Repository: chriskmanx/qmole
Catalog: QMOLEDEV/libwnck-2.29.92/po/*.po
Languages: en@shaw, id

source: maximized vertically
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿğ‘› ğ‘ğ‘»ğ‘‘ğ‘¦ğ‘’ğ‘©ğ‘¤ğ‘¦
id: dimaksimalkan arah tegak

source: shaded
en@shaw: ğ‘–ğ‘±ğ‘›ğ‘©ğ‘›
id: berbayang

source: pinned
en@shaw: ğ‘ğ‘¦ğ‘¯ğ‘›
id: dipatok

source: sticky
en@shaw: ğ‘•ğ‘‘ğ‘¦ğ‘’ğ‘¦
id: lengket

source: above
en@shaw: ğ‘©ğ‘šğ‘³ğ‘
id: di atas

source: below
en@shaw: ğ‘šğ‘©ğ‘¤ğ‘´
id: di bawah

source: fullscreen
id: layar penuh

source: needs attention
en@shaw: ğ‘¯ğ‘°ğ‘›ğ‘Ÿ ğ‘©ğ‘‘ğ‘§ğ‘¯ğ‘–ğ‘©ğ‘¯
id: perlu perhatian

source: skip pager
en@shaw: ğ‘•ğ‘’ğ‘¦ğ‘ ğ‘ğ‘±ğ‘¡ğ‘»
id: lewati pager

source: skip tasklist
id: lewati daftar tugas

source: State: %s
en@shaw: ğ‘•ğ‘‘ğ‘±ğ‘‘: %s
id: Keadaan: %s

source: move
en@shaw: ğ‘¥ğ‘µğ‘
id: pindah

source: resize
en@shaw: ğ‘®ğ‘°ğ‘•ğ‘²ğ‘Ÿ
id: ubah ukuran

source: shade
en@shaw: ğ‘–ğ‘±ğ‘›
id: berbayang

source: unshade
id: tak berbayang

source: stick
en@shaw: ğ‘•ğ‘‘ğ‘¦ğ‘’
id: lengket

source: unstick
id: tak lengket

source: maximize horizontally
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿ ğ‘£ğ‘ªğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¯ğ‘‘ğ‘©ğ‘¤ğ‘¦
id: maksimalkan arah mendatar

source: unmaximize horizontally
id: tak maksimalkan arah mendatar

source: maximize vertically
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿ ğ‘ğ‘»ğ‘‘ğ‘¦ğ‘’ğ‘©ğ‘¤ğ‘¦
id: maksimalkan arah tegak

source: unmaximize vertically
id: tak maksimalkan arah tegak

source: change workspace
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•
id: ubah area kerja

source: pin
en@shaw: ğ‘ğ‘¦ğ‘¯
id: patok

source: unpin
id: lepas patok

source: minimize
en@shaw: ğ‘¥ğ‘¦ğ‘¯ğ‘©ğ‘¥ğ‘²ğ‘Ÿ
id: minimalkan

source: unminimize
id: tak minimalkan

source: maximize
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿ
id: maksimalkan

source: unmaximize
id: tak maksimalkan

source: change fullscreen mode
id: ubah mode layar penuh

source: close
en@shaw: ğ‘’ğ‘¤ğ‘´ğ‘Ÿ
id: tutup

source: make above
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘©ğ‘šğ‘³ğ‘
id: buat di atas

source: unmake above
id: buat tak di atas

source: make below
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘šğ‘©ğ‘¤ğ‘´
id: buat di bawah

source: unmake below
id: buat tak di bawah

source: no action possible
en@shaw: ğ‘¯ğ‘´ ğ‘¨ğ‘’ğ‘–ğ‘©ğ‘¯ ğ‘ğ‘ªğ‘•ğ‘©ğ‘šğ‘©ğ‘¤
id: tak ada aksi yang mungkin

source: Possible Actions: %s
en@shaw: ğ‘ğ‘ªğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘¨ğ‘’ğ‘–ğ‘©ğ‘¯ğ‘Ÿ: %s
id: Aksi Yang Mungkin: %s

source: Print or modify the properties of a screen/workspace/window, or interact with it, following the EWMH specification. For information about this specification, see: http://freedesktop.org/wiki/Specifications/wm-spec
id: Cetak atau ubah properti dari suatu layar/ruang kerja/jendela, atau berinteraksi dengannya, mengikuti spesifikasi EWMH. Untuk informasi tentang spesifikasi ini, lihat: http://freedesktop.org/wiki/Specifications/wm-spec

source: Options to list windows or workspaces
en@shaw: ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ ğ‘¹ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ
id: Pilihan untuk mendaftar jendela atau area kerja

source: Show options to list windows or workspaces
en@shaw: ğ‘–ğ‘´ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ ğ‘¹ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ
id: Tampilkan pilihan untuk mendaftar jendela atau area kerja

source: Options to modify properties of a window
en@shaw: ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘² ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦ğ‘Ÿ ğ‘ ğ‘© ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Pilihan untuk mengubah sifat dari sebuah jendela

source: Show options to modify properties of a window
en@shaw: ğ‘–ğ‘´ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘² ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦ğ‘Ÿ ğ‘ ğ‘© ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Tampilkan pilihan untuk mengubah sifat dari sebuah jendela

source: Options to modify properties of a workspace
en@shaw: ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘² ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦ğ‘Ÿ ğ‘ ğ‘© ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•
id: pilihan untuk mengubah sifat dari sebuah area kerja

source: Show options to modify properties of a workspace
en@shaw: ğ‘–ğ‘´ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘² ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦ğ‘Ÿ ğ‘ ğ‘© ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•
id: Tampilkan pilihan untuk mengubah sifat dari sebuah area kerja

source: Options to modify properties of a screen
en@shaw: ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘² ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦ğ‘Ÿ ğ‘ ğ‘© ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯
id: Pilihan untuk mengubah sifat dari sebuah layar

source: Show options to modify properties of a screen
en@shaw: ğ‘–ğ‘´ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘² ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦ğ‘Ÿ ğ‘ ğ‘© ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯
id: Tampilkan pilihan untuk mengubah sifat dari sebuah layar

source: Error while parsing arguments: %s
en@shaw: ğ‘»ğ‘¼ ğ‘¢ğ‘²ğ‘¤ ğ‘ğ‘¸ğ‘•ğ‘¦ğ‘™ ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘•: %s
id: Galat saat mengurai argumen: %s

source: Cannot interact with screen %d: the screen does not exist
en@shaw: ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ ğ‘¢ğ‘¦ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ %d: ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ ğ‘›ğ‘³ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘§ğ‘’ğ‘Ÿğ‘¦ğ‘•ğ‘‘
id: Tak bisa interaksi dengan layar %d: layar tak ada

source: Cannot interact with workspace %d: the workspace cannot be found
en@shaw: ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ ğ‘¢ğ‘¦ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• %d: ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘“ğ‘¬ğ‘¯ğ‘›
id: Tak bisa interaksi dengan area kerja %d: area kerja tak ditemukan

source: Cannot interact with class group "%s": the class group cannot be found
en@shaw: ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ ğ‘¢ğ‘¦ğ‘ ğ‘’ğ‘¤ğ‘­ğ‘• ğ‘œğ‘®ğ‘µğ‘ "%s": ğ‘ ğ‘’ğ‘¤ğ‘­ğ‘• ğ‘œğ‘®ğ‘µğ‘ ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘“ğ‘¬ğ‘¯ğ‘›
id: Tak bisa interaksi dengan grup kelas "%s": grup kelas tak ditemukan

source: Cannot interact with application having its group leader with XID %lu: the application cannot be found
id: Tak bisa interaksi dengan aplikasi dengan XID pemimpin grup %lu: aplikasi tak ditemukan

source: Cannot interact with window with XID %lu: the window cannot be found
id: Tak bisa interaksi dengan jendela dengan XID %lu: jendela tak ditemukan

source: desktop
en@shaw: ğ‘›ğ‘§ğ‘•ğ‘’ğ‘‘ğ‘ªğ‘

source: normal
en@shaw: ğ‘¯ğ‘¹ğ‘¥ğ‘©ğ‘¤
