Repository: chriskmanx/qmole
Catalog: QMOLEDEV/libwnck-2.29.92/po/*.po
Languages: en@shaw, id

source: Untitled application
id: Aplikasi tak berjudul

source: Workspace Switcher
en@shaw: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘•ğ‘¢ğ‘¦ğ‘—ğ‘»
id: Penukar Area Kerja

source: Tool to switch between workspaces
en@shaw: ğ‘‘ğ‘µğ‘¤ ğ‘‘ ğ‘•ğ‘¢ğ‘¦ğ‘— ğ‘šğ‘¦ğ‘‘ğ‘¢ğ‘°ğ‘¯ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ
id: Perkakas untuk bertukar antar area kerja

source: Click this to switch to workspace %s
en@shaw: ğ‘’ğ‘¤ğ‘¦ğ‘’ ğ‘ğ‘¦ğ‘• ğ‘‘ ğ‘•ğ‘¢ğ‘¦ğ‘— ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• %s
id: Klik untuk pindah ke area kerja %s

source: Click to start dragging "%s"
en@shaw: ğ‘’ğ‘¤ğ‘¦ğ‘’ ğ‘‘ ğ‘•ğ‘‘ğ‘¸ğ‘‘ ğ‘›ğ‘®ğ‘¨ğ‘œğ‘¦ğ‘™ "%s"
id: Klik untuk mulai menyeret "%s"

source: Current workspace: "%s"
en@shaw: ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•: "%s"
id: Area kerja kini: "%s"

source: Click to switch to "%s"
en@shaw: ğ‘’ğ‘¤ğ‘¦ğ‘’ ğ‘‘ ğ‘•ğ‘¢ğ‘¦ğ‘— ğ‘‘ "%s"
id: Klik untuk berpindah ke "%s"

source: No Windows Open
en@shaw: ğ‘¯ğ‘´ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ ğ‘´ğ‘ğ‘©ğ‘¯
id: Tak Ada Jendela Terbuka

source: Window Selector
id: Pemilih Jendela

source: Tool to switch between windows
en@shaw: ğ‘‘ğ‘µğ‘¤ ğ‘‘ ğ‘•ğ‘¢ğ‘¦ğ‘— ğ‘šğ‘¦ğ‘‘ğ‘¢ğ‘°ğ‘¯ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ
id: Perkakas untuk berpindah antara jendela

source: Window List
en@shaw: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘¤ğ‘¦ğ‘•ğ‘‘
id: Daftar Jendela

source: Tool to switch between visible windows
en@shaw: ğ‘‘ğ‘µğ‘¤ ğ‘‘ ğ‘•ğ‘¢ğ‘¦ğ‘— ğ‘šğ‘¦ğ‘‘ğ‘¢ğ‘°ğ‘¯ ğ‘ğ‘¦ğ‘•ğ‘¦ğ‘šğ‘©ğ‘¤ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ
id: Perkakas untuk berpindah antara jendela yang tampak

source: Mi_nimize All
en@shaw: ğ‘¥ğ‘¦_ğ‘¯ğ‘¦ğ‘¥ğ‘²ğ‘Ÿ ğ‘·ğ‘¤
id: _Minimalkan Semua

source: Un_minimize All
en@shaw: ğ‘³ğ‘¯_ğ‘¥ğ‘¦ğ‘¯ğ‘¦ğ‘¥ğ‘²ğ‘Ÿ ğ‘·ğ‘¤
id: Jangan Minimalkan Se_mua

source: Ma_ximize All
en@shaw: ğ‘¥ğ‘¨_ğ‘’ğ‘•ğ‘¦ğ‘¥ğ‘²ğ‘Ÿ ğ‘·ğ‘¤
id: Ma_ksimalkan Semua

source: _Unmaximize All
id: Jangan Maksimalkan Sem_ua

source: _Close All
en@shaw: _ğ‘’ğ‘¤ğ‘´ğ‘• ğ‘·ğ‘¤
id: _Tutup Semua

source: Use N_ROWS rows
en@shaw: ğ‘¿ğ‘• N_ROWS ğ‘®ğ‘´ğ‘Ÿ
id: Gunakan N_ROWS baris

source: Only show current workspace
en@shaw: ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘–ğ‘´ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•
id: Tunjukkan hanya area kerja kini

source: Use RTL as default direction
id: Gunakan RTL sebagai arah baku

source: Show workspace names instead of workspace contents
en@shaw: ğ‘–ğ‘´ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¯ğ‘±ğ‘¥ğ‘Ÿ ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘§ğ‘› ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘©ğ‘¯ğ‘‘ğ‘•
id: Tampilkan nama area kerja alih-alih isinya

source: Use a vertical orientation
en@shaw: ğ‘¿ğ‘Ÿ ğ‘© ğ‘ğ‘»ğ‘‘ğ‘¦ğ‘’ğ‘©ğ‘¤ ğ‘ªğ‘®ğ‘¦ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘–ğ‘©ğ‘¯
id: Gunakan orientasi tegak

source: Don't show window in tasklist
id: Jangan tampilkan jendela di daftar tugas

source: Always group windows
en@shaw: ğ‘·ğ‘¤ğ‘¢ğ‘±ğ‘Ÿ ğ‘œğ‘®ğ‘µğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ
id: Selalu kelompokkan jendela

source: Never group windows
en@shaw: ğ‘¯ğ‘§ğ‘ğ‘¼ ğ‘œğ‘®ğ‘µğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ
id: Jangan kelompokkan jendela

source: Display windows from all workspaces
en@shaw: ğ‘›ğ‘©ğ‘•ğ‘ğ‘¤ğ‘± ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘·ğ‘¤ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ
id: Tampilkan jendela dari semua area kerja

source: Enable Transparency
en@shaw: ğ‘¦ğ‘¯ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ğ‘®ğ‘¨ğ‘¯ğ‘•ğ‘ğ‘¨ğ‘®ğ‘©ğ‘¯ğ‘•ğ‘¦
id: Fungsikan Tembus Pandang

source: Unmi_nimize
en@shaw: ğ‘³ğ‘¯ğ‘¥ğ‘¦_ğ‘¯ğ‘¦ğ‘¥ğ‘²ğ‘Ÿ
id: Tak Mi_nimalkan

source: Mi_nimize
en@shaw: ğ‘¥ğ‘¦_ğ‘¯ğ‘¦ğ‘¥ğ‘²ğ‘Ÿ
id: Mi_nimalkan

source: Unma_ximize
en@shaw: ğ‘³ğ‘¯ğ‘¥ğ‘¨_ğ‘’ğ‘•ğ‘¦ğ‘¥ğ‘²ğ‘Ÿ
id: Tak Ma_ksimalkan

source: Ma_ximize
en@shaw: ğ‘¥ğ‘¨_ğ‘’ğ‘•ğ‘¦ğ‘¥ğ‘²ğ‘Ÿ
id: Ma_ksimalkan

source: Workspace %d
en@shaw: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• %d
id: Area kerja %d

source: Workspace 1_0
en@shaw: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• 1_0
id: Area kerja 1_0

source: Workspace %s%d
en@shaw: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• %s%d
id: Area kerja %s%d

source: _Move
en@shaw: _ğ‘¥ğ‘µğ‘
id: _Pindah

source: _Resize
en@shaw: _ğ‘®ğ‘°ğ‘•ğ‘²ğ‘Ÿ
id: UbahÂ·Uku_ran

source: Always On _Top
en@shaw: ğ‘·ğ‘¤ğ‘¢ğ‘±ğ‘Ÿ ğ‘ªğ‘¯ _ğ‘‘ğ‘ªğ‘
id: Selalu Di A_tas

source: _Always on Visible Workspace
en@shaw: _ğ‘·ğ‘¤ğ‘¢ğ‘±ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ğ‘¦ğ‘•ğ‘¦ğ‘šğ‘©ğ‘¤ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•
id: Sel_alu pada Area Kerja Tampak

source: _Only on This Workspace
en@shaw: _ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘ªğ‘¯ ğ‘ğ‘¦ğ‘• ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•
id: _Hanya pada Area Kerja Ini

source: Move to Workspace _Left
en@shaw: ğ‘¥ğ‘µğ‘ ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• _ğ‘¤ğ‘§ğ‘“ğ‘‘
id: Pindah ke Area Kerja _Kiri

source: Move to Workspace R_ight
en@shaw: ğ‘¥ğ‘µğ‘ ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘®_ğ‘²ğ‘‘
id: P_indah ke Area Kerja Kanan

source: Move to Workspace _Up
en@shaw: ğ‘¥ğ‘µğ‘ ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• _ğ‘³ğ‘
id: Pindah ke Area Kerja _Atas

source: Move to Workspace _Down
en@shaw: ğ‘¥ğ‘µğ‘ ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• _ğ‘›ğ‘¬ğ‘¯
id: Pindah ke Area Kerja _Bawah

source: Move to Another _Workspace
en@shaw: ğ‘¥ğ‘µğ‘ ğ‘‘ ğ‘©ğ‘¯ğ‘³ğ‘ğ‘¼ _ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•
id: Pindah ke Area Kerja _Lain

source: _Close
en@shaw: _ğ‘’ğ‘¤ğ‘´ğ‘Ÿ
id: _Tutup

source: Untitled window
id: Jendela tanpa judul

source: X window ID of the window to examine or modify
en@shaw: X ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ID ğ‘ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘‘ ğ‘¦ğ‘œğ‘Ÿğ‘¨ğ‘¥ğ‘¦ğ‘¯ ğ‘¹ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘²
id: ID X window dari jendela yang akan diperiksa atau diubah

source: X window ID of the group leader of an application to examine
en@shaw: X ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ID ğ‘ ğ‘ ğ‘œğ‘®ğ‘µğ‘ ğ‘¤ğ‘°ğ‘›ğ‘¼ ğ‘ ğ‘©ğ‘¯ ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘‘ ğ‘¦ğ‘œğ‘Ÿğ‘¨ğ‘¥ğ‘¦ğ‘¯
id: ID X window dari pemimpin grup dari aplikasi yang akan diperiksa

source: Class resource of the class group to examine
en@shaw: ğ‘’ğ‘¤ğ‘­ğ‘• ğ‘®ğ‘¦ğ‘Ÿğ‘¹ğ‘• ğ‘ ğ‘ ğ‘’ğ‘¤ğ‘­ğ‘• ğ‘œğ‘®ğ‘µğ‘ ğ‘‘ ğ‘¦ğ‘œğ‘Ÿğ‘¨ğ‘¥ğ‘¦ğ‘¯
id: Sumberdaya kelas dari grup kelas untuk diperiksa

source: CLASS
en@shaw: ğ‘’ğ‘¤ğ‘­ğ‘•
id: KELAS

source: NUMBER of the workspace to examine or modify
en@shaw: ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘‘ ğ‘¦ğ‘œğ‘Ÿğ‘¨ğ‘¥ğ‘¦ğ‘¯ ğ‘¹ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘²
id: ANGKA area kerja untuk diperiksa atau diubah

source: NUMBER
en@shaw: ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼
id: ANGKA

source: NUMBER of the screen to examine or modify
en@shaw: ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ ğ‘‘ ğ‘¦ğ‘œğ‘Ÿğ‘¨ğ‘¥ğ‘¦ğ‘¯ ğ‘¹ ğ‘¥ğ‘ªğ‘›ğ‘¦ğ‘“ğ‘²
id: ANGKA layar untuk diperiksa atau diubah

source: Alias of --window
en@shaw: ğ‘±ğ‘¤ğ‘°ğ‘©ğ‘• ğ‘ --window
id: Alias dari --window

source: List windows of the application/class group/workspace/screen (output format: "XID: Window Name")
id: Daftar jendela dari aplikasi/grup kelas/ruang kerja/layar (bentuk luaran: "XID: Nama Jendela")

source: List workspaces of the screen (output format: "Number: Workspace Name")
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ ğ‘ ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ (ğ‘¬ğ‘‘ğ‘ğ‘«ğ‘‘ ğ‘“ğ‘¹ğ‘¥ğ‘¨ğ‘‘: "ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¯ğ‘±ğ‘¥")
id: Daftar ruang kerja dari layar (bentuk luaran: "Nomor: Nama Ruang Kerja")

source: Change the number of workspaces of the screen to NUMBER
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ ğ‘ ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ ğ‘‘ ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼
id: Ubah cacah area kerja layar ke ANGKA

source: Change the workspace layout of the screen to use NUMBER rows
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¤ğ‘±ğ‘¬ğ‘‘ ğ‘ ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ ğ‘‘ ğ‘¿ğ‘• ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘®ğ‘´ğ‘Ÿ
id: Ubah tata letak area kerja layar menjadi ANGKA baris

source: Change the workspace layout of the screen to use NUMBER columns
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¤ğ‘±ğ‘¬ğ‘‘ ğ‘ ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ ğ‘‘ ğ‘¿ğ‘• ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ğ‘Ÿ
id: Ubah tata letak area kerja layar menjadi ANGKA kolom

source: Show the desktop
en@shaw: ğ‘–ğ‘´ ğ‘ ğ‘›ğ‘§ğ‘•ğ‘’ğ‘‘ğ‘ªğ‘
id: Tampilkan desktop

source: Stop showing the desktop
en@shaw: ğ‘•ğ‘‘ğ‘ªğ‘ ğ‘–ğ‘´ğ‘¦ğ‘™ ğ‘ ğ‘›ğ‘§ğ‘•ğ‘’ğ‘‘ğ‘ªğ‘
id: Berhenti tampilkan dekstop

source: Move the viewport of the current workspace to X coordinate X
id: Pindahkan viewport dari area kerja kini ke X koordinat X

source: Move the viewport of the current workspace to Y coordinate Y
id: Pindahkan viewport dari area kerja kini ke Y koordinat Y

source: Minimize the window
en@shaw: ğ‘¥ğ‘¦ğ‘¯ğ‘©ğ‘¥ğ‘²ğ‘Ÿ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Minimalkan jendela

source: Unminimize the window
id: Tak minimalkan jendela

source: Maximize the window
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Maksimalkan jendela

source: Unmaximize the window
id: Tak maksimalkan jendela

source: Maximize horizontally the window
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿ ğ‘£ğ‘ªğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¯ğ‘‘ğ‘©ğ‘¤ğ‘¦ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Maksimalkan arah mendatar jendela

source: Unmaximize horizontally the window
id: Tak maksimalkan arah mendatar jendela

source: Maximize vertically the window
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿ ğ‘ğ‘»ğ‘‘ğ‘¦ğ‘’ğ‘©ğ‘¤ğ‘¦ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Maksimalkan arah tegak jendela

source: Unmaximize vertically the window
id: Tak maksimalkan arah tegak jendela

source: Start moving the window via the keyboard
en@shaw: ğ‘•ğ‘‘ğ‘¸ğ‘‘ ğ‘¥ğ‘µğ‘ğ‘¦ğ‘™ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘ğ‘²ğ‘© ğ‘ ğ‘’ğ‘°ğ‘šğ‘ªğ‘®ğ‘›
id: Mulai memindah jendela lewat papan ketik

source: Start resizing the window via the keyboard
id: Mulai ubah ukuran jendela lewat papan ketik

source: Activate the window
en@shaw: ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘ğ‘±ğ‘‘ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Aktifkan jendela

source: Close the window
en@shaw: ğ‘’ğ‘¤ğ‘´ğ‘Ÿ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Tutup jendela

source: Make the window fullscreen
id: Buat jendela layar penuh

source: Make the window quit fullscreen mode
id: Keluar dari mode layar penuh

source: Make the window always on top
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘·ğ‘¤ğ‘¢ğ‘±ğ‘Ÿ ğ‘ªğ‘¯ ğ‘‘ğ‘ªğ‘
id: Buat jendela selalu paling atas

source: Make the window not always on top
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘¯ğ‘ªğ‘‘ ğ‘·ğ‘¤ğ‘¢ğ‘±ğ‘Ÿ ğ‘ªğ‘¯ ğ‘‘ğ‘ªğ‘
id: Buat jendela tak selalu paling atas

source: Make the window below other windows
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘šğ‘©ğ‘¤ğ‘´ ğ‘³ğ‘ğ‘¼ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ
id: Buat jendela di bawah jendela lain

source: Make the window not below other windows
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘©ğ‘¤ğ‘´ ğ‘³ğ‘ğ‘¼ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ
id: Buat jendela tak di bawah jendela lain

source: Shade the window
en@shaw: ğ‘–ğ‘±ğ‘› ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: Jendela berbayang

source: Unshade the window
id: Jendela tak berbayang

source: Make the window have a fixed position in the viewport
id: Buat jendela memiliki posisi tetap di viewport

source: Make the window not have a fixed position in the viewport
id: Buat jendela tak memiliki posisi tetap di viewport

source: Make the window not appear in pagers
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘¯ğ‘ªğ‘‘ ğ‘©ğ‘ğ‘½ ğ‘¦ğ‘¯ ğ‘ğ‘±ğ‘¡ğ‘»ğ‘Ÿ
id: Buat jendela tak muncul di pager

source: Make the window appear in pagers
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘©ğ‘ğ‘½ ğ‘¦ğ‘¯ ğ‘ğ‘±ğ‘¡ğ‘»ğ‘Ÿ
id: Buat jendela muncul di pager

source: Make the window not appear in tasklists
id: Buat jendela tak muncul di daftar tugas

source: Make the window appear in tasklists
id: Buat jendela muncul di daftar tugas

source: Make the window visible on all workspaces
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘ğ‘¦ğ‘•ğ‘¦ğ‘šğ‘©ğ‘¤ ğ‘ªğ‘¯ ğ‘·ğ‘¤ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ
id: Buat jendela nampak di semua area kerja

source: Make the window visible on the current workspace only
en@shaw: ğ‘¥ğ‘±ğ‘’ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘ğ‘¦ğ‘•ğ‘¦ğ‘šğ‘©ğ‘¤ ğ‘ªğ‘¯ ğ‘ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘´ğ‘¯ğ‘¤ğ‘¦
id: Buat jendela nampak di area kerja kini saja

source: Move the window to workspace NUMBER (first workspace is 0)
en@shaw: ğ‘¥ğ‘µğ‘ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ (ğ‘“ğ‘»ğ‘•ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¦ğ‘Ÿ 0)
id: Pindah jendela ke area kerja nomor NOMOR (area kerja pertama adalah 0)

source: Change the X coordinate of the window to X
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ X ğ‘’ğ‘´ğ‘¹ğ‘›ğ‘©ğ‘¯ğ‘±ğ‘‘ ğ‘ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘‘ X
id: Ubah koordinat X jendela ke X

source: Change the Y coordinate of the window to Y
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ Y ğ‘’ğ‘´ğ‘¹ğ‘›ğ‘©ğ‘¯ğ‘±ğ‘‘ ğ‘ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘‘ Y
id: Ubah koordinat Y jendela ke Y

source: Change the width of the window to WIDTH
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ ğ‘¢ğ‘¦ğ‘›ğ‘” ğ‘ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘‘ ğ‘¢ğ‘¦ğ‘›ğ‘”
id: Ubah lebar jendela menjadi LEBAR

source: WIDTH
en@shaw: ğ‘¢ğ‘¦ğ‘›ğ‘”
id: LEBAR

source: Change the height of the window to HEIGHT
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ ğ‘£ğ‘²ğ‘‘ ğ‘ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘‘ ğ‘£ğ‘²ğ‘‘
id: Ubah tinggi jendela menjadi TINGGI

source: HEIGHT
en@shaw: ğ‘£ğ‘²ğ‘‘
id: TINGGI

source: Change the type of the window to TYPE (valid values: normal, desktop, dock, dialog, toolbar, menu, utility, splash)
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘‘ ğ‘‘ğ‘²ğ‘ (ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ: normal, desktop, dock, dialog, toolbar, menu, utility, splash)
id: Ubah tipe jendela menjadi TIPE (nilai valid: normal, desktop, dock, dialog, toolbar, menu, utility, splash)

source: TYPE
en@shaw: ğ‘‘ğ‘²ğ‘
id: TIPE

source: Change the name of the workspace to NAME
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ ğ‘¯ğ‘±ğ‘¥ ğ‘ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘‘ ğ‘¯ğ‘±ğ‘¥
id: Ubah nama area kerja menjadi NAMA

source: NAME
en@shaw: ğ‘¯ğ‘±ğ‘¥
id: NAMA

source: Activate the workspace
en@shaw: ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘ğ‘±ğ‘‘ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•
id: Aktifkan area kerja

source: Invalid value "%s" for --%s
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘ğ‘¨ğ‘¤ğ‘¿ "%s" ğ‘“ğ‘¹ --%s
id: Nilai tak valid "%s" bagi --%s

source: Conflicting options are present: screen %d should be interacted with, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ %d ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¢ğ‘¦ğ‘, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: mestinya berinteraksi dengan layar %d, tapi --%s telah dipakai

source: Conflicting options are present: windows or workspaces of screen %d should be listed, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ ğ‘¹ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ %d ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘›, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: jendela atau area kerja dari layar %d mestinya didaftar, tapi --%s telah dipakai

source: Conflicting options are present: workspace %d should be interacted with, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• %d ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¢ğ‘¦ğ‘, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: mestinya berinteraksi dengan area kerja %d, tapi --%s telah dipakai

source: Conflicting options are present: windows of workspace %d should be listed, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• %d ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘›, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: jendela atau area kerja %d mestinya didaftar, tapi --%s telah dipakai

source: Conflicting options are present: an application should be interacted with, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘©ğ‘¯ ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¢ğ‘¦ğ‘, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: mestinya berinteraksi dengan sebuah aplikasi, tapi --%s telah dipakai

source: Conflicting options are present: windows of an application should be listed, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ ğ‘ ğ‘©ğ‘¯ ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘›, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: jendela dari suatu aplikasi mestinya didaftar, tapi --%s telah dipakai

source: Conflicting options are present: class group "%s" should be interacted with, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘’ğ‘¤ğ‘­ğ‘• ğ‘œğ‘®ğ‘µğ‘ "%s" ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¢ğ‘¦ğ‘, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: mestinya berinteraksi dengan grup kelas "%s", tapi --%s telah dipakai

source: Conflicting options are present: windows of class group "%s" should be listed, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ ğ‘ ğ‘’ğ‘¤ğ‘­ğ‘• ğ‘œğ‘®ğ‘µğ‘ "%s" ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘›, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: jendela dari grup kelas "%s" mestinya didaftar, tapi --%s telah dipakai

source: Conflicting options are present: a window should be interacted with, but --%s has been used
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: ğ‘© ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¨ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¢ğ‘¦ğ‘, ğ‘šğ‘³ğ‘‘ --%s ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘¿ğ‘Ÿğ‘›
id: Ada pilihan bertentangan: mestinya berinteraksi dengan suatu jendela, tapi --%s telah dipakai

source: Conflicting options are present: --%s and --%s
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: --%s ğ‘¯ --%s
id: Ada pilihan bertentangan: --%s dan --%s

source: Invalid argument "%d" for --%s: the argument must be strictly positive
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ "%d" ğ‘“ğ‘¹ --%s: ğ‘ ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘’ğ‘‘ğ‘¤ğ‘¦ ğ‘ğ‘ªğ‘Ÿğ‘¦ğ‘‘ğ‘¦ğ‘
id: Argumen tak valid "%d" bagi --%s: argumen mesti benar-benar positif

source: Invalid argument "%d" for --%s: the argument must be positive
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ "%d" ğ‘“ğ‘¹ --%s: ğ‘ ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° ğ‘ğ‘ªğ‘Ÿğ‘¦ğ‘‘ğ‘¦ğ‘
id: Argumen tak valid "%d" bagi --%s: argumen mesti positif

source: Conflicting options are present: --%s or --%s, and --%s
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¤ğ‘¦ğ‘’ğ‘‘ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘¸ ğ‘ğ‘®ğ‘©ğ‘Ÿğ‘§ğ‘¯ğ‘‘: --%s ğ‘¹ --%s, ğ‘¯ --%s
id: Opsi bertentangan hadir: --%s atau --%s, dan --%s

source: Invalid argument "%s" for --%s, valid values are: %s
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ "%s" ğ‘“ğ‘¹ --%s, ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘¸: %s
id: Argumen tak valid "%s" bagi --%s: nilai yang valid adalah: %s

source: Cannot change the workspace layout on the screen: the layout is already owned
en@shaw: ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¤ğ‘±ğ‘¬ğ‘‘ ğ‘ªğ‘¯ ğ‘ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯: ğ‘ ğ‘¤ğ‘±ğ‘¬ğ‘‘ ğ‘¦ğ‘Ÿ ğ‘·ğ‘¤ğ‘®ğ‘§ğ‘›ğ‘¦ ğ‘´ğ‘¯ğ‘›
id: Tak dapat mengubah tata leta area kerja di layar: tata letak telak dimiliki

source: Viewport cannot be moved: the current workspace does not contain a viewport
id: Viewport tak bisa dipindah: area kerja kini tak memuat suatu viewport

source: Viewport cannot be moved: there is no current workspace
id: Viewport tak bisa dipindah: tidak ada area kerja kini

source: Action not allowed
en@shaw: ğ‘¨ğ‘’ğ‘–ğ‘©ğ‘¯ ğ‘¯ğ‘ªğ‘‘ ğ‘©ğ‘¤ğ‘¬ğ‘›
id: Aksi tak diijinkan

source: Window cannot be moved to workspace %d: the workspace does not exist
en@shaw: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘¥ğ‘µğ‘ğ‘› ğ‘‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• %d: ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘›ğ‘³ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘§ğ‘’ğ‘Ÿğ‘¦ğ‘•ğ‘‘
id: Jendela tak bisa dipindah ke area kerja %d: area kerja tak ada

source: <name unset>
en@shaw: <ğ‘¯ğ‘±ğ‘¥ ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘>
id: <nama belum diisi>

source: Screen Number: %d
en@shaw: ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯ ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼: %d
id: Nomor Layar: %d

source: Geometry (width, height): %d, %d
en@shaw: ğ‘¡ğ‘¦ğ‘ªğ‘¥ğ‘©ğ‘‘ğ‘®ğ‘¦ (ğ‘¢ğ‘¦ğ‘›ğ‘”, ğ‘£ğ‘²ğ‘‘): %d, %d
id: Geometri (lebar, tinggi): %d, %d

source: Number of Workspaces: %d
en@shaw: ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ: %d
id: Cacah Area Kerja: %d

source: Workspace Layout (rows, columns, orientation): %d, %d, %s
en@shaw: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¤ğ‘±ğ‘¬ğ‘‘ (ğ‘®ğ‘´ğ‘Ÿ, ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ğ‘Ÿ, ğ‘ªğ‘®ğ‘¦ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘–ğ‘©ğ‘¯): %d, %d, %s
id: Tata Letak Area Kerja (baris, kolom, arah): %d, %d, %s

source: <no EWMH-compliant window manager>
id: <tak ada manajer jendela yang patuh-EWMH>

source: Window Manager: %s
en@shaw: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘¥ğ‘¨ğ‘¯ğ‘©ğ‘¡ğ‘¼: %s
id: Manajer Jendela: %s

# workspace
source: none
en@shaw: ğ‘¯ğ‘³ğ‘¯
id: tidak ada

source: Active Workspace: %s
en@shaw: ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•: %s
id: Area Kerja Aktif: %s

# window
source: none
en@shaw: ğ‘¯ğ‘³ğ‘¯
id: tidak ada

source: Active Window: %s
en@shaw: ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´: %s
id: Jendela Aktif: %s

source: Showing the desktop: %s
en@shaw: ğ‘–ğ‘´ğ‘¦ğ‘™ ğ‘ ğ‘›ğ‘§ğ‘•ğ‘’ğ‘‘ğ‘ªğ‘: %s
id: Menampilkan desktop: %s

source: true
en@shaw: ğ‘‘ğ‘®ğ‘µ
id: benar

source: false
en@shaw: ğ‘“ğ‘·ğ‘¤ğ‘•
id: salah

source: Workspace Name: %s
en@shaw: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¯ğ‘±ğ‘¥: %s
id: Nama Area Kerja: %s

source: Workspace Number: %d
en@shaw: ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘• ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼: %d
id: Nomor Area Kerja: %d

source: On Screen: %d (Window Manager: %s)
en@shaw: ğ‘ªğ‘¯ ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯: %d (ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘¥ğ‘¨ğ‘¯ğ‘©ğ‘¡ğ‘¼: %s)
id: Pada Layar: %d (Manajer Jendela: %s)

source: <no viewport>
id: <tak ada viewport>

source: Viewport position (x, y): %s
id: Posisi viewport (x, y): %s

source: Position in Layout (row, column): %d, %d
en@shaw: ğ‘ğ‘©ğ‘Ÿğ‘¦ğ‘–ğ‘©ğ‘¯ ğ‘¦ğ‘¯ ğ‘¤ğ‘±ğ‘¬ğ‘‘ (ğ‘®ğ‘´, ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥): %d, %d
id: Posisi pada tata letak (baris, kolom): %d, %d

source: Left Neighbor: %s
en@shaw: ğ‘¤ğ‘§ğ‘“ğ‘‘ ğ‘¯ğ‘±ğ‘šğ‘¼: %s
id: Tetangga Kiri: %s

source: Right Neighbor: %s
en@shaw: ğ‘®ğ‘²ğ‘‘ ğ‘¯ğ‘±ğ‘šğ‘¼: %s
id: Tetangga Kanan: %s

source: Top Neighbor: %s
en@shaw: ğ‘‘ğ‘ªğ‘ ğ‘¯ğ‘±ğ‘šğ‘¼: %s
id: Tentangga Atas: %s

source: Bottom Neighbor: %s
en@shaw: ğ‘šğ‘ªğ‘‘ğ‘«ğ‘¥ ğ‘¯ğ‘±ğ‘šğ‘¼: %s
id: Tetangga Bawah: %s

source: Resource Class: %s
en@shaw: ğ‘®ğ‘¦ğ‘Ÿğ‘¹ğ‘• ğ‘’ğ‘¤ğ‘­ğ‘•: %s
id: Kelas Sumber Daya: %s

source: Group Name: %s
en@shaw: ğ‘œğ‘®ğ‘µğ‘ ğ‘¯ğ‘±ğ‘¥: %s
id: Nama Grup: %s

source: set
en@shaw: ğ‘•ğ‘§ğ‘‘
id: ditata

source: <unset>
en@shaw: <ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘>
id: <belum ditata>

source: Icons: %s
en@shaw: ğ‘²ğ‘’ğ‘ªğ‘¯ğ‘Ÿ: %s
id: Ikon: %s

source: Number of Windows: %d
en@shaw: ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ğ‘Ÿ: %d
id: Cacah Jendela: %d

source: Name: %s
en@shaw: ğ‘¯ğ‘±ğ‘¥: %s
id: Nama: %s

source: Icon Name: %s
en@shaw: ğ‘²ğ‘’ğ‘ªğ‘¯ ğ‘¯ğ‘±ğ‘¥: %s
id: Nama Ikon: %s

# startupID
source: none
en@shaw: ğ‘¯ğ‘³ğ‘¯
id: tidak ada

source: Startup ID: %s
en@shaw: ğ‘•ğ‘‘ğ‘¸ğ‘‘ğ‘³ğ‘ ID: %s
id: ID Startup: %s

source: all workspaces
en@shaw: ğ‘·ğ‘¤ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•ğ‘©ğ‘Ÿ
id: semua area kerja

source: On Workspace: %s
en@shaw: ğ‘ªğ‘¯ ğ‘¢ğ‘»ğ‘’ğ‘•ğ‘ğ‘±ğ‘•: %s
id: Pada Area Kerja: %s

source: normal window
en@shaw: ğ‘¯ğ‘¹ğ‘¥ğ‘©ğ‘¤ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: jendela normal

source: dock or panel
en@shaw: ğ‘›ğ‘­ğ‘’ ğ‘¹ ğ‘ğ‘¨ğ‘¯ğ‘©ğ‘¤
id: dok atau panel

source: dialog window
en@shaw: ğ‘›ğ‘²ğ‘©ğ‘¤ğ‘ªğ‘œ ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: jendela dialog

source: tearoff toolbar
id: batang perkakas yang dapat dilepas

source: tearoff menu
id: menu yang dapat dilepas

source: utility window
en@shaw: ğ‘˜ğ‘µğ‘‘ğ‘¦ğ‘¤ğ‘©ğ‘‘ğ‘° ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´
id: jendela utilitas

source: splash screen
en@shaw: ğ‘•ğ‘ğ‘¤ğ‘¨ğ‘– ğ‘•ğ‘’ğ‘®ğ‘°ğ‘¯
id: layar pembuka

source: Window Type: %s
en@shaw: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´ ğ‘‘ğ‘²ğ‘: %s
id: Tipe Jendela: %s

source: Geometry (x, y, width, height): %d, %d, %d, %d
en@shaw: ğ‘¡ğ‘¦ğ‘ªğ‘¥ğ‘©ğ‘‘ğ‘®ğ‘¦ (x, y, ğ‘¢ğ‘¦ğ‘›ğ‘”, ğ‘£ğ‘²ğ‘‘): %d, %d, %d, %d
id: Geometri (x, y, lebar, tinggi): %d, %d, %d, %d

source: Class Group: %s
en@shaw: ğ‘’ğ‘¤ğ‘­ğ‘• ğ‘œğ‘®ğ‘µğ‘: %s
id: Grup Kelas: %s

source: Session ID: %s
en@shaw: ğ‘•ğ‘§ğ‘–ğ‘©ğ‘¯ ID: %s
id: ID Sesi: %s

source: Group Leader: %lu
en@shaw: ğ‘œğ‘®ğ‘µğ‘ ğ‘¤ğ‘°ğ‘›ğ‘¼: %lu
id: Pemimpin Grup: %lu

source: Transient for: %lu
en@shaw: ğ‘‘ğ‘®ğ‘¨ğ‘¯ğ‘ ğ‘©ğ‘¯ğ‘‘ ğ‘“ğ‘¹: %lu
id: Transien for: %lu

source: minimized
en@shaw: ğ‘¥ğ‘¦ğ‘¯ğ‘©ğ‘¥ğ‘²ğ‘Ÿğ‘›
id: diminimalkan

source: maximized
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿğ‘›
id: dimaksimalkan

source: maximized horizontally
en@shaw: ğ‘¥ğ‘¨ğ‘’ğ‘•ğ‘©ğ‘¥ğ‘²ğ‘Ÿğ‘› ğ‘£ğ‘ªğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¯ğ‘‘ğ‘©ğ‘¤ğ‘¦
id: dimaksimalkan arah mendatar
