Repository: chriskmanx/qmole
Catalog: QMOLEDEV/emelfm2-0.9.1/po/*.po
Languages: de

source: Display only the items which are:
de: Nur Dateien folgender Größe anzeigen:

source: size filter
de: Filter nach Größe

source: bigger than
de: größer als

source: equal to
de: gleich

source: smaller than
de: kleiner als

source: Mbytes
de: MB

source: bytes
de: Byte

source: kbytes
de: kB

source: %s added to tasks queue
de: %s zur Warteschlange hinzugefügt.

source: The current operation (%s)
de: Die aktuelle Aktion (%s)

source: operation
de: Aktion

source: Busy
de: Beschäftigt

source: File operation in progress
de: Datei-Aktion in Arbeit

source: Operation not permitted - Circular directories
de: Operation nicht erlaubt - Zirkuläre Verzeichnis-Struktur!

source: Enter new name for
de: Neuer Name für

source: Trashed item %s reinstated to %s
de: Objekt %s wiederhergestellt nach %s

source: Cannot reinstate %s
de: Fehler beim Wiederherstellen von %s

source: link
de: Symbolischer Link

source: Removed all trash items from '%s'
de: Alle Objekte entfernt aus Papierkorb '%s'

source: Cannot rename %s
de: Umbenennen von '%s' nicht möglich!

source: You do not have authority to change permission(s) of %s
de: Sie sind nicht berechtigt, die Zugriffsrechte zu ändern für %s

source: You do not have authority to change owner(s) of %s
de: Sie sind nicht berechtigt, den/die Eigentümer zu ändern für %s

source: open with
de: Öffnen mit

source: Enter command:
de: Befehl eingeben:

source: Enter a name or partial name to find:
de: Name oder einen Teil davon zur Suche eingeben:

source: abort
de: Abbrechen

source: Cannot change ownership of %s
de: Ändern des Eigentümers von '%s' nicht möglich!

source: Cannot delete %s
de: Löschen von '%s' nicht möglich!

source: Cannot delete existing %s
de: Löschen von '%s' nicht möglich!

source: Cannot create special file %s
de: Erstellen der speziellen Datei '%s' nicht möglich!

source: Cannot create FIFO %s
de: Erstellen des FIFO '%s' nicht möglich!

source: Cannot create new link to %s
de: Erstellen des neuen Links nach '%s' nicht möglich!

source: Cannot get target info for link %s
de: Keine Ziel-Informationen des Links '%s' gefunden!

source: Cannot copy all of %s
de: Das Kopieren aller Objekte in %s ist nicht möglich!

source: incomplete
de: teilweise

source: Cannot move %s to %s
de: Verschieben von '%s' nach '%s' nicht möglich!

source: Cannot create link to %s
de: Erstellen des Links nach '%s' nicht möglich!

source: Cannot rename %s to %s
de: Umbenennen von '%s' nach '%s' nicht möglich!

source: Cannot get current data for %s
de: Fehler beim Erhalten aktueller Daten von %s!

source: Cannot change permission(s) of all of %s
de: Das Ändern der Zugriffsrechte aller Objekte in %s ist nicht möglich!

source: Cannot get current permissions of %s
de: Fehler beim Erhalten aktueller Zugriffsrechte von %s!

source: Cannot change ownership of all of %s
de: Das Ändern der Eigentümer aller Objekte in %s ist nicht möglich!

source: Show _bar
de: _Leiste zeigen

source: Show _tooltips
de: _Schnellhilfe zeigen

source: Space _handling
de: _Platzbehandlung

source: _none
de: _ohne

source: _scrollbars
de: _Bildlaufleiste

source: _Placement
de: _Platzierung

source: _Container
de: _Bereich

source: _main window
de: _Hauptfenster

source: _both panes
de: _Beide Fenster

source: file-pane _1
de: _Fenster 1

source: flle-pane _2
de: _Fenster 2

source: _Reset order
de: _Reihenfolge zurücksetzen

source: Buttons _relief
de: _Button-Relief

source: Buttons _same size
de: _Gleiche Button-Größe

source: _Button style
de: _Button-Stil

source: _theme
de: _GTK-Thema

source: icon _only
de: _Nur Icon

source: _label only
de: _Nur Name

source: icon _above label
de: _Icon über Name

source: icon _beside label
de: _Icon neben Name

source: _Icon size
de: _Icon-Größe

source: _menu
de: _Menü

source: toolbar _small
de: _Leiste (klein)

source: toolbar _large
de: _Leiste (groß)

source: drag '_n' drop
de: _Drag & Drop

source: Bar i_tems
de: Leisten-Einträge...

source: Show a menu of hidden items
de: Zeige das Menü der nicht sichtbaren Werkzeuge

source: not
de: nicht

source: accessed
de: Zugriff

source: changed
de: geändert

source: modified
de: verändert

source: show the
de: Anzeigen der

source: This determines whether the %s is displayed or hidden
de: Wenn aktiviert, wird die %s angezeigt.

source: This determines whether the %s is displayed horizontally or vertically
de: Wenn NICHT aktiviert, so wird die %s VERTIKAL angezeigt.

source: show tooltips for %s buttons
de: Schnellhilfe für die Buttons der %s anzeigen

source: If deactivated, tooltips will not be displayed for %s buttons
de: Wenn aktiviert, wird für jeden Button der %s eine kurze Hilfe angezeigt, wenn der Mauszeiger darauf steht.

source: This determines the method for accessing %s elements that are hidden due to lack of screen-space
de: Hier legen Sie die Methode fest, wie Sie Zugang zu den Elementen der %s erhalten, wenn diese auf Grund eines Platzmangels versteckt sind.

source: use rest button
de: Rest-Button

source: use scrollbars
de: Bildlaufleiste

source: space handling
de: Behandlung der verfügbaren Breite

source: buttons have relief
de: : Buttons immer mit Relief anzeigen

source: Buttons with relief show their outline continually, not just when 'moused'
de: Wenn aktiviert, werden die Buttons immer mit Umrandung angezeigt auch, wenn sich der Mauszeiger nicht darüber befindet.

source: buttons are the same size
de: : Buttons mit gleicher Größe anzeigen

source: Equal-width buttons look good on a vertical bar, bad on a horizontal bar
de: Wenn aktiviert, werden alle Buttons mit der gleichen Breite angezeigt.

source: button style
de: Button-Stil

source: icon size
de: Icon-Größe

source: container
de: im Bereich

source: This determines the 'box' into which the %s is placed
de: Hier legen Sie den Bereich fest, in welchem sich die %s befinden soll.

source: both panes
de: Beide Fenster

source: file-pane 1
de: Fenster 1

source: file-pane 2
de: Fenster 2

source: main window
de: Hauptfenster

source: priority
de: an Position

source: This determines the order of toolbars (0 = left or top)
de: Hier beeinfussen Sie, in welcher Reihenfolge die einzelnen Leisten angezeigt werden. Beachten Sie dabei auch die Einstellungen der anderen Leisten. (0=ganz links oder ganz oben)

source: Copy items selected in the active pane to the other one
de: Ausgewählte(s) Objekt(e) in das andere Fenster kopieren

source: Move items selected in the active pane to the other one
de: Ausgewählte(s) Objekt(e) in das andere Fenster verschieben

source: Symlink items selected in the active pane to the other one
de: Symbolischen Link des/der ausgewählten Objekte(s) im anderen Fenster erzeugen

source: Re_name..
de: _Umbenennen

source: Rename items selected in the active pane
de: Ausgewählte(s) Objekt(e) umbenennen

source: Move items selected in the active pane to a trashbin
de: Ausgewählte(s) Objekt(e) in den Papierkorb verschieben

source: Create new directory(ies)
de: Neue(s) Verzeichnis(se) erstellen

source: Re_fresh
de: A_ktualisieren

source: Update pane contents
de: Fensterinhalt aktualisieren

source: _Switch
de: _Wechseln

source: Toggle the active pane
de: Aktives Fenster wechseln

source: Full
de: Voll

source: Maximize output pane
de: Ausgabebereich maximieren

source: Shrink
de: Klein

source: Un-maximize output pane
de: Ausgabebereich minimieren

source: Hide
de: Verstecken

source: Hide output pane
de: Ausgabebereich verstecken

source: Show
de: Zeigen

source: Show output pane
de: Ausgabebereich anzeigen

source: Clear
de: Löschen

source: Clear output pane
de: Ausgabebereich löschen

source: Clear command line
de: Befehlszeile löschen

source: cl
de: Del

source: Child processes
de: Kindprozesse auflisten

source: ps
de: List

source: Calculate disk usage of selected items
de: Berechne Speicherplatz der gewählten Objekte

source: du
de: Speicherplatz

source: Find item in active pane, by name
de: Suche Objekt im aktiven Fenster beim Name

source: Open terminal at the active directory
de: Öffne Terminal im aktiven Verzeichnis

source: _X
de: _Terminal

source: Run command as root
de: Befehl als Root ausführen

source: Mount or unmount a device
de: Laufwerk mounten oder unmounten

source: mts..
de: mnt..

source: View/change configuration settings for this program
de: Anzeigen/Ändern der Einstellungen von emelFM2

source: _Settings..
de: _Setup..

source: Get information about this program
de: Informationen über emelFM2

source: Close this program
de: emelFM2 beenden

source: Hide other pane
de: Anderes Fenster verstecken

source: _Panes
de: _Fenster

source: Show other pane
de: Anderes Fenster zeigen

source: Show _hidden
de: _Zeige

source: Display hidden items in this directory
de: Versteckte Dateien anzeigen

source: Hide _hidden
de: _Verberge

source: Do not display hidden items in this directory
de: Versteckte Dateien verbergen

source: Fil_ters
de: _Filter

source: Set rules for the items to be displayed
de: Anzeigefilter

source: Set/remove rules for the items to be displayed
de: Anzeigefilter bearbeiten/entfernen

source: Show a virtual directory in this pane
de: Ein Virtuelles Verzeichnis in diesem Fenster zeigen

source: _Marks
de: _Lesez.

source: Bookmarks
de: Lesezeichen

source: Add the current directory to the top of the bookmarks list
de: Fügt das aktuelle Verzeichnis an die erste Stelle der Lesezeichen hinzu.

source: Add the current directory to the bottom of the bookmarks list
de: Fügt das aktuelle Verzeichnis an die letzte Stelle der Lesezeichen hinzu.

source: _Edit bookmarks
de: _Lesezeichen bearbeiten

source: Open the bookmarks configuration dialog
de: Öffnet die Konfigurationsseite der Lesezeichen

source: M_irror
de: _Spiegeln

source: Go to directory shown in other pane
de: Ins gleiche Verzeichnis wechseln wie im anderen Fenster

source: Go to previous directory in history
de: Gehe ins vorherige Verzeichnis

source: Go up to parent directory
de: Gehe ins Stammverzeichnis

source: Go to next directory in history
de: Gehe ins nächste Verzeichnis

source: Copy selected path
de: Kopiert den ausgewählten Pfad in die Zwischenablage

source: Collapse all paths
de: Einklappen aller Pfade

source: _Strict hiding
de: _Striktes Verstecken

source: If active, hidden ancestors of visible directories will not be displayed
de: Wenn aktiviert, werden auch sichtbare Verzeichnisse nicht angezeigt, deren Elternverzeichnis versteckt ist.

source: pane 1 navigator
de: Verzeichnisbaum - Fenster 1

source: pane 2 navigator
de: Verzeichnisbaum - Fenster 2

source: Toggle display of hidden directories
de: Anzeige der versteckten Verzeichnisse umschalten

source: unknown encoding
de: unbekannte Zeichenkodierung

source: Not enough memory! Things may not work as expected
de: Nicht genug Speicher! Fehlfunktionen sind dadurch zu erwarten!

source: Cannot read USAGE help document
de: Fehler beim Lesen der USAGE Hilfedatei!

source: No item selected
de: Kein Objekt gewählt!

source: No item selected in other pane
de: Kein Objekt im anderen Fenster gewählt!

source: Cannot read '%s'
de: Fehler beim Lesen von '%s'!

source: '%s' is a directory
de: '%s' ist ein Verzeichnis!

source: Cannot read %s
de: Lesen von '%s' nicht möglich!

source: Encoding conversion command '%s' failed
de: Fehler beim Ausführen des Befehles '%s' zur Zeichensatz-Konvertierung!

source: Conversion from %s encoding failed: "%s"
de: Fehler bei der Konverierung von %s: "%s"

source: choose file encoding
de: Dateicodierung auswählen

source: Select one or more encodings to test
de: Bitte eine oder mehrere Kodierung(en) zum Testen wählen

source: The file encoding may be any of the selected ones
de: Die Zeichenkodierung könnte eine der gewählten sein.

source: File encoding cannot be converted from any selected type
de: Die Zeichenkodierung konnte nicht konvertiert werden.

source: Finds
de: Suchtext

source: If activated, text case does matter when searching
de: Wenn aktiviert, wird beim Suchen zwischen Groß- und Kleinschreibung unterschieden.

source: _match case
de: _Groß-/Kleinbuchstaben unterscheiden

source: If activated, matches must be surrounded by word-separator characters
de: Wenn aktiviert, müssen die Treffer durch eine Wort-Trennzeichen begrenzt sein (z.B. Leerzeichen).

source: wh_ole words
de: _ganze Wörter

source: If activated, searching proceeds toward document start
de: Wenn aktiviert, erfolgt die Suche rückwärts.

source: _backward
de: _rückwärts

source: If activated, searching cycles from either end to the other
de: Wenn aktiviert, erfolgt sie Suche in einer Endlosschleife.

source: _loop
de: _zyklisch

source: displaying file
de: Interner Dateibetrachter

source: _wrap
de: _Zeilenumbruch

source: Show the search options bar
de: Such-Parameter anzeigen

source: wrap text
de: Zeilenumbruch

source: This causes the view window to open with text-wrapping enabled
de: Wenn aktiviert, wird das Betrachter-/Editor-Fenster mit aktiviertem Zeilenumbruch geöffnet.

source: window width
de: Fensterbreite

source: The view window will default to showing this many characters per line (but the the displayed buttons may make it wider than this)
de: Hier stellen Sie die Breite des Betrachter-Fensters ein (Anzahl der Zeichen, Minimum ist abhängig von den Buttons).

source: window height
de: Fensterhöhe

source: The view window will default to showing this many lines of text
de: Hier stellen Sie die Höhe des Betrachter-Fensters ein (Anzahl der Zeilen).

source: custom font for viewing files
de: Font für den internen Betrachter/Editor

source: This is the font used for text in each view dialog
de: Hier wird die Schriftart zu Darstellung im internen Datei-Betrachter und Editor festgelegt.

source: case sensitive searches
de: Groß-/Kleinbuchstaben unterscheiden

source: This causes the view window search-bar to first open with case-sensitive searching enabled
de: Wenn aktiviert, so wird in der Suchleiste des Betrachter-Fensters die Gross-/Kleinschreibung aktiviert.

source: show last search string
de: Letzten Suchtext anzeigen

source: This shows the last search-string in the entry field, when the view window search-bar is displayed
de: Wenn aktiviert, wird der zuletzt gesuchte Text im Eingabefeld der Suchleiste angezeigt.

source: keep search history
de: Such-Chronik speichern

source: This causes search strings to be remembered between sessions
de: Wenn aktiviert, merkt sich emelFM2 die letzten Suchstrings.

source: displayed & %d concealed
de: angezeigten & %d versteckten

source: %s%d selected item(s) of %d %sin %s
de: %s%d ausgewählte(s) Objekt(e) von %d %sin %s

source: copy_name
de: Namen_kopieren

source: Copy _names
de: _Namen kopieren

source: Copy path or name of each selected item to the clipboard
de: Kopiert den/die Name(n) des/der ausgewählten Objekte(s) in die Zwischenablage.

source: clone
de: Kopie

source: C_lone..
de: _Kopie...

source: Copy selected items, each with new name, to the current directory
de: Erstellt eine Kopie der ausgewählten Datei(en) im selben Verzeichnis.

source: Bad configuration data for %s, not installed
de: Fehlerhafte Konfigurationsdaten für %s, nicht installiert!

source: Incompatible format - %s
de: Fehler: Nicht kompatibles Format - %s

source: select configuration data file
de: Auswahl der Konfigurationsdatei

source: save configuration data file
de: Konfigurationsdatei speichern

source: select icons directory
de: Auswahl des Icons-Verzeichnisses

source: Save configuration data in
de: Konfigurationsdaten exportieren nach:

source: backup
de: Sicherheitskopie

source: Se_lect
de: _Auswahl

source: Select the file in which to store the config data
de: Klicken Sie hier, um das Verzeichnis und den Dateinamen der Konfigurationsdatei auszuwählen.

source: Save current config data in the specified file
de: Klicken Sie hier, um die aktuellen Konfigurationsdaten in die angegebenen Datei zu exportieren.

source: Get configuration data from
de: Konfigurationsdaten importieren von:

source: Select the config file from which to get the data
de: Klicken Sie hier, um die zu importierende Konfigurationsdatei auszuwählen.

source: Import config data in accord with choices below
de: Klicken Sie hier, um die Konfigurationsdaten entsprechend der unten gewählten Angaben zu importieren.

source: _all options
de: _alle Optionen

source: all '_non-group' options
de: alle '_nicht-Gruppen'-Optionen

source: all 'g_roup' options
de: alle '_Gruppen'-Optionen

source: _specific group option(s)
de: _spezielle Gruppen-Option(en)

source: _groups
de: _Gruppen

source: Use icons in
de: Die Icons im folgenden Verzeichnis benutzen:

source: Select the directory where the icons are
de: Klicken Sie hier, um das Verzeichnis zu wählen, in welchem sich die emelFM2-Icons befinden.

source: Apply the chosen icon directory
de: Klicken Sie hier, um die Icons im ausgewählten Verzeichnis anzuwenden.

source: Copy current icons to
de: Aktuelle Icons kopieren nach:

source: Select the directory where the icons will be saved
de: Klicken Sie hier, um das Verzeichnis zu wählen, in welches die aktuellen Icons kopiert werden sollen.

source: C_opy
de: _Kopieren

source: Copy the icons to the chosen directory
de: Klicken Sie hier, um die aktuellen Icons in das angegebene Verzeichnis zu kopieren.

source: manage configuration data
de: Konfigurationsdaten

source: manage
de: handhaben

source: _Configure..
de: _Konfiguration...

source: Export or import configuration data
de: Exportieren/Importieren der Konfigurationsdaten

source: copying %s to %s this is item %s of %s
de: Kopiere %s nach %s Objekt %s von %s

source: %.2f MB of %.2f MB (%.0f\%%)
de: %.2f MB von %.2f MB (%.0f\%%)

source: Cannot put anything in %s
de: Es können keine Objekte in '%s' abgelegt werden!

source: copying
de: Kopieren

source: _Resume
de: _Weiter

source: cpbar
de: Kopieren_mit_Anzeige

source: Copy selected items, with displayed progress details
de: Die ausgewählten Objekte werden mit Fortschrittsanzeige in das andere Fenster kopiert.

source: cpbar_with_time
de: Kopieren_mit_Zeit+Anzeige

source: Copy with _times
de: Kopieren mit _Zeit

source: Copy selected items, with preserved time-properties and displayed progress details
de: Die ausgewählten Objekte werden mit Fortschrittsanzeige und Beibehaltung der Zeiten in das andere Fenster kopiert.

source: Compression failed for file %s
de: Fehler beim Komprimieren der Datei %s

source: Cannot open '%s' for writing
de: Fehler beim Öffnen von '%s' zum Schreiben!

source: Wrong password for %s
de: Falsches Passwort für %s

source: Error decompressing file %s
de: Fehler beim Entpacken der Datei %s

source: Requested %s compression library not found or not compatible
de: Fehler! Die angeforderte Bibliothek %s wurde nicht gefunden oder ist nicht kompatibel.

source: Unknown compression library
de: Unbekannte Kompressions-Bibliothek für Datei %s

source: No %s compression library
de: %s Bibliothek nicht gefunden

source: %s does not end with "%s". Process this file anyway?
de: %s endet nicht mit "%s". Trotzdem weitermachen?

source: Cannot process all of %s
de: Fehler! Kann nicht alles verarbeiten von %s

source: _Encrypt
de: _Verschlüsseln

source: _Decrypt
de: _Entschlüsseln

source: en/decrypt file
de: Datei ver-/entschlüsseln

source: Symbolic link
de: Symbolischer Link

source: to %s
de: nach %s

source: _encrypt
de: _Verschlüsseln

source: _decrypt
de: _Entschlüsseln

source: encrypted file will have _same name
de: Die verschlüsselte Datei wird den _gleichen Namen besitzen.

source: _append this to encrypted file name
de: das _anhängen an den verschlüsselten Dateinamen

source: encrypted file _name will be
de: Der _verschlüsselte Dateiname wird sein:

source: decrypted file will have _same name
de: Die entschlüsselte Datei wird den _gleichen Namen besitzen.

source: decrypted file will have e_mbedded name, if any
de: Die entschlüsselte Datei wird den einge_betteten Namen besitzen, sofern vorhanden

source: strip this _from end of decrypted file name
de: Vom Ende des Dateinamens diese Zeichen nach dem Entschlüsseln entfernen:

source: decrypted file _name will be
de: Der _entschlüsselte Dateiname wird sein:

source: apply any stored permissions, owners, dates to decrypted file
de: Aktuellen Name, Zugriffsrechte usw. in der verschlüsselten Datei speichern.

source: restore _properties
de: Eigenschaften _wiederherstellen

source: compress
de: Packen

source: compress file before encryption
de: Datei vor dem Verschlüsseln packen

source: _compress
de: _Packen

source: _validate
de: _Gültigkeit prüfen

source: setup for validation when decrypting
de: Wenn aktiviert, erfolgt beim Entschlüsseln eine Gültigkeitsprüfung.

source: store _filename
de: Dateiname speichern

source: store current name for application after decryption
de: Aktuellen Namen nach dem Entschlüsseln speichern.

source: store _properties
de: _Eigenschaften speichern

source: store current permissions etc for application after decryption
de: Aktuelle Zugriffsrechte usw. nach dem Entschlüsseln speichern.

source: _backup
de: _Sicherheitskopie

source: backup an existing file with the same name as the processed file
de: Wenn beim Speichern einer Datei eine gleichnamige bereits existiert, so wird diese gesichert.

source: _keep original
de: _Original erhalten

source: do not remove the original file, after processing it
de: Originaldatei nach der Verarbeitung nicht entfernen.

source: if file is a symlink, process its target
de: Wenn die Datei ein symbolischer Link ist, dann das Ziel des Links verarbeiten.

source: through _links
de: _Links folgen

source: _recurse directories
de: _Rekursiv (mit Unterverzeichnissen)

source: You do not have authority to modify %s
de: Sie sind nicht berechtigt, '%s' zu ändern!

source: crypt
de: Schlüssel

source: _En/decrypt..
de: _Ver-/Entschlüsseln

source: Encrypt or decrypt selected items
de: Ver- oder Entschlüsselt die gewählten Objakte.

source: compression type
de: Komprimierungstyp

source: Use this form of compression before encryption
de: Diese Art der Komprimierung vor dem Verschlüsseln verwenden

source: compare
de: vergleichen

source: C_ompare
de: _Vergleichen

source: Select active-pane items which are duplicated in the other pane
de: Wählt alle Objekte des aktiven Fensters, die auch im anderen Fenster vorkommen

source: total size:
de: Gesamtgröße:

source: kilobytes
de: Kilobyte

source: Megabytes
de: Megabyte

source: gigabytes
de: Gigabyte

source: (one or more are hidden)
de: (eins oder mehrere sind versteckt)

source: _Disk usage
de: _Speicherplatz

source: Calculate the disk usage of selected items
de: Berechnet Speicherplatz der gewählten Objekte

source: sort_by_ext
de: nach_Erweiterung_sortieren

source: Extension _sort
de: _Sortieren nach Erweiterung

source: Sort the active file pane by filename extension
de: Sortiert das aktive Fenster nach der Dateierweiterung

source: all files
de: alle Dateien

source: images
de: Bilder

source: music
de: Sounddateien

source: videos
de: Videodateien

source: text files
de: Textdateien

source: development files
de: Entwicklerdateien

source: other files
de: Andere Dateien

source: applications
de: Anwendungen

source: email attachments
de: E-Mail-Anhänge

source: hours
de: Stunden

source: days
de: Tagen

source: months
de: Monate

source: years
de: Jahre

source: Find items:
de: Finde Objekte:

source: any_where
de: über_all

source: in _trash
de: im _Papierkorb

source: in _active directory
de: im aktuellen _Verzeichnis

source: in _other directory
de: im Verzeichnis des _nicht aktiven Fensters

source: in _directory
de: im _Verzeichnis

source: Choose directory
de: Verzeichnis auswählen

source: _Recurse subdirectories
de: _Rekursiv

source: Include _linked subdirectories
de: Ver_linkte Verzeichnisse einschließen

source: Careful about circular links
de: Vorsicht bei zirkulären Links

source: and whose name:
de: und deren Name...
