Repository: chriskmanx/qmole
Catalog: QMOLEDEV/emelfm2-0.9.1/po/*.po
Languages: de

source: The files are different
de: Die Dateien sind verschieden!

source: The files are identical
de: Die Dateien sind gleich!

source: _Compare files
de: Dateien _vergleichen

source: Compare _directories
de: Verzeichnisse _vergleichen

source: _Remove spaces
de: _Leerzeichen entfernen

source: Enter the piece-size (in kB):
de: Teilgröße eingeben (in kB):

source: _Split file..
de: Datei _teilen...

source: Co_ncatenate files..
de: Dateien _zusammenfügen...

source: Enter the name of the combined file:
de: Name der zusammengefügten Datei eingeben:

source: Show _usage
de: _Speicherplatz

source: _Free space
de: _Freier Speicherplatz

source: percent free
de: Prozent frei

source: _Edit user commands..
de: _Eigene Befehle bearbeiten

source: Ma_ke dir..
de: _Verzeichnis(se) erstellen...

source: _Bookmarks
de: _Lesezeichen

source: Add _top
de: _Lesezeichen hinzufügen (Anfang)

source: Add _bottom
de: _Lesezeichen hinzufügen (Ende)

source: _Edit bookmarks..
de: _Lesezeichen bearbeiten...

source: _History
de: _Chronik

source: _Edit filetype..
de: _Dateityp bearbeiten...

source: Shift
de: Umsch

source: Ctrl
de: Strg

source: Action
de: Aktion

source: hour
de: Stunde

source: day
de: Tag

source: month
de: Monat

source: year
de: Jahr

source: Display only the items:
de: Dateien mit folgender Bedingung anzeigen:

source: date filter
de: Filter nach Datum

source: accessed since
de: Zugriff seit dem

source: modified before
de: Verändert vor dem

source: modified since
de: Verändert seit dem

source: accessed before
de: Zugriff vor dem

source: changed before
de: Geändert vor dem

source: changed since
de: Geändert seit dem

source: Error mounting device: %s
de: Fehler beim Einhängen des Gerätes: %s

source: Error unmounting device: %s
de: Fehler beim Aushängen des Gerätes: %s

source: _Hidden
de: _Versteckte Dateien

source: Toggle display of hidden items
de: Anzeige der versteckten Objekte umschalten

source: user input
de: Datei erstellen

source: You don't have authority to change anything
de: Sie sind nicht berechtigt etwas zu ändern

source: You don't have authority to do this
de: Sie sind nicht berechtigt, das zu tun!

source: Are you sure you want to delete <b>%s</b>?
de: <b>%s</b> wirklich löschen?

source: confirm
de: Bestätigung

source: Delete items without further confirmation
de: Löscht Objekte ohne weitere Nachfragen

source: Retain this item
de: Dieses Objekt beibehalten

source: older
de: älter

source: newer
de: neuer

source: existing
de: vorhanden

source: Remove all contents of %s <b>%s</b> ?
de: Den gesamten Inhalt von %s <b>%s</b> löschen?

source: Overwrite %s <b>%s</b> in %s ?
de: Überschreiben des %sen Objektes <b>%s</b> in %s ?

source: Overwrite any existing item without further confirmation
de: Überschreibt jedes existierende Objekt ohne weitere Nachfragen

source: _Replace
de: _Ersetzen

source: %s is taking a long time. Continue waiting ?
de: %s benötigte bereits viel Zeit. Weiter warten?

source: _Quiet
de: _Stille

source: Don't ask any more
de: Nicht mehr danach fragen

source: _Stop
de: _Anhalten

source: Cancel the %s
de: Abbrechen von '%s'

source: _Wait
de: _Warten

source: Wait some more
de: Weiter warten

source: center
de: Bildschirmmitte

source: mouse
de: Am Mauszeiger

source: none
de: ohne

source: always center
de: Immer in der Mitte

source: center on parent
de: In der Mitte des vorherigen Fensters

source: dialog position
de: Dialog-Fensterposition

source: This determines the position where dialog windows will pop up
de: Hier wird die Position der Dialog-Fenster festgelegt.

source: C_ancel
de: A_bbrechen

source: file save as
de: Datei speichern als

source: Cannot save %s in its original encoding %s. Reverting to UTF-8
de: Fehler beim Speichern von %s im Original-Zeichensatz %s. Konvertiere zurück nach UTF-8.

source: Encoding conversion failed for %s
de: Fehler bei der Zeichensatz-Konvertierung von %s!

source: Original encoding of '%s' is unknown, now saved as UTF-8
de: Der Original-Zeichensatz von '%s' ist unbekannt, wurde als UTF-8 gespeichert!

source: Re_vert
de: _Zurück

source: Reverting to saved version cannot be undone
de: Das Zurücksetzen auf die gesicherte Version kann nicht rückgängig gemacht werden!

source: Cannot initialize spell checking: %s
de: Fehler beim Initialisieren der Rechtschreibkontrolle: %s!

source: choose language
de: Sprache auswählen

source: Enter the spell-checker language (like en_CA):
de: Sprache der Rechtschreibkontrolle (z.B. de_DE):

source: Cannot set speller language to %s (%s)
de: Fehler beim Einstellen der Sprache: %s (%s)

source: Replace this one ?
de: Diesen Text ersetzen?

source: Spelling suggestions
de: Rechtschreibvorschläge

source: _Save
de: _Speichern

source: Save the file
de: Speichert die Datei

source: Save as..
de: S_peichern als...

source: Save the file with a new name
de: Speichert die Datei mit einem neuen Namen

source: Save se_lection..
de: Auswa_hl speichern...

source: Save the selected text
de: Speichert den ausgewählten Text in eine Datei

source: Print file
de: Datei drucken

source: Print selected text
de: Druckt den ausgewählten Text

source: _Print..
de: _Drucken...

source: Reload the file being edited
de: Die geöffnete Datei neu laden

source: _Find..
de: S_uchen...

source: Find matching text
de: Text suchen

source: _Replace..
de: _Ersetzen...

source: Find and replace matching text
de: Text suchen und ersetzen

source: _Hide
de: Vers_tecken

source: Hide the search options bar
de: Such-Parameter verstecken

source: _Undo
de: _Rückgängig

source: Undo last change
de: Letzte Änderung rückgängig machen

source: Re_do
de: _Wiederholen

source: Reverse last undo
de: Letzte Änderung wiederholen

source: _Check spelling
de: _Rechtschreibprüfung

source: Flag mis-spelt words
de: Falsch geschriebene Worte markieren

source: _Clear spellcheck
de: Rechtschreibkontrolle _zurücksetzen

source: Remove all spell-check flags
de: Alle Markierungen entfernen

source: _Language..
de: _Sprache...

source: Set spell-checker language
de: Stellt die Sprache der Rechtschreibkontrolle ein.

source: _Wrap
de: Zei_lenumbruch

source: If activated, text in the window will be word-wrapped
de: Wenn aktiviert, wird der Text im Fenster mit Zeilenumbruch angezeigt.

source: Se_ttings
de: _Einstellungen

source: Open the configuration dialog at the options page
de: Öffnet die Konfigurationsseite des Betrachters/Editors

source: Save modified file ?
de: Geänderte Datei speichern?

source: _Edit
de: _Bearbeiten

source: Resume editing
de: Bearbeitung wiederholen

source: editing file
de: Datei bearbeiten

source: Replacements
de: Ersetzungstext

source: If activated, the next match will be sought after each replacement
de: Wenn aktiviert, wird nach jedem Ersetzen zum nächsten Vorkommen gesprungen.

source: r_epeat
de: _wiederholen

source: If activated, all matches will be replaced at once
de: Wenn aktiviert, werden alle Vorkommen des Suchtextes auf einmal ersetzt.

source: _all
de: _alle

source: If activated, confirmation will be sought when "replacing all"
de: Wenn aktiviert, werden Sie vor jeder Erstetzung zu einer Bestätigung aufgefordert. (Nur, wenn "alle" aktiviert ist.)

source: co_nfirm
de: _bestätigen

source: not found
de: nicht gefunden

source: Replace this match
de: Diesen Text ersetzen

source: _Find
de: _Suchen

source: Find the next match
de: Finde das nächste Vorkommen des Suchtextes

source: backup when saving
de: Sicherheitskopie beim Speichern erstellen

source: When saving an edited file, an existing file with the same name will be renamed
de: Wenn beim Speichern einer Datei eine gleichnamige bereits existiert, so wird diese umbenannt.

source: Type:
de: Objekttyp:

source: Item:
de: Objekt:

source: Mime:
de: Mime-Typ:

source: Encoding:
de: Kodierung:

source: Size:
de: Größe:

source: User:
de: Eigentümer:

source: Group:
de: Gruppe:

source: Permissions:
de: Zugriffsrechte:

source: Accessed:
de: Zugriff:

source: Content modified:
de: Inhalt geändert:

source: Property changed:
de: Eigenschaften verändert:

source: Copy displayed data
de: Kopiert die angezeigten Daten in die Zwischenablage

source: file info
de: Eigenschaften

source: Virtual file
de: Virtuelle Datei

source: Unknown
de: Unbekannt

source: Directory
de: Verzeichnis

source: %s containing %s item(s) which occupy %s byte(s)
de: %s beinhaltet %s Objekt(e), die %s Byte(s) belegen

source: empty
de: leer

source: Symbolic Link
de: Symbolischer Link

source: Character Device
de: Zeichenorientiertes Gerät

source: Block Device
de: Blockorientiertes Gerät

source: Socket
de: Sockel

source: to %s
de: nach %s

source: (which is <b>missing</b>)
de: (welches <b>nicht vorhanden</b> ist)

source: (which is <b>itself</b>)
de: (welches es <b>selbst</b> ist)

source: and ultimately to %s
de: und letztendlich nach %s

source: (Cannot resolve the link)
de: (Link kann nicht aufgelöst werden)

source: %s bytes
de: %s Byte

source: Item was last opened, run, read etc
de: geöffnet, gestartet, gelesen usw.

source: Item content was last changed
de: Objekt-Inhalt wurde zuletzt geändert

source: Item name, permission, owner, etc was last changed
de: Objekt-Eigenschaften (Name, Rechte, Eigentümer usw.) wurden zuletzt geändert

source: file information
de: Datei-Eigenschaften

source: displayed date/time format
de: Datums-/Zeitformat:

source: Pattern provided to strftime() to format date/time strings in the dialog
de: Dieser Formatierungsstring wird von der Funktion strftime() für Dateidatum und -zeit interpretiert.

source: Cannot access %s, going to %s instead
de: Fehler beim Zugriff auf %s, gehe deshalb zu %s!

source: <directory>
de: <Verzeichnis>

source: <executable>
de: <ausführbar>

source: <none>
de: <ohne>

source: directories
de: Verzeichnisse

source: _Open
de: _Öffnen

source: O_pen in other
de: Ö_ffnen im anderen Fenster

source: _Mount
de: _Mounten

source: _Unmount
de: _Unmounten

source: executables
de: Ausführbare Dateien

source: _Run
de: Aus_führen

source: Edit _with..
de: _Bearbeiten mit...

source: Editor command:
de: Editor-Befehl:

source: office documents
de: Office-Dokumente

source: HTML documents
de: HTML-Dateien

source: _Firefox
de: _Firefox-Browser

source: _Mozilla
de: _Mozilla-Browser

source: _Lynx
de: _Lynx-Browser

source: _Opera
de: _Opera-Browser

source: PDF documents
de: PDF-Dateien

source: postscript documents
de: Postscript-Dateien

source: text documents
de: Text-Dateien

source: View
de: Betrachten

source: spreadsheets
de: Tabellen

source: audio files
de: Sound-Dateien

source: image files
de: Bilder

source: video files
de: Videos

source: plain tarballs
de: Tar-Archive

source: Unpack
de: Entpacken (temporär)

source: Unpack in other pane
de: Entpacken im anderen Fenster

source: _List contents
de: _Inhalt anzeigen

source: gzip tarballs
de: Gzip-Archive

source: _Unpack
de: _Entpacken

source: Unpack in _other pane
de: _Entpacken im anderen Fenster

source: bzip2 tarballs
de: Bzip2-Archive

source: lzma tarballs
de: Lzma-Archive

source: xz tarballs
de: xz.tar-Archive

source: 7z archives
de: 7Zip-Archiv

source: zip archives
de: Zip-Archive

source: _Unzip
de: _Entpacken

source: Unzip in _other pane
de: _Entpacken im anderen Fenster

source: RPM packages
de: RPM-Pakete

source: _Install
de: _Installieren

source: source code files
de: Quellcode-Dateien

source: object files
de: Objekt-Dateien

source: _View symbols
de: _Symbole anzeigen

source: Category
de: Kategorie

source: Command
de: Befehl

source: case-insensitive filetypes
de: Groß-/Kleinbuchstaben des Dateitypes unterscheiden

source: This causes text-case to always be ignored when matching a file-extension
de: Wenn aktiviert, wird Groß- und Kleinschreibung des Dateitypes unterschieden.

source: new
de: neu

source: Cu_t
de: _Ausschneiden

source: Cut selected row(s)
de: Markierte Zeile(n) ausschneiden

source: Copy selected row(s)
de: Markierte Zeile(n) kopieren

source: _Paste
de: _Einfügen

source: Paste previously copied or cut row(s) after current row
de: Fügt die Zwischenablage hinter der aktuellen Zeile ein.

source: _Add
de: _Hinzufügen

source: Add a row after the current one
de: Fügt eine neue Zeile nach der aktuellen ein

source: _Up
de: _Hoch

source: Move selected row up
de: Bewegt die aktuelle Zeile nach oben.

source: _Down
de: _Runter

source: Move selected row down
de: Bewegt die aktuelle Zeile nach unten.

source: edit filetypes
de: Dateityp bearbeiten

source: Extensions
de: Dateierweiterungen

source: Labels
de: Bezeichnungen

source: Commands
de: Befehle

source: Move the selected row one place up
de: Bewegt die aktuelle Zeile nach oben.

source: Move the selected row one place down
de: Bewegt die aktuelle Zeile nach unten.

source: Add a row after the currently selected one
de: Es wird eine neue Zeile nach der aktuellen Zeile eingefügt.

source: ambiguous filetype
de: mehrdeutiger Dateityp

source: unrecognised filetype
de: Nicht zugeordneter Dateityp

source: What would you like to do with <b>%s</b> in %s ?
de: Was möchten Sie mit '<b>%s</b>' tun in %s ?

source: _Add..
de: _Hinzufügen

source: Create a new filetype for this extension, or add it to an existing filetype
de: Eine neue Zuordung für diesen Dateityp erstellen oder zu einer bestehenden Zuordnung hinzufügen

source: Edit the file
de: Datei bearbeiten

source: Execute the item
de: Objekt ausführen

source: Open with the default application
de: Mit der Standard-Anwendung öffnen

source: _Open..
de: Öffnen _mit...

source: Enter a command with which to open the file
de: Einen Befehl eingeben, mit dem die Datei geöffnet werden soll

source: Filename
de: Dateiname

source: Size
de: Größe

source: Permissions
de: Rechte

source: Owner
de: Eigentümer

source: Group
de: Gruppe

source: Modified
de: Verändert

source: Accessed
de: Zugriff

source: Changed
de: Geändert

source: '%s' is not a directory
de: '%s' ist kein Verzeichnis!

source: Cannot access directory '%s' - No permission
de: Zugriff auf Verzeichnis '%s' nicht möglich!

source: Directory '%s' does not exist
de: Das Verzeichnis '%s' existiert nicht!

source: Reading directory data
de: Verzeichnisdaten lesen

source: directory read
de: Verzeichnis lesen

source: Cannot open '%s' for writing - %s
de: Fehler beim Öffnen von '%s' zum Schreiben -%s!

source: Error writing file '%s' - %s
de: Fehler beim Schreiben der Datei '%s' - %s!

source: Error reading file %s
de: Fehler beim Lesen der Datei '%s'!

source: Cannot get information about %s
de: Kann keine Informationen erhalten über %s

source: Cannot open file %s
de: Fehler beim Öffnen der Datei %s

source: Cannot create file %s
de: Erstellen der Datei '%s' nicht möglich!

source: Error writing file %s
de: Fehler beim Schreiben der Datei '%s'!

source: Cannot open '%s' for reading
de: Fehler beim Öffnen von '%s' zum Lesen!

source: Cannot open pipe for command '%s'
de: Fehler beim Erzeugen der Pipe für den Befehl '%s'!

source: Command %s failed: not enough memory
de: Kommando %s konnte nicht ausgeführt werden: nicht genug Speicher

source: Cannot change anything in %s
de: Keine Änderungen in '%s' möglich!

source: Cannot change permissions of %s
de: Ändern der Zugriffsrechte von '%s' nicht möglich!

source: Directory %s not opened
de: Fehler! Verzeichnis %s ist nicht geöffnet!

source: Cannot open directory %s
de: Fehler beim Öffnen des Verzeichnisses %s!

source: gesture
de: Geste

source: Draw gesture
de: Geste zeichnen

source: Comma-separated grid-positions, each 1-9
de: Kommagetrennte Gitterpositionen (1-9) der Geste

source: Clea_r
de: _Löschen

source: Cannot auto-mount device '%s' at '%s'
de: Fehler beim automatischen Mounten von '%s' nach '%s'

source: _About
de: Ü_ber

source: _Bold
de: _Fett

source: _Clear
de: _Löschen

source: _Connect
de: _Verbinden

source: _Convert
de: _Konvertieren

source: _Cut
de: _Ausschneiden

source: _Directory
de: _Verzeichnis

source: _Disconnect
de: _Trennen

source: _Execute
de: _Ausführen

source: _File
de: _Datei

source: _Fullscreen
de: _Vollbild

source: _Back
de: _Zurück

source: _Forward
de: _Vor

source: _Bottom
de: _Unten

source: _First
de: _Erstes

source: _Last
de: _Letztes

source: _Top
de: _Oben

source: _Help
de: _Hilfe

source: _Indent
de: _Einrücken

source: _Italic
de: _Schräg

source: _Goto
de: _Gehe zu

source: _Centre
de: _Zentriert

source: _Fill
de: _Blocksatz

source: _Left
de: _Links

source: _Right
de: _Rechts

source: _Next
de: _Weiter

source: _Play
de: _Wiedergabe

source: _Previous
de: _Zurück

source: _Record
de: _Aufzeichnen

source: Re_wind
de: _Zurückspulen

source: _Network
de: _Netzwerk

source: _New
de: _Neu

source: _No
de: _Nein

source: _OK
de: _Okay

source: _Landscape
de: _Querformat

source: _Portrait
de: _Hochformat

source: _Preferences
de: _Einstellungen

source: _Print
de: _Drucken

source: Pre_view
de: _Vorschau

source: _Properties
de: _Eigenschaften

source: _Quit
de: _Ende

source: _Redo
de: _Wiederholen

source: _Revert
de: _Rückgängig

source: _Save_as
de: _Speichern_unter

source: _Color
de: _Farbe

source: _Font
de: _Schrift

source: Sort_asc
de: Au_fsteigend sortieren

source: Sort_desc
de: A_bsteigend sortieren

source: _Spell
de: _Rechtschreibung

source: _Strikeout
de: _Durchstreichen

source: _Undelete
de: _Wiederherstellen

source: _Underline
de: _Unterstreichen

source: _Outdent
de: _Ausrücken

source: _Yes
de: _Ja

source: Cannot find a key binding named %s
de: Tastenkürzel %s nicht gefunden!

source: key bindings
de: Tastenkürzel

source: Now press one of h,m,d\n
de: Drücken Sie jetzt h (Home-Verzeichnis), m (Mount-Punkte) oder d (Download-Verzeichnis)\n

source: Key
de: Taste(n)

source: Continue
de: Weiter

source: chained keybindings timeout (ms)
de: Timeout für verkettete Tastenkürzel (ms)

source: This sets the time limit (in milliseconds) for accepting 'chained' keybindings
de: Dieser Parameter setzt das Zeitlimit für das Akzeptieren von verketteten Tastenkürzel.

source: Your current locale is '%s'.
de: Die aktuelle Spracheinstellung ist '%s'.

source: You have set the environment variable G_BROKEN_FILENAMES, which causes GTK+ to convert filename encoding, from the one specified by the system locale, to UTF-8. However, you have not set a system locale. Please do so, by setting the environment variable LANG or LC_CTYPE!
de: Die Umgebungsvariable G_BROKEN_FILENAMES ist gesetzt, wodurch GTK+ die Dateinamen von der Systemkodierung zu UTF-8 konvertiert. Es sollte dennoch die Umgebungsvariable LANG oder LC_CTYPE gesetzt werden!

source: (Note: There is a command line option -i/--ignore-problems, but use it at your own risk!)
de: (Hinweis: Es gibt eine Kommandozeilen-Option -i/--ignore-problems, aber benutzen Sie diese auf eigene Gefahr!)

source: %s will ignore locale problems when reading filenames because --ignore-problems/-i has been set. This might result in segfaults and all kind of problems. You really should set a system locale with the LANG or LC_CTYPE environment variable.
de: %s wird länderspezifische Zeichenprobleme der Dateinamen ignorieren weil --ignore-problems/-i gesetzt wurde. Das könnte zu einer Zugriffsver- letzung und anderen Problemen führen. Es sollte eine korrekte Locale- Einstellung mit den Umgebungsvariablen LANG oder LC_CTYPE erfolgen.

source: %u process(es) are running
de: %u Kindprozesse laufen

source: _Continue
de: _Weiter

source: Continue working
de: Weiter arbeiten

source: Missing _image
de: Fehlendes _Bild

source: no children
de: keine Kindprozesse

source: _Name filter
de: Filter nach _Name

source: _Size filter
de: Filter nach _Größe

source: _Date filter
de: Filter nach _Datum

source: _Directories too
de: Auch _Verzeichnisse filtern

source: _Remove all filters
de: Alle _Filter entfernen

source: Menu
de: Menü

source: new directory
de: neues Verzeichnis

source: yes
de: ja

source: no
de: nein

source: cannot write to '%s' - %s
de: Schreiben in '%s' nicht möglich: %s

source: cannot write to parent directory - %s
de: Schreiben ins Elternverzeichnis nicht möglich - %s!

source: only '%s' exists - %s
de: Es existiert nur '%s' - %s!

source: the directory already exists
de: Das Verzeichnis existiert bereits!

source: something is in the way
de: Irgendetwas stimmt nicht!

source: but it's unwise to use wildcard char(s)
de: aber es ist nicht ratsam Platzhalterzeichen zu verwenden

source: directories will be created
de: Verzeichnisse werden erstellt

source: Cannot create directory %s
de: Erstellen des Verzeichnisses '%s' nicht möglich!

source: What is the new directory's name?
de: Name des neuen Verzeichnisses:

source: create directory
de: Verzeichnis(se) erstellen

source: <small>parent directory:</small>
de: <small>Erstellen im Verzeichnis:</small>

source: <small>creation possible:</small>
de: <small>Erstellen möglich:</small>

source: Create and continue
de: Erstellen und weiter

source: open info frame
de: Infobereich anzeigen

source: This causes make-directory dialogs to start with extra information displayed
de: Wenn aktiviert, wird der Info-Bereich im Dialog zum Erstellen von Verzeichnissen immer aufgeklappt.

source: follow active-pane directory
de: Folge dem Verzeichnis im aktiven Fenster

source: This makes the parent directory for new directories the same as the one in the active pane, even if the latter changes
de: Diese Option legt fest, dass stets das Verzeichnis des aktiven Fensters beim Erstellen neuer Verzeichnisse als übergeordnetes Verzeichnis verwendet wird.

source: suggest directory name
de: Neuen Verzeichnisname vorschlagen

source: This presents a suggested name for each new directory, based on the last-created directory with an increasing number appended
de: Wenn aktiviert, so schlägt emelFM2 einen neuen Name für das zu erstellende Verzeichnis basierend auf das zuletzt erstellte vor.

source: show last directory name
de: Letztes Verzeichnis anzeigen

source: This causes the name of the last-created directory to be shown in the entry field, after opening the dialog or when creating another directory
de: Wenn aktiviert, so wird der Name des zuletzt erstellten Verzeichnisses im Dialogfenster angezeigt.

source: replicate changes
de: Änderungen im Dialogfenster übernehmen

source: This causes option-changes to be replicated in other mkdir dialogs. Otherwise such changes will be confined to the current dialog
de: Wenn aktiviert, werden die im Dialogfenster vorgenommenen Änderungen der Optionen generell übernommen.

source: Cannot find a button binding named %s
de: Tastenkürzel %s nicht gefunden!

source: button bindings
de: Tastenkürzel

source: Double
de: Doppelklick

source: Triple
de: Dreifachklick

source: Release
de: Loslassen

source: pointer gestures
de: Mausgesten

source: Identifier
de: Kennzeichen

source: Sequence
de: Sequenz

source: Invalid filename pattern
de: Ungültiges Muster für Dateinamen!

source: Display only the items named like:
de: Nur Dateien mit folgender Maske anzeigen:

source: name filter
de: Filter nach Name

source: example: *~,*.?
de: Beispiel: *~,*.? (mehrere Masken durch Komma trennen)

source: Invert
de: Invertieren

source: Show files that DO NOT match the given mask
de: Objekte anzeigen, die NICHT der Maske entsprechen

source: Case sensitive
de: Groß-/Kleinbuchstaben unterscheiden

source: Cannot create trash directory %s
de: Das Verzeichnis für den Papierkorb '%s' konnte nicht erstellt werden.

source: Configuration data re-loaded
de: Konfiguration wurde neu geladen.

source: # This is the %s configuration data file. # It will be overwritten each time the program is run! # If you're inclined to edit the file between program sessions, note this: # for tree options, you have to use \| to escape | and you have to use \< to escape <, # if that is the first non-space character on a line.
de: # Das ist die Konfigurationsdatei von %s. # Sie wird immer beim Beenden des Programmes überschrieben!
