Repository: chriskmanx/qmole
Catalog: QMOLEDEV/emelfm2-0.9.1/po/*.po
Languages: de

source: Cannot write config file %s - %s
de: Fehler beim Schreiben der Konfigurationsdatei %s - %s!

source: aliases
de: Kurzbefehle

source: bookmarks
de: Lesezeichen

source: colors
de: Farben

source: columns
de: Spalten

source: command toolbar
de: Kommandoleiste

source: command line
de: Befehlszeile

source: confirmation
de: Bestätigungen

source: context menu
de: Kontextmenü

source: custom menus
de: Eigenes Menü

source: dialogs
de: Dialogfenster

source: directory lines
de: Verzeichnisbox

source: extensions
de: Dateierweiterungen

source: file actions
de: Datei-Aktionen

source: filetypes
de: Dateitypen

source: fonts
de: Schriften

source: general
de: emelFM2

source: interface
de: Oberfläche

source: item types
de: Objekttypen

source: main
de: Hauptfenster

source: make directory
de: Verzeichnis(se) erstellen

source: miscellaneous
de: Allgemeines

source: options
de: Optionen

source: pane 1
de: Fenster 1

source: pane1 toolbar
de: Fensterleiste 1

source: pane 2
de: Fenster 2

source: pane2 toolbar
de: Fensterleiste 2

source: pointer buttons
de: Maustasten

source: startup
de: Start

source: style
de: Stil

source: tab completion
de: Automatische Vervollständigung (Tabulator)

source: task toolbar
de: Werkzeugleiste

source: strftime() format provided below
de: Eigener Formatierungsstring (nä. Zeile)

source: show all options in config dialogs
de: Alle Optionen in den Konfigurationsdialogen zeigen.

source: reload config on external change
de: Konfiguration erneut laden bei externer Änderung

source: This enables automatic reloading of the configuration data for this program, if that data is changed by another program instance
de: Wenn aktiviert, erfolgt ein automatisches Laden der Konfigurationseinstellungen von emelFM2, wenn diese durch eine andere Programm-Instanz verändert wurde.

source: document containing usage advice
de: Dokument, welches Hinweise zur Benutzung enthält

source: This document is opened from the help dialog usage page
de: Dieses Dokument wird bei der generellen Hilfe von emelFM2 angezeigt.

source: document containing configuration advice
de: Dokument, welches Hinweise zur Konfiguration enthält

source: This document is opened from the help dialog configuration page
de: Dieses Dokument wird bei der Konfiguration von emelFM2 angezeigt.

source: warn about running processes when shutting down
de: Vor dem Beenden warnen, wenn noch Kindprozesse laufen

source: This enables a reminder about incomplete commands and actions
de: Wenn aktiviert, wird vor dem Beenden von emelFM2 eine Warnung über nicht abgeschlossene Befehle und Aktionen ausgegeben.

source: running commands survive shutdown
de: Laufende Aktionen beim Beenden von emelFM2 nicht abbrechen

source: If activated, commands that are still running will not be terminated at end of emelFM2 session
de: Wenn aktiviert, werden laufende Aktionen beim Beenden von emelFM2 nicht abgebrochen.

source: opacity
de: Transparenz

source: Window translucence, 30 (faint) to 100 (opaque)
de: Fenstertransparenz, 30 (durchsichtig) bis 100 (undurchsichtig)

source: 'go up' on middle-button click
de: Mit der mittleren Maustaste eine Verzeichnisebene zurück springen

source: This is a faster alternative to double clicking '..' or clicking the 'go up' button
de: Das ist eine etwas schnellere Alternative, um eine Verzeichnisebene höher zu springen.

source: match windows (TM) right-click behaviour
de: Auswahl auch mit der rechten Maustaste

source: If activated, clicking the right mouse button will also select the row where the mouse cursor is
de: Wenn aktiviert, so wird das an der Mauszeigerposition befindliche Objekt beim Klick auf die rechte Maustaste ausgewählt.

source: advanced windows (TM) right-click behaviour
de: Aktuelle Auswahl beim rechten Mausklick auf einen freien Bereich nicht löschen

source: If activated, clicking on a free area will not clear the current selection
de: Wenn aktiviert, so wird beim Klicken mit der rechten Maustaste auf einen freien Bereich im Fenster die aktuelle Auswahl nicht entfernt.

source: menu popup delay (ms)
de: Verzögerung vor dem Aufklappen eines Menüs (ms)

source: The delay (in milliseconds) after the mouse pointer arrives at a menu item, before any submenu will pop up
de: Dieser Wert entspricht der Verzögerung, bevor ein Untermenü automatisch geöffnet wird, wenn der Mauszeiger darauf zeigt.

source: menu popdown delay (ms)
de: Verzögerung vor dem Zuklappen eines Menüs (ms)

source: The delay (in milliseconds) after the mouse pointer leaves a menu item, before popping down an activated submenu
de: Dieser Wert entspricht der Verzögerung, bevor ein Untermenü automatisch geschlossen wird, wenn der Mauszeiger es verlässt.

source: bottom-left
de: unten und links

source: bottom-right
de: unten und rechts

source: top-left
de: oben und links

source: top-right
de: oben und rechts

source: scrollbar position
de: Bildlaufleisten-Position

source: The default (bottom-right) should be ok for most users
de: Hier stellen Sie die Position der horizontalen und vertikalen Bildlaüfleisten ein. (Standard: unten und rechts)

source: use icons directory
de: Eigenes Icon-Verzeichnis benutzen

source: If activated, icon files in the directory shown below will be used for toolbars etc
de: Wenn aktiviert, so werden die Icons im nachstehenden Verzeichnis verwendet.

source: icons directory
de: Icon-Verzeichnis:

source: The directory from which icon files will be retrieved
de: Hier wird das Verzeichnis mit den eigenen Icons eingetragen.

source: theme
de: GTK-Thema

source: show icons in dialog buttons
de: Icons in den Dialog-Buttons zeigen

source: Show an icon as well as a label
de: Wenn aktiviert, werden Icons in den Dialogfenstern angezeigt.

source: show icons in menus
de: Icons in den Menüs zeigen

source: auto refresh
de: Automatisch aktualisieren

source: Automatically check for and display file-list changes
de: Wenn aktiviert, wird die Dateiliste automatisch auf Änderungen geprüft und aktualisiert.

source: focus the pane after completing a directory entry
de: Fenster nach Eingabe des Pfades aktivieren

source: After a directory-line is activated, make the pane containing it the active one
de: Wenn aktiviert, wird nach Eingabe eines Pfades in der Verzeichniszeile auch das entsprechende Fenster aktiv.

source: select first item in newly-opened directories
de: erstes Objekt im neu geöffneten Verzeichnis wählen

source: Select the first item in a file-list when a directory is first displayed in a session
de: Wenn aktiviert, wird beim Öffnen eines Verzeichnisses dessen erstes Objekt ausgewählt.

source: persistent goto history
de: Verzeichnis-Historie speichern

source: Save "goto buttons" opened-directories data for use in the next session
de: Wenn aktiviert, wird die Historie der geöffneten Verzeichnisse gesichert und ist bei der nächsten Session abrufbar.

source: use horizontal panes
de: Horizontale Fensterteilung

source: Horizontal (vertical-stacked) panes present more columns at once
de: Wenn aktiviert, so werden die Fenster untereinander angeordnet. (Das hat den Vorteil, dass mehr Spalten angezeigt werden können.)

source: bold name header
de: Überschriften in Fettschrift

source: colored headers
de: Einfärben der Spaltenköpfe

source: sensitivity
de: Nicht aktives Fenster grau

source: type of indicator for active pane
de: Art der Hervorhebung des aktiven Fensters

source: This determines how the active pane is indicated on-screen. Some GTK themes do not allow column-header re-coloring
de: Hier stellen Sie ein, wie das aktive Fenster zu erkennen ist. (Manche GTK-Themen erlauben kein Einfärben der Spaltenköpfe.)

source: single toolbar
de: Nur eine Werkzeugleiste

source: Show toolbar in active pane only
de: Werkzeugleiste nur im aktiven Fenster zeigen

source: banded background
de: Gestreiften Hintergrund verwenden

source: If activated, lines in file lists will alternate background color
de: Wenn aktiviert, so wird jede zweite Zeile im Fenster durch einen anderen Hintergrund hervorgehoben.

source: use custom font
de: Eigene Schriftart verwenden

source: If activated, the font specified below will be used, instead of the theme default
de: Wenn aktiviert, wird die nachstehende Schriftart anstatt der Schriftart des GTK-Themas benutzt.

source: custom font
de: Schriftart für Fenster

source: This is the font used for flle pane text
de: Hier wird die Schriftart zu Darstellung der Dateiliste in den Fenstern festgelegt.

source: Default: May 20 09:11
de: Grundeinstellung: May 20 09:11

source: American: 05/20/04 09:11
de: Amerikanisch: 05/20/04 09:11

source: LC_TIME locale specified
de: Länderspezifisch laut LC_TIME

source: date format
de: Datumsformat

source: This determines the format of all dates displayed in the panes
de: Hier stellen Sie die Darstellungsform des Datums in den Fenstern ein.

source: custom date/time format string:
de: Eigener Datums-/Zeitformat-String:

source: Format string interpreted by strftime() to present file date/time
de: Dieser Formatierungsstring wird von der Funktion strftime() für Dateidatum und -zeit interpretiert.

source: condensed
de: verkürzt

source: exact
de: exakt

source: size format
de: Format der Größenangaben

source: Displayed item-sizes can be 'condensed' to show kB, MB where appropriate
de: Die Dateigröße wird bei 'verkürzt' in kB und MB angezeigt, sofern sinnvoll.

source: show parent directory entry '..' in file lists
de: Übergeordnetes Verzeichnis durch '..' in den Fenstern anzeigen

source: This slows status-line updates
de: Wenn aktiviert, wird das übergeordnete Verzeichnis durch '..' dargestellt.

source: directories first
de: Verzeichnisse zuerst

source: This places directories ahead of other items in file lists
de: Wenn aktiviert, werden Verzeichnisse vor allen anderen Objekten in der Dateiliste anzeigen.

source: filename sort is case sensitive
de: Groß-/Kleinschreibung bei der Sortierung der Dateinamen berücksichtigen

source: This places all the capitalised file/directory names ahead of the others, if your LANG_C suports that
de: Wenn aktiviert, werden alle Dateien/Verzeichnisse, die mit Großbuchstaben beginnen, vor den anderen Einträgen angezeigt.

source: executable
de: Ausführbare Datei

source: Executable file names are listed in this color
de: Ausführbare Dateien werden in dieser Farbe ausgelistet.

source: directory
de: Verzeichnis

source: Directory names are listed in this color
de: Verzeichnisse werden in dieser Farbe ausgelistet.

source: symbolic link
de: Symbolischer Link

source: Symbolic link names are listed in this color
de: Symbolische Links werden in dieser Farbe ausgelistet.

source: device
de: Gerät

source: Device names are listed in this color
de: Gerätenamen werden in dieser Farbe ausgelistet.

source: Sockets are listed in this color
de: Socket-Namen werden in dieser Farbe ausgelistet.

source: custom background color
de: Eigene Hintergrund-Farbe

source: If enabled, the color specified below will be used for background
de: Wenn aktiviert, wird die nachstehende Farbe für den Hintergrund benutzt.

source: background color
de: Hintergrund-Farbe

source: Background color used instead of theme color
de: Hintergrund-Farbe anstatt Themen-Farbe verwenden

source: active pane header color
de: Farbe des aktiven Fensters

source: This color is used for the background of column headers in the active pane
de: Der Hintergrund der Spaltenköpfe des aktiven Fensters wird in dieser Farbe dargestellt.

source: highlight color
de: Hintergrundfarbe markierter Objekte

source: This color is used for the background of highlighed item-names and other text
de: Der Hintergrund markierter Objekte wird in dieser Farbe dargestellt.

source: icon above label
de: Icon über Name

source: icon beside label
de: Icon neben Name

source: icon only
de: Nur Icon

source: label only
de: Nur Name

source: '%s' uses the Gtk default, '%s' leaves most space for other things
de: '%s' benutzt die GTK-Einstellung, '%s' nimmt am wenigsten Platz für die anderen Bereiche weg.

source: toolbars button style
de: Stil der Werkzeug-Buttons

source: dnd
de: Drag & Drop

source: menu
de: Menü

source: toolbar large
de: Werkzeugleiste (groß)

source: toolbar small
de: Werkzeugleiste (klein)

source: '%s' uses the Gtk default, '%s' is smallest, '%s' is largest
de: '%s' benutzt die Einstellung des GTK-Themas, '%s' ist am kleinsten, '%s' ist am größten.

source: toolbars icon size
de: Größe der Werkzeug-Icons

source: Press key
de: Drücke Taste

source: Changing button %s may block normal operation
de: Das Ändern von Button %s könnte die normale Funktion blockieren!

source: That combination is assigned to '%s'
de: Diese Kombination ist zugeordnet zu '%s'

source: Press button
de: Drücke Button

source: %s is assigned to '%s'
de: %s ist zugeordnet zu '%s'

source: select icon for %s
de: Wähle Icon für %s

source: Are you sure that you want to delete this row and <b>%d</b> other related %s ?
de: Wirklich diese Zeile und <b>%d</b> %s löschen?

source: action
de: Aktion

source: Are you sure that you want to delete this row and <b>%d</b> %s?
de: Wirklich diese Zeile und <b>%d</b> %s löschen?

source: confirm row delete
de: Bestätigung

source: Remove the selected row
de: Entfernt die aktuelle Zeile.

source: _Select
de: Plugins _wählen

source: Select one or more plugins to be added
de: Ein oder mehrere Plugin(s) zum Laden wählen

source: _Child
de: _Unterpunkt

source: Add a child row to the currently selected one
de: Fügt einen neuen Unterpunkt zur aktuellen Zeile hinzu.

source: Add a row after the currently selected row in the tree
de: Fügt eine neue Zeile nach der aktuellen Zeile hinzu.

source: Tra_nslate
de: Über_setzen

source: Re_plicate
de: _Replizieren

source: Import data of the other toolbar
de: Übernimmt die Leisteneinträge des anderen Fensters

source: Co_lor
de: _Farbe

source: Show color-selection dialog
de: Klicken Sie hier, um den Farbauswahl-Dialog zu öffnen.

source: Get help on this option
de: Zeigt eine kurze Hilfe zu dieser Einstellung an.

source: Cut selected row and any descendant(s)
de: Schneidet die aktuelle Zeile und eventuelle Unterpunkte aus und kopiert sie in die Zwischenablage.

source: Copy selected row and any descendant(s)
de: Kopiert die aktuelle Zeile und eventuelle Unterpunkte in die Zwischenablage.

source: Expand all rows on this page
de: Ausklappen aller Unterpunkte

source: Collapse all rows on this page
de: Einklappen aller Unterpunkte

source: Add c_hild
de: Neuer _Unterpunkt

source: Add a child to the selected row
de: Erzeugt einen Unterpunkt zur aktuellen Zeile

source: _Load all
de: A_lle laden

source: Mark all listed plugins to be loaded
de: Alle Plugins zum Laden wählen

source: Load _none
de: _Keine laden

source: Mark all listed plugins to not be loaded
de: Keine Plugins zum Laden wählen

source: _Menu all
de: Alle im Menü _zeigen

source: Show all listed plugins in menu
de: Zeigt alle Plugins im Menü an

source: M_enu none
de: Alle im Menü _verstecken

source: Hide all listed plugins from menu
de: Alle Plugins im Menü verstecken

source: Cannot find any output from process %s
de: Keine Meldungen des Prozesses %s gefunden!

source: Do not show the output pane
de: Ausgabebereich verstecken

source: _Toggle full
de: _Ausgabe maxi-/minimieren

source: Toggle output pane size to/from the full window size
de: Umschalten des Ausgabebereiches auf maximale und minimale Größe

source: _New tab
de: Tab _hinzufügen

source: Add another tab for the output pane
de: Weiteren Tab für den Ausgabebereich hinzufügen

source: _Remove tab
de: Tab _entfernen

source: Close this this tab
de: Diesen Tab schließen

source: _Attach
de: _Anwenden

source: Move this tab back to output pane
de: Tab zurück zum Ausgabebereich verschieben

source: C_lear
de: _Löschen

source: Clear this tab
de: Entfernt den Inhalt dieses Tabs

source: Copy selected text
de: Kopiert den ausgewählten Text in die Zwischenablage

source: Edit the tab contents
de: Bearbeitet den Inhalt dieses Tabs

source: Co_mmand output
de: Kindprozess-_Meldungen

source: Show output from a completed command
de: Zeige die Ausgabe eines beendeten Kindprozesses

source: _Settings
de: _Einstellungen

source: _Other
de: _Andere

source: Open the configuration dialog at the output options page
de: Öffnet die Konfigurationsseite des Ausgabebereiches

source: output tabs
de: Tabs des Ausgabebereiches

source: -- end-of-output --
de: -- Ende-der-Ausgabe --

source: show output pane when a new message appears
de: Ausgabebereich bei einer neuen Nachricht anzeigen

source: This will ensure you don't miss any messages
de: Wenn aktiviert, wird der Ausgabebereich bei einer neuen Nachricht geöffnet. Damit können Sie keine Nachricht verpassen.

source: show output pane if the command line is focused
de: Ausgabebereich beim Aktivieren der Befehlszeile zeigen

source: This causes the output pane to be opened when you are about enter a command
de: Wenn aktiviert, wird der Ausgabebereich bei Eingabe eines Befehles geöffnet.

source: hide output pane if the command line is unfocused
de: Ausgabebereich beim Verlassen der Befehlszeile verbergen

source: This causes the output pane to be closed when you move focus away from the command line
de: Wenn aktiviert, wird der Ausgabebereich bei Verlassen der Befehlszeile geschlossen.

source: show commands
de: Befehle anzeigen

source: This echoes the commands that are run and their exit value
de: Wenn aktiviert, werden sowohl die Befehle als auch deren Rückgabewerte im Ausgabebereich angezeigt.

source: scroll to new output
de: Springe automatisch zu neuen Nachrichten

source: This will automatically scroll the output pane content, to show new message(s)
de: Wenn aktiviert, wird im Ausgabebereich automatisch zur neuesten Nachricht gesprungen.

source: only scroll when really following
de: Springe nicht zu neuen Nachrichten, wenn manuell eingriffen wird

source: This stops automatic pane scrolling to new output if you've manually scrolled away
de: Wenn aktiviert, wird im Ausgabebereich nicht mehr automatisch zur neuesten Nachricht gesprungen, sobald Sie manuell darin blättern.

source: only scroll when new output is at the end
de: Springe nur zu neuen Nachrichten, wenn diese am Ende des Ausgabebereiches sind

source: This stops pane scrolling if a different process has displayed text after the current insert position
de: Wenn aktiviert, wird im Ausgabebereich nicht mehr automatisch zur neuesten Nachricht gesprungen, sobald ein anderer Prozess danach eine Nachricht einfügt.

source: auto-selection boundary characters
de: Begrenzungszeichen für die automatische Textauswahl:

source: Character(s), usually punctuation, any of which will set a boundary for auto-selected text
de: Textbegrenzungszeichen (meist Satzzeichen), welche als Begrenzung für die automatische Textwahl verwendet werden.

source: everywhere
de: überall

source: words
de: Wort

source: line wrap mode
de: Zeilenumbruch

source: If mode is 'none', a horizontal scrollbar will be available. Mode 'words' will only break the line between words
de: Wenn 'ohne' eingestellt ist, so wird eine horizontale Laufleiste eingeblendet. Wenn 'Wort' eingestellt ist, so erfolgt nur zwischen Wörtern ein Umbruch. Wenn 'überall' eingestellt ist, so erfolgt auch mitten im Wort ein Umbruch.

source: left margin (pixels)
de: Linker Rand (Pixel)

source: This is the left margin between the output-pane edge and the text in it
de: Hier stellen Sie die Spanne zwischen dem linken Rand des Ausgabebereiches und dem Text darin ein.

source: right margin (pixels)
de: Rechter Rand (Pixel)

source: This is the right margin between the output-pane edge and the text in it
de: Hier stellen Sie die Spanne zwischen dem rechten Rand des Ausgabebereiches und dem Text darin ein.

source: custom output font
de: Schriftart des Ausgabebereiches

source: This is the font used for text in the output pane
de: Hier wird die Schriftart zu Darstellung im Ausgabebereich festgelegt.

source: positive color
de: Positive Mitteilungen

source: This color is used for messages about successful operations or other 'positive events'
de: Mitteilungen erfolgreicher Operationen oder anderer positiven Ereignisse werden in dieser Farbe dargestellt.

source: negative color
de: Negative Mitteilungen

source: This color is used for errors, warnings and other messages that should grab attention
de: Fehler, Warnungen und andere wichtige Nachrichten werden in dieser Frabe dargestellt.

source: commands color
de: Kommandos/Befehle

source: This color is used for echoing issued commands
de: Diese Farbe wird zur Ausgabe eingegebener Kommandos/Befehle verwendet.

source: unimportant color
de: Unwichtige Mitteilungen

source: This color is used for messages of minor importance or other miscellaneous events
de: Mitteilungen von geringer Bedeutung und mancher Ereignisse werden in dieser Farbe dargestellt.

source: ownership
de: Eigentum

source: Directory name
de: Verzeichnisname

source: User
de: Eigentümer

source: _Recurse
de: _rekursiv (Unterverzeichnisse einschließen)

source: No trash directory is available
de: Papierkorb-Verzeichnis nicht vorhanden.

source: _Edit places
de: _Orte bearbeiten...

source: both
de: beide

source: At startup, show a specific directory in this pane
de: Beim Start ein bestimmtes Verzeichnis in diesem Fester zeigen

source: This causes the directory named below, instead of the last-opened directory, to be shown at session start
de: Wenn aktiviert, wird beim Start von emelFM2 ein bestimmtes Verzeichnis anstatt des zuletzt geöffneten angezeigt.

source: pane %d startup directory:
de: Fenster %d Start-Verzeichnis:

source: This is the directory to show in this pane, at session start
de: Dieses Verzeichnis wird beim Starten von emelFM2 im Fenster angezeigt.

source: this pane is like pane 2
de: Dieses Fenster wie Fenster 2

source: This makes pane %d options (other than toolbar placement and content) apply to pane %d
de: Wenn aktiviert, werden die Einstellungen des %d. Fensters auch vom %d. Fenster übernommen.

source: this pane is like pane 1
de: Dieses Fenster wie Fenster 1

source: show %s column
de: %s anzeigen

source: This causes the the named column to be displayed in pane %d (duh ...)
de: Wenn aktiviert, wird die genannte Spalte in Fenster %d angezeigt.

source: Enter password:
de: Passwort eingeben:

source: Confirm password:
de: Passwort bestätigen:

source: Entered passwords are different
de: Die eingegebenen Passwörter sind unterschiedlich!

source: currently
de: Momentan eingestellt:

source: Read
de: Lesen

source: Write
de: Schreiben

source: Exec
de: Ausführen

source: Special
de: Spezial

source: Set UID
de: Set User ID

source: Set GID
de: Set Group ID

source: Other
de: Andere

source: Sticky
de: Sticky-Bit

source: _Set
de: _Setzen

source: R_ecurse:
de: _Rekursiv

source: If activated, changes will be applied to selected items and also their descendents, if such items match your choice of "directories" and/or "others" (anything not a directory)
de: Wenn aktiviert, werden die Änderungen auch in den darunter liegenden Verzeichnissen vorgenommen (Verzeichnisse und/oder andere Objekte, je nach Wahl)

source: d_irectories
de: _Verzeichnisse

source: o_thers
de: _Andere

source: Cannot unload plugin
de: Fehler beim Entfernen (aus dem Speicher) des Plugins!

source: Loaded
de: Laden

source: Location
de: Ort

source: Add page _header
de: _Kopfzeile hinzufügen

source: _Wrap text
de: _Zeilenumbruch

source: _Double-space lines
de: _Doppelter Zeilenabstand

source: _Invert colours
de: _Farben invertieren

source: Tab size
de: Tabulatorweite

source: spaces
de: Leerzeichen

source: Preferences
de: Einstellungen

source: Choose icons directory
de: Icon-Verzeichnis auswählen

source: _other
de: _Andere

source: _stock
de: _Vorrat

source: Remove the current icon
de: Zugewiesenes Icon entfernen
