Repository: chriskmanx/qmole
Catalog: QMOLEDEV/emelfm2-0.9.1/po/*.po
Languages: de

source: is
de: so ist

source: is like
de: so ähnlich ist

source: matches this regex
de: dem regulären Ausdruck entspricht

source: ignore case
de: Groß-/Kleinschreibung ignorieren

source: size
de: Größe

source: and whose size is:
de: und deren Größe folgendermaßen ist...

source: less than:
de: kleiner als

source: equal to:
de: gleich

source: more than
de: größer als

source: and whose mimetype is like this:
de: und deren Mime-Typ wie folgt ist:

source: save
de: Gesichert

source: and which were most-recently saved:
de: und die gesichert wurden...

source: before:
de: vor dem

source: on/at:
de: am

source: after:
de: nach dem

source: during the preceding:
de: seit den vergangenen

source: access
de: Zugriff

source: and which were most-recently opened or executed:
de: und die gelesen oder ausgeführt wurden...

source: property
de: Eigenschaft

source: and which had any property (inode) change:
de: und deren Eigenschaften (Inode) geändert wurden...

source: after
de: nach dem

source: permission
de: Recht

source: and whose permissions:
de: und deren Zugriffsrechte...

source: are
de: sind

source: include
de: schließen ein

source: exclude
de: schließen aus

source: owner read
de: Lesen-Eigentümer

source: group read
de: Lesen-Gruppe

source: anyone read
de: Lesen-Andere

source: owner write
de: Schreiben-Eigentümer

source: group write
de: Schreiben-Gruppe

source: anyone write
de: Schreiben-Andere

source: owner execute
de: Ausführen-Eigentümer

source: group execute
de: Ausführen-Gruppe

source: anyone execute
de: Ausführen-Andere

source: setuid
de: Set User ID

source: setgid
de: Set Group ID

source: sticky
de: Sticky-Bit

source: type
de: Typ

source: and which:
de: und welche

source: are not
de: sind nicht

source: regular
de: Reguläre Datei

source: and with:
de: und mit:

source: any user id
de: jeder Benutzer-ID

source: specific user id
de: spezieller Benutzer-ID

source: current user's uid
de: aktueller Benutzer-ID

source: this user id
de: dieser Benutzer-ID

source: unregistered user
de: nicht registrierter Benutzer

source: any group id
de: jeder Gruppen-ID

source: specific group id
de: spezieller Gruppen-ID

source: current user's gid
de: aktueller Gruppen-ID

source: this group id
de: dieser Gruppen-ID

source: unregistered group
de: nicht registrierte Gruppe

source: content
de: Inhalt

source: Using grep, find files with content that:
de: Verwende grep, finde Dateien deren Inhalt:

source: and with content that:
de: und deren Inhalt:

source: Using
de: Verwende

source: find files with content that is:
de: Finde Dateien, deren Inhalt:

source: Day
de: Tag

source: Month
de: Monat

source: Year
de: Jahr

source: Hour
de: Stunde

source: Get advice on search options on displayed tab
de: Hilfe zum Suchen (wird im Ausgabebereich angezeigt)

source: Clear all search parameters
de: Löscht alle Suchparameter

source: Stop the current search
de: Suchvorgang anhalten

source: Begin searching
de: Suche starten (Ergebnisse im Ausgabebereich)

source: detfind
de: Suchen

source: Find and list items, using detailed criteria
de: Dateien nach den verschiedensten Kriterien suchen.

source: repeat action
de: Befehl für Auswahl

source: Action to run for each selected item:
de: Befehl, der mit jedem einzelnen ausge- wählten Objekt ausgeführt werden soll:

source: foreach
de: Befehl_für_Auswahl

source: For _each..
de: _Befehl für Auswahl...

source: Execute an entered command on each selected item separately
de: Führt einen einzugegebenden Befehl mit jedem ausgewählte Objekt einzeln aus

source: Select items:
de: Ausgewählte Objekte:

source: selection filter
de: Mehrfachauswahl-Filter

source: Named like
de: Maske(n) für Name:

source: _Invert
de: _Invertieren

source: Select items that DO NOT match the given mask
de: Objekte auswählen, die NICHT der Maske entsprechen.

source: Case _sensitive
de: Groß-/Kleinbuchstaben unterscheiden

source: glob
de: Mehrfach_Filter

source: _Glob..
de: _Mehrfachauswahl...

source: Select items matching a specified pattern
de: Wählt Dateien entsprechend einer Maske aus

source: moving %s to %s this is item %s of %s
de: Verschiebe %s nach %s Objekt %s von %s

source: Cannot delete anything from %s
de: Löschen von '%s' nicht möglich!

source: moving
de: Verschieben

source: mvbar
de: Verschieben_mit_Anzeige

source: Move selected items, with displayed progress details
de: Die ausgewählten Objekte werden mit Fortschrittsanzeige in das andere Fenster verschoben.

source: Filename:
de: Dateiname:

source: archive creation
de: Archiv erzeugen

source: pack
de: Archiv

source: _Pack..
de: _Archiv...

source: Build an archive containing the selected items
de: Erzeugt ein Archiv mit den/dem ausgewählten Objekt(en).

source: No current name pattern is specified
de: Fehler beim Umbenennen: momentaner Name wurde nicht angegeben!

source: No replacement name pattern is specified
de: Fehler beim Umbenennen: neuer Name wurde nicht angegeben!

source: Replacement name pattern cannot have wildcard(s)
de: Fehler! Der Zielname darf keine Platzhalter enthalten.

source: Error in regular expression %s
de: Fehler im regulären Ausdruck %s

source: Cannot find anything which matches %s
de: Kein Objekt '%s' gefunden!

source: _Rename
de: _Umbenennen

source: Rename <b>%s</b> to <b>%s</b> (which already exists) in %s
de: Umbenennen von Objekt <b>%s</b> nach <b>%s</b> (welches bereits existiert) in %s

source: Rename <b>%s</b> to <b>%s</b> in %s
de: <b>%s</b> umbenennen nach <b>%s</b> in %s

source: Renamed %s to %s in %s
de: %s nach %s in %s umbenannt!

source: rename items
de: Objekte umbenennen

source: Search for items:
de: Objekte suchen:

source: R_ecurse subdirectories
de: _rekursiv (Unterverzeichnisse einschliessen)

source: _Selected items
de: _ausgewählte Objekte

source: Match _exact/wildcard
de: exakte Übereinstimmung/Platzhalter verwenden

source: Match regular e_xpression
de: _regulären Ausdruck verwenden

source: Current name is like this:
de: Momentaner Name :

source: New name is _upper case
de: Name komplett in _Großbuchstaben

source: New name is _lower case
de: Name komplett in _Kleinbuchstaben

source: _New name is like this:
de: _Neuer Name ist wie folgt:

source: Con_firm before each rename
de: vor dem Umbenennen eine _Bestätigung anfordern

source: Get advice on rename options
de: Hilfe zum Umbennen (wird im Ausgabebereich angezeigt)

source: Begin renaming
de: Startet das Umbenennen

source: renext
de: Umbenennen

source: Rename items, using wildcards or regular-expressions
de: Dateien/Verzeichnisse mit Hilfe regulärer Ausdrücke umbenennen

source: selmatchpart
de: Gleiche_Auswahl_teilweise

source: selmatch
de: Gleiche_Auswahl_genau

source: _Select same
de: _Gleiche Auswahl

source: Select items whose whole name matches a selected item in the other pane
de: Wählt Objekte im aktiven Fensters aus, deren Name genau mit denen übereinstimmt, welche im anderen Fenster markiert sind

source: Select _like
de: Markieren _wie

source: Select items whose name partially matches a selected item in the other pane
de: Wählt Objekte im aktiven Fensters aus, deren Name teilsweise mit denen übereinstimmt, welche im anderen Fenster markiert sind

source: match to first separator
de: Übereinstimmung bis zum ersten Trennzeichen

source: If enabled, name matching stops at the first instance of any specified separator, otherwise, at the last instance
de: Wenn aktiviert, erfolgt die Auswertung der Namensübereinstimmung bis zum ersten Vorkommen eines der Trennzeichen ansonsten bis zum letzten Vorkommen

source: separator character(s)
de: Trennzeichen

source: String comprising all chars considered to be a 'separator'
de: Alle hier angegebenen Zeichen werden als Trennzeichen betrachtet

source: Failed to remove %s
de: Fehler beim Entfernen von %s

source: shred
de: sicheres Löschen

source: _Shred
de: Sicheres _Löschen

source: Thoroughly delete selected items
de: Ausgewählte Objekte gründlich entfernen

source: tag
de: Merken

source: _Tag
de: _Merken

source: Log the items selected in active pane
de: Markierte Objekte des aktiven Fensters merken

source: retag
de: Markieren

source: _Retag
de: Mar_kieren

source: Re-select any items logged in active pane
de: Gemerkte Objekte des aktiven Fensters markieren

source: Cannot change times of %s
de: Fehler! Kann Zeiten von '%s' nicht ändern!

source: Cannot get current times of %s
de: Fehler beim Erhalten aktueller Zeiten von %s!

source: Cannot interpret date-time %s
de: Fehler beim Interpretieren der Zeitangabe %s

source: Changing 'ctime' requires temporary changes to the system clock. That is normally unwise, as typically, other things rely on system time.
de: Das Ändern der "Geändert"-Zeit erfordert eine temporäre Änderung der Systemzeit. Das ist normalerweise unklug bezogen auf andere Prozesse, die der Systemzeit vertrauen! Trotzdem ausführen?

source: times
de: Zeit-Eigenschaften

source: Current values
de: Aktuelle Werte

source: New date
de: Neues Datum

source: New time
de: Neue Zeit

source: Content Modified
de: Verändert

source: Inode Changed
de: Geändert

source: You do not have authority to change time(s) for %s
de: Sie sind nicht berechtigt zum Ändern der Zeit-Eigenschaft(en) für %s

source: timeset
de: Zeiten_ändern

source: Change _times..
de: _Zeiten ändern...

source: Change any of the time properties of selected items
de: Ändert die Zeit-Eigenschaften eines oder mehrerer Objekte

source: What do you want to do with the unpacked items ?
de: Was soll mit den entpackten Objekten geschehen?

source: Re_pack
de: _Archiv erneut erzeugen

source: _Retain
de: _Beibehalten

source: Selected item is not a supported archive
de: Das ausgewählte Objekt ist kein unterstütztes Archiv!

source: Recursive unpack is not supported
de: Rekursives Entpacken wird nicht unterstützt!

source: unpack_with_plugin
de: Entpacken_mit_Plugin

source: Unpack archive file into a temporary directory
de: Archiv in ein temporäres Verzeichnis entpacken.

source: Configuration arrangements for this version %s of %s are considerably different from those of old versions. To reliably ensure access to the program's current features, it is best to start with fresh settings. If you proceed, the superseded configuration files in %s will have '.save' appended to their names. Feel free to delete them.
de: Die Konfigurationseinstellungen für diese Version (%s) von %s sind bedeutend anders als die der alten Versionen. Um abzusichern, dass alle Programmteile richtig funktionieren, ist es besser mit einer neuen Konfiguration zu starten. Soll mit einer neuen Konfiguration gestartet werden? (Die alten Konfigurationsdateien in %s werden in '*.save' umbenannt und können danach gelöscht werden)

source: Several default configuration settings of this version %s of %s are different from those of recent versions (see changelog). If you click OK, those settings will be updated where possible. Or else you can Cancel, and later, via the configuration dialog, manuallychange individual settings, or change all settings to current defaults.
de: Verschiedene Standard-Konfigurationseinstellungen dieser Version (%s) von %s weichen von früheren Versionen ab (siehe CHANGELOG). Sollen diese Einstellungen jetzt aktualisiert werden (Änderungen sind jederzeit im Konfigurationsdialog möglich!)?

source: update information
de: Information aktualisieren

source: _Partial
de: _Teilweise

source: _Whole
de: _Komplett

source: Open the first selected item with the %s text-file viewer
de: Öffnet das erste ausgewählte Objekt mit dem internen Betrachter von %s.

source: view_with_plugin
de: Betrachten_mit_Plugin
