Repository: chriskmanx/qmole
Catalog: QMOLEDEV/emelfm2-0.9.1/po/*.po
Languages: de

source: help
de: Hilfe

source: about
de: Über

source: <b>An "orthodox" file manager for GTK2+</b> Copyright &#169; %s This program is licensed under the terms of version 3 of the General Public License This binary was compiled on %s using %s and GTK+%d.%d.%d
de: <b>Ein GTK2+ Dateimanager</b> Copyright &#169; %s This program is licensed under the terms of version 3 of the General Public License This binary was compiled on %s using %s and GTK+%d.%d.%d

source: The file <b>%s</b> gives details.
de: Die Datei <b>%s</b> enthält Details.

source: contributors
de: Entwickler

source: This program is based on emelFM, developed by Michael Clark. Contributions have been made by many friends.
de: Dieses Progamm basiert auf emelFM, entwickelt von Michael Clark. Viele Freunde trugen der Entwicklung bei.

source: usage
de: Benutzung

source: commands
de: Befehle

source: actions
de: Aktionen

source: Read the file
de: Datei lesen

source: _View
de: _Anzeigen

source: bookmark
de: Lesezeichen

source: command
de: Befehl

source: children
de: Unterpunkte

source: configure
de: Konfigurieren

source: dirline
de: Verzeichnisbox

source: file
de: Datei

source: filelist
de: Dateiliste

source: history
de: Chronik

source: output
de: Ausgabebereich

source: pane1
de: Fenster1

source: pane2
de: Fenster2

source: pane
de: Fenster

source: panes
de: Fenster

source: pending
de: Warteschlange

source: toggle
de: umschalten

source: trash
de: Papierkorb

source: separator
de: Trennlinie

source: <custom command>
de: <Eigener Befehl>

source: <separator>
de: <Trennlinie>

source: <submenu>
de: <Untermenü>

source: <actions>
de: <Aktionen>

source: <bookmarks>
de: <Lesezeichen>

source: <filters>
de: <Filter>

source: <handlers>
de: <Handler>

source: <line>
de: <Eingabefeld>

source: <menu>
de: <Menü>

source: activate
de: aktivieren

source: add
de: Hinzufügen

source: add_history
de: zur_Chronik_hinzufügen

source: adjust_ratio
de: Bereichsgröße

source: application
de: Anwendung

source: change
de: Ändern

source: clear
de: Bereinigen

source: clear_history
de: Chronik_löschen

source: complete
de: komplettieren

source: copy
de: Kopieren

source: copy_as
de: Kopieren_nach

source: copy_merge
de: Kopieren_mit_mischen

source: copy_with_time
de: Kopieren_mit_Zeit

source: default
de: Standard

source: del_history
de: aus_Chronik_entfernen

source: delete
de: Löschen

source: edit
de: Bearbeiten

source: edit_again
de: Bearbeiten_fortsetzen

source: filetype
de: Dateityp

source: find
de: Suchen

source: focus
de: Fokus

source: fullscreen
de: Vollbild

source: go_back
de: zurückgehen

source: go_forward
de: vorwärtsgehen

source: go_up
de: hoch

source: goto_bottom
de: ans_Ende_gehen

source: goto_top
de: an_den_Anfang_gehen

source: insert_selection
de: Auswahl_einfügen

source: invert_selection
de: Auswahl_invertieren

source: list
de: Auflistung

source: mirror
de: Fenster_spiegeln

source: mkdir
de: Verzeichnis_erstellen

source: mountpoints
de: Mountpunkte

source: move
de: Verschieben

source: move_as
de: Verschieben_nach

source: open
de: Öffnen

source: open_in_other
de: Öffnen_im_anderen

source: open_with
de: Öffnen_mit

source: owners
de: Besitzer

source: page_down
de: Seite_runter

source: page_up
de: Seite_hoch

source: permissions
de: Zugriffsrechte

source: print
de: Druck

source: quit
de: Beenden

source: refresh
de: Aktualisieren

source: refreshresume
de: Aktualisierung_ein

source: refreshsuspend
de: Aktualisierung_aus

source: rename
de: Umbenennen

source: scroll_down
de: runterblättern

source: scroll_up
de: hochblättern

source: search
de: Suchen

source: select_type
de: Typauswahl

source: send
de: zu_Kindprozess_senden

source: set
de: setzen

source: show
de: anzeigen

source: show_hidden
de: versteckte_anzeigen

source: show_menu
de: Menü_zeigen

source: sortaccesssed
de: sortieren_nach_Zugriff

source: sortchanged
de: sortieren_nach_geändert

source: sortext
de: nach_Erweiterung_sortieren

source: sortgroup
de: sortieren_nach_Gruppe

source: sortmodified
de: sortieren_nach_verändert

source: sortname
de: sortieren_nach_Dateiname

source: sortpermission
de: sortieren_nach_Rechte

source: sortsize
de: sortieren_nach_Größe

source: sortuser
de: sortieren_nach_Eigentümer

source: switch
de: umschalten

source: symlink
de: Symbolischer_Link

source: symlink_as
de: Link_als

source: sync
de: spiegeln

source: toggle_direction
de: Ausrichtung_ändern

source: toggle_focus
de: Fokus_umschalten

source: toggle_select_all
de: alles_auswählen

source: toggle_selected
de: Objekt_auswählen

source: tree
de: Verzeichnisbaum

source: unpack
de: Entpacken

source: untrash
de: wiederherstellen

source: view
de: Betrachten

source: view_again
de: Betrachten_fortsetzen

source: view_at
de: Betrachten_an_Stelle

source: child
de: Unterpunkt

source: ctrl
de: eigene_Befehle

source: dirs
de: nur_Verzeichnisse

source: escape
de: nicht_gequotet

source: expand
de: aufklappen

source: files
de: Dateien

source: off
de: aus

source: on
de: an

source: quote
de: gequotet

source: shift
de: Kontext

source: top
de: am_Anfang

source: <spacemenu>
de: <leeres_Menü>

source: namespace
de: Namensraum

source: unpack_in_other
de: Entpacken_im_anderen

source: key
de: Taste

source: button
de: Buttons

source: Done. Press enter
de: Abgeschlossen. Drücke ENTER.

source: keys
de: Tasten

source: e2ps
de: Prozess

source: Match
de: Ausdruck

source: Stop
de: Halt

source: Replace
de: Ersetzen durch

source: Are you sure that you want to delete the bookmark
de: Lesezeichen wirklich löschen

source: and
de: und

source: confirm bookmark delete
de: Bestätigung

source: _Add child
de: Neuer _Unterpunkt

source: Bookmark the current directory a child of the selected item
de: Fügt ein Lesezeichen des aktuellen Verzeichnisses als Unterpunkt zum markierten Lesezeichen hinzu.

source: _Add after
de: _Hinzufügen (danach)

source: Bookmark the current directory after the selected item
de: Fügt ein Lesezeichen des aktuellen Verzeichnisses nach dem markierten Lesezeichen ein.

source: _Delete
de: _Löschen

source: Delete the selected bookmark, and its children if any
de: Löscht das markierte Lesezeichen und dessen Unterpunkte, soweit vorhanden.

source: root
de: Stammverzeichnis /

source: Your home directory
de: Ihr Home-Verzeichnis

source: home
de: Verzeichnis /home

source: media
de: Verzeichnis /media

source: mnt
de: Verzeichnis /mnt

source: usr
de: Verzeichnis /usr

source: usr/local
de: Verzeichnis /usr/local

source: default trash directory
de: Verzeichnis für den Papierkorb

source: Label
de: Bezeichnung

source: Tooltip
de: Schnellhilfe

source: Path
de: Pfad

source: open bookmark in other pane on middle-button click
de: Lesezeichen im anderen Fenster beim Drücken der mittleren Maustaste öffnen

source: Clicking the middle mouse button on a bookmark will open it in the other file pane
de: Wenn aktiviert, wird beim Drücken der mittleren Maustaste auf ein Lesezeichen dieses im anderen Fenster geöffnet.

source: focus file pane after opening a bookmark in it
de: Fenster, in dem das Lesezeichen göffnet wird, aktivieren

source: After opening a bookmark in the inactive file pane, that pane will become the active one
de: Wenn aktiviert, wird nach dem Öffnen des Lesezeichens im inaktiven Fenster dieses aktiviert.

source: confirm any delete of a selected bookmark
de: Löschen EINES Lesezeichens bestätigen

source: You will be asked to confirm, before deleting any bookmark
de: Wenn aktiviert, werden Sie immer vor dem Löschen eines Lesezeichens zu einer Bestätigung aufgefordert.

source: confirm any delete of multiple bookmarks
de: Löschen MEHRERER Lesezeichen bestätigen

source: You will be asked to confirm, before deleting any bookmark that has 'children'
de: Wenn aktiviert, werden Sie immer vor dem Löschen eines Lesezeichens, welches Unterpunkte enthält, zu einer Bestätigung aufgefordert.

source: _Cancel
de: Ab_brechen

source: Commi_t
de: S_peichern

source: Change all unprocessed items
de: Alle Objekte bearbeiten

source: _All
de: _Alle

source: Abandon any changes
de: Letzte Änderungen verwerfen

source: _Discard
de: Ver_werfen

source: _Refresh
de: _Aktualisieren

source: _Close
de: _Schließen

source: C_reate
de: _Erstellen

source: _Remove
de: E_ntfernen

source: _Apply
de: _Anwenden

source: _Proceed
de: Aus_führen

source: _Omit
de: _Verwerfen

source: _Keep
de: _Erhalten

source: Do not do anything
de: Keinerlei Aktionen ausführen

source: Do not change this item
de: Dieses Objekt nicht ändern

source: Do not change this
de: Hier nichts ändern

source: %sThis file stores runtime configuration data for %s. %sThe file will be overwritten each time %s is shut down.
de: %sDiese Datei speichert Laufzeit-Konfigurationsdaten für %s. %sSie wird immer beim Beenden von %s überschrieben!

source: Cannot write cache file %s - %s
de: Fehler beim Schreiben der Cache-Datei: %s - %s!

source: Usage: %s [option ...]
de: Anwendung: %s [Optionen]

source: Options:
de: Optionen:

source: set 1st pane's start directory to DIR
de: DIR=Start-Verzeichnis des 1. Fensters

source: set 2nd pane's start directory to DIR
de: DIR=Start-Verzeichnis des 2. Fensters

source: display build-time parameters
de: Build-Parameter anzeigen

source: set config directory to DIR (default: ~/.config/emelfm2)
de: DIR=Konfigurationsverzeichnis (Standard: ~/.config/emelfm2)

source: set debug level from 1 (low) to 5 (high)
de: Debug-Level einstellen (von 1=niedrig bis 5=hoch)

source: set filesystem character encoding to TYPE
de: TYPE=Zeichenkodierung des Dateisystems

source: set fallback encoding (default: ISO-8859-1)
de: Fallback-Kodierung einstellen (Standard: ISO-8859-1)

source: show this help message
de: zeigt diese Hilfe an

source: ignore encoding/locale problems (at your own risk!)
de: Kodierungs- und Lokalisationsprobleme ignorieren (Auf eigene Gefahr!)

source: maximise scope of error logging
de: maximale Fehlerprotokollierung

source: run program as daemon
de: Programm als Daemon starten

source: run program with default settings
de: Programm mit Standardeinstellungen starten

source: run command CMD at session start
de: Befehl CMD beim Programmstart ausführen

source: set one-line gui option using config-file formatted OPT
de: GUI-Option OPT entsprechend der Formatierung der Konfigurationsdatei setzen

source: set trash directory to DIR (default: ~/.local/share/Trash/files)
de: DIR=Verzeichnis des Papierkorbes (Standard: ~/.local/share/Trash/files)

source: highlight the displayed session user
de: Session-Benutzer hervorheben

source: display version and build info
de: Version und Build-Informationen anzeigen

source: display time/location info in debug messages
de: Zeit und lokale Informationen in den Debug-Nachrichten zeigen

source: same as -2 DIR, except pane 2 is focused
de: Einstellung wie -2 DIR außer, dass Fenster 2 fokusiert ist

source: %s v. %s Licensed under the GPL Copyright (C) %s Build date: %s Build platform: GTK+ %d.%d.%d %s
de: %s v. %s Lizensiert unter der GPL Copyright (C) %s Build-Datum: %s Build-Plattform: GTK+ %d.%d.%d %s

source: build parameters
de: Build-Parameter

source: Startup options must begin with "-" or "--", or be a valid file-system path
de: Fehler! Startoptionen beginnen mit "-" oder "--" oder einem gültigen Verzeichnis!

source: returned
de: meldete

source: Command '%s' - %s
de: Befehl '%s' - %s

source: Error while launching '%s'
de: Fehler beim Starten von '%s'!

source: Cannot find last child process
de: Fehler! Kann letzten Kindprozess nicht finden!

source: Cannot find child process with pid %ld
de: Fehler! Kann Kindprozess nicht finden mit der PID %ld

source: Cannot communicate to process %ld
de: Fehler bei der Kommunikation mit dem Prozess %ld

source: Failed writing to child
de: Fehler beim Senden zum Kindprozess

source: Strange error: could not run '%s'
de: Fehler beim Ausführen von '%s'!

source: The process with pid %ld is not our child
de: Der Prozess mit der PID %ld ist kein Kindprozess von emelFM2.

source: Failed writing to child: %s
de: Fehler beim Senden zum Kindprozess: %s

source: nothing is waiting
de: Die Warteschlange ist leer!

source: task
de: Anwendung

source: <selected items>
de: <ausgewählte Objekte>

source: nothing is running
de: Nichts läuft!

source: (pid) task directory
de: (pid) Anwendung Verzeichnis

source: task @ directory || result
de: Anwendung @ Verzeichnis || Ergebnis

source: OK
de: Okay

source: error
de: Fehler

source: Cannot run '%s'
de: Ausführen von '%s' nicht möglich!

source: Failed to expand macros
de: Makro konnte nicht ausgeführt werden!

source: Failed parsing command '%s' - %s
de: Fehler beim Interpretieren des Befehls '%s' - %s!

source: Cannot send "%s" to a child process
de: Senden von "%s" zu einem Kindprozess nicht möglich!

source: x terminal emulator:
de: X-Terminal-Befehl:

source: This is the external command/application that will be be run when emelFM2 is asked to open a terminal
de: Das ist der Befehl, welcher aufrufen wird, wenn emelFM2 ein Terminal öffnen soll.

source: use external file-viewer
de: Externen Datei-Betrachter verwenden

source: If activated, the command entered below will be run to view file content, instead of launching the internal viewer
de: Wenn aktiviert, wird das nachstehende Programm zum Betrachten des Dateiinhaltes anstatt des internen Betrachters verwendet.

source: viewer command:
de: Betrachter-Befehl:

source: This is a command to run an external application for viewing file content. The first selected item will be supplied as the first argument
de: Das ist der Befehl, welcher den externen Datei-Betrachter aufruft. Die erste ausgewählte Datei wird als erster Parameter übergeben.

source: use external file-editor
de: Externen Datei-Editor verwenden

source: If activated, the command entered below will be run to edit file content, instead of launching the internal editor
de: Wenn aktiviert, wird das nachstehende Programm zum Bearbeiten des Dateiinhaltes anstatt des internen Editors verwendet.

source: editor command:
de: Editor-Befehl:

source: This is a command to run an external application for editing file content. The first selected item will be supplied as the first argument
de: Das ist der Befehl, welcher den externen Datei-Editor aufruft. Die erste ausgewählte Datei wird als erster Parameter übergeben.

source: use external encoding converter
de: Externen Zeichensatz-Konverter verwenden

source: If activated, the command entered below will be run, instead of using the internal conversion functions, to convert file character encoding when needed
de: Wenn aktiviert, wird das nachstehende Programm zum Umwandeln des Zeichensatzes anstatt des internen Konverters verwendet.

source: File encoding:
de: Datei-Zeichensatz

source: converter command:
de: Konverter-Befehl:

source: A command which runs an external application to convert text encoding to UTF-8
de: Das ist der Befehl, welcher den externen Zeichensatz-Konverter aufruft, der den Text in UTF-8 umwandelt.

source: use aliases
de: Kurzbefehle verwenden

source: This is a general switch to turn on/off alias handling for commands
de: Wenn aktiviert, so wird das Verwenden von Kurzbefehlen in der Befehlszeile eingeschaltet.

source: interpret 'relative' paths
de: Relative Pfade interpretieren

source: This enables correct interpretation of paths containing '..' etc. These might be typed in, or attached to a button, say
de: Wenn aktiviert, werden Pfade, welche '..' enthalten, richtig interpretiert.

source: watch priority
de: Ausgabe-Priorität

source: The watch priority of commands influences how fast program output is read from i/o channels. A too-high priority might decrease gui responsiveness and break automatic scrolling. (note: negative values mean high priority, positive values mean low priority)
de: Die Ausgabe-Priorität beeinflusst, wie schnell Programm-Ausgaben von den I/O-Kanälen gelesen werden. Eine zu hohe Priorität kann die Reaktionsfähigkeit von emelFM2 verringern. (Anmerkung: negative Werte=hohe Priorität, positive Werte=geringe Priorität)

source: stop after timeout
de: Datei-Aktionen nach einer bestimmten Zeit abbrechen

source: If activated, each file operation will be terminated if not finished within the time-interval set below
de: Wenn aktiviert, wird jede Datei-Aktion abgebrochen, wenn sie nicht innerhalb der angegebenen Zeit vollendet wurde.

source: timeout interval
de: maximale Zeitdauer je Datei-Aktion (in Sekunden)

source: The interval (seconds) allowed to complete any file operation
de: Hier stellen Sie die Anzahl der Sekunden ein, in der eine Datei-Aktion abgeschlossen sein muss.

source: confirm any delete
de: Jedes Löschen bestätigen

source: If activated, you will be asked for confirmation before actually deleting anything
de: Wenn aktiviert, werden Sie immer vor dem Löschen zu einer Bestätigung aufgefordert.

source: confirm any overwrite
de: Jedes Überschreiben bestätigen

source: If activated, you will be asked for confirmation before actually overwriting anything
de: Wenn aktiviert, werden Sie immer vor dem Überschreiben zu einer Bestätigung aufgefordert.

source: relative symlinks
de: Symbolische Links mit relativem Pfad erzeugen

source: This gives each created symlink a relative path to its source, like '../../<otherbranch>/<file>', instead of a full path referenced to /
de: Wenn aktiviert, werden symbolische Links mit relativen Pfaden (z.B. ../../Verzeichnis/Datei) anstatt des vollen Pfades (z.B. /home/Benutzer/Verzeichnis/Datei) erzeugt.

source: all
de: Alles

source: Warning - process %s is not active
de: Warnung - Kindprozess %s ist nicht aktiv!

source: show last
de: Letzten Befehl zeigen

source: If activated, the last-entered command will be displayed, instead of an empty line
de: Wenn aktiviert, wird der letzte eingegebene Befehl angezeigt anstatt einer leeren Zeile.

source: maximum number of history entries
de: Maximale Anzahl der Chronik-Einträge

source: This is the largest number of command-line history entries that will be recorded. Set to 0 for no limit
de: Das ist die maximale Anzahl der Befehle, die in der Befehlszeilen-Chronik aufgezeichnet werden. 0 = ohne Limit

source: double entries
de: Gleiche Einträge aufzeichnen

source: This allows entries to be recorded more than once in the history list
de: Wenn NICHT aktiviert, werden gleiche Befehle NICHT mehrfach aufgezeichnet.

source: cyclic list
de: Liste zyklisch durchblättern

source: When scanning the history list, cycle from either end around to the other end, instead of stopping
de: Wenn aktiviert, wird nach Anzeige der letzten Chronikzeile die erste wieder angezeigt und umgekehrt anstatt zu stoppen.

source: show as a menu
de: Als Menü anzeigen

source: If activated, the history entries will be presented as a menu. For most Gtk+2 themes, this will not be as attractive as the list view
de: Wenn aktiviert, wird die Befehlszeilen-Chronik nicht als Liste sondern als Menü angezeigt.

source: append space after unique items
de: Leerzeichen nach eindeutigen Datei-/Verzeichnisnamen anhängen

source: This appends a 'space' character to the end of a unique successful match of a file
de: Wenn aktiviert, wird bei eindeutigen Datei- und Verzeichnisnamen bei Betätigung der Tabulatortaste ein Leerzeichen angehängt.

source: show last entry
de: Letztes Verzeichnis zeigen

source: If activated, the last-entered directory will be displayed, instead of an empty line
de: Wenn aktiviert, wird das letzte eingegebene Verzeichnis angezeigt anstatt einer leeren Zeile.

source: show pathname as a tooltip
de: Pfadname als Schnellhilfe zeigen

source: If activated, the full directory pathname will display as a tooltip. This is useful when the path is too long for the normal display
de: Wenn aktiviert, so wird der komplette Pfadname als Schnellhilfe angezeigt, wenn der Mauszeiger in der Verzeichnisbox steht. Das ist sehr nützlich, wenn der Pfadname länger als die Verzeichnisbox ist.

source: <Tab> only
de: Vervöllständigung nur mit Tabulatortaste

source: inserted
de: möglicher Pfad wird sofort vervöllständigt

source: selected
de: möglicher Pfad wird hervorgehoben

source: directory path completion
de: Automatische Pfad-Vervollständigung

source: This determines the mode of completion when keying a directory-path
de: Hier stellen Sie den Modus der automatischen Pfad-Vervöllständigung ein

source: auto update
de: Automatisch aktualisieren

source: If activated, all opened directories will be added to pane history, otherwise, manual addition is needed
de: Wenn aktiviert, werden geöffnete Verzeichnisse zur Historie hinzugefügt, andernfalls müssen die Verzeichnisse manuell hinzugefügt werden.

source: maximum number of entries
de: Maximale Anzahl der Chronik-Einträge

source: This is the largest number of directory-line history entries that will be retained
de: Das ist die maximale Anzahl der Verzeichnisse, die in der Verzeichnis-Chronik aufgezeichnet werden.

source: repeated entries
de: Wiederholende Befehle

source: Allows entries to be recorded more than once in the history list
de: Wenn aktiviert, werden gleiche Befehle mehrfach aufgezeichnet.

source: When scanning a history list, cycle from either end around to the other end, instead of stopping
de: Wenn aktiviert, wird nach Anzeige der letzten Chronikzeile die erste wieder angezeigt und umgekehrt anstatt zu stoppen.

source: If activated, the directory line history will be presented as a menu. For most for most Gtk+2 themes, this will not be as attractive as the list view
de: Wenn aktiviert, wird die Verzeichnis-Chronik nicht als Liste sondern als Menü angezeigt.

source: configuration
de: Konfiguration

source: _Expand
de: A_usklappen

source: Expand all rows
de: Ausklappen aller Unterpunkte

source: C_ollapse
de: E_inklappen

source: Collapse all rows
de: Einklappen aller Unterpunkte

source: Reverting to default configuration cannot be undone
de: Das Zurücksetzen auf die Standard-Einstellungen kann nicht rückgängig gemacht werden! Einstellungen wirklich zurücksetzen?

source: Select and continue
de: Auswählen und weiter

source: choose plugin
de: Wähle Plugin

source: Choose font: %s
de: Wähle %s

source: example:
de: Beispiel:

source: Color data are not stored there
de: Die Farben werden nicht in diesem Bereich eingestellt!

source: The current color descriptor is not valid
de: Die aktuelle Farbdefinition ist falsch.

source: Set filetype color
de: Farbe des Dateitypes bearbeiten

source: Choose color: %s
de: Wähle Farbe für '%s'

source: currently:
de: Momentan eingestellt:

source: Categories
de: Kategorien

source: Click to open a font select dialog
de: Klicken Sie hier, um den Schriften-Auswahl-Dialog zu öffnen.

source: Click to open a color selection dialog
de: Klicken Sie hier, um den Farbauswahl-Dialog zu öffnen.

source: De_fault
de: _Standard

source: Revert all options to their default settings
de: Es werden alle Optionen auf ihre Grundeinstellung zurückgesetzt!

source: _Basic
de: _Basis

source: Display only the basic configuration options
de: Es werden nur die Grundeinstellungen angezeigt.

source: Ad_vanced
de: _Erweitert

source: Display all configuration options
de: Es werden alle Konfigurationseinstellungen angezeigt.

source: Open _with..
de: Öffnen _mit...

source: _Info
de: _Eigenschaften

source: _Actions
de: _Aktionen

source: _Copy
de: _Kopieren

source: _Move
de: _Verschieben

source: _Trash
de: _Papierkorb

source: _Rename..
de: _Umbenennen...

source: Change _owners..
de: Ei_gentümer...

source: Change _permissions..
de: _Zugriffsrechte...

source: Copy as..
de: Kopieren als...

source: Move as..
de: Verschieben als...

source: Link as..
de: Link als...

source: _Edit plugins..
de: _Plugins bearbeiten...

source: _User commands
de: Eigene _Befehle

source: Enter file name:
de: Dateiname:

source: _Make new file..
de: _Neue Datei erstellen...
