<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on diciembre, 10 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima: 5. Tipos de datos y estructuras</title>

<meta name="description" content="Manual de Maxima: 5. Tipos de datos y estructuras">
<meta name="keywords" content="Manual de Maxima: 5. Tipos de datos y estructuras">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Tipos-de-datos-y-estructuras"></a>
<a name="SEC18"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_4.html#SEC17" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_4.html#SEC7" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 5. Tipos de datos y estructuras </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC19">5.1 N&uacute;meros</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC25">5.2 Cadenas de texto</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC28">5.3 Constantes</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC30">5.4 Listas</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC33">5.5 Arrays</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC36">5.6 Estructuras</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>



<hr size="6">
<a name="N_00fameros"></a>
<a name="SEC19"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC18" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC18" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.1 N&uacute;meros </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC20">5.1.1 Introducci&oacute;n a los n&uacute;meros</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC24">5.1.2 Funciones y variables para los n&uacute;meros</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>




<hr size="6">
<a name="Introducci_00f3n-a-los-n_00fameros"></a>
<a name="SEC20"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC19" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC24" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.1.1 Introducci&oacute;n a los n&uacute;meros </h3>




<a name="SEC21"></a>
<h3 class="subheading"> N&uacute;meros enteros y racionales </h3>

<p>Los c&aacute;lculos aritm&eacute;ticos con n&uacute;meros enteros y racionales son exactos.
En principio, los n&uacute;meros enteros y racionales admiten una cantidad arbitraria
de cifras, con la &uacute;nica limitaci&oacute;n que impongan las capacidades de memoria
del sistema.
</p>
<pre class="example">(%i1) 1/3+5/4+3;
                               55
(%o1)                          --
                               12
(%i2) 100!;
(%o2) 9332621544394415268169923885626670049071596826438162146859\
2963895217599993229915608941463976156518286253697920827223758251\
185210916864000000000000000000000000
(%i3) 100!/101!;
                                1
(%o3)                          ---
                               101
</pre>
<p>Funciones disponibles para los n&uacute;meros enteros y racionales:
</p>
<pre class="verbatim">   integerp       numberp       nonnegintegerp     
   oddp           evenp
   ratnump        rationalize
</pre>
<a name="SEC22"></a>
<h3 class="subheading"> N&uacute;meros decimales en coma flotante </h3>

<p>Maxima hace los c&aacute;lculos con n&uacute;meros decimales en coma flotante 
en doble precisi&oacute;n. Adem&aacute;s, Maxima puede hacer cl'culos con 
n&uacute;meros decimales grandes en coma flotante (<i>bigfloats</i>, en ingl&eacute;s),
que, en principio, admiten precisi&oacute;n arbitraria.
</p>
<p>La coma de los n&uacute;meros decimales en coma flotante se escribe con un
punto y el exponente se puede indicar con &quot;f&quot;, &quot;e&quot; o &quot;d&quot;. Por defecto,
Maxima hace los c&aacute;lculos en doble precisi&oacute;n y muestra el exponente
como &quot;e&quot; en el resultado, mientras que representa el exponente con la
letra &quot;b&quot; en el caso de decimales grandes de precisi&oacute;n arbitraria.
Maxima no distingue si la letra del exponente se escribe en min&uacute;scula
o may&uacute;scula.
</p>
<pre class="example">(%i1) [2.0,1f10,1,e10,1d10,1d300];
(%o1)        [2.0, 1.e+10, 1, e10, 1.e+10, 1.e+300]
(%i2) [2.0b0,1b10,1b300];
(%o2)               [2.0b0, 1.0b10, 1.0b300]
</pre>
<p>Si en un c&aacute;lculo aritm&eacute;tico aparece un n&uacute;mero decimal en coma flotante,
se producir&aacute; un efecto de contagio que har&aacute; que el resultado se devuelva
tambi&eacute;n como decimal. Esto tambi&eacute;n es cierto para el caso de decimales
grandes de precisi&oacute;n arbitraria.
</p>
<pre class="example">(%i1) 2.0+1/2+3;
(%o1)                                 5.5
(%i2) 2.0b0+1/2+3;
(%o2)                                5.5b0
</pre>
<p>Con las funciones <code>float</code> y <code>bfloat</code> se puede convertir
un n&uacute;mero en decimal de doble precisi&oacute;n, o de precisi&oacute;n
arbitraria, respectivamente:
</p>
<pre class="example">(%i1) float([2,1/2,1/3,2.0b0]);
(%o1)          [2.0, 0.5, .3333333333333333, 2.0]
(%i2) bfloat([2,1/2,1/3,2.0b0]);
(%o2)     [2.0b0, 5.0b-1, 3.333333333333333b-1, 2.0b0]
</pre>
<p>Funciones y variables disponibles para n&uacute;meros decimales:
</p>
<pre class="verbatim">   float        floatnump     
   bfloat       bfloatp       fpprec
   float2bf     bftorat       ratepsilon

   number_pbranch 
   m1pbranch
</pre>
<a name="SEC23"></a>
<h3 class="subheading"> N&uacute;meros complejos </h3>

<p>Maxima no tiene un tipo de dato espec&iacute;co para
n&uacute;meros complejos; &eacute;stos se representan internamente como
la suma de la parte real y la imaginaria multiplicada por el
s&iacute;mbolo <code>%i</code>, que hace las veces de unidad
imaginaria. Por ejemplo, las ra&iacute;ces de la ecuaci&oacute;n
<code>x^2 - 4*x + 13 = 0</code> se representan como <code>2 + 3*%i</code> y
<code>2 - 3*%i</code>.
</p>
<p>Maxima no simplifica autom&aacute;ticamente productos, cocientes,
ra&iacute;ces y otras expresiones con n&uacute;meros complejos.
Por ejemplo, para hacer la multiplicaci&oacute;n de n&uacute;meros
complejos se puede utilizar la funci&oacute;n <code>expand</code>.
</p>
<p>Funciones disponibles para los n&uacute;meros complejos:
</p>
<pre class="verbatim">   realpart     imagpart      rectform     polarform
   cabs         carg          conjugate    csign
</pre>






<hr size="6">
<a name="Funciones-y-variables-para-los-n_00fameros"></a>
<a name="SEC24"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC20" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC25" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.1.2 Funciones y variables para los n&uacute;meros </h3>


<dl>
<dt><u>Funci&oacute;n:</u> <b>bfloat</b><i> (<var>expr</var>)</i>
<a name="IDX79"></a>
</dt>
<dd><p>Convierte todos los n&uacute;meros y  funciones num&eacute;ricas a n&uacute;meros decimales de punto flotante grandes (&quot;bigfloats&quot;).
El n&uacute;mero de d&iacute;gitos significativos de los &quot;bigfloats&quot; resultantes se especifica mediante la variable global <code>fpprec</code>.
</p>
<p>Si <code>float2bf</code> vale <code>false</code> se mostrar&aacute; un mensaje de aviso cuando un n&uacute;mero en punto flotante se convierte a decimal de tipo &quot;bigfloats&quot;, puesto que tal transformaci&oacute;n puede conllevar p&eacute;rdida de precisi&oacute;n.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>bfloatp</b><i> (<var>expr</var>)</i>
<a name="IDX80"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un n&uacute;mero decimal en punto flotante grande (&quot;bigfloats&quot;), en caso contrario devuelve <code>false</code>.
</p>
</dd></dl>


<dl>
<dt><u>Variable optativa:</u> <b>bftorat</b>
<a name="IDX81"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>La variable <code>bftorat</code> controla la conversi&oacute;n de n&uacute;meros decimales de punto flotante grandes (&quot;bigfloats&quot;) a n&uacute;meros racionales. Si <code>bftorat</code> vale <code>false</code>, se utilizar&aacute; <code>ratepsilon</code> para controlar la conversi&oacute;n  (lo cual resulta en n&uacute;meros racionales relativamente peque&ntilde;os). Si  <code>bftorat</code> vale <code>true</code>, el n&uacute;mero racional generado representar&aacute; exactamente al n&uacute;mero decimal de punto flotante grande (&quot;bigfloat&quot;).
</p>
</dd></dl>


<dl>
<dt><u>Variable optativa:</u> <b>bftrunc</b>
<a name="IDX82"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>La variable <code>bftrunc</code> provoca la eliminaci&oacute;n de ceros en n&uacute;meros decimales grandes no nulos para que no se muestren.  As&iacute;, si <code>bftrunc</code> vale <code>false</code>, <code>bfloat (1)</code>
se muestra como <code>1.000000000000000B0</code>. En otro caso, se mostrar&aacute; como <code>1.0B0</code>.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>evenp</b><i> (<var>expr</var>)</i>
<a name="IDX83"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un entero par y <code>false</code> en cualquier otro caso.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>float</b><i> (<var>expr</var>)</i>
<a name="IDX84"></a>
</dt>
<dd><p>Convierte los enteros, n&uacute;meros racionales y los decimales de punto flotante grandes (&quot;bigfloats&quot;) que est&aacute;n presentes en <var>expr</var> a n&uacute;meros de punto flotante. Tambi&eacute;n act&uacute;a como s&iacute;mbolo <code>evflag</code>.
</p>
</dd></dl>


<dl>
<dt><u>Variable optativa:</u> <b>float2bf</b>
<a name="IDX85"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p> 
<p>Si <code>float2bf</code> vale <code>false</code> se mostrar&aacute; un mensaje de aviso cuando un n&uacute;mero
en punto flotante se convierte a decimal de tipo &quot;bigfloats&quot;, puesto que tal transformaci&oacute;n
puede conllevar p&eacute;rdida de precisi&oacute;n.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>floatnump</b><i> (<var>expr</var>)</i>
<a name="IDX86"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un n&uacute;mero de punto flotante, en caso contario retorna <code>false</code>.
</p>
</dd></dl>



<dl>
<dt><u>Variable optativa:</u> <b>fpprec</b>
<a name="IDX87"></a>
</dt>
<dd><p>Valor por defecto: 16
</p>
<p>La variable <code>fpprec</code> guarda el n&uacute;mero de d&iacute;gitos significativos en la aritm&eacute;tica con n&uacute;meros decimales de punto flotante grandes (&quot;bigfloats&quot;). La variable <code>fpprec</code> no afecta a los c&aacute;lculos con n&uacute;meros decimales de punto flotante ordinarios.
</p>
<p>V&eacute;anse tambi&eacute;n <code>bfloat</code> y <code>fpprintprec</code>.
</p>
</dd></dl>

<dl>
<dt><u>Variable optativa:</u> <b>fpprintprec</b>
<a name="IDX88"></a>
</dt>
<dd><p>Valor por defecto: 0
</p>
<p>La variable <code>fpprintprec</code> guarda el n&uacute;mero de d&iacute;gitos
a imprimir de los n&uacute;meros decimales en coma flotante, tanto los ordinarios
como los de precisi&oacute;n ilimitada (<i>bigfloats</i>).
</p>
<p>En el caso de los decimales ordinarios, si <code>fpprintprec</code> toma un valor
entre 2 y 16 (inclusive), el n&uacute;mero de d&iacute;gitos que se 
imprimen es igual a <code>fpprintprec</code>. En caso contrario, <code>fpprintprec</code> es 0
o mayor que 16, siendo el n&uacute;mero de d&iacute;gitos
a imprimir en todos loa casos igual a 16.
</p>
<p>En el caso de los decimales de precisi&oacute;n ilimitada (<i>bigfloats</i>),
si <code>fpprintprec</code> toma un valor entre 2 y 16 (inclusive),
el n&uacute;mero de d&iacute;gitos que se imprimen es igual a 
<code>fpprintprec</code>. En caso contrario, <code>fpprintprec</code> es 0
o mayor que <code>fpprec</code>, siendo el n&uacute;mero de d&iacute;gitos
a imprimir igual a <code>fpprec</code>.
</p>
<p>La variable <code>fpprintprec</code> no admite el valor 1.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>integerp</b><i> (<var>expr</var>)</i>
<a name="IDX89"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un n&uacute;mero entero y <code>false</code> en cualquier otro caso.
</p>
<p>La funci&oacute;n <code>integerp</code> devuelve <code>false</code> si su argumento es un s&iacute;mbolo, incluso cuando &eacute;ste ha sido declarado como entero.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) integerp (0);
(%o1)                         true
(%i2) integerp (1);
(%o2)                         true
(%i3) integerp (-17);
(%o3)                         true
(%i4) integerp (0.0);
(%o4)                         false
(%i5) integerp (1.0);
(%o5)                         false
(%i6) integerp (%pi);
(%o6)                         false
(%i7) integerp (n);
(%o7)                         false
(%i8) declare (n, integer);
(%o8)                         done
(%i9) integerp (n);
(%o9)                         false
</pre>
</dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>m1pbranch</b>
<a name="IDX90"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>La variable <code>m1pbranch</code> es la rama principal de <code>-1</code> elevado a una potencia. Cantidades como <code>(-1)^(1/3)</code> (esto es, un exponente racional impar) y <code>(-1)^(1/4)</code> (esto es, un exponente racional par) son tratados como sigue:
</p>
<pre class="example">              dominio real
                            
(-1)^(1/3):      -1         
(-1)^(1/4):   (-1)^(1/4)   

             dominio complejo              
m1pbranch:false          m1pbranch:true
(-1)^(1/3)               1/2+%i*sqrt(3)/2
(-1)^(1/4)              sqrt(2)/2+%i*sqrt(2)/2
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>nonnegintegerp</b><i> (<var>n</var>)</i>
<a name="IDX91"></a>
</dt>
<dd><p>Devuelve <code>true</code> si y solo si <code><var>n</var> &gt;= 0</code>, siendo <var>n</var> un entero.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>numberp</b><i> (<var>expr</var>)</i>
<a name="IDX92"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un en&uacute;mero entero, racional, 
de coma flotante o &quot;bigfloat&quot;, en caso contrario devuelve <code>false</code>.
</p>
<p>La funci&oacute;n <code>numberp</code> devuelve <code>false</code> si su argumento es un s&iacute;mbolo, incluso cuando el argumento es un n&uacute;mero simb&oacute;lico como <code>%pi</code> o <code>%i</code>, o aunque haya sido declarado como <code>even</code> (par), <code>odd</code> (impar), <code>integer</code> (entero), <code>rational</code> (racional), <code>irrational</code> (irracional), <code>real</code> (real), <code>imaginary</code> (imaginario) o <code>complex</code> (complejo).
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) numberp (42);
(%o1)                         true
(%i2) numberp (-13/19);
(%o2)                         true
(%i3) numberp (3.14159);
(%o3)                         true
(%i4) numberp (-1729b-4);
(%o4)                         true
(%i5) map (numberp, [%e, %pi, %i, %phi, inf, minf]);
(%o5)      [false, false, false, false, false, false]
(%i6) declare (a, even, b, odd, c, integer, d, rational,
     e, irrational, f, real, g, imaginary, h, complex);
(%o6)                         done
(%i7) map (numberp, [a, b, c, d, e, f, g, h]);
(%o7) [false, false, false, false, false, false, false, false]
</pre>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>numer</b>
<a name="IDX93"></a>
</dt>
<dd><p>La variable <code>numer</code> hace algunas funciones matem&aacute;ticas
con argumentos num&eacute;ricos se eval&uacute;en como decimales de punto flotante.
Tambi&eacute;n hace que las variables de una expresi&oacute;n a las cuales se les ha
asignado un n&uacute;mero sean sustituidas por sus valores.
Adem&aacute;s, activa la variable <code>float</code>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>%enumer</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) [sqrt(2), sin(1), 1/(1+sqrt(3))];
                                               1
(%o1)                   [sqrt(2), sin(1), -----------]
                                          sqrt(3) + 1
(%i2) [sqrt(2), sin(1), 1/(1+sqrt(3))],numer;
(%o2) [1.414213562373095, .8414709848078965, .3660254037844387]
</pre></dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>numer_pbranch</b>
<a name="IDX94"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>La variable opcional <code>numer_pbranch</code> controla la evaluaci&oacute;n
num&eacute;rica de las potencias de n&uacute;meros enteros, racionales y
decimales negativos. Si <code>numer_pbranch</code> vale <code>true</code> y el
exponente es decimal o la variable opcional <code>numer</code> vale 
<code>true</code>, Maxima eval&uacute;a el resultado num&eacute;rico utilizando la rama
principal. En caso contrario, se devuleve un resultado simplificado pero
no evaluado.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) (-2)^0.75;
(%o1) (-2)^0.75

(%i2) (-2)^0.75,numer_pbranch:true;
(%o2) 1.189207115002721*%i-1.189207115002721

(%i3) (-2)^(3/4);
(%o3) (-1)^(3/4)*2^(3/4)

(%i4) (-2)^(3/4),numer;
(%o4) 1.681792830507429*(-1)^0.75

(%i5) (-2)^(3/4),numer,numer_pbranch:true;
(%o5) 1.189207115002721*%i-1.189207115002721
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>numerval</b><i> (<var>x_1</var>, <var>expr_1</var>, ..., <var>var_n</var>, <var>expr_n</var>)</i>
<a name="IDX95"></a>
</dt>
<dd><p>Declara las variables <code>x_1</code>, ..., <var>x_n</var> asign&aacute;ndoles los valores num&eacute;ricos <code>expr_1</code>, ..., <code>expr_n</code>.
El valor num&eacute;rico se eval&uacute;a y sustituye a la variable en cualquier expresi&oacute;n en la que &eacute;sta aparezca si <code>numer</code> toma el valor <code>true</code>. V&eacute;ase tambi&eacute;n <code>ev</code>.
</p>
<p>Las expresiones <code>expr_1</code>, ..., <code>expr_n</code> pueden ser expresiones no necesariamente num&eacute;ricas.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>oddp</b><i> (<var>expr</var>)</i>
<a name="IDX96"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un entero impar y <code>false</code> en caso contrario.
</p></dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>ratepsilon</b>
<a name="IDX97"></a>
</dt>
<dd><p>Valor por defecto: 2.0e-8
</p>
<p>La variable <code>ratepsilon</code> guarda la tolerancia utilizada en la conversi&oacute;n de n&uacute;meros decimales en coma flotante a n&uacute;meros racionales.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>rationalize</b><i> (<var>expr</var>)</i>
<a name="IDX98"></a>
</dt>
<dd><p>Convierte todos los n&uacute;meros en coma flotante de doble precisi&oacute;n y grandes (big float) presentes en una expresi&oacute;n <var>expr</var> de Maxima a sus formas racionales exactas equivalentes. Si el usuario no est&aacute; familiarizado con la representaci&oacute;n binaria de n&uacute;meros en coma flotante, le puede extra&ntilde;ar que <code>rationalize (0.1)</code> no sea igual que 1/10.  Este comportamiento no es &uacute;nico de Maxima, ya que el n&uacute;mero 1/10 en su forma binaria es peri&oacute;dico y no exacto.
</p>
<pre class="example">(%i1) rationalize (0.5);
                                1
(%o1)                           -
                                2
(%i2) rationalize (0.1);
                               1
(%o2)                          --
                               10
(%i3) fpprec : 5$
(%i4) rationalize (0.1b0);
                             209715
(%o4)                        -------
                             2097152
(%i5) fpprec : 20$
(%i6) rationalize (0.1b0);
                     236118324143482260685
(%o6)                ----------------------
                     2361183241434822606848
(%i7) rationalize (sin (0.1*x + 5.6));
                              x    28
(%o7)                     sin(-- + --)
                              10   5
</pre>
<p>Ejemplo de uso:
</p>
<pre class="example">(%i1) unitfrac(r) := block([uf : [], q],
    if not(ratnump(r)) then
       error(&quot;The input to 'unitfrac' must be a rational number&quot;),
    while r # 0 do (
        uf : cons(q : 1/ceiling(1/r), uf),
        r : r - q),
    reverse(uf))$
(%i2) unitfrac (9/10);
                            1  1  1
(%o2)                      [-, -, --]
                            2  3  15
(%i3) apply (&quot;+&quot;, %);
                               9
(%o3)                          --
                               10
(%i4) unitfrac (-9/10);
                                  1
(%o4)                       [- 1, --]
                                  10
(%i5) apply (&quot;+&quot;, %);
                                9
(%o5)                         - --
                                10
(%i6) unitfrac (36/37);
                        1  1  1  1    1
(%o6)                  [-, -, -, --, ----]
                        2  3  8  69  6808
(%i7) apply (&quot;+&quot;, %);
                               36
(%o7)                          --
                               37
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>ratnump</b><i> (<var>expr</var>)</i>
<a name="IDX99"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un entero literal o una fracci&oacute;n de enteros literales, en caso contrario devuelve <code>false</code>.
</p>
</dd></dl>









<hr size="6">
<a name="Cadenas-de-texto"></a>
<a name="SEC25"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC24" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC26" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC18" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.2 Cadenas de texto </h2>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC26">5.2.1 Introducci&oacute;n a las cadenas de texto</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC27">5.2.2 Funciones y variables para las cadenas de texto</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>




<hr size="6">
<a name="Introducci_00f3n-a-las-cadenas-de-texto"></a>
<a name="SEC26"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC25" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC27" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC25" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.2.1 Introducci&oacute;n a las cadenas de texto </h3>




<p>Las cadenas de caracteres deben ir acotadas por comillas dobles (<code>&quot;</code>)
al ser introducidas en Maxima, siendo luego mostradas con o sin ellas, 
dependiendo del valor de la variable global <code>stringdisp</code>.
</p>
<p>Las cadenas pueden contener todo tipo de caracteres, incluyendo tabulaciones,
caracteres de nueva l&iacute;nea y de retorno.
La secuencia <code>\&quot;</code> se reconoce literalmente como una comilla doble, al
tiempo que <code>\\</code> se interpreta como una barra invertida. Cuando la barra
invertida aparece al final de una l&iacute;nea, tanto la barra como el
final de l&iacute;nea (representado &eacute;ste bien por el car&aacute;cter de nueva 
l&iacute;nea o el de retorno) son ignorados, de forma que la cadena
contin&uacute;a en el siguiente rengl&oacute;n. No se reconocen m&aacute;s combinaciones especiales
de la barra invertida con otros caracteres aparte de las comentadas; de modo
que si la barra invertida aparece antes de cualquier otro car&aacute;cter distinto de
<code>&quot;</code>, <code>\</code>, o de un final de l&iacute;nea, dicha barra ser&aacute;
ignorada.
No hay manera de representar los caracteres especiales
(tabulaci&oacute;n, nueva l&iacute;nea o retorno) de otra
forma que no sea incluy&eacute;ndolos literalmente en la cadena.
</p>
<p>No existe en Maxima el tipo de variable car&aacute;cter, debi&eacute;ndose
representar un car&aacute;cter simple como una cadena de un solo car&aacute;cter.
</p>
<p>El paquete adicional <code>stringproc</code> contiene muchas funciones que
permiten trabajar con cadenas.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) s_1 : &quot;This is a string.&quot;;
(%o1)               This is a string.
(%i2) s_2 : &quot;Embedded \&quot;double quotes\&quot; and backslash \\ characters.&quot;;
(%o2) Embedded &quot;double quotes&quot; and backslash \ characters.
(%i3) s_3 : &quot;Embedded line termination
in this string.&quot;;
(%o3) Embedded line termination
in this string.
(%i4) s_4 : &quot;Ignore the \
line termination \
characters in \
this string.&quot;;
(%o4) Ignore the line termination characters in this string.
(%i5) stringdisp : false;
(%o5)                         false
(%i6) s_1;
(%o6)               This is a string.
(%i7) stringdisp : true;
(%o7)                         true
(%i8) s_1;
(%o8)              &quot;This is a string.&quot;
</pre>







<hr size="6">
<a name="Funciones-y-variables-para-las-cadenas-de-texto"></a>
<a name="SEC27"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC26" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC28" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC25" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.2.2 Funciones y variables para las cadenas de texto </h3>



<dl>
<dt><u>Funci&oacute;n:</u> <b>concat</b><i> (<var>arg_1</var>, <var>arg_2</var>, ...)</i>
<a name="IDX100"></a>
</dt>
<dd><p>Concatena sus argumentos, que deben ser todos &aacute;tomos.
El valor devuelto es un s&iacute;mbolo si el primer argumento es a su vez un s&iacute;mbolo, o una cadena en caso contrario.
</p>
<p>La funci&oacute;n <code>concat</code> eval&uacute;a sus argumentos.
El ap&aacute;trofo  <code>'</code> evita la evaluaci&oacute;n.
</p>
<pre class="example">(%i1) y: 7$
(%i2) z: 88$
(%i3) concat (y, z/2);
(%o3)                          744
(%i4) concat ('y, z/2);
(%o4)                          y44
</pre>
<p>A un s&iacute;mbolo construido por <code>concat</code> se le puede asignar un valor y ser utilizado posteriormente en expresiones.
La asignaci&oacute;n con el operador <code>::</code> eval&uacute;a su expresi&oacute;n izquierda.
</p>
<pre class="example">(%i5) a: concat ('y, z/2);
(%o5)                          y44
(%i6) a:: 123;
(%o6)                          123
(%i7) y44;
(%o7)                          123
(%i8) b^a;
                               y44
(%o8)                         b
(%i9) %, numer;
                               123
(%o9)                         b
</pre>
<p>N&oacute;tese que aunque <code>concat (1, 2)</code> parezca un n&uacute;mero, se trata de una cadena.
</p>
<pre class="example">(%i10) concat (1, 2) + 3;
(%o10)                       12 + 3
</pre>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>sconcat</b><i> (<var>arg_1</var>, <var>arg_2</var>, ...)</i>
<a name="IDX101"></a>
</dt>
<dd><p>Concatena sus argumentos para producir una cadena.
Al contrario que <code>concat</code>, sus argumentos <i>no</i> necesitan ser &aacute;tomos.
</p>
<p>El resultado es una cadena.
</p>
<pre class="example">(%i1) sconcat (&quot;xx[&quot;, 3, &quot;]:&quot;, expand ((x+y)^3));
(%o1)               xx[3]:y^3+3*x*y^2+3*x^2*y+x^3
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>string</b><i> (<var>expr</var>)</i>
<a name="IDX102"></a>
</dt>
<dd><p>Convierte <code>expr</code> a la notaci&oacute;n lineal de Maxima, tal como si fuese tecleada.
</p>
<p>El valor que retorna la funci&oacute;n <code>string</code> es una cadena, por lo que no puede ser utilizada en los c&aacute;lculos.
</p>
</dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>stringdisp</b>
<a name="IDX103"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>stringdisp</code> vale <code>true</code>,
las cadenas alfanum&eacute;ricas se muestran encerradas entre comillas dobles. En caso contrario, no se nuestran las comillas.
</p>
<p>La variable <code>stringdisp</code> vale siempre <code>true</code> cuando se muestra la definici&oacute;n de una funci&oacute;n.
</p>

<p>Ejemplos:
</p>
<pre class="example">(%i1) stringdisp: false$
(%i2) &quot;This is an example string.&quot;;
(%o2)              This is an example string.
(%i3) foo () :=
      print (&quot;This is a string in a function definition.&quot;);
(%o3) foo() := 
              print(&quot;This is a string in a function definition.&quot;)
(%i4) stringdisp: true$
(%i5) &quot;This is an example string.&quot;;
(%o5)             &quot;This is an example string.&quot;
</pre>
</dd></dl>



<hr size="6">
<a name="Constantes"></a>
<a name="SEC28"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC27" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC29" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC18" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.3 Constantes </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC29">5.3.1 Funciones y variables para Constantes</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">   
</td></tr>
</table>

<hr size="6">
<a name="Funciones-y-variables-para-Constantes"></a>
<a name="SEC29"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC28" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC30" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC28" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.3.1 Funciones y variables para Constantes </h3>

<dl>
<dt><u>Constante:</u> <b>%e</b>
<a name="IDX104"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>%e</code> representa a la base de los logaritmos
naturales, tambi&eacute;n conocido como n&uacute;mero de Euler. El valor num&eacute;rico
de <code>%e</code> es el n&uacute;mero decimal en coma flotante 2.718281828459045d0.
</p>
</dd></dl>


<dl>
<dt><u>Constante:</u> <b>%i</b>
<a name="IDX105"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>%i</code> representa la unidad imaginaria, <em>sqrt(- 1)</em>.
</p>
</dd></dl>


<dl>
<dt><u>Constante:</u> <b>false</b>
<a name="IDX106"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>false</code> representa al valor l&oacute;gico
&quot;falso&quot;. Maxima implementa <code>false</code> con el valor <code>NIL</code> de
Lisp.
</p></dd></dl>



<dl>
<dt><u>Constante:</u> <b>%gamma</b>
<a name="IDX107"></a>
</dt>
<dd><p>Es la constante de Euler-Mascheroni, 0.5772156649015329 ....
</p>
</dd></dl>



<dl>
<dt><u>Constante:</u> <b>ind</b>
<a name="IDX108"></a>
</dt>
<dd><p><code>ind</code> representa un resultado acotado indeterminado.
</p>
<p>V&eacute;ase tambi&eacute;n <code>limit</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) limit (sin(1/x), x, 0);
(%o1)                          ind
</pre></dd></dl>

<dl>
<dt><u>Constante:</u> <b>inf</b>
<a name="IDX109"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>inf</code> representa al infinito real positivo.
</p></dd></dl>

<dl>
<dt><u>Constante:</u> <b>infinity</b>
<a name="IDX110"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>infinity</code> representa al infinito complejo.
</p></dd></dl>

<dl>
<dt><u>Constante:</u> <b>minf</b>
<a name="IDX111"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>minf</code> representa al infinito real negativo.
</p></dd></dl>

<dl>
<dt><u>Constante:</u> <b>%phi</b>
<a name="IDX112"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>%phi</code> representa a la llamada <i>raz&oacute;n &aacute;urea</i>,
<em>(1 + sqrt(5))/2</em>.
El valor num&eacute;rico de <code>%phi</code> es el n&uacute;mero decimal en coma flotante 1.618033988749895d0.
</p>
<p>La funci&oacute;n <code>fibtophi</code> expresa los n&uacute;meros de Fibonacci <code>fib(n)</code> en
t&eacute;rminos de <code>%phi</code>.
</p>
<p>Por defecto, Maxima desconoce las propiedades algebraicas de <code>%phi</code>.
Tras evaluar <code>tellrat(%phi^2 - %phi - 1)</code> y <code>algebraic: true</code>,
<code>ratsimp</code> puede simplificar algunas expresiones que contengan <code>%phi</code>.
</p>
<p>Ejemplos:
</p>
<p><code>fibtophi</code> expresa el n&uacute;mero de Fibonacci <code>fib(n)</code> en t&eacute;rminos de <code>%phi</code>.
</p>
<pre class="example">(%i1) fibtophi (fib (n));
                           n             n
                       %phi  - (1 - %phi)
(%o1)                  -------------------
                           2 %phi - 1
(%i2) fib (n-1) + fib (n) - fib (n+1);
(%o2)          - fib(n + 1) + fib(n) + fib(n - 1)
(%i3) fibtophi (%);
            n + 1             n + 1       n             n
        %phi      - (1 - %phi)        %phi  - (1 - %phi)
(%o3) - --------------------------- + -------------------
                2 %phi - 1                2 %phi - 1
                                          n - 1             n - 1
                                      %phi      - (1 - %phi)
                                    + ---------------------------
                                              2 %phi - 1
(%i4) ratsimp (%);
(%o4)                           0
</pre>
<p>Por defecto, Maxima desconoce las propiedades algebraicas de <code>%phi</code>.
Despu&eacute;s de evaluar <code>tellrat (%phi^2 - %phi - 1)</code> y
<code>algebraic: true</code>, <code>ratsimp</code> puede simplificar algunas expresiones
que contengan <code>%phi</code>.
</p>

<pre class="example">(%i1) e : expand ((%phi^2 - %phi - 1) * (A + 1));
                 2                      2
(%o1)        %phi  A - %phi A - A + %phi  - %phi - 1
(%i2) ratsimp (e);
                  2                     2
(%o2)        (%phi  - %phi - 1) A + %phi  - %phi - 1
(%i3) tellrat (%phi^2 - %phi - 1);
                            2
(%o3)                  [%phi  - %phi - 1]
(%i4) algebraic : true;
(%o4)                         true
(%i5) ratsimp (e);
(%o5)                           0
</pre>
</dd></dl>


<dl>
<dt><u>Constante:</u> <b>%pi</b>
<a name="IDX113"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>%pi</code> representa la raz&oacute;n entre la longitud de
una circunferencia y su radio. 
El valor num&eacute;rico de <code>%pi</code> es el n&uacute;mero decimal en coma flotante 3.141592653589793d0.
</p></dd></dl>

<dl>
<dt><u>Constante:</u> <b>true</b>
<a name="IDX114"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>true</code> representa al valor l&oacute;gico
&quot;verdadero&quot;. Maxima implementa <code>true</code> con el valor <code>T</code> de
Lisp.
</p></dd></dl>

<dl>
<dt><u>Constante:</u> <b>und</b>
<a name="IDX115"></a>
</dt>
<dd><p><code>und</code> representa un resultado indefinido.
</p>
<p>V&eacute;ase tambi&eacute;n <code>limit</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) limit (x*sin(x), x, inf);
(%o1)                          und
</pre>
</dd></dl>

<dl>
<dt><u>Constante:</u> <b>zeroa</b>
<a name="IDX116"></a>
</dt>
<dd><p><code>zeroa</code> representa un infinitesimal mayor que cero. 
<code>zeroa</code> puede utilizarse en expresiones. <code>limit</code>
simplifica expresiones que contienen infinitesimales.
</p>
<p>V&eacute;anse tambi&eacute;n <code>zerob</code> y <code>limit</code>.
</p>
<p>Ejemplo:
</p>
<p><code>limit</code> simplifica expresiones que contienen infinitesimales:
</p>
<pre class="example">(%i1) limit(zeroa);
(%o1)                                  0
(%i2) limit(x+zeroa);
(%o2)                                  x
</pre>
</dd></dl>

<dl>
<dt><u>Constante:</u> <b>zerob</b>
<a name="IDX117"></a>
</dt>
<dd><p><code>zerob</code> representa un infinitesimal menor que cero. 
<code>zerob</code> puede utilizarse en expresiones. <code>limit</code>
simplifica expresiones que contienen infinitesimales.
</p>
<p>V&eacute;anse tambi&eacute;n <code>zeroa</code> y <code>limit</code>.
</p></dd></dl>



<hr size="6">
<a name="Listas"></a>
<a name="SEC30"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC29" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC31" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC18" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.4 Listas </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC31">5.4.1 Introducci&oacute;n a las listas</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">       
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC32">5.4.2 Funciones y variables para listas</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">       
</td></tr>
</table>

<hr size="6">
<a name="Introducci_00f3n-a-las-listas"></a>
<a name="SEC31"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC30" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC32" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC30" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.4.1 Introducci&oacute;n a las listas </h3>

<p>Las listas son bloques de construcci&oacute;n b&aacute;sica para Maxima y Lisp. Todos los tipos de datos
diferentes a los arreglos, tablas mixtas o n&uacute;meros son representados como listas Lisp,
estas listas Lisp tienen la forma
</p>
<pre class="example">((MPLUS) $A 2)
</pre>

<p>para indicar la expresi&oacute;n <code>a+2</code>. Al nivel de Maxima se observar&aacute;
la notaci&oacute;n infija <code>a+2</code>. Maxima tambi&eacute;n tiene listas con el formato
</p>
<pre class="example">[1, 2, 7, x+y]
</pre>

<p>para una lista de 4 elementos. Internamente esto se corresponde con una lista Lisp
de la forma
</p>
<pre class="example">((MLIST) 1  2  7  ((MPLUS)  $X $Y ))
</pre>

<p>El elemento que denota el tipo de expresi&oacute;n en Maxima es tambi&eacute;n una lista, la cual tras ser analizada y simplificada tomar&aacute; la forma
</p>
<pre class="example">((MLIST SIMP) 1 2 7 ((MPLUS SIMP) $X $Y))
</pre>

<hr size="6">
<a name="Funciones-y-variables-para-listas"></a>
<a name="SEC32"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC31" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC33" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC30" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.4.2 Funciones y variables para listas </h3>



<dl>
<dt><u>Operador:</u> <b>[</b>
<a name="IDX118"></a>
</dt>
<dt><u>Operador:</u> <b>]</b>
<a name="IDX119"></a>
</dt>
<dd><p><code>[</code> y <code>]</code> marcan, respectivamente, el comienzo y el final de una lista.
</p>
<p><code>[</code> y <code>]</code> tambi&eacute;n se utilizan para indicar los sub&iacute;ndices
de una lista o de un array.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) x: [a, b, c];
(%o1)                       [a, b, c]
(%i2) x[3];
(%o2)                           c
(%i3) array (y, fixnum, 3);
(%o3)                           y
(%i4) y[2]: %pi;
(%o4)                          %pi
(%i5) y[2];
(%o5)                          %pi
(%i6) z['foo]: 'bar;
(%o6)                          bar
(%i7) z['foo];
(%o7)                          bar
(%i8) g[k] := 1/(k^2+1);
                                  1
(%o8)                     g  := ------
                           k     2
                                k  + 1
(%i9) g[10];
                                1
(%o9)                          ---
                               101
</pre>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>append</b><i> (<var>lista_1</var>, ..., <var>lista_n</var>)</i>
<a name="IDX120"></a>
</dt>
<dd><p>Devuelve una lista cuyos elementos son los de la lista <var>lista_1</var> seguidos de los de <var>lista_2</var>, ...  La funci&oacute;n <code>append</code> tambi&eacute;n opera con expresiones generales, como la llamada <code>append (f(a,b), f(c,d,e));</code>, de la que se obtiene <code>f(a,b,c,d,e)</code>.
</p>
<p>Tecl&eacute;ese <code>example(append);</code> para ver un ejemplo.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>assoc</b><i> (<var>clave</var>, <var>lista</var>, <var>valor_por_defecto</var>)</i>
<a name="IDX121"></a>
</dt>
<dt><u>Function:</u> <b>assoc</b><i> (<var>clave</var>, <var>lista</var>)</i>
<a name="IDX122"></a>
</dt>
<dd><p>Esta funci&oacute;n busca la <var>clave</var> en el lado derecho de la  <var>lista</var>, la cual es de la forma <code>[x,y,z,...]</code>, donde cada elemento  es una expresi&oacute;n formada por un operador binario y dos elementos. Por ejemplo, <code>x=1</code>, <code>2^3</code>, <code>[a,b]</code> etc.  La <var>clave</var> se compara con el primer operando. La funci&oacute;n <code>assoc</code> devuelve el segundo operando si se encuentra con que la <code>clave</code> coincide.  Si la <code>clave</code> no coincide entonces devuelve el valor <var>valor_por_defecto</var>. El argumento <var>valor_por_defecto</var> es opcional; en caso de no estar presente, se devolver&aacute; <code>false</code>.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>cons</b><i> (<var>expr</var>, <var>lista</var>)</i>
<a name="IDX123"></a>
</dt>
<dd><p>Devuelve una nueva lista en la que el elemento <var>expr</var> ocupa la primera posici&oacute;n, seguido de los elementos de <var>lista</var>. La funci&oacute;n  <code>cons</code> tambi&eacute;n opera con otro tipo de expresiones, como  <code>cons(x, f(a,b,c));</code>  -&gt;  <code>f(x,a,b,c)</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>copylist</b><i> (<var>lista</var>)</i>
<a name="IDX124"></a>
</dt>
<dd><p>Devuelve una copia de la <var>lista</var>.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>create_list</b><i> (<var>form</var>, <var>x_1</var>, <var>list_1</var>, ..., <var>x_n</var>, <var>list_n</var>)</i>
<a name="IDX125"></a>
</dt>
<dd><p>Crea una lista mediante la evaluaci&oacute;n de <var>form</var> con <var>x_1</var> tomando cada uno de los
valores de <var>list_1</var>, para cada uno de estos valores liga <var>x_2</var> con cada elemento de 
<var>list_2</var>, .... El n&uacute;mero de elementos en el resultado ser&aacute; el producto del n&uacute;mero de elementos
en cada lista. Cada variable <var>x_i</var> debe ser un s&iacute;mbolo y no ser&aacute; evaluado.
La lista de argumentos ser&aacute; evaluada una vez al comienzo de la iteraci&oacute;n.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) create_list (x^i, i, [1, 3, 7]);
                                3   7
(%o1)                      [x, x , x ]
</pre>

<p>Con una doble iteraci&oacute;n:
</p>
<pre class="example">(%i1) create_list ([i, j], i, [a, b], j, [e, f, h]);
(%o1)   [[a, e], [a, f], [a, h], [b, e], [b, f], [b, h]]
</pre>
<p>En lugar de <var>list_i</var> se pueden suministrar dos argumentos cada uno de los cuales 
deber&iacute;a poder evaluarse a un n&uacute;mero, los cuales ser&aacute;n los l&iacute;mites inferior
y superior, ambos inclusive, para cada iteraci&oacute;n.
</p>
<pre class="example">(%i1) create_list ([i, j], i, [1, 2, 3], j, 1, i);
(%o1)   [[1, 1], [2, 1], [2, 2], [3, 1], [3, 2], [3, 3]]
</pre>
<p>N&oacute;tese que los l&iacute;mites o lista para la variable <code>j</code> pueden depender
del valor actual de <code>i</code>.
</p></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>delete</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX126"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>delete</b><i> (<var>expr_1</var>, <var>expr_2</var>, <var>n</var>)</i>
<a name="IDX127"></a>
</dt>
<dd><p><code>delete(<var>expr_1</var>, <var>expr_2</var>)</code>
elimina de <var>expr_2</var> cualesquiera argumentos del operador
del nivel superior que sean iguales a <var>expr_1</var>.
N&oacute;tese que los argumentos de las subexpresiones no se ven
afectados por esta funci&oacute;n.
</p>
<p><var>expr_1</var> puede ser un &aacute;tomo o una expresi&oacute;n no
at&oacute;mica. <var>expr_2</var> puede ser cualquier expresi&oacute;n no
at&oacute;mica. La funci&oacute;n <code>delete</code> devuelve una
nueva expresi&oacute;n sin modificar <var>expr_2</var>.
</p>
<p><code>delete(<var>expr_1</var>, <var>expr_2</var>, <var>n</var>)</code>
elimina de <var>expr_2</var> los primeros <var>n</var> argumentos
del operador del nivel superior que sean iguales a <var>expr_1</var>.
Si hay menos de <var>n</var> argumentos iguales, entonces se
eliminan todos ellos.
</p>
<p>Ejemplos:
</p>
<p>Eliminando elementos de una lista.
</p>
<pre class="example">(%i1) delete (y, [w, x, y, z, z, y, x, w]);
(%o1)                  [w, x, z, z, x, w]
</pre>
<p>Eliminando t&eacute;rminos de una suma.
</p>
<pre class="example">(%i1) delete (sin(x), x + sin(x) + y);
(%o1)                         y + x
</pre>
<p>Eliminando factores de un producto.
</p>
<pre class="example">(%i1) delete (u - x, (u - w)*(u - x)*(u - y)*(u - z));
(%o1)                (u - w) (u - y) (u - z)
</pre>
<p>Eliminando argumentos de una expresi&oacute;n arbitraria.
</p>
<pre class="example">(%i1) delete (a, foo (a, b, c, d, a));
(%o1)                     foo(b, c, d)
</pre>
<p>Limitando el n&uacute;mero de argumentos a eliminar.
</p>
<pre class="example">(%i1) delete (a, foo (a, b, a, c, d, a), 2);
(%o1)                    foo(b, c, d, a)
</pre>
<p>Los argumentos se comparan respecto de &quot;=&quot;.
Aquellos argumentos que verifiquen la condici&oacute;n <code>equal</code>,
pero no &quot;=&quot; no ser&aacute;n eliminados.
</p>
<pre class="example">(%i1) [is (equal (0, 0)), is (equal (0, 0.0)), is (equal (0, 0b0))];
rat: replaced 0.0 by 0/1 = 0.0
`rat' replaced 0.0B0 by 0/1 = 0.0B0
(%o1)                  [true, true, true]
(%i2) [is (0 = 0), is (0 = 0.0), is (0 = 0b0)];
(%o2)                 [true, false, false]
(%i3) delete (0, [0, 0.0, 0b0]);
(%o3)                     [0.0, 0.0b0]
(%i4) is (equal ((x + y)*(x - y), x^2 - y^2));
(%o4)                         true
(%i5) is ((x + y)*(x - y) = x^2 - y^2);
(%o5)                         false
(%i6) delete ((x + y)*(x - y), [(x + y)*(x - y), x^2 - y^2]);
                              2    2
(%o6)                       [x  - y ]
</pre></dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>eighth</b><i> (<var>expr</var>)</i>
<a name="IDX128"></a>
</dt>
<dd><p>Devuelve el octavo elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>endcons</b><i> (<var>expr</var>, <var>lista</var>)</i>
<a name="IDX129"></a>
</dt>
<dd><p>Devuelve una nueva lista formada por los elementos de <code>lista</code> seguidos de los de <var>expr</var>. La funci&oacute;n <code>endcons</code> tambi&eacute;n opera con expresiones generales, por ejemplo <code>endcons(x, f(a,b,c));</code>  -&gt;  <code>f(a,b,c,x)</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>fifth</b><i> (<var>expr</var>)</i>
<a name="IDX130"></a>
</dt>
<dd><p>Devuelve el quinto elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>first</b><i> (<var>expr</var>)</i>
<a name="IDX131"></a>
</dt>
<dd><p>Devuelve la primera parte de <var>expr</var>, que puede consistir en el primer elemento de una lista, la primera fila de una matriz, el primer t&eacute;rmino de una suma, etc. N&oacute;tese que tanto <code>first</code> como sus funciones relacionadas, <code>rest</code> y <code>last</code>, operan sobre la forma en la que <var>expr</var> es mostrada por Maxima, no sobre la forma en la que es introducida la expresi&oacute;n. Sin embargo, cuando la variable <code>inflag</code> toma el valor <code>true</code> estas funciones tendr&aacute;n en cuenta el formato interno de <var>expr</var>. T&eacute;ngase en cuenta que el simplificador reordena las expresiones.  As&iacute;, <code>first(x+y)</code> devolver&aacute; <code>x</code> si <code>inflag</code> vale <code>true</code> y <code>y</code> cuando <code>inflag</code> tome el valor <code>false</code> (<code>first(y+x)</code> devuelve el mismo resultado). Las funciones <code>second</code> ... <code>tenth</code> devuelven desde el segundo hasta el d&eacute;cimo elemento del argumento de entrada.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>fourth</b><i> (<var>expr</var>)</i>
<a name="IDX132"></a>
</dt>
<dd><p>Devuelve el cuarto elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>join</b><i> (<var>l</var>, <var>m</var>)</i>
<a name="IDX133"></a>
</dt>
<dd><p>Crea una nueva lista con los elementos de las listas <var>l</var> y <var>m</var> alternados.
El resultado tiene como elementos <code>[<var>l</var>[1], <var>m</var>[1], <var>l</var>[2], <var>m</var>[2], ...]</code>.
Las listas <var>l</var> y <var>m</var> pueden contener cualquier tipo de elementos.
</p>
<p>Si las listas son de diferente longitud, <code>join</code> ignora los elementos sobrantes de la lista m&aacute;s larga.
</p>
<p>Maxima da error si o bien <var>l</var> o <var>m</var> no son listas.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) L1: [a, sin(b), c!, d - 1];
(%o1)                [a, sin(b), c!, d - 1]
(%i2) join (L1, [1, 2, 3, 4]);
(%o2)          [a, 1, sin(b), 2, c!, 3, d - 1, 4]
(%i3) join (L1, [aa, bb, cc, dd, ee, ff]);
(%o3)        [a, aa, sin(b), bb, c!, cc, d - 1, dd]
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>last</b><i> (<var>expr</var>)</i>
<a name="IDX134"></a>
</dt>
<dd><p>Devuelve la &uacute;ltima parte (t&eacute;rmino, fila, elemento, etc.) de <var>expr</var>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>length</b><i> (<var>expr</var>)</i>
<a name="IDX135"></a>
</dt>
<dd><p>Devuelve (por defecto) el n&uacute;mero de partes de que consta <var>expr</var> en la versi&oacute;n correspondiente a la que muestra.  En el caso de listas, se devuelve el n&uacute;mero de elementos, si se trata de matrices el n&uacute;mero de filas y se se trata de sumas el n&uacute;mero de t&eacute;rminos o sumandos (v&eacute;ase <code>dispform</code>).
</p>
<p>La funci&oacute;n <code>length</code> se ve afectada por el valor de la variable <code>inflag</code>.  As&iacute;, <code>length(a/(b*c));</code> devuelve 2 si <code>inflag</code> vale <code>false</code> (dando por hecho que <code>exptdispflag</code> vale <code>true</code>), pero devuelve 3 si <code>inflag</code> vale <code>true</code> (ya que la representaci&oacute;n interna es <code>a*b^-1*c^-1</code>).
</p>
</dd></dl>

<dl>
<dt><u>Variable opcional:</u> <b>listarith</b>
<a name="IDX136"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando vale <code>false</code> provoca que no se realicen operaciones aritm&eacute;ticas con listas;  cuando vale <code>true</code>, las operaciones con listas y matrices son contagiosas, en el sentido de que las listas se transforman en matrices, retornando resultados de este &uacute;ltimo tipo. Sin embargo, operaciones que involucren listas con listas devolver&aacute;n tambi&eacute;n listas.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>listp</b><i> (<var>expr</var>)</i>
<a name="IDX137"></a>
</dt>
<dd><p>Devuelve el valor <code>true</code> si <var>expr</var> es una lista, y <code>false</code> en caso contrario.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>makelist</b><i> ()</i>
<a name="IDX138"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>makelist</b><i> (<var>expr</var>, <var>n</var>)</i>
<a name="IDX139"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>makelist</b><i> (<var>expr</var>, <var>i</var>, <var>i_max</var>)</i>
<a name="IDX140"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>makelist</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_max</var>)</i>
<a name="IDX141"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>makelist</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_max</var>, <var>step</var>)</i>
<a name="IDX142"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>makelist</b><i> (<var>expr</var>, <var>x</var>, <var>list</var>)</i>
<a name="IDX143"></a>
</dt>
<dd><p>El primer formato, <code>makelist ()</code>, crea una lista vac&iacute;a. El
segundo formato, <code>makelist (<var>expr</var>)</code>, crea una lista con <var>expr</var>
como &uacute;nico elemento. <code>makelist (<var>expr</var>, <var>n</var>)</code> crea una lista
de <var>n</var> elementos generados a partir de <var>expr</var>.
</p>
<p>El formato m&aacute;s general, <code>makelist (<var>expr</var>, <var>i</var>, <var>i_0</var>,
<var>i_max</var>, <var>step</var>)</code>, devuelve la lista de elementos obtenidos al
aplicar <code>ev (<var>expr</var>, <var>i</var>=<var>j</var>)</code> a los elementos <var>j</var> 
de la secuencia <var>i_0</var>, <var>i_0</var> + <var>step</var>, <var>i_0</var> +
2*<var>step</var>, ..., siendo <var>|j|</var> menor o igual que <var>|i_max|</var>.
</p>
<p>El incremento <var>step</var> puede ser un n&uacute;mero (positivo o negativo) o una
expresi&oacute;n. En caso de omitirse, se utilizar&aacute; 1 como valor por defecto.
Si se omiten  <var>i_0</var> y <var>step</var>, se le asignar&aacute; a ambos 1 como valor
por defecto.
</p>
<p><code>makelist (<var>expr</var>, <var>x</var>, <var>list</var>)</code> devuelve una lista, cuyo
<code>j</code>-&eacute;simo elemento es igual a
<code>ev (<var>expr</var>, <var>x</var>=<var>list</var>[j])</code> tomando <code>j</code> valores desde
1 hasta <code>length (<var>list</var>)</code>.
</p>

<p>Ejemplos:
</p>
<pre class="example">(%i1) makelist (concat (x,i), i, 6);
(%o1)               [x1, x2, x3, x4, x5, x6]
(%i2) makelist (x=y, y, [a, b, c]);
(%o2)                 [x = a, x = b, x = c]
(%i3) makelist (x^2, x, 3, 2*%pi, 2);
(%o3)                        [9, 25]
(%i4) makelist (random(6), 4);
(%o4)                     [2, 0, 2, 5]
(%i5) flatten (makelist (makelist (i^2, 3), i, 4));
(%o5)        [1, 1, 1, 4, 4, 4, 9, 9, 9, 16, 16, 16]
(%i6) flatten (makelist (makelist (i^2, i, 3), 4));
(%o6)         [1, 4, 9, 1, 4, 9, 1, 4, 9, 1, 4, 9]
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>member</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX144"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <code>is(<var>expr_1</var> = <var>a</var>)</code>
para alg&uacute;n elemento <var>a</var> de <code>args(<var>expr_2</var>)</code>,
en caso contrario devuelve <code>false</code>.
</p>
<p>Normalmente, <code>expr_2</code> ser&aacute; una lista,
en cuyo caso <code>args(<var>expr_2</var>) = <var>expr_2</var></code>,
y la comprobaci&oacute;n ser&aacute; si <code>is(<var>expr_1</var> = <var>a</var>)</code> para 
alg&uacute;n elemento <var>a</var> de <code>expr_2</code>.
</p>
<p>La funci&oacute;n <code>member</code> no inspecciona las partes de los argumentos de <code>expr_2</code>,
por lo que puede devolver <code>false</code> si <code>expr_1</code> es parte de alguno de los argumentos de <code>expr_2</code>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>elementp</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) member (8, [8, 8.0, 8b0]);
(%o1)                         true
(%i2) member (8, [8.0, 8b0]);
(%o2)                         false
(%i3) member (b, [a, b, c]);
(%o3)                         true
(%i4) member (b, [[a, b], [b, c]]);
(%o4)                         false
(%i5) member ([b, c], [[a, b], [b, c]]);
(%o5)                         true
(%i6) F (1, 1/2, 1/4, 1/8);
                               1  1  1
(%o6)                     F(1, -, -, -)
                               2  4  8
(%i7) member (1/8, %);
(%o7)                         true
(%i8) member (&quot;ab&quot;, [&quot;aa&quot;, &quot;ab&quot;, sin(1), a + b]);
(%o8)                         true
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>ninth</b><i> (<var>expr</var>)</i>
<a name="IDX145"></a>
</dt>
<dd><p>Devuelve el noveno elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>pop</b><i> (<var>list</var>)</i>
<a name="IDX146"></a>
</dt>
<dd><p>Borra el primer elemento de la lista <var>list</var> y devuelve este
mismo elemento.
</p>
<p>Si el argumento <var>list</var> es una lista vac&iacute;a, o
simplemente no es una lista, Maxima devuelve un mensaje de error.
</p>
<p>V&eacute;ase <code>push</code> para los ejemplos.
</p>
<p>Ejec&uacute;tese <code>load(basic)</code> antes de utilizar esta funci&oacute;n.
</p></dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>push</b><i> (<var>item</var>, <var>list</var>)</i>
<a name="IDX147"></a>
</dt>
<dd><p>A&ntilde;ade al comienzo de la lista <var>list</var> el elemento <var>item</var>,
devolviendo este mismo elemento. El argumento <var>list</var> debe ser necesariamente
una lista, mientras que <var>item</var> puede ser cualquier s&iacute;mbolo
o expresi&oacute;n.
</p>
<p>Si el argumento <var>list</var> no es una lista, Maxima devuelve un
mensaje de error.
</p>
<p>V&eacute;ase <code>pop</code> para eliminar el primer elemento de una lista.
</p>
<p>Ejec&uacute;tese <code>load(basic)</code> antes de utilizar esta funci&oacute;n.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (&quot;basic&quot;)$
(%i2) ll: [];
(%o2)                          []
(%i3) push (x, ll);
(%o3)                          [x]
(%i4) push (x^2+y, ll);
                                 2
(%o4)                      [y + x , x]
(%i5) a: push (&quot;string&quot;, ll);
                                     2
(%o5)                  [string, y + x , x]
(%i6) pop (ll);
(%o6)                        string
(%i7) pop (ll);
                                  2
(%o7)                        y + x
(%i8) pop (ll);
(%o8)                           x
(%i9) ll;
(%o9)                          []
(%i10) a;
                                     2
(%o10)                 [string, y + x , x]
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>rest</b><i> (<var>expr</var>, <var>n</var>)</i>
<a name="IDX148"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>rest</b><i> (<var>expr</var>)</i>
<a name="IDX149"></a>
</dt>
<dd><p>Devuelve <var>expr</var> sin sus primeros <var>n</var> elementos si <var>n</var> es positivo, o sus &uacute;ltimos <code>- <var>n</var></code> elementos si <var>n</var> es negativo. En caso de que <var>n</var> tome el valor 1 puede ser omitido. La expresi&oacute;n  <var>expr</var> puede ser una lista, una matriz o cualquier otra expresi&oacute;n.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>reverse</b><i> (<var>lista</var>)</i>
<a name="IDX150"></a>
</dt>
<dd><p>Invierte el orden de los elementos de la <var>lista</var> (no los propios elementos). La funci&oacute;n <code>reverse</code> tambi&eacute;n opera sobre expresiones generales, como en  <code>reverse(a=b);</code> gives <code>b=a</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>second</b><i> (<var>expr</var>)</i>
<a name="IDX151"></a>
</dt>
<dd><p>Devuelve el segundo elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>seventh</b><i> (<var>expr</var>)</i>
<a name="IDX152"></a>
</dt>
<dd><p>Devuelve el s&eacute;ptimo elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>sixth</b><i> (<var>expr</var>)</i>
<a name="IDX153"></a>
</dt>
<dd><p>Devuelve el sexto elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>sort</b><i> (<var>L</var>, <var>P</var>)</i>
<a name="IDX154"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>sort</b><i> (<var>L</var>)</i>
<a name="IDX155"></a>
</dt>
<dd><p><code>sort(<var>L</var>, <var>P</var>)</code> ordena la lista <var>L</var> de acuerdo con el predicado <code>P</code>
de dos argumentos, el cual define un preorden total sobre los elementos de <var>L</var>.
Si <code><var>P</var>(a, b)</code> vale <code>true</code>, entonces <code>a</code> aparece antes que <code>b</code> en
el resultado. Si ninguna de las expresiones <code><var>P</var>(a, b)</code> y <code><var>P</var>(b, a)</code>
valen <code>true</code>, entonces <code>a</code> y <code>b</code> son equivalentes y aparecen en el
resultado en el mismo orden que a la entrada; esto es, <code>sort</code> es un orden estable.
</p>
<p>Si tanto <code><var>P</var>(a, b)</code> como <code><var>P</var>(b, a)</code> valen ambos <code>true</code> para
algunos elementos de <var>L</var>, entonces <var>P</var> no es un predicado de orden correcto,
siento entonces el resultado indefinido. Si <code><var>P</var>(a, b)</code> toma un valor diferente
a <code>true</code> o <code>false</code>, entonces <code>sort</code> devuelve un error.
</p>
<p>El predicado puede especificarse como el nombre de una funci&oacute;n, de una operaci&oacute;n binaria
infija o como una expresi&oacute;n <code>lambda</code>. Si se especifica con el nombre de un operador,
dicho nombre debe encerrarse con comillas dobles.
</p>
<p>La lista ordenada se devuelve como un nuevo objeto, no modific&aacute;ndose el argumento <var>L</var>.
</p>
<p><code>sort(<var>L</var>)</code> equivale a <code>sort(<var>L</var>, orderlessp)</code>.
</p>
<p>La ordenaci&oacute;n por defecto es ascendente, tal como queda determinada por <code>orderlessp</code>.
El predicado <code>ordergreatp</code> ordena las listas en orden descendente.
</p>
<p>Todos los &aacute;tomos y expresiones de Maxima son comparables respecto de los predicados
<code>orderlessp</code> y <code>ordergreatp</code>.
</p>
<p>Los operadores <code>&lt;</code> y <code>&gt;</code> ordenan n&uacute;meros, constantes y expresiones constantes por
magnitud. N&oacute;tese que <code>orderlessp</code> y <code>ordergreatp</code> no ordenan n&uacute;meros, 
constantes y expresiones constantes por magnitud.
</p>
<p><code>ordermagnitudep</code> ordena n&uacute;meros, constantes y expresiones constantes de igual modo
que lo hace <code>&lt;</code>, y cualesquiera otros elementos lo hace igual que <code>orderlessp</code>.
</p>
<p>Ejemplos:
</p>
<p><code>sort</code> ordena una lista respecto de un predicado de dos argumentos que define un
preorden total en los elementos de la lista.
</p>
<pre class="example">(%i1) sort ([1, a, b, 2, 3, c], 'orderlessp);
(%o1)                  [1, 2, 3, a, b, c]
(%i2) sort ([1, a, b, 2, 3, c], 'ordergreatp);
(%o2)                  [c, b, a, 3, 2, 1]
</pre>
<p>El predicado puede especificarse con el nombre de una funci&oacute;n, de un
operador binario infijo o una expresi&oacute;n <code>lambda</code>. Si se especifica
con el nombre de un operador, dicho nombre debe encerrarse con comillas dobles.
</p>
<pre class="example">(%i1) L : [[1, x], [3, y], [4, w], [2, z]];
(%o1)           [[1, x], [3, y], [4, w], [2, z]]
(%i2) foo (a, b) := a[1] &gt; b[1];
(%o2)                 foo(a, b) := a  &gt; b
                                    1    1
(%i3) sort (L, 'foo);
(%o3)           [[4, w], [3, y], [2, z], [1, x]]
(%i4) infix (&quot;&gt;&gt;&quot;);
(%o4)                          &gt;&gt;
(%i5) a &gt;&gt; b := a[1] &gt; b[1];
(%o5)                   a &gt;&gt; b := a  &gt; b
                                   1    1
(%i6) sort (L, &quot;&gt;&gt;&quot;);
(%o6)           [[4, w], [3, y], [2, z], [1, x]]
(%i7) sort (L, lambda ([a, b], a[1] &gt; b[1]));
(%o7)           [[4, w], [3, y], [2, z], [1, x]]
</pre>
<p><code>sort(<var>L</var>)</code> equivale a <code>sort(<var>L</var>, orderlessp)</code>.
</p>
<pre class="example">(%i1) L : [a, 2*b, -5, 7, 1 + %e, %pi];
(%o1)             [a, 2 b, - 5, 7, %e + 1, %pi]
(%i2) sort (L);
(%o2)             [- 5, 7, %e + 1, %pi, a, 2 b]
(%i3) sort (L, 'orderlessp);
(%o3)             [- 5, 7, %e + 1, %pi, a, 2 b]
</pre>
<p>La ordenaci&oacute;n por defecto es ascendente, tal como queda determinada por <code>orderlessp</code>.
El predicado <code>ordergreatp</code> ordena las listas en orden descendente.
</p>
<pre class="example">(%i1) L : [a, 2*b, -5, 7, 1 + %e, %pi];
(%o1)                    [a, 2 b, - 5, 7, %e + 1, %pi]
(%i2) sort (L);
(%o2)                    [- 5, 7, %e + 1, %pi, a, 2 b]
(%i3) sort (L, 'ordergreatp);
(%o3)                    [2 b, a, %pi, %e + 1, 7, - 5]
</pre>
<p>Todos los &aacute;tomos y expresiones de Maxima son comparables respecto de los predicados
<code>orderlessp</code> y <code>ordergreatp</code>.
</p>
<pre class="example">(%i1) L : [11, -17, 29b0, 9*c, 7.55, foo(x, y), -5/2, b + a];
                                                 5
(%o1)  [11, - 17, 2.9b1, 9 c, 7.55, foo(x, y), - -, b + a]
                                                 2
(%i2) sort (L, orderlessp);
                5
(%o2)  [- 17, - -, 7.55, 11, 2.9b1, b + a, 9 c, foo(x, y)]
                2
(%i3) sort (L, ordergreatp);
                                                  5
(%o3)  [foo(x, y), 9 c, b + a, 2.9b1, 11, 7.55, - -, - 17]
                                                  2
</pre>
<p>Los operadores <code>&lt;</code> y <code>&gt;</code> ordenan n&uacute;meros, constantes y expresiones constantes por
magnitud. N&oacute;tese que <code>orderlessp</code> y <code>ordergreatp</code> no ordenan n&uacute;meros, 
constantes y expresiones constantes por magnitud.
</p>
<pre class="example">(%i1) L : [%pi, 3, 4, %e, %gamma];
(%o1)                [%pi, 3, 4, %e, %gamma]
(%i2) sort (L, &quot;&gt;&quot;);
(%o2)                [4, %pi, 3, %e, %gamma]
(%i3) sort (L, ordergreatp);
(%o3)                [%pi, %gamma, %e, 4, 3]
</pre>
<p><code>ordermagnitudep</code> ordena n&uacute;meros, constantes y expresiones constantes de igual modo
que lo hace <code>&lt;</code>, y cualesquiera otros elementos lo hace igual que <code>orderlessp</code>.
</p>
<pre class="example">(%i1) L : [%i, 1+%i, 2*x, minf, inf, %e, sin(1), 0, 1, 2, 3, 1.0, 1.0b0];
(%o1) [%i, %i + 1, 2 x, minf, inf, %e, sin(1), 0, 1, 2, 3, 1.0, 
                                                           1.0b0]
(%i2) sort (L, ordermagnitudep);
(%o2) [minf, 0, sin(1), 1, 1.0, 1.0b0, 2, %e, 3, inf, %i, 
                                                     %i + 1, 2 x]
(%i3) sort (L, orderlessp);
(%o3) [0, 1, 1.0, 2, 3, %e, %i, %i + 1, inf, minf, sin(1), 
                                                      1.0b0, 2 x]
</pre></dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>sublist</b><i> (<var>list</var>, <var>p</var>)</i>
<a name="IDX156"></a>
</dt>
<dd><p>Devuelve la lista de elementos de <var>list</var> para los cuales el predicado <code>p</code> retorna <code>true</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) L: [1, 2, 3, 4, 5, 6];
(%o1)                  [1, 2, 3, 4, 5, 6]
(%i2) sublist (L, evenp);
(%o2)                       [2, 4, 6]
</pre>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>sublist_indices</b><i> (<var>L</var>, <var>P</var>)</i>
<a name="IDX157"></a>
</dt>
<dd><p>Devuelve los &iacute;ndices de los elementos <code>x</code> de la
lista <var>L</var> para la cual el predicado <code>maybe(<var>P</var>(x))</code>
devuelve <code>true</code>, lo que excluye a <code>unknown</code> y a <code>false</code>.
<var>P</var> puede ser el nombre de una funci&oacute;n o de una expresi&oacute;n lambda.
<var>L</var> debe ser una lista literal.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) sublist_indices ('[a, b, b, c, 1, 2, b, 3, b],
                       lambda ([x], x='b));
(%o1)                     [2, 3, 7, 9]
(%i2) sublist_indices ('[a, b, b, c, 1, 2, b, 3, b], symbolp);
(%o2)                  [1, 2, 3, 4, 7, 9]
(%i3) sublist_indices ([1 &gt; 0, 1 &lt; 0, 2 &lt; 1, 2 &gt; 1, 2 &gt; 0],
                       identity);
(%o3)                       [1, 4, 5]
(%i4) assume (x &lt; -1);
(%o4)                       [x &lt; - 1]
(%i5) map (maybe, [x &gt; 0, x &lt; 0, x &lt; -2]);
(%o5)                [false, true, unknown]
(%i6) sublist_indices ([x &gt; 0, x &lt; 0, x &lt; -2], identity);
(%o6)                          [2]
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>unique</b><i> (<var>L</var>)</i>
<a name="IDX158"></a>
</dt>
<dd><p>Devuelve la lista <var>L</var> sin redundancias, es decir, sin
elementos repetidos
</p>
<p>Cuando ninguno de los elementos de <var>L</var> est&aacute; repetido,
<code>unique</code> devuelve una r&eacute;plica de <var>L</var>, no la
propia <var>L</var>.
</p>
<p>Si <var>L</var> no es una lista, <code>unique</code> devuelve <var>L</var>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) unique ([1, %pi, a + b, 2, 1, %e, %pi, a + b, [1]]);
(%o1)              [1, 2, %e, %pi, [1], b + a]
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>tenth</b><i> (<var>expr</var>)</i>
<a name="IDX159"></a>
</dt>
<dd><p>Devuelve el d&eacute;cimo elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>third</b><i> (<var>expr</var>)</i>
<a name="IDX160"></a>
</dt>
<dd><p>Devuelve el tercer elemento de la lista o expresi&oacute;n <var>expr</var>. V&eacute;ase <code>first</code> para m&aacute;s detalles.
</p>
</dd></dl>



<hr size="6">
<a name="Arrays"></a>
<a name="SEC33"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC32" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC34" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC18" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.5 Arrays </h2>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC34">5.5.1 Introducci&oacute;n a los arrays</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC35">5.5.2 Funciones y variables para los arrays</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>



<hr size="6">
<a name="Introducci_00f3n-a-los-arrays"></a>
<a name="SEC34"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC33" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC35" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC33" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.5.1 Introducci&oacute;n a los arrays </h3>

<p>Los arrays m&aacute;s flexibles son aquellos que no necesitan ser declarados, llamados
tambi&eacute;n, en ingl&eacute;s, <i>hashed-arrays</i>, y se basan en que a una variable
subindicada se le puede asignar un valor cualquiera. Los &iacute;ndices
no necesitan ser n&uacute;meros enteros, admiti&eacute;ndose s&iacute;mbolos o
expresiones. Los arrays no declarados crecen din&aacute;micamente seg&uacute;n se le van
asignando valores a sus elementos. En el siguiente ejemplo se muestra c&oacute;mo
se va construyendo un array no declarado <code>a</code>. Para obtener un listado de
los elementos de un array se utiliza la funci&oacute;n <code>listarray</code>.
</p>
<pre class="example">(%i1) a[1,2]: 99;
(%o1)                          99
(%i2) a[x,y]: x^y;
                                y
(%o2)                          x
(%i3) listarray(a);
                                  y
(%o3)                       [99, x ]
</pre>
<p>Otro tipo de arrays son los declarados, los cuales admiten hasta cinco dimensiones
y pueden guardar valores de un tipo concreto, como <code>fixnum</code> para enteros o
<code>flonum</code> para reales de coma flotante. Maxima distingue dos tipos de arrays
declarados; los primeros se pueden definir declarando un s&iacute;mbolo
como array, haciendo uso de la funci&oacute;n <code>array</code>; los segundos son arrays
de Lisp, en los que un s&iacute;mbolo se declara como tal con la
funci&oacute;n <code>make_array</code>.
</p>
<p>En el primer ejemplo se declara el s&iacute;mbolo <code>a</code> como array,
mientras que en el segundo se declara <code>b</code> como array de Lisp.
</p>
<pre class="example">(%i1) array(a, fixnum, 2, 2);
(%o1)                           a
(%i2) b: make_array(fixnum, 2, 2);
(%o2)              {Array:  #2A((0 0) (0 0))}
</pre>
<p>Cuando a la variable opcional <code>use_fast_arrays</code> se le asigna el valor
<code>true</code>, la funci&oacute;n <code>array</code> tambi&eacute;n generar&aacute; un array de Lisp.
Tal es lo que sucede en el ejemplo siguiente, en el que el s&iacute;mbolo
<code>c</code> queda declarado como array de Lisp. T&eacute;ngase en cuenta que por este
m&eacute;todo no se puede asignar el tipo de array, ya que al introducirle el tipo
<code>fixnum</code> se genera un mensaje de error.
</p>
<pre class="example">(%i3) use_fast_arrays: true;
(%o3)                         true
(%i4) array(c, 2, 2);
(%o4)    #2A((NIL NIL NIL) (NIL NIL NIL) (NIL NIL NIL))
(%i5) c;
(%o5)    #2A((NIL NIL NIL) (NIL NIL NIL) (NIL NIL NIL))
(%i6) array(c, fixnum, 2, 2);

make_array: dimensions must be integers; found [fixnum + 1, 3, 3]
 -- an error. To debug this try: debugmode(true);
</pre>
<p>Maxima tambi&eacute;n dispone de funciones array, que pueden almacenar
valores de funciones, y de funciones subindicadas.
</p>
<p>Se puede encontrar m&aacute;s informaci&oacute;n en las descripciones de las
funciones. Los siguientes s&iacute;mbolos y funciones de Maxima
permiten trabajar con arrays:
</p>
<pre class="verbatim">   array         arrayapply     arrayinfo   
   arraymake     arrays         fillarray
   listarray     make_array     rearray
   remarray      subvar         subvarp
   use_fast_arrays
</pre>








<hr size="6">
<a name="Funciones-y-variables-para-los-arrays"></a>
<a name="SEC35"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC34" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC36" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC33" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.5.2 Funciones y variables para los arrays </h3>

<dl>
<dt><u>Funci&oacute;n:</u> <b>array</b><i> (<var>nombre</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX161"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>array</b><i> (<var>nombre</var>, <var>type</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX162"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>array</b><i> ([<var>nombre_1</var>, ..., <var>nombre_m</var>], <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX163"></a>
</dt>
<dd><p>Crea un array de dimensi&oacute;n <em>n</em>, que debe ser menor o igual que 5. Los sub&iacute;ndices de la <em>i</em>-&eacute;sima dimensi&oacute;n son enteros que toman valores entre 0 y <var>dim_i</var>.  
</p>
<p>La llamada <code>array (<var>nombre</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</code> crea un array de tipo general.
</p>
<p>La llamada <code>array (<var>nombre</var>, <var>type</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</code> crea un array con sus elementos del tipo especificado. El tipo <var>type</var> puede ser <code>fixnum</code> para enteros de tama&ntilde;o limitado o <code>flonum</code> para n&uacute;meros decimales en coma flotante.
</p>
<p>La llamada <code>array ([<var>nombre_1</var>, ..., <var>nombre_m</var>], <var>dim_1</var>, ..., <var>dim_n</var>)</code>
crea <em>m</em> arrays,  todos ellos de igual dimensi&oacute;n.
</p>
<p>Si el usuario asigna un valor a una variable subindicada antes de declarar el array correspondiente, entonces se construye un array no declarado. Los arrays no declarados, tambi&eacute;n conocidos por el nombre de &quot;arrays de claves&quot; (hashed arrays), son m&aacute;s generales que los arrays declarados. El usuario no necesita declarar su tama&ntilde;o m&aacute;ximo y pueden ir creciendo de forma din&aacute;mica. Los sub&iacute;ndices de los arrays no declarados no necesitan ser necesariamente n&uacute;meros. Sin embargo, a menos que un array tenga sus elementos dispersos, probablemente sea m&aacute;s eficiente declararlo siempre que sea posible antes que dejarlo como no declarado. La funci&oacute;n <code>array</code> puede utilizarse para transformar un array no declarado a a uno declarado.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>arrayapply</b><i> (<var>A</var>, [<var>i_1</var>, ..., <var>i_n</var>])</i>
<a name="IDX164"></a>
</dt>
<dd><p>Eval&uacute;a <code><var>A</var> [<var>i_1</var>, ..., <var>i_n</var>]</code>, donde <var>A</var> es un array y <var>i_1</var>, ..., <var>i_n</var> son enteros.
</p>
<p>Esto es como <code>apply</code>, excepto por el hecho de que el primer argumento es un array en lugar de una funci&oacute;n.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>arrayinfo</b><i> (<var>A</var>)</i>
<a name="IDX165"></a>
</dt>
<dd><p>Devuelve informaci&oacute;n sobre el array<var>A</var>.
El argumento <var>A</var> puede ser un array declarado o no declarado,
una funci&oacute;n array o una funci&oacute;n subindicada.
</p>
<p>En el caso de arrays declarados, <code>arrayinfo</code> devuelve una
lista que contiene el &aacute;tomo <code>declared</code>, el n&uacute;mero de
dimensiones y el tama&ntilde;o de cada dimensi&oacute;n.
Los elementos del array, tanto los que tienen valores
asignados como los que no, son devueltos por <code>listarray</code>.
</p>
<p>En el caso de arrays no declarados (<i>hashed arrays</i>), <code>arrayinfo</code>
devuelve una lista que contiene el &aacute;tomo <code>hashed</code>, el n&uacute;mero
de sub&iacute;ndices y los sub&iacute;ndices de aquellos
elementos que guarden un valor. Los valores son devueltos por <code>listarray</code>.
</p>
<p>En el caso de funciones array, <code>arrayinfo</code> devuelve una lista que 
contiene el &aacute;tomo <code>hashed</code>, el n&uacute;mero de sub&iacute;ndices
y los sub&iacute;ndices para los que la funci&oacute;n tiene valores almacenados.
Los valores almacenados de la funci&oacute;n array son devueltos por <code>listarray</code>.
</p>
<p>En el caso de funciones subindicadas, <code>arrayinfo</code> devuelve una lista que
contiene el &aacute;tomo <code>hashed</code>, el n&uacute;mero de sub&iacute;ndices y
los sub&iacute;ndices para los que hay expresiones lambda.
Las expresiones lambda son devueltas por <code>listarray</code>.
</p>
<p>Ejemplos:
</p>
<p><code>arrayinfo</code> y <code>listarray</code> aplicadas a una array declarado.
</p>
<pre class="example">(%i1) array (aa, 2, 3);
(%o1)                          aa
(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
(%i3) aa [1, 2] : %e;
(%o3)                          %e
(%i4) arrayinfo (aa);
(%o4)                 [declared, 2, [2, 3]]
(%i5) listarray (aa);
(%o5) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
</pre>
<p><code>arrayinfo</code> y <code>listarray</code> aplicadas a una array no declarado (<i>hashed arrays</i>).
</p>
<pre class="example">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
(%i3) arrayinfo (bb);
(%o3)               [hashed, 1, [BAR], [FOO]]
(%i4) listarray (bb);
                              3         2
(%o4)                 [(c - d) , (b + a) ]
</pre>
<p><code>arrayinfo</code> y <code>listarray</code> aplicadas a una funci&oacute;n array.
</p>
<pre class="example">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
(%i4) arrayinfo (cc);
(%o4)              [hashed, 2, [4, z], [u, v]]
(%i5) listarray (cc);
                              z  v
(%o5)                        [-, -]
                              4  u
</pre>
<p><code>arrayinfo</code> y <code>listarray</code> aplicadas a una funci&oacute;n subindicada.
</p>
<pre class="example">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
(%i4) arrayinfo (dd);
(%o4)             [hashed, 1, [b + a], [v - u]]
(%i5) listarray (dd);
                         b + a                v - u
(%o5)      [lambda([y], y     ), lambda([y], y     )]
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>arraymake</b><i> (<var>name</var>, [<var>i_1</var>, ..., <var>i_n</var>])</i>
<a name="IDX166"></a>
</dt>
<dd><p>El resultado es una referencia a array no evaluada.
</p>
<p>Devuelve la expresi&oacute;n <code><var>name</var> [<var>i_1</var>, ..., <var>i_n</var>]</code>.
</p>
<p>Esta funci&oacute;n es similar a <code>funmake</code>, excepto que el valor retornado es referencia a un array no evaluado, en lugar de una llamada a una funci&oacute;n no evaluada.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) arraymake (A, [1]);
(%o1)                          A
                                1
(%i2) arraymake (A, [k]);
(%o2)                          A
                                k
(%i3) arraymake (A, [i, j, 3]);
(%o3)                       A
                             i, j, 3
(%i4) array (A, fixnum, 10);
(%o4)                           A
(%i5) fillarray (A, makelist (i^2, i, 1, 11));
(%o5)                           A
(%i6) arraymake (A, [5]); 
(%o6)                          A
                                5
(%i7) ''%;
(%o7)                          36
(%i8) L : [a, b, c, d, e];
(%o8)                    [a, b, c, d, e]
(%i9) arraymake ('L, [n]);
(%o9)                          L
                                n
(%i10) ''%, n = 3;
(%o10)                          c
(%i11) A2 : make_array (fixnum, 10);
(%o11)          {Array:  #(0 0 0 0 0 0 0 0 0 0)}
(%i12) fillarray (A2, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o12)          {Array:  #(1 2 3 4 5 6 7 8 9 10)}
(%i13) arraymake ('A2, [8]);
(%o13)                         A2
                                 8
(%i14) ''%;
(%o14)                          9
</pre>
</dd></dl>

<dl>
<dt><u>Variable del sistema:</u> <b>arrays</b>
<a name="IDX167"></a>
</dt>
<dd><p>Valor por defecto: <code>[]</code>
La variable <code>arrays</code> es una lista con todos los arrays que han sido alojados,
lo que comprende a los arrays declarados por <code>array</code>, a los
no declarados (<i>hashed arrays</i>) construidos impl&iacute;citamente
(asignando algo al elemento de un array) y a las funciones array definidas
mediante <code>:=</code> y <code>define</code>.
Los arrays definidos mediante <code>make_array</code> no se incluyen en
este grupo.
</p>
<p>V&eacute;anse tambi&eacute;n
<code>array</code>, <code>arrayapply</code>, <code>arrayinfo</code>, <code>arraymake</code>, 
<code>fillarray</code>, <code>listarray</code> y <code>rearray</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) array (aa, 5, 7);
(%o1)                          aa
(%i2) bb [FOO] : (a + b)^2;
                                   2
(%o2)                       (b + a)
(%i3) cc [x] := x/100;
                                   x
(%o3)                      cc  := ---
                             x    100
(%i4) dd : make_array ('any, 7);
(%o4)       {Array:  #(NIL NIL NIL NIL NIL NIL NIL)}
(%i5) arrays;
(%o5)                     [aa, bb, cc]
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>arraysetapply</b><i> (<var>A</var>, [<var>i_1</var>, &hellip;, <var>i_n</var>], <var>x</var>)</i>
<a name="IDX168"></a>
</dt>
<dd><p>Asigna <var>x</var> a <code><var>A</var>[<var>i_1</var>, ..., <var>i_n</var>]</code>,
siendo <var>A</var> un array y <var>i_1</var>, &hellip;, <var>i_n</var> enteros.
</p>
<p><code>arraysetapply</code> eval&uacute;a sus argumentos..
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>fillarray</b><i> (<var>A</var>, <var>B</var>)</i>
<a name="IDX169"></a>
</dt>
<dd><p>Rellena el array <var>A</var> con los valores de <var>B</var>, que puede ser una lista o array.
</p>
<p>Si se ha declarado <var>A</var> de un determinado tipo en el momento de su
creaci&oacute;n, s&oacute;lo podr&aacute; contener elementos de ese tipo, produci&eacute;ndose
un error en caso de intentar asignarle un elemento de tipo distinto.
</p>
<p>Si las dimensiones de los arrays <var>A</var> y <var>B</var> son diferentes,
<var>A</var> se rellena seg&uacute;n el orden de las filas. Si no hay 
suficientes elementos en <var>B</var> el &uacute;ltimo elemento se utiliza 
para cubrir el resto de <var>A</var>. Si hay demasiados, los elementos 
sobrantes son ignorados.
</p>
<p>La funci&oacute;n <code>fillarray</code> devuelve su primer argumento.
</p>
<p>Ejemplos:
</p>
<p>Creaci&oacute;n de un array de 9 elementos y posterior relleno a partir de una lista.
</p>
<pre class="example">(%i1) array (a1, fixnum, 8);
(%o1)                          a1
(%i2) listarray (a1);
(%o2)              [0, 0, 0, 0, 0, 0, 0, 0, 0]
(%i3) fillarray (a1, [1, 2, 3, 4, 5, 6, 7, 8, 9]);
(%o3)                          a1
(%i4) listarray (a1);
(%o4)              [1, 2, 3, 4, 5, 6, 7, 8, 9]
</pre>
<p>Si no hay suficientes elementos para cubrir el array, se repite el
&uacute;ltimo elemento. Si hay demasiados, los elementos 
sobrantes son ignorados.
</p>
<pre class="example">(%i1) a2 : make_array (fixnum, 8);
(%o1)             {Array:  #(0 0 0 0 0 0 0 0)}
(%i2) fillarray (a2, [1, 2, 3, 4, 5]);
(%o2)             {Array:  #(1 2 3 4 5 5 5 5)}
(%i3) fillarray (a2, [4]);
(%o3)             {Array:  #(4 4 4 4 4 4 4 4)}
(%i4) fillarray (a2, makelist (i, i, 1, 100));
(%o4)             {Array:  #(1 2 3 4 5 6 7 8)}
</pre>
<p>Arrays multidimensionales se rellenan seg&uacute;n el orden de las filas.
</p>
<pre class="example">(%i1) a3 : make_array (fixnum, 2, 5);
(%o1)        {Array:  #2A((0 0 0 0 0) (0 0 0 0 0))}
(%i2) fillarray (a3, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o2)        {Array:  #2A((1 2 3 4 5) (6 7 8 9 10))}
(%i3) a4 : make_array (fixnum, 5, 2);
(%o3)     {Array:  #2A((0 0) (0 0) (0 0) (0 0) (0 0))}
(%i4) fillarray (a4, a3);
(%o4)     {Array:  #2A((1 2) (3 4) (5 6) (7 8) (9 10))}
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>listarray</b><i> (<var>A</var>)</i>
<a name="IDX170"></a>
</dt>
<dd><p>Devuelve una lista con los elementos del array <var>A</var>.
El argumento <var>A</var> puede ser un array declarado o no declarado,
una funci&oacute;n array o una funci&oacute;n subindicada.
</p>
<p>Los elementos se ordenan en primera instancia respecto del primer 
&iacute;ndice, despu&eacute;s respecto del segundo &iacute;ndice
y as&iacute; sucesivamente.
La ordenaci&oacute;n de los &iacute;ndices es la misma que la 
establecida por <code>orderless</code>.
</p>
<p>En el caso de arrays no declarados, funciones array y funciones
subindicadas, los elementos corresponden a los &iacute;ndices
devueltos por <code>arrayinfo</code>.
</p>
<p>Los elementos de los arrays declarados que no tienen valores asignados
(excepto <code>fixnum</code> y <code>flonum</code>) se devuelven como <code>#####</code>.
Los elementos sin valores asignados de los arrays <code>fixnum</code> y <code>flonum</code>
son devueltos como 0 y 0.0, respectivamente.
Los elementos sin valor asignado de los arrays no declarados, 
funciones array y funciones subindicadas no son devueltos.
</p>
<p>Ejemplos:
</p>
<p><code>listarray</code> y <code>arrayinfo</code> aplicadas a un array declarado.
</p>
<pre class="example">(%i1) array (aa, 2, 3);
(%o1)                          aa
(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
(%i3) aa [1, 2] : %e;
(%o3)                          %e
(%i4) listarray (aa);
(%o4) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
(%i5) arrayinfo (aa);
(%o5)                 [declared, 2, [2, 3]]
</pre>
<p><code>listarray</code> y <code>arrayinfo</code> aplicadas a un array no declarado (<i>hashed array</i>).
</p>
<pre class="example">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
(%i3) listarray (bb);
                              3         2
(%o3)                 [(c - d) , (b + a) ]
(%i4) arrayinfo (bb);
(%o4)               [hashed, 1, [BAR], [FOO]]
</pre>
<p><code>listarray</code> y <code>arrayinfo</code> aplicadas a una funci&oacute;n array.
</p>
<pre class="example">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
(%i4) listarray (cc);
                              z  v
(%o4)                        [-, -]
                              4  u
(%i5) arrayinfo (cc);
(%o5)              [hashed, 2, [4, z], [u, v]]
</pre>
<p><code>listarray</code> y <code>arrayinfo</code> aplicadas a una funci&oacute;n subindicada.
</p>
<pre class="example">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
(%i4) listarray (dd);
                         b + a                v - u
(%o4)      [lambda([y], y     ), lambda([y], y     )]
(%i5) arrayinfo (dd);
(%o5)             [hashed, 1, [b + a], [v - u]]
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>make_array</b><i> (<var>tipo</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX171"></a>
</dt>
<dd><p>Construye y devuelve un array de Lisp. El argumento <var>tipo</var> puede ser
<code>any</code>, <code>flonum</code>, <code>fixnum</code>, <code>hashed</code> o <code>functional</code>.
Hay <em>n</em> &iacute;ndices, y el &iacute;ndice <em>i</em>-&eacute;simo
va de  0 a <em><var>dim_i</var> - 1</em>.
</p>
<p>La ventaja de <code>make_array</code> sobre <code>array</code> estriba en que el valor
retornado no tiene nombre, y una vez que un puntero deja de referenciarlo,
el valor desaparece. Por ejemplo, si <code>y: make_array (...)</code> entonces
<code>y</code> apunta a un objeto que ocupa cierto espacio en la memoria, pero
despu&eacute;s de <code>y: false</code>, <code>y</code> ya no apunta al objeto, por lo
que &eacute;ste puede ser considerado basura y posteriormente eliminado.  
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) A1 : make_array (fixnum, 10);
(%o1)           {Array:  #(0 0 0 0 0 0 0 0 0 0)}
(%i2) A1 [8] : 1729;
(%o2)                         1729
(%i3) A1;
(%o3)          {Array:  #(0 0 0 0 0 0 0 0 1729 0)}
(%i4) A2 : make_array (flonum, 10);
(%o4) {Array:  #(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
(%i5) A2 [2] : 2.718281828;
(%o5)                      2.718281828
(%i6) A2;
(%o6) 
     {Array:  #(0.0 0.0 2.718281828 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
(%i7) A3 : make_array (any, 10);
(%o7) {Array:  #(NIL NIL NIL NIL NIL NIL NIL NIL NIL NIL)}
(%i8) A3 [4] : x - y - z;
(%o8)                      - z - y + x
(%i9) A3;
(%o9) {Array:  #(NIL NIL NIL NIL ((MPLUS SIMP) $X ((MTIMES SIMP)\
 -1 $Y) ((MTIMES SIMP) -1 $Z))
  NIL NIL NIL NIL NIL)}
(%i10) A4 : make_array (fixnum, 2, 3, 5);
(%o10) {Array:  #3A(((0 0 0 0 0) (0 0 0 0 0) (0 0 0 0 0)) ((0 0 \
0 0 0) (0 0 0 0 0) (0 0 0 0 0)))}
(%i11) fillarray (A4, makelist (i, i, 1, 2*3*5));
(%o11) {Array:  #3A(((1 2 3 4 5) (6 7 8 9 10) (11 12 13 14 15))
    ((16 17 18 19 20) (21 22 23 24 25) (26 27 28 29 30)))}
(%i12) A4 [0, 2, 1];
(%o12)                         12
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>rearray</b><i> (<var>A</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</i>
<a name="IDX172"></a>
</dt>
<dd><p>Cambia las dimensiones de un array. El nuevo array ser&aacute; rellenado con los elementos del viejo seg&uacute;n el orden de las filas. Si el array antiguo era demasiado peque&ntilde;o, los elementos restantes se rellenan con <code>false</code>, <code>0.0</code> o <code>0</code>, dependiendo del tipo del array. El tipo del array no se puede cambiar.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>remarray</b><i> (<var>A_1</var>, ..., <var>A_n</var>)</i>
<a name="IDX173"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>remarray</b><i> (all)</i>
<a name="IDX174"></a>
</dt>
<dd><p>Borra los arrays y las funciones relacionadas con ellos, liberando el espacio de memoria ocupado.
Los argumentos pueden ser arrays declarados, arrays no declarados (<i>hashed arrays</i>), 
funciones array y funciones subindicadas.
</p>
<p>La llamada <code>remarray (all)</code> borra todos los elementos de la lista global <code>arrays</code>.
</p>
<p>La funci&oacute;n <code>remarray</code> devuelve la lista de los arrays borrados.
</p>
<p>La funci&oacute;n <code>remarray</code> no eval&uacute;a sus argumentos.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>subvar</b><i> (<var>x</var>, <var>i</var>)</i>
<a name="IDX175"></a>
</dt>
<dd><p>Eval&uacute;a la expresi&oacute;n subindicada <code><var>x</var>[<var>i</var>]</code>.
</p>
<p>La funci&oacute;n <code>subvar</code> eval&uacute;a sus argumentos.
</p>
<p>La instrucci&oacute;n <code>arraymake (<var>x</var>, [<var>i</var>]</code> construye la expresi&oacute;n <code><var>x</var>[<var>i</var>]</code>,
pero no la eval&uacute;a.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) x : foo $

(%i2) i : 3 $

(%i3) subvar (x, i);
(%o3)                         foo
                                 3
(%i4) foo : [aa, bb, cc, dd, ee]$

(%i5) subvar (x, i);
(%o5)                          cc
(%i6) arraymake (x, [i]);
(%o6)                         foo
                                 3
(%i7) ''%;
(%o7)                          cc
</pre>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>subvarp</b><i> (<var>expr</var>)</i>
<a name="IDX176"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es una variable subindicada, como <code>a[i]</code>.
</p>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>use_fast_arrays</b>
<a name="IDX177"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>use_fast_arrays</code> vale <code>true</code> entonces tan solo se reconocen dos tipos de arrays. 
</p>
 
</dd></dl>




<hr size="6">
<a name="Estructuras"></a>
<a name="SEC36"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC35" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC37" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC18" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.6 Estructuras </h2>



<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC37">5.6.1 Introducci&oacute;n a las estructuras</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">       
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC38">5.6.2 Funciones y variables para las estructuras</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">       
</td></tr>
</table>

<hr size="6">
<a name="Introducci_00f3n-a-las-estructuras"></a>
<a name="SEC37"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC36" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC38" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC36" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.6.1 Introducci&oacute;n a las estructuras </h3>

<p>Maxima dispone de estructuras para la agregaci&oacute;n de datos.
Una estructura es una expresi&oacute;n en la que los argumentos se definen con
un nombre (nombre del campo) y la estructura en su conjunto se define por
medio de su operador (nombre de la estructura). Los valores dados a los 
campos pueden ser expresiones cualesquiera.
</p>
<p>Una estructura se define con la funci&oacute;n <code>defstruct</code>, guardando la
variable <code>structures</code> la lista de todas las estructuras definidas
por el usuario. El operador <code>@</code> permite hacer referencias a los
campos de la estructura. Con <code>kill(<var>S</var>)</code> se borra la estructura
<var>S</var> completa y <code>kill(<var>x</var>@ <var>a</var>)</code> elimina la asignaci&oacute;n
actual del campo <var>a</var> en la estructura <var>x</var>.
</p>
<p>En la impresi&oacute;n por consola (con <code>display2d</code> igual a <code>true</code>),
las estructuras se representan con las asignaciones de los campos en forma de ecuaci&oacute;n,
con el nombre del campo a la izquierda y su valor asociado a la derecha. En la
impresi&oacute;n unidimensional (mediante <code>grind</code> o d&aacute;ndole a <code>display2d</code>
el valor <code>false</code>), las estructuras se escriben sin los nombres de los campos.
</p>
<p>No es posible utilizar el nombre de un campo como nombre de funci&oacute;n, pero el
valor de un campo s&iacute; puede ser una expresi&oacute;n lambda.
Tampoco es posible restringir los valores de los campos a tipos de datos
concretos, siendo el caso que a cada campo se le puede asignar cualquier
tipo de expresi&oacute;n. Por &uacute;ltimo, no es posible hacer que ciertos campos
sean o no accesibles desde determinados contextos, ya que todos los campos
son siempre visibles.
</p>



<hr size="6">
<a name="Funciones-y-variables-para-las-estructuras"></a>
<a name="SEC38"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC37" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC36" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.6.2 Funciones y variables para las estructuras </h3>

<dl>
<dt><u>Variable global:</u> <b>structures</b>
<a name="IDX178"></a>
</dt>
<dd><p><code>structures</code> es la lista que contiene las estructuras definidas por el usuario con <code>defstruct</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>defstruct</b><i> (<var>S</var>(<var>a_1</var>, ..., <var>a_n</var>))</i>
<a name="IDX179"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>defstruct</b><i> (<var>S</var>(<var>a_1</var> = <var>v_1</var>, ..., <var>a_n</var> = <var>v_n</var>))</i>
<a name="IDX180"></a>
</dt>
<dd><p>Define una estructura, la cual es una lista de nombres de campos <var>a_1</var>, ..., <var>a_n</var>
asociados a un s&iacute;mbolo <var>S</var>.
Todo individuo de una estructura dada consiste en una expresi&oacute;n con operador <var>S</var>
y exactamente <code>n</code> argumentos. La sentencia <code>new(<var>S</var>)</code> crea un nuevo
individuo con estructura <var>S</var>.
</p>
<p>Un argumento consistente en un s&iacute;mbolo <var>a</var> especifica el nombre de
un campo. Un argumento consistente en una ecuaci&oacute;n <code><var>a</var> = <var>v</var></code> especifica
el nombre del campo <var>a</var> junto con su valor por defecto <var>v</var>. El valor por
defecto puede ser cualquier tipo de expresi&oacute;n.
</p>
<p>La llamada a <code>defstruct</code> a&ntilde;ade <var>S</var> a la lista de estructuras definidas
por el usuario, <code>structures</code>.
</p>
<p>La sentencia <code>kill(<var>S</var>)</code> borra <var>S</var> de la lista de estructuras
definidas por el usuario y elimina la definici&oacute;n de la estructura.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) defstruct (foo (a, b, c));
(%o1)                    [foo(a, b, c)]
(%i2) structures;
(%o2)                    [foo(a, b, c)]
(%i3) new (foo);
(%o3)                     foo(a, b, c)
(%i4) defstruct (bar (v, w, x = 123, y = %pi));
(%o4)             [bar(v, w, x = 123, y = %pi)]
(%i5) structures;
(%o5)      [foo(a, b, c), bar(v, w, x = 123, y = %pi)]
(%i6) new (bar);
(%o6)              bar(v, w, x = 123, y = %pi)
(%i7) kill (foo);
(%o7)                         done
(%i8) structures;
(%o8)             [bar(v, w, x = 123, y = %pi)]
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>new</b><i> (<var>S</var>)</i>
<a name="IDX181"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>new</b><i> (<var>S</var> (<var>v_1</var>, ..., <var>v_n</var>))</i>
<a name="IDX182"></a>
</dt>
<dd><p><code>new</code> crea nuevos individuos de estructuras declaradas.
</p>
<p>La sentencia <code>new(<var>S</var>)</code> crea un nuevo individuo de 
estructura <var>S</var> en el que cada campo toma su valor por defecto,
si este fue definido, o sin valor alguno en caso de que no se haya
fijado un valor por defecto en la definici&oacute;n de la estructura.
</p>
<p>La sentencia <code>new(<var>S</var>(<var>v_1</var>, ..., <var>v_n</var>))</code>
crea un nuevo individuo de estructura <var>S</var> en el que los campos
adquieren los valores <var>v_1</var>, ..., <var>v_n</var>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) defstruct (foo (w, x = %e, y = 42, z));
(%o1)              [foo(w, x = %e, y = 42, z)]
(%i2) new (foo);
(%o2)               foo(w, x = %e, y = 42, z)
(%i3) new (foo (1, 2, 4, 8));
(%o3)            foo(w = 1, x = 2, y = 4, z = 8)
</pre>
</dd></dl>

<dl>
<dt><u>Operador:</u> <b>@</b>
<a name="IDX183"></a>
</dt>
<dd><p><code>@</code> es el operador para acceder a los campos de las estructuras.
</p>
<p>La expresi&oacute;n <code><var>x</var>@ <var>a</var></code> hace referencia al valor del
campo <var>a</var> del individuo <var>x</var> de una estructura dada. El nombre del campo no se eval&uacute;a.
</p>
<p>Si el campo <var>a</var> de <var>x</var> no tiene valor asignado, <code><var>x</var>@ <var>a</var></code>
se eval&uacute;a a s&iacute; mismo; es decir, devuelve la propia expresi&oacute;n
<code><var>x</var>@ <var>a</var></code> tal cual.
</p>
<p>La sentencia <code>kill(<var>x</var>@ <var>a</var>)</code> elimina el valor del campo <var>a</var> de <var>x</var>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) defstruct (foo (x, y, z));
(%o1)                    [foo(x, y, z)]
(%i2) u : new (foo (123, a - b, %pi));
(%o2)           foo(x = 123, y = a - b, z = %pi)
(%i3) u@z;
(%o3)                          %pi
(%i4) u@z : %e;
(%o4)                          %e
(%i5) u;
(%o5)            foo(x = 123, y = a - b, z = %e)
(%i6) kill (u@z);
(%o6)                         done
(%i7) u;
(%o7)              foo(x = 123, y = a - b, z)
(%i8) u@z;
(%o8)                          u@z
</pre>
<p>El nombre del campo no se eval&uacute;a.
</p>
<pre class="example">(%i1) defstruct (bar (g, h));
(%o1)                      [bar(g, h)]
(%i2) x : new (bar);
(%o2)                       bar(g, h)
(%i3) x@h : 42;
(%o3)                          42
(%i4) h : 123;
(%o4)                          123
(%i5) x@h;
(%o5)                          42
(%i6) x@h : 19;
(%o6)                          19
(%i7) x;
(%o7)                    bar(g, h = 19)
(%i8) h;
(%o8)                          123
</pre>
</dd></dl>

<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC18" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>diciembre, 10 2012</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
