<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on diciembre, 10 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima: 50. ezunits</title>

<meta name="description" content="Manual de Maxima: 50. ezunits">
<meta name="keywords" content="Manual de Maxima: 50. ezunits">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="ezunits"></a>
<a name="SEC255"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_49.html#SEC254" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC256" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC252" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC259" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 50. ezunits </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC256">50.1 Introducci&oacute;n a ezunits</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC257">50.2 Introducci&oacute;n a physical_constants</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC258">50.3 Funciones y variables para ezunits</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Introducci_00f3n-a-ezunits"></a>
<a name="SEC256"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC255" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC257" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC255" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC255" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC259" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 50.1 Introducci&oacute;n a ezunits </h2>

<p><code>ezunits</code> es un paquete para trabajar con magnitudes dimensionales, incluyendo
algunas funciones para realizar an&aacute;lisis dimensional.
<code>ezunits</code> puede hacer operaciones aritm&eacute;ticas con magnitudes dimensionales y
efectuar conversiones entre unidades.
Las unidades que se definen son las del Sistema Internacional (SI) y otras comunes en
los Estados Unidos, siendo posible declarar otras nuevas.
</p>
<p>V&eacute;ase tambi&eacute;n <code>physical_constants</code>, una colecci&oacute;n de constantes f&iacute;sicas.
</p>
<p>Es necesario ejecutar primero <code>load(ezunits)</code> para utilizar este paquete. 
Con <code>demo(ezunits)</code> se podr&aacute;n ver algunos ejemplos de utilizaci&oacute;n.
La funci&oacute;n <code>known_units</code> devuelve una lista con todas las unidades
que est&aacute;n definidas y <code>display_known_unit_conversions</code> muestra
las conversiones conocidas por el sistema en un formato de lectura sencilla.
</p>
<p>Una expresi&oacute;n tal como <em>a ` b</em> representa una magnitud dimensional, siendo
<code>a</code> una magnitud adimensional y <code>b</code> las unidades.
Se puede utilizar un s&iacute;mbolo como unidad, sin necesidad
de declararlo como tal ni de que deba cumplir propiedades especiales.
Tanto la magnitud como la unidad de una expresi&oacute;n de la forma <em>a ` b</em>
pueden extraerse invocando las funciones <code>qty</code> y <code>units</code>,
respectivamente.
</p>
<p>Una expresi&oacute;n tal como <code>a ` b `` c</code> convierte las unidades <code>b</code>
en <code>c</code>. El paquete <code>ezunits</code> contiene funciones conversoras para
unidades fundamentales del SI, unidades derivadas, as&iacute; como
algunas otras unidades ajenas al SI.
Las conversiones entre unidades que no est&eacute;n programadas en <code>ezunits</code>
podr&aacute;n declararse a posteriori.
Las conversiones conocidas por <code>ezunits</code> est&aacute;n especificadas en la
variable global <code>known_unit_conversions</code>, incluyendo tanto las ya
declaradas por defecto como aqu&eacute;llas introducidas por el usuario.
Las conversiones para los productos, cocientes y potencias de unidades
se derivan del conjunto de conversiones ya conocidas.
</p>
<p>En general, Maxima prefiere n&uacute;meros exactos (enteros o racionales)
a inexactos (decimales en coma flotante), por lo que <code>ezunits</code>
respetar&aacute; los exactos cuando aparezcan en expresiones de magnitudes
dimensionales. Todas las conversiones del paquete se han definido en
t&eacute;rminos de n&uacute;meros exactos.
</p>
<p>No hay un sistema de representaci&oacute;n de unidades que se considere preferible,
raz&oacute;n por la cual las unidades no se convierten a otras a menos que se
indique de forma expl&iacute;cita. <code>ezunits</code> reconoce los prefijos
m-, k-, M y G- para mili-, kilo-, mega- y giga-, respectivamente, tal como se
utilizan en el SI; estos prefijos s&oacute;lo se utilizan cuando as&iacute;
se indica de forma expl&iacute;cita.
</p>
<p>Las operaciones aritm&eacute;ticas con magnitudes dimensionales se realizan
de la forma convencional.
</p>
<ul class="toc">
<li> <code>(x ` a) * (y ` b)</code> es igual a <em>(x * y) ` (a * b)</em>.
</li><li> <code>(x ` a) + (y ` a)</code> es igual a <em>(x + y) ` a</em>.
</li><li> <code>(x ` a)^y</code> es igual a <em>x^y ` a^y</em> si <code>y</code> es adimensional.
</li></ul>

<p><code>ezunits</code> no necesita que las unidades en una suma tengan las mismas 
dimensiones; estos t&eacute;rminos ser&aacute;n sumados sin emitirse mensaje de error.
</p>
<p><code>ezunits</code> incluye funciones para el an&aacute;lisis dimensional elemental,
como las dimensiones fundamentales, las unidades fundamentales de una
magnitud dimensional o el c&aacute;lculo de magnitudes adimensionales y
unidades naturales. Las funciones de an&aacute;lisis dimensional son
adaptaciones de funciones semejantes escritas por Barton Willis en
otro paquete.
</p>
<p>Con el fin de poder llevar a cabo an&aacute;lisis dimensionales, se 
mantiene una lista de dimensiones fundamentales y otra lista asociada
de unidades fundamentales; por defecto, las dimensiones fundamentales son
longitud, masa, tiempo, carga, temperatura y cantidad de materia, siendo
las unidades fundamentales las propias del Sistema Internacional.
En cualquier caso, es posible declarar otras dimensiones y unidades
fundamentales.
</p>


<hr size="6">
<a name="Introducci_00f3n-a-physical_005fconstants"></a>
<a name="SEC257"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC256" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC258" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC255" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC255" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC259" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 50.2 Introducci&oacute;n a physical_constants </h2>

<p><code>physical_constants</code> contiene constantes f&iacute;sicas
recomendadas por el CODATA 2006 (<a href="http://physics.nist.gov/constants">http://physics.nist.gov/constants</a>).
La instrucci&oacute;n <code>load(physical_constants)</code> carga este paquete
en memoria junto con el propio <code>ezunits</code>, si &eacute;ste no estaba
previamente cargado.
</p>
<p>Una constante f&iacute;sica se representa por un s&iacute;mbolo
con la propiedad de ser un valor constante. El valor constante es una magnitud
dimensional en la sintaxis de <code>ezunits</code>. La funci&oacute;n <code>constvalue</code>
extrae el valor constante, el cual no es el valor ordinario del s&iacute;mbolo,
por lo que las constantes f&iacute;sicas se mantienen inalteradas en las
expresiones evaluadas hasta que sus valores sea extra&iacute;do con
la funci&oacute;n <code>constvalue</code>.
</p>
<p><code>physical_constants</code> incluye cierta informaci&oacute;n adicional,
como la descripci&oacute;n de cada constante, una estimaci&oacute;n del error 
de su valor num&eacute;rico y una propiedad para ser representada en TeX.
Para identificar constantes f&iacute;sicas, cada s&iacute;mbolo
tiene la propiedad <code>physical_constant</code>, de forma que 
<code>propvars(physical_constant)</code> muestra la lista de todas
las constantes f&iacute;sicas.
</p>
<p><code>physical_constants</code> contiene las siguientes constantes:
</p>
<dl compact="compact">
<dt> <code>%c</code></dt>
<dd><p>velocidad de la luz en el vac&iacute;o
</p></dd>
<dt> <code>%mu_0</code></dt>
<dd><p>constante magn&eacute;tica
</p></dd>
<dt> <code>%e_0</code></dt>
<dd><p>constante el&eacute;ctrica
</p></dd>
<dt> <code>%Z_0</code></dt>
<dd><p>impedancia caracter&iacute;stica del vac&iacute;o
</p></dd>
<dt> <code>%G</code></dt>
<dd><p>constante gravitatoria de Newton
</p></dd>
<dt> <code>%h</code></dt>
<dd><p>constante de Planck
</p></dd>
<dt> <code>%h_bar</code></dt>
<dd><p>constante de Planck
</p></dd>
<dt> <code>%m_P</code></dt>
<dd><p>masa de Planck
</p></dd>
<dt> <code>%T_P</code></dt>
<dd><p>temperature de Planck
</p></dd>
<dt> <code>%l_P</code></dt>
<dd><p>longitud de Planck
</p></dd>
<dt> <code>%t_P</code></dt>
<dd><p>tiempo de Planck
</p></dd>
<dt> <code>%%e</code></dt>
<dd><p>carga elemental
</p></dd>
<dt> <code>%Phi_0</code></dt>
<dd><p>flujo magn&eacute;tico cu&aacute;ntico
</p></dd>
<dt> <code>%G_0</code></dt>
<dd><p>conductancia cu&aacute;ntica
</p></dd>
<dt> <code>%K_J</code></dt>
<dd><p>constante de Josephson
</p></dd>
<dt> <code>%R_K</code></dt>
<dd><p>constante de von Klitzing
</p></dd>
<dt> <code>%mu_B</code></dt>
<dd><p>magnet&oacute;n de Bohr
</p></dd>
<dt> <code>%mu_N</code></dt>
<dd><p>magnet&oacute;n nuclear
</p></dd>
<dt> <code>%alpha</code></dt>
<dd><p>constante de estructura fina
</p></dd>
<dt> <code>%R_inf</code></dt>
<dd><p>constante de Rydberg
</p></dd>
<dt> <code>%a_0</code></dt>
<dd><p>radio de Bohr
</p></dd>
<dt> <code>%E_h</code></dt>
<dd><p>energ&iacute;a de Hartree
</p></dd>
<dt> <code>%ratio_h_me</code></dt>
<dd><p>cuanto de circulaci&oacute;n
</p></dd>
<dt> <code>%m_e</code></dt>
<dd><p>masa del electr&oacute;n
</p></dd>
<dt> <code>%N_A</code></dt>
<dd><p>n&uacute;mero de Avogadro
</p></dd>
<dt> <code>%m_u</code></dt>
<dd><p>constante de masa at&oacute;mica
atomic mass constant
</p></dd>
<dt> <code>%F</code></dt>
<dd><p>constante de Faraday
</p></dd>
<dt> <code>%R</code></dt>
<dd><p>constante molar de los gases
</p></dd>
<dt> <code>%%k</code></dt>
<dd><p>constante de Boltzmann
</p></dd>
<dt> <code>%V_m</code></dt>
<dd><p>volumen molar del gas ideal
</p></dd>
<dt> <code>%n_0</code></dt>
<dd><p>constante de Loschmidt
</p></dd>
<dt> <code>%ratio_S0_R</code></dt>
<dd><p>constante de Sackur-Tetrode (constante de entrop&iacute;a absoluta)
</p></dd>
<dt> <code>%sigma</code></dt>
<dd><p>constante de Stefan-Boltzmann
</p></dd>
<dt> <code>%c_1</code></dt>
<dd><p>primera constante de radiaci&oacute;n
</p></dd>
<dt> <code>%c_1L</code></dt>
<dd><p>primera constante de radiaci&oacute;n para radiancia espectral
</p></dd>
<dt> <code>%c_2</code></dt>
<dd><p>segunda constante de radiaci&oacute;n
</p></dd>
<dt> <code>%b</code></dt>
<dd><p>Constante de la ley del desplazamiento de Wien
</p></dd>
<dt> <code>%b_prime</code></dt>
<dd><p>Constante de la ley del desplazamiento de Wien
</p></dd>
</dl>

<p>Ejemplos:
</p>
<p>Lista de todos los s&iacute;mbolos que tienen la propiedad
<code>physical_constant</code>.
</p>
<pre class="example">(%i1) load (physical_constants)$
(%i2) propvars (physical_constant);
(%o2) [%c, %mu_0, %e_0, %Z_0, %G, %h, %h_bar, %m_P, %T_P, %l_P, 
%t_P, %%e, %Phi_0, %G_0, %K_J, %R_K, %mu_B, %mu_N, %alpha, 
%R_inf, %a_0, %E_h, %ratio_h_me, %m_e, %N_A, %m_u, %F, %R, %%k, 
%V_m, %n_0, %ratio_S0_R, %sigma, %c_1, %c_1L, %c_2, %b, %b_prime]
</pre>

<p>Propiedades de la constante f&iacute;sica <code>%c</code>.
</p>
<pre class="example">(%i1) load (physical_constants)$
(%i2) constantp (%c);
(%o2)                         true
(%i3) get (%c, description);
(%o3)               speed of light in vacuum
(%i4) constvalue (%c);
                                      m
(%o4)                     299792458 ` -
                                      s
(%i5) get (%c, RSU);
(%o5)                           0
(%i6) tex (%c);
$$c$$
(%o6)                         false
</pre>

<p>Energ&iacute;a equivalente de una libra-masa. El s&iacute;mbolo
<code>%c</code> se mantiene hasta que su valor es extra&iacute;do
con la llamada a la funci&oacute;n <code>constvalue</code>.
</p>
<pre class="example">(%i1) load (physical_constants)$
(%i2) m * %c^2;
                                2
(%o2)                         %c  m
(%i3) %, m = 1 ` lbm;
                              2
(%o3)                       %c  ` lbm
(%i4) constvalue (%);
                                            2
                                       lbm m
(%o4)              89875517873681764 ` ------
                                          2
                                         s
(%i5) E : % `` J;
Computing conversions to base units; may take a moment. 
                     366838848464007200
(%o5)                ------------------ ` J
                             9
(%i6) E `` GJ;
                      458548560580009
(%o6)                 --------------- ` GJ
                         11250000
(%i7) float (%);
(%o7)              4.0759872051556356e+7 ` GJ
</pre>


<hr size="6">
<a name="Funciones-y-variables-para-ezunits"></a>
<a name="SEC258"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC257" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC259" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC255" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC255" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC259" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 50.3 Funciones y variables para ezunits </h2>

<dl>
<dt><u>Operador:</u> <b>`</b>
<a name="IDX2130"></a>
</dt>
<dd><p>Operador de magnitud dimensional. 
Una expresi&oacute;n tal como <em>a ` b</em> representa una magnitud dimensional, siendo
<code>a</code> una magnitud adimensional y <code>b</code> las unidades.
Se puede utilizar un s&iacute;mbolo como unidad, sin necesidad
de declararlo como tal ni de que deba cumplir propiedades especiales.
Tanto la magnitud como la unidad de una expresi&oacute;n de la forma <em>a ` b</em>
pueden extraerse invocando las funciones <code>qty</code> y <code>units</code>,
respectivamente.
</p>
<p>Las operaciones aritm&eacute;ticas con magnitudes dimensionales se realizan
de la forma convencional.
</p>
<ul class="toc">
<li> <code>(x ` a) * (y ` b)</code> es igual a <em>(x * y) ` (a * b)</em>.
</li><li> <code>(x ` a) + (y ` a)</code> es igual a <em>(x + y) ` a</em>.
</li><li> <code>(x ` a)^y</code> es igual a <em>x^y ` a^y</em> si <code>y</code> es adimensional.
</li></ul>

<p><code>ezunits</code> no necesita que las unidades en una suma tengan las mismas 
dimensiones; estos t&eacute;rminos ser&aacute;n sumados sin emitirse mensaje de error.
</p>
<p>Para utilizar este operador ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<p>Unidades del Sistema Internacional.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) foo : 10 ` m;
(%o2)                        10 ` m
(%i3) qty (foo);
(%o3)                          10
(%i4) units (foo);
(%o4)                           m
(%i5) dimensions (foo);
(%o5)                        length
</pre>

<p>Unidades definidas por el usuario.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) bar : x ` acre;
(%o2)                       x ` acre
(%i3) dimensions (bar);
                                   2
(%o3)                        length
(%i4) fundamental_units (bar);
                                2
(%o4)                          m
</pre>
<p>Unidades ad hoc.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) baz : 3 ` sheep + 8 ` goat + 1 ` horse;
(%o2)           8 ` goat + 3 ` sheep + 1 ` horse
(%i3) subst ([sheep = 3*goat, horse = 10*goat], baz);
(%o3)                       27 ` goat
(%i4) baz2 : 1000`gallon/fortnight;
                                gallon
(%o4)                   1000 ` ---------
                               fortnight
(%i5) subst (fortnight = 14*day, baz2);
                          500   gallon
(%o5)                     --- ` ------
                           7     day
</pre>

<p>Operaciones aritm&eacute;ticas y magnitudes dimensionales.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) 100 ` kg + 200 ` kg;
(%o2)                       300 ` kg
(%i3) 100 ` m^3 - 100 ` m^3;
                                  3
(%o3)                        0 ` m
(%i4) (10 ` kg) * (17 ` m/s^2);
                                 kg m
(%o4)                      170 ` ----
                                   2
                                  s
(%i5) (x ` m) / (y ` s);
                              x   m
(%o5)                         - ` -
                              y   s
(%i6) (a ` m)^2;
                              2    2
(%o6)                        a  ` m
</pre>

</dd></dl>

<dl>
<dt><u>Operador:</u> <b>`</b><i>`</i>
<a name="IDX2131"></a>
</dt>
<dd><p>Operador de conversi&oacute;n de unidades.
Una expresi&oacute;n tal como <em>a ` b `` c</em> convierte las unidades <code>b</code>
en <code>c</code>. El paquete <code>ezunits</code> contiene funciones conversoras para
unidades fundamentales del SI, unidades derivadas, as&iacute; como
algunas otras unidades ajenas al SI.
Las conversiones entre unidades que no est&eacute;n programadas en <code>ezunits</code>
podr&aacute;n declararse a posteriori.
Las conversiones conocidas por <code>ezunits</code> est&aacute;n especificadas en la
variable global <code>known_unit_conversions</code>, incluyendo tanto las ya
declaradas por defecto como aqu&eacute;llas introducidas por el usuario.
Las conversiones para los productos, cocientes y potencias de unidades
se derivan del conjunto de conversiones ya conocidas.
</p>
<p>No hay un sistema de representaci&oacute;n de unidades que se considere preferible,
raz&oacute;n por la cual las unidades no se convierten a otras a menos que se
indique de forma expl&iacute;cita. Del mismo modo, <code>ezunits</code>
no transforma prefijos (milli-, centi-, deci-, etc) a menos que se le
indique.
</p>
<p>Para utilizar este operador ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<p>Conjunto de conversiones conocidas.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) display2d : false$
(%i3) known_unit_conversions;
(%o3) {acre = 4840*yard^2,Btu = 1055*J,cfm = feet^3/minute,
       cm = m/100,day = 86400*s,feet = 381*m/1250,ft = feet,
       g = kg/1000,gallon = 757*l/200,GHz = 1000000000*Hz,
       GOhm = 1000000000*Ohm,GPa = 1000000000*Pa,
       GWb = 1000000000*Wb,Gg = 1000000*kg,Gm = 1000000000*m,
       Gmol = 1000000*mol,Gs = 1000000000*s,ha = hectare,
       hectare = 100*m^2,hour = 3600*s,Hz = 1/s,inch = feet/12,
       km = 1000*m,kmol = 1000*mol,ks = 1000*s,l = liter,
       lbf = pound_force,lbm = pound_mass,liter = m^3/1000,
       metric_ton = Mg,mg = kg/1000000,MHz = 1000000*Hz,
       microgram = kg/1000000000,micrometer = m/1000000,
       micron = micrometer,microsecond = s/1000000,
       mile = 5280*feet,minute = 60*s,mm = m/1000,
       mmol = mol/1000,month = 2629800*s,MOhm = 1000000*Ohm,
       MPa = 1000000*Pa,ms = s/1000,MWb = 1000000*Wb,
       Mg = 1000*kg,Mm = 1000000*m,Mmol = 1000000000*mol,
       Ms = 1000000*s,ns = s/1000000000,ounce = pound_mass/16,
       oz = ounce,Ohm = s*J/C^2,
       pound_force = 32*ft*pound_mass/s^2,
       pound_mass = 200*kg/441,psi = pound_force/inch^2,
       Pa = N/m^2,week = 604800*s,Wb = J/A,yard = 3*feet,
       year = 31557600*s,C = s*A,F = C^2/J,GA = 1000000000*A,
       GC = 1000000000*C,GF = 1000000000*F,GH = 1000000000*H,
       GJ = 1000000000*J,GK = 1000000000*K,GN = 1000000000*N,
       GS = 1000000000*S,GT = 1000000000*T,GV = 1000000000*V,
       GW = 1000000000*W,H = J/A^2,J = m*N,kA = 1000*A,
       kC = 1000*C,kF = 1000*F,kH = 1000*H,kHz = 1000*Hz,
       kJ = 1000*J,kK = 1000*K,kN = 1000*N,kOhm = 1000*Ohm,
       kPa = 1000*Pa,kS = 1000*S,kT = 1000*T,kV = 1000*V,
       kW = 1000*W,kWb = 1000*Wb,mA = A/1000,mC = C/1000,
       mF = F/1000,mH = H/1000,mHz = Hz/1000,mJ = J/1000,
       mK = K/1000,mN = N/1000,mOhm = Ohm/1000,mPa = Pa/1000,
       mS = S/1000,mT = T/1000,mV = V/1000,mW = W/1000,
       mWb = Wb/1000,MA = 1000000*A,MC = 1000000*C,
       MF = 1000000*F,MH = 1000000*H,MJ = 1000000*J,
       MK = 1000000*K,MN = 1000000*N,MS = 1000000*S,
       MT = 1000000*T,MV = 1000000*V,MW = 1000000*W,
       N = kg*m/s^2,R = 5*K/9,S = 1/Ohm,T = J/(m^2*A),V = J/C,
       W = J/s}
</pre>

<p>Converiones de unidades fundamentales.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) 1 ` ft `` m;
Computing conversions to base units; may take a moment. 
                            381
(%o2)                       ---- ` m
                            1250
(%i3) %, numer;
(%o3)                      0.3048 ` m
(%i4) 1 ` kg `` lbm;
                            441
(%o4)                       --- ` lbm
                            200
(%i5) %, numer;
(%o5)                      2.205 ` lbm
(%i6) 1 ` W `` Btu/hour;
                           720   Btu
(%o6)                      --- ` ----
                           211   hour
(%i7) %, numer;
                                        Btu
(%o7)               3.412322274881517 ` ----
                                        hour
(%i8) 100 ` degC `` degF;
(%o8)                      212 ` degF
(%i9) -40 ` degF `` degC;
(%o9)                     (- 40) ` degC
(%i10) 1 ` acre*ft `` m^3;
                        60228605349    3
(%o10)                  ----------- ` m
                         48828125
(%i11) %, numer;
                                          3
(%o11)                1233.48183754752 ` m
</pre>
<p>Transformando pies a metros y viceversa.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) 100 ` m + 100 ` ft;
(%o2)                  100 ` m + 100 ` ft
(%i3) (100 ` m + 100 ` ft) `` ft;
                           163100
(%o3)                      ------ ` ft
                            381
(%i4) %, numer;
(%o4)                428.0839895013123 ` ft
(%i5) (100 ` m + 100 ` ft) `` m;
                            3262
(%o5)                       ---- ` m
                             25
(%i6) %, numer;
(%o6)                      130.48 ` m
</pre>
<p>An&aacute;lisis dimensional para encontrar dimensiones y unidades fundamentales.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) foo : 1 ` acre * ft;
(%o2)                      1 ` acre ft
(%i3) dimensions (foo);
                                   3
(%o3)                        length
(%i4) fundamental_units (foo);
                                3
(%o4)                          m
(%i5) foo `` m^3;
                        60228605349    3
(%o5)                   ----------- ` m
                         48828125
(%i6) %, numer;
                                          3
(%o6)                 1233.48183754752 ` m
</pre>
<p>Declaraci&oacute;n de conversiones.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) declare_unit_conversion (MMBtu = 10^6*Btu, kW = 1000*W);
(%o2)                         done
(%i3) declare_unit_conversion (kWh = kW*hour, MWh = 1000*kWh,
                               bell = 1800*s);
(%o3)                         done
(%i4) 1 ` kW*s `` MWh;
Computing conversions to base units; may take a moment. 
                             1
(%o4)                     ------- ` MWh
                          3600000
(%i5) 1 ` kW/m^2 `` MMBtu/bell/ft^2;
                       1306449      MMBtu
(%o5)                 ---------- ` --------
                      8242187500          2
                                   bell ft
</pre></dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>constvalue</b><i> (<var>x</var>)</i>
<a name="IDX2132"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>declare_constvalue</b><i> (<var>a</var>, <var>x</var>)</i>
<a name="IDX2133"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>remove_constvalue</b><i> (<var>a</var>)</i>
<a name="IDX2134"></a>
</dt>
<dd><p>Devuelve la constante declarada para un s&iacute;mbolo.
Los valores constantes se declaran con <code>declare_constvalue</code>.
</p>
<p>Los valores constantes reconocidos por <code>constvalue</code>
son distintos de los valores declarados por <code>numerval</code>
y reconocidos por <code>constantp</code>.
</p>
<p>El paquete <code>physical_units</code> declara los valores constantes
de las constantes f&iacute;sicas.
</p>
<p><code>remove_constvalue</code> deshace la acci&oacute;n de <code>declare_constvalue</code>.
</p>
<p>Para utilizar estas funciones ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<p>Valor de una constante f&iacute;sica.
</p>
<pre class="example">(%i1) load (physical_constants)$
(%i2) constvalue (%G);
                                     3
                                    m
(%o2)                    6.67428 ` -----
                                       2
                                   kg s
(%i3) get ('%G, 'description);
(%o3)           Newtonian constant of gravitation
</pre>
<p>Declarando una nueva constante.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) declare_constvalue (FOO, 100 ` lbm / acre);
                                 lbm
(%o2)                      100 ` ----
                                 acre
(%i3) FOO * (50 ` acre);
(%o3)                     50 FOO ` acre
(%i4) constvalue (%);
(%o4)                      5000 ` lbm
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>units</b><i> (<var>x</var>)</i>
<a name="IDX2135"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>declare_units</b><i> (<var>a</var>, <var>u</var>)</i>
<a name="IDX2136"></a>
</dt>
<dd><p>Devuelve las unidades de la magnitud dimensional <var>x</var>,
o 1 en caso de que <var>x</var> sea adimensional.
</p>
<p><var>x</var> puede ser una expresi&oacute;n literal dimensional <em>a ` b</em>,
un s&iacute;mbolo con unidades declaradas por
medio de <code>declare_units</code>, o una expresi&oacute;n 
que contenga cualquiera o ambos de los anteriores.
</p>
<p><code>declare_constvalue</code> declara que <code>units(<var>a</var>)</code>
debe devolver <var>u</var>, siendo <var>u</var> una expresi&oacute;n.
</p>
<p>Para utilizar estas funciones ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<p><code>units</code> aplicado a expresiones dimensionales literales.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) foo : 100 ` kg;
(%o2)                              100 ` kg
(%i3) bar : x ` m/s;
                                         m
(%o3)                                x ` -
                                         s
(%i4) units (foo);
(%o4)                                 kg
(%i5) units (bar);
                                       m
(%o5)                                  -
                                       s
(%i6) units (foo * bar);
                                     kg m
(%o6)                                ----
                                      s
(%i7) units (foo / bar);
                                     kg s
(%o7)                                ----
                                      m
(%i8) units (foo^2);
                                        2
(%o8)                                 kg
</pre>
<p><code>units</code> aplicado a s&iacute;mbolos con unidades declaradas.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) linenum:0;
(%o0)                                  0
(%i1) units (aa);
(%o1)                                  1
(%i2) declare_units (aa, J);
(%o2)                                  J
(%i3) units (aa);
(%o3)                                  J
(%i4) units (aa^2);
                                       2
(%o4)                                 J
(%i5) foo : 100 ` kg;
(%o5)                              100 ` kg
(%i6) units (aa * foo);
(%o6)                                kg J
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>qty</b><i> (<var>x</var>)</i>
<a name="IDX2137"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>declare_qty</b><i> (<var>a</var>, <var>x</var>)</i>
<a name="IDX2138"></a>
</dt>
<dd><p><code>qty</code> devuelve la parte adimensional de la magnitud dimensional <var>x</var>,
o <var>x</var>, si <var>x</var> es adimensional.
<var>x</var> puede ser una expresi&oacute;n literal dimensional <em>a ` b</em>,
un s&iacute;mbolo con unidades declaradas o una expresi&oacute;n 
que contenga cualquiera o ambos de los anteriores.
</p>
<p><code>declare_qty</code> declara que <code>qty(<var>a</var>)</code>
debe devolver <var>x</var>, siendo <var>x</var> una magnitud dimensional.
</p>
<p>Para utilizar estas funciones ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<p><code>qty</code> aplicado a expresiones dimensionales literales.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) foo : 100 ` kg;
(%o2)                       100 ` kg
(%i3) qty (foo);
(%o3)                          100
(%i4) bar : v ` m/s;
                                  m
(%o4)                         v ` -
                                  s
(%i5) foo * bar;
                                  kg m
(%o5)                     100 v ` ----
                                   s
(%i6) qty (foo * bar);
(%o6)                         100 v
</pre>
<p><code>qty</code> aplicado a s&iacute;mbolos con unidades declaradas.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) declare_qty (aa, xx);
(%o2)                          xx
(%i3) qty (aa);
(%o3)                          xx
(%i4) qty (aa^2);
                                 2
(%o4)                          xx
(%i5) foo : 100 ` kg;
(%o5)                       100 ` kg
(%i6) qty (aa * foo);
(%o6)                        100 xx
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>unitp</b><i> (<var>x</var>)</i>
<a name="IDX2139"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>x</var> es una expresi&oacute;n dimensional
literal, un s&iacute;mbolo declarado como dimensional o
una expresi&oacute;n en la que su operador principal ha sido declarado
como dimensional. En cualquier otro caso, <code>unitp</code> devuelve
<code>false</code>.
</p>
<p>Para utilizar esta funci&oacute;n ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<p><code>unitp</code> aplicado a expresiones dimensionales literales.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) unitp (100 ` kg);
(%o2)                         true
</pre>
<p><code>unitp</code> applied to a symbol declared dimensional.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) unitp (foo);
(%o2)                         false
(%i3) declare (foo, dimensional);
(%o3)                         done
(%i4) unitp (foo);
(%o4)                         true
</pre>
<p><code>unitp</code> aplicado a una expresi&oacute;n en la que el operador
principal se declara dimensional.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) unitp (bar (x, y, z));
(%o2)                         false
(%i3) declare (bar, dimensional);
(%o3)                         done
(%i4) unitp (bar (x, y, z));
(%o4)                         true
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>declare_unit_conversion</b><i> (<var>u</var> = <var>v</var>, ...)</i>
<a name="IDX2140"></a>
</dt>
<dd><p>A&ntilde;ade las ecuaciones <var>u</var> = <var>v</var>, ... a la lista de conversiones
de unidades conocidas por el operador de conversi&oacute;n <em>``</em>.
<var>u</var> y <var>v</var> son t&eacute;rminos multiplicativos en las que las
variables son unidades o expresiones dimensionales literales.
</p>
<p>De momento, es imperativo expresar las conversiones de forma
que el miembro izquierdo de cada ecuaci&oacute;n sea una unidad simple
(en opsici&oacute;n a una expresi&oacute;n multiplicativa) o una expresi&oacute;n
dimensional literal con la cantidad igual a 1 y con unidad simple.
Est&aacute; previsto eliminar esta restricci&oacute;n en versiones futuras.
</p>
<p><code>known_unit_conversions</code> es la lista de conversiones de unidades conocidas.
</p>
<p>Para utilizar esta funci&oacute;n ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<p>Conversi&oacute;n de unidades expresadas por ecuaciones con t&eacute;rminos multiplicativos.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) declare_unit_conversion (nautical_mile = 1852 * m,
                               fortnight = 14 * day);
(%o2)                         done
(%i3) 100 ` nautical_mile / fortnight `` m/s;
Computing conversions to base units; may take a moment. 
                            463    m
(%o3)                       ---- ` -
                            3024   s
</pre>
<p>Conversi&oacute;n de unidades expresadas por ecuaciones con expresiones dimensionales
literales.
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) declare_unit_conversion (1 ` fluid_ounce = 2 ` tablespoon);
(%o2)                         done
(%i3) declare_unit_conversion (1 ` tablespoon = 3 ` teaspoon);
(%o3)                         done
(%i4) 15 ` fluid_ounce `` teaspoon;
Computing conversions to base units; may take a moment. 
(%o4)                     90 ` teaspoon
</pre>

</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>declare_dimensions</b><i> (<var>a_1</var>, <var>d_1</var>, ..., <var>a_n</var>, <var>d_n</var>)</i>
<a name="IDX2141"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>remove_dimensions</b><i> (<var>a_1</var>, ..., <var>a_n</var>)</i>
<a name="IDX2142"></a>
</dt>
<dd><p><code>declare_dimensions</code> declara <var>a_1</var>, ..., <var>a_n</var>
con las dimensiones <var>d_1</var>, ..., <var>d_n</var>, respectivamente.
</p>
<p>Cada <var>a_k</var> es un s&iacute;mbolo o lista de s&iacute;mbolos.
En caso de ser una lista, cada s&iacute;mbolo en <var>a_k</var> se
declara de dimensi&oacute;n <var>d_k</var>.
</p>
<p><code>remove_dimensions</code> invierte el efecto de <code>declare_dimensions</code>.
</p>
<p>Ejec&uacute;tese <code>load(ezunits)</code> para hacer uso de estas funciones.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (ezunits) $
(%i2) declare_dimensions ([x, y, z], length, [t, u], time);
(%o2)                         done
(%i3) dimensions (y^2/u);
                                   2
                             length
(%o3)                        -------
                              time
(%i4) fundamental_units (y^2/u);
0 errors, 0 warnings
                                2
                               m
(%o4)                          --
                               s
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>declare_fundamental_dimensions</b><i> (<var>d_1</var>, <var>d_2</var>, <var>d_3</var>, ...)</i>
<a name="IDX2143"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>remove_fundamental_dimensions</b><i> (<var>d_1</var>, <var>d_2</var>, <var>d_3</var>, ...)</i>
<a name="IDX2144"></a>
</dt>
<dt><u>Variable global:</u> <b>fundamental_dimensions</b>
<a name="IDX2145"></a>
</dt>
<dd><p><code>declare_fundamental_dimensions</code> declara dimensiones fundamentales.
Los s&iacute;mbolos <var>d_1</var>, <var>d_2</var>, <var>d_3</var>, ... se a&ntilde;aden a la lista
de dimensiones fundamentales si no est&aacute;n ya presentes en la lista.
</p>
<p><code>remove_fundamental_dimensions</code> invierte el efecto de <code>declare_fundamental_dimensions</code>.
</p>
<p><code>fundamental_dimensions</code> es la lista de dimensiones fundamentales.
Por defecto, la lista comprende algunas dimensiones f&iacute;sicas.
</p>
<p>Ejec&uacute;tese <code>load(ezunits)</code> para hacer uso de estas funciones.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (ezunits) $
(%i2) fundamental_dimensions;
(%o2) [length, mass, time, current, temperature, quantity]
(%i3) declare_fundamental_dimensions (money, cattle, happiness);
(%o3)                         done
(%i4) fundamental_dimensions;
(%o4) [length, mass, time, current, temperature, quantity, 
                                        money, cattle, happiness]
(%i5) remove_fundamental_dimensions (cattle, happiness);
(%o5)                         done
(%i6) fundamental_dimensions;
(%o6) [length, mass, time, current, temperature, quantity, money]
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>declare_fundamental_units</b><i> (<var>u_1</var>, <var>d_1</var>, ..., <var>u_n</var>, <var>d_n</var>)</i>
<a name="IDX2146"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>remove_fundamental_units</b><i> (<var>u_1</var>, ..., <var>u_n</var>)</i>
<a name="IDX2147"></a>
</dt>
<dd><p><code>declare_fundamental_units</code> declara <var>u_1</var>, ..., <var>u_n</var>
de dimensiones <var>d_1</var>, ..., <var>d_n</var>, respectivamente.
Todos los argumentos deben s&iacute;mbolos.
</p>
<p>Tras la llamada a <code>declare_fundamental_units</code>,
<code>dimensions(<var>u_k</var>)</code> devuelve <var>d_k</var> para cada argumento <var>u_1</var>, ..., <var>u_n</var>,
y <code>fundamental_units(<var>d_k</var>)</code> devuelve <var>u_k</var> para cada <var>d_1</var>, ..., <var>d_n</var>.
</p>
<p><code>remove_fundamental_units</code> invierte el efecto de <code>declare_fundamental_units</code>.
</p>
<p>Ejec&uacute;tese <code>load(ezunits)</code> para hacer uso de estas funciones.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (ezunits) $
(%i2) declare_fundamental_dimensions (money, cattle, happiness);
(%o2)                         done
(%i3) declare_fundamental_units (dollar, money, goat, cattle,
                                 smile, happiness);
(%o3)                 [dollar, goat, smile]
(%i4) dimensions (100 ` dollar/goat/km^2);
                             money
(%o4)                    --------------
                                      2
                         cattle length
(%i5) dimensions (x ` smile/kg);
                            happiness
(%o5)                       ---------
                              mass
(%i6) fundamental_units (money*cattle/happiness);
0 errors, 0 warnings
                           dollar goat
(%o6)                      -----------
                              smile
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>dimensions</b><i> (<var>x</var>)</i>
<a name="IDX2148"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>dimensions_as_list</b><i> (<var>x</var>)</i>
<a name="IDX2149"></a>
</dt>
<dd><p><code>dimensions</code> devuelve las dimensiones de la magnitud dimensional <var>x</var>
en forma de expresi&oacute;n que contiene productos y potencias de dimensiones
fundamentales.
</p>
<p><code>dimensions_as_list</code> devuelve las dimensiones de la magnitud dimensional <var>x</var>
en forma de lista, cuyos elementos indican las potencias de las dimensiones
fundamentales correspondientes.
</p>
<p>Para utilizar estas funciones ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) dimensions (1000 ` kg*m^2/s^3);
                                2
                          length  mass
(%o2)                     ------------
                                 3
                             time
(%i3) declare_units (foo, acre*ft/hour);
                             acre ft
(%o3)                        -------
                              hour
(%i4) dimensions (foo);
                                   3
                             length
(%o4)                        -------
                              time
</pre>

<pre class="example">(%i1) load (ezunits)$
(%i2) fundamental_dimensions;
(%o2)  [length, mass, time, charge, temperature, quantity]
(%i3) dimensions_as_list (1000 ` kg*m^2/s^3);
(%o3)                 [2, 1, - 3, 0, 0, 0]
(%i4) declare_units (foo, acre*ft/hour);
                             acre ft
(%o4)                        -------
                              hour
(%i5) dimensions_as_list (foo);
(%o5)                 [3, 0, - 1, 0, 0, 0]
</pre>

</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>fundamental_units</b><i> (<var>x</var>)</i>
<a name="IDX2150"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>fundamental_units</b><i> ()</i>
<a name="IDX2151"></a>
</dt>
<dd><p><code>fundamental_units(<var>x</var>)</code> devuelve las unidades
asociadas a las dimensiones fundamentales de <var>x</var>,
tal como queda determinada por <code>dimensions(<var>x</var>)</code>.
</p>
<p><var>x</var> puede ser una expresi&oacute;n literal dimensional <em>a ` b</em>,
un s&iacute;mbolo con unidades declaradas a trav&eacute;s de
<code>declare_units</code> o una expresi&oacute;n que contenga a ambos.
</p>
<p><code>fundamental_units()</code> devuelve una lista con las unidades
fundamentales conocidas, tal como fueron declaradas por <code>declare_fundamental_units</code>.
</p>
<p>Para utilizar esta funci&oacute;n ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (ezunits)$
(%i2) fundamental_units ();
(%o2)                 [m, kg, s, A, K, mol]
(%i3) fundamental_units (100 ` mile/hour);
                                m
(%o3)                           -
                                s
(%i4) declare_units (aa, g/foot^2);
                                g
(%o4)                         -----
                                  2
                              foot
(%i5) fundamental_units (aa);
                               kg
(%o5)                          --
                                2
                               m
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>dimensionless</b><i> (<var>L</var>)</i>
<a name="IDX2152"></a>
</dt>
<dd><p>Devuelve una expresi&oacute;n sin dimensiones que se puede formar
a partir de una lista <var>L</var> de cantidades dimensionales 
</p>
<p>Para utilizar esta funci&oacute;n ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) load (ezunits) $
(%i2) dimensionless ([x ` m, y ` m/s, z ` s]);
0 errors, 0 warnings
0 errors, 0 warnings
                               y z
(%o2)                         [---]
                                x
</pre>
<p>Cantidades adimensionales obtenidas a partir de cantidades f&iacute;sicas.
N&oacute;tese que el primer elemento de la lista es proporcional a la
constante de estructura fina.
</p>
<pre class="example">(%i1) load (ezunits) $
(%i2) load (physical_constants) $
(%i3) dimensionless([%h_bar, %m_e, %m_P, %%e, %c, %e_0]);
0 errors, 0 warnings
0 errors, 0 warnings
                              2
                           %%e        %m_e
(%o3)                [--------------, ----]
                      %c %e_0 %h_bar  %m_P
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>natural_unit</b><i> (<var>expr</var>, [<var>v_1</var>, ..., <var>v_n</var>])</i>
<a name="IDX2153"></a>
</dt>
<dd><p>Busca los exponentes <var>e_1</var>, ..., <var>e_n</var> tales que
<code>dimension(<var>expr</var>) = dimension(<var>v_1</var>^<var>e_1</var> ... <var>v_n</var>^<var>e_n</var>)</code>.
</p>
<p>Para utilizar esta funci&oacute;n ejec&uacute;tese primero <code>load(ezunits)</code>.
</p>
</dd></dl>





<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC255" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC259" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>diciembre, 10 2012</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
