<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on diciembre, 10 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima: 10. Funciones matem&aacute;ticas</title>

<meta name="description" content="Manual de Maxima: 10. Funciones matem&aacute;ticas">
<meta name="keywords" content="Manual de Maxima: 10. Funciones matem&aacute;ticas">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Funciones-matem_00e1ticas"></a>
<a name="SEC59"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_9.html#SEC58" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 10. Funciones matem&aacute;ticas </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC60">10.1 Funciones para los n&uacute;meros</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC61">10.2 Funciones para los n&uacute;meros complejos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC62">10.3 Funciones combinatorias</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC63">10.4 Funciones radicales, exponenciales y logar&iacute;tmicas</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC64">10.5 Funciones trigonom&eacute;tricas</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC67">10.6 N&uacute;meros aleatorios</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>




<hr size="6">
<a name="Funciones-para-los-n_00fameros"></a>
<a name="SEC60"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC59" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC61" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC59" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.1 Funciones para los n&uacute;meros </h2>


<dl>
<dt><u>Funci&oacute;n:</u> <b>abs</b><i> (<var>z</var>)</i>
<a name="IDX326"></a>
</dt>
<dd><p>La funci&oacute;n <code>abs</code> representa el valor absoluto y se puede aplicar tanto 
a argumentos num&eacute;ricos como simb&oacute;licos. Si el argumento <var>z</var> es un
n&uacute;mero real o complejo, <code>abs</code> devuelve el valor absoluto de <var>z</var>.
Si es posible, las expresiones simb&oacute;licas que utilizan la funci&oacute;n del
valor absoluto tambi&eacute;n se simplifican.
</p>
<p>Maxima puede derivar, integrar y calcular l&iacute;mites de expresiones
que contengan a <code>abs</code>. El paquete <code>abs_integrate</code> extiende las
capacidades de Maxima para calcular integrales que contengan llamadas a
<code>abs</code>. V&eacute;ase <code>(%i12)</code> en el ejemplo de m&aacute;s abajo.
</p>
<p>Cuando se aplica a una lista o matriz, <code>abs</code> se distribuye autom&aacute;ticamente
sobre sus elementos. De forma similar, tambi&eacute;n se distribuye sobre los dos
miembros de una igualdad. Para cambiar este comportamiento por defecto, 
v&eacute;ase la variable <code>distribute_over</code>.
</p>
<p>Ejemplos:
</p>
<p>C&aacute;lculo del valor absoluto de n&uacute;meros reales y complejos, incluyendo
constantes num&eacute;ricas e infinitos. El primer ejemplo muestra c&oacute;mo 
<code>abs</code> se distribuye sobre los elementos de una lista.
</p>
<pre class="example">(%i1) abs([-4, 0, 1, 1+%i]);
(%o1)                  [4, 0, 1, sqrt(2)]

(%i2) abs((1+%i)*(1-%i));
(%o2)                           2
(%i3) abs(%e+%i);
                                2
(%o3)                    sqrt(%e  + 1)
(%i4) abs([inf, infinity, minf]);
(%o4)                   [inf, inf, inf]
</pre>
<p>Simplificaci&oacute;n de expresiones que contienen <code>abs</code>:
</p>
<pre class="example">(%i5) abs(x^2);
                                2
(%o5)                          x
(%i6) abs(x^3);
                             2
(%o6)                       x  abs(x)

(%i7) abs(abs(x));
(%o7)                       abs(x)
(%i8) abs(conjugate(x));
(%o8)                       abs(x)
</pre>
<p>Integrando y derivando con la funci&oacute;n <code>abs</code>. N&oacute;tese que se pueden
calcular m&aacute;s integrales que involucren la funci&oacute;n <code>abs</code> si se
carga el paquete <code>abs_integrate</code>. El &uacute;ltimo ejemplo muestra la
transformada de Laplace de <code>abs</code>. V&eacute;ase <code>laplace</code>.
</p>
<pre class="example">(%i9) diff(x*abs(x),x),expand;
(%o9)                       2 abs(x)

(%i10) integrate(abs(x),x);
                             x abs(x)
(%o10)                       --------
                                2

(%i11) integrate(x*abs(x),x);
                           /
                           [
(%o11)                     I x abs(x) dx
                           ]
                           /

(%i12) load(abs_integrate)$
(%i13) integrate(x*abs(x),x);
                      2           3
                     x  abs(x)   x  signum(x)
(%o13)               --------- - ------------
                         2            6

(%i14) integrate(abs(x),x,-2,%pi);
                               2
                            %pi
(%o14)                      ---- + 2
                             2

(%i15) laplace(abs(x),x,s);
                               1
(%o15)                         --
                                2
                               s
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>ceiling</b><i> (<var>x</var>)</i>
<a name="IDX327"></a>
</dt>
<dd><p>Si <var>x</var> es un n&uacute;mero real, devuelve el menor entero mayor o igual que <var>x</var>.  
</p>
<p>Si <var>x</var> es una expresi&oacute;n constante (por ejemplo, <code>10 * %pi</code>), 
<code>ceiling</code> eval&uacute;a <var>x</var> haciendo uso de n&uacute;meros grandes en coma flotante (big floats), aplicando a continuaci&oacute;n
 <code>ceiling</code> al n&uacute;mero decimal obtenido. Puesto que <code>ceiling</code> hace evaluaciones en coma flotante, es posible, pero improbable, que esta funci&oacute;n devuelva un valor err&oacute;neo para entradas constantes. Para evitar estos errores, la evaluaci&oacute;n en punto flotante se lleva a cabo utilizando tres valores para <code>fpprec</code>.
</p>
<p>Para argumentos no constantes, <code>ceiling</code> intenta devolver un valor simplificado. Aqu&iacute; se presentan algunos ejemplos sobre las simplificaciones que <code>ceiling</code> es capaz de hacer:
</p>
<pre class="example">(%i1) ceiling (ceiling (x));
(%o1)                      ceiling(x)
(%i2) ceiling (floor (x));
(%o2)                       floor(x)
(%i3) declare (n, integer)$
(%i4) [ceiling (n), ceiling (abs (n)), ceiling (max (n, 6))];
(%o4)                [n, abs(n), max(n, 6)]
(%i5) assume (x &gt; 0, x &lt; 1)$
(%i6) ceiling (x);
(%o6)                           1
(%i7) tex (ceiling (a));
$$\left \lceil a \right \rceil$$
(%o7)                                false
</pre>
<p>La funci&oacute;n <code>ceiling</code> no se extiende autom&aacute;ticamente a los elementos de listas y matrices.
Por &uacute;ltimo, para todos los argumentos que tengan una forma compleja, <code>ceiling</code> devuelve una forma nominal.
</p>
<p>Si el rango de una funci&oacute;n es subconjunto de los n&uacute;meros enteros, entonces puede ser declarada como <code>integervalued</code>. Tanto <code>ceiling</code> como <code>floor</code> son funciones que hacen uso de esta informaci&oacute;n; por ejemplo:
</p>
<pre class="example">(%i1) declare (f, integervalued)$
(%i2) floor (f(x));
(%o2)                         f(x)
(%i3) ceiling (f(x) - 1);
(%o3)                       f(x) - 1
</pre>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>entier</b><i> (<var>x</var>)</i>
<a name="IDX328"></a>
</dt>
<dd><p>Devuelve el mayor entero menor o igual a <var>x</var>, siendo <var>x</var> num&eacute;rico. La funci&oacute;n  <code>fix</code> (como en
<code>fixnum</code>) es un sin&oacute;nimo, de modo que <code>fix(<var>x</var>)</code> hace justamente lo mismo.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>floor</b><i> (<var>x</var>)</i>
<a name="IDX329"></a>
</dt>
<dd><p>Si <var>x</var> es un n&uacute;mero real, devuelve el mayor entero menor o igual que <var>x</var>.
</p>
<p>Si <var>x</var> es una expresi&oacute;n constante (por ejemplo, <code>10 * %pi</code>), 
<code>floor</code> eval&uacute;a <var>x</var> haciendo uso de n&uacute;meros grandes en coma flotante (big floats), aplicando a continuaci&oacute;n
 <code>floor</code> al n&uacute;mero decimal obtenido. Puesto que <code>floor</code> hace evaluaciones en coma flotante, es posible, pero improbable, que esta funci&oacute;n devuelva un valor err&oacute;neo para entradas constantes. Para evitar estos errores, la evaluaci&oacute;n en punto flotante se lleva a cabo utilizando tres valores para <code>fpprec</code>.
</p>
<p>Para argumentos no constantes, <code>floor</code> intenta devolver un valor simplificado. Aqu&iacute; se presentan algunos ejemplos sobre las simplificaciones que <code>floor</code> es capaz de hacer:
</p>
<pre class="example">(%i1) floor (ceiling (x));
(%o1)                      ceiling(x)
(%i2) floor (floor (x));
(%o2)                       floor(x)
(%i3) declare (n, integer)$
(%i4) [floor (n), floor (abs (n)), floor (min (n, 6))];
(%o4)                [n, abs(n), min(n, 6)]
(%i5) assume (x &gt; 0, x &lt; 1)$
(%i6) floor (x);
(%o6)                           0
(%i7) tex (floor (a));
$$\left \lfloor a \right \rfloor$$
(%o7)                         false
</pre>
<p>La funci&oacute;n <code>floor</code> no se extiende autom&aacute;ticamente a los elementos de listas y matrices.
Por &uacute;ltimo, para todos los argumentos que tengan una forma compleja, <code>floor</code> devuelve una forma nominal.
</p>
<p>Si el rango de una funci&oacute;n es subconjunto de los n&uacute;meros enteros, entonces puede ser declarada como <code>integervalued</code>. Tanto <code>ceiling</code> como <code>floor</code> son funciones que hacen uso de esta informaci&oacute;n; por ejemplo:
</p>
<pre class="example">(%i1) declare (f, integervalued)$
(%i2) floor (f(x));
(%o2)                         f(x)
(%i3) ceiling (f(x) - 1);
(%o3)                       f(x) - 1
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>fix</b><i> (<var>x</var>)</i>
<a name="IDX330"></a>
</dt>
<dd><p>Es un sin&oacute;nimo de  <code>entier (<var>x</var>)</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>lmax</b><i> (<var>L</var>)</i>
<a name="IDX331"></a>
</dt>
<dd><p>Si <var>L</var> es una lista o conjunto, devuelve <code>apply ('max, args (<var>L</var>))</code>.  Si <var>L</var> no es una lista o conjunto, env&iacute;a un mensaje de error.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>lmin</b><i> (<var>L</var>)</i>
<a name="IDX332"></a>
</dt>
<dd><p>Si <var>L</var> es una lista o conjunto, devuelve <code>apply ('min, args (<var>L</var>))</code>.  Si <var>L</var> no es una lista o conjunto, env&iacute;a un mensaje de error.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>max</b><i> (<var>x_1</var>, ..., <var>x_n</var>)</i>
<a name="IDX333"></a>
</dt>
<dd><p>Devuelve un valor simplificado de la mayor de las expresiones desde <var>x_1</var> hasta <var>x_n</var>.
Si <code>get (trylevel, maxmin)</code> es 2 o m&aacute;s, <code>max</code> aplica la simplificaci&oacute;n 
<code>max (e, -e) --&gt; |e|</code>.  Si <code>get (trylevel, maxmin)</code> es 3 o m&aacute;s, <var>max</var> intenta
eliminar las expresiones que est&eacute;n entre otros dos de los argumentos dados; por ejemplo,
<code>max (x, 2*x, 3*x) --&gt; max (x, 3*x)</code>. Para asignar el valor 2 a <code>trylevel</code> se puede hacer
<code>put (trylevel, 2, maxmin)</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>min</b><i> (<var>x_1</var>, ..., <var>x_n</var>)</i>
<a name="IDX334"></a>
</dt>
<dd><p>Devuelve un valor simplificado de la menor de las expresiones desde <var>x_1</var> hasta <var>x_n</var>.
Si <code>get (trylevel, maxmin)</code> es 2 o m&aacute;s, <code>min</code> aplica la simplificaci&oacute;n 
<code>min (e, -e) --&gt; |e|</code>.  Si <code>get (trylevel, maxmin)</code> es 3 o m&aacute;s, <var>min</var> intenta
eliminar las expresiones que est&eacute;n entre otros dos de los argumentos dados; por ejemplo,
<code>min (x, 2*x, 3*x) --&gt; min (x, 3*x)</code>. Para asignar el valor 2 a <code>trylevel</code> se puede hacer
<code>put (trylevel, 2, maxmin)</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>round</b><i> (<var>x</var>)</i>
<a name="IDX335"></a>
</dt>
<dd><p>Si <var>x</var> es un n&uacute;mero real, la funci&oacute;n devuelve el entero m&aacute;s 
pr&oacute;ximo a <var>x</var>. Los m&uacute;ltiplos de 1/2 se redondean al entero par m&aacute;s pr&oacute;ximo.
La evaluaci&oacute;n de <var>x</var> es similar a <code>floor</code> y <code>ceiling</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>signum</b><i> (<var>x</var>)</i>
<a name="IDX336"></a>
</dt>
<dd><p>Tanto sea <var>x</var> real o complejo, la funci&oacute;n <code>signum</code> devuelve 0 si <var>x</var>
es cero. Para un valor no nulo de <var>x</var>, la funci&oacute;n devuelve <code>abs(x)/x</code>.
</p>
<p>Para valores no num&eacute;ricos de <var>x</var>, Maxima intenta determinar el
signo del argumento. Cuando es negativo, cero o positivo, <code>signum</code>
devuelve -1, 0 o 1, respectivamente. En caso de no poder determinarse,
<code>signum</code> devuelve una forma simplificada equivalente. Estas 
simplificaciones incluyen la transformaci&oacute;n de <code>signum(-x)</code>
en <code>-signum(x)</code> y la de <code>signum(x*y)</code> en
<code>signum(x) * signum(y)</code>.
</p>
<p>La funci&oacute;n <code>signum</code> es distributiva respecto de listas,
matrices o ecuaciones. V&eacute;ase <code>distribute_over</code>.
</p>
</dd></dl>








<hr size="6">
<a name="Funciones-para-los-n_00fameros-complejos"></a>
<a name="SEC61"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC60" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC62" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC59" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.2 Funciones para los n&uacute;meros complejos </h2>


<dl>
<dt><u>Funci&oacute;n:</u> <b>cabs</b><i> (<var>expr</var>)</i>
<a name="IDX337"></a>
</dt>
<dd><p>Calcula el valor absoluto de una expresi&oacute;n que representa a un n&uacute;mero
complejo. Al contrario que <code>abs</code>, la funci&oacute;n <code>cabs</code> siempre
descompone su argumento en sus partes real e imaginaria. Si <code>x</code> e
<code>y</code> representan variables o expresiones reales, la funci&oacute;n <code>cabs</code>
calcula el valor absoluto de <code>x + %i*y</code> como
</p><pre class="example">                           2    2
                     sqrt(y  + x )
</pre>
<p>La funci&oacute;n <code>cabs</code> puede utilizar propiedades como la simetr&iacute;a
de funciones complejas para calcular el valor absoluto de una expresi&oacute;n.
</p>
<p><code>cabs</code> no es una funci&oacute;n apropiada para c&aacute;lculos simb&oacute;licos; en tales
casos, que incluyen la integraci&oacute;n, diferenciaci&oacute;n y l&iacute;mites que
contienen valores absolutos, es mejor utilizar <code>abs</code>.
</p>
<p>El resultado devuelto por <code>cabs</code> puede incluir la funci&oacute;n de valor absoluto,
<code>abs</code>, y el arco tangente, <code>atan2</code>.
</p>
<p>Cuando se aplica a una lista o matriz, <code>cabs</code> autom&aacute;ticamente se distribuye
sobre sus elementos. Tambi&eacute;n se distribuye sobre los dos miembros de una 
igualdad.
</p>
<p>Para otras formas de operar con n&uacute;meros complejos, v&eacute;anse las funciones
<code>rectform</code>, <code>realpart</code>, <code>imagpart</code>, <code>carg</code>, <code>conjugate</code>
y <code>polarform</code>.
</p>
<p>Ejemplos:
</p>
<p>Ejemplos con <code>sqrt</code> and <code>sin</code>:
</p>
<pre class="example">(%i1) cabs(sqrt(1+%i*x));
                             2     1/4
(%o1)                      (x  + 1)
(%i2) cabs(sin(x+%i*y));
                    2        2         2        2
(%o2)       sqrt(cos (x) sinh (y) + sin (x) cosh (y))
</pre>
<p>La simetr&iacute;a especular de la funci&oacute;n de error <code>erf</code> se utiliza
para calcular el valor absoluto del argumento complejo:
</p>
<pre class="example">(%i3) cabs(erf(x+%i*y));
                                          2
           (erf(%i y + x) - erf(%i y - x))
(%o3) sqrt(--------------------------------
                          4
                                                               2
                                (erf(%i y + x) + erf(%i y - x))
                              - --------------------------------)
                                               4
</pre>
<p>Dado que Maxima reconoce algunas identidades complejas de las funciones de
Bessel, le permite calcular su valor absoluto cuando tiene argumentos 
complejos. Un ejemplo para <code>bessel_j</code>:
</p>
<pre class="example">(%i4) cabs(bessel_j(1,%i));
(%o4)                 abs(bessel_j(1, %i))
</pre></dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>carg</b><i> (<var>z</var>)</i>
<a name="IDX338"></a>
</dt>
<dd><p>Devuelve el argumento complejo de <var>z</var>.
El argumento complejo es un &aacute;ngulo <code>theta</code> en <code>(-%pi, %pi]</code>
tal que <code>r exp (theta %i) = <var>z</var></code> donde <code>r</code> es la magnitud de <var>z</var>.
</p>
<p>La funci&oacute;n <code>carg</code> es computacional, no simplificativa.
</p>
<p>V&eacute;anse tambi&eacute;n <code>abs</code> (m&oacute;dulo complejo), <code>polarform</code>, <code>rectform</code>,
<code>realpart</code> y <code>imagpart</code>.
</p>
<p>Ejemplos:
</p>

<pre class="example">(%i1) carg (1);
(%o1)                           0
(%i2) carg (1 + %i);
                               %pi
(%o2)                          ---
                                4
(%i3) carg (exp (%i));
(%o3)                           1
(%i4) carg (exp (%pi * %i));
(%o4)                          %pi
(%i5) carg (exp (3/2 * %pi * %i));
                                %pi
(%o5)                         - ---
                                 2
(%i6) carg (17 * exp (2 * %i));
(%o6)                           2
</pre>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>conjugate</b><i> (<var>x</var>)</i>
<a name="IDX339"></a>
</dt>
<dd><p>Devuelve el conjugado complejo de <var>x</var>.
</p>
<pre class="example">(%i1) declare ([aa, bb], real, cc, complex, ii, imaginary);

(%o1)                         done
(%i2) conjugate (aa + bb*%i);

(%o2)                      aa - %i bb
(%i3) conjugate (cc);

(%o3)                     conjugate(cc)
(%i4) conjugate (ii);

(%o4)                         - ii
(%i5) conjugate (xx + yy);

(%o5)             conjugate(yy) + conjugate(xx)
</pre>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>imagpart</b><i> (<var>expr</var>)</i>
<a name="IDX340"></a>
</dt>
<dd><p>Devuelve la parte imaginaria de la expresi&oacute;n <var>expr</var>.
</p>
<p>La funci&oacute;n <code>imagpart</code> es computacional,
no simplificativa.
</p>
<p>V&eacute;anse tambi&eacute;n <code>abs</code>, <code>carg</code>, <code>polarform</code>, <code>rectform</code> y <code>realpart</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>polarform</b><i> (<var>expr</var>)</i>
<a name="IDX341"></a>
</dt>
<dd><p>Devuelve una expresi&oacute;n de la forma <code>r %e^(%i theta)</code> equivalente a <var>expr</var>,
con <code>r</code> y <code>theta</code> son reales.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>realpart</b><i> (<var>expr</var>)</i>
<a name="IDX342"></a>
</dt>
<dd><p>Devuelve la parte real de <var>expr</var>. La funciones <code>realpart</code> y <code>imagpart</code> operan tambi&eacute;n con expresiones que contengan funciones trigonom&eacute;tricas e hiperb&oacute;licas, ra&iacute;ces cuadradas, logaritmos y exponentes.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>rectform</b><i> (<var>expr</var>)</i>
<a name="IDX343"></a>
</dt>
<dd><p>Devuelve una expresi&oacute;n de la forma <code>a + b %i</code> equivalente a <var>expr</var>, con <var>a</var> y <var>b</var> reales.
</p>
</dd></dl>







<hr size="6">
<a name="Funciones-combinatorias"></a>
<a name="SEC62"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC61" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC63" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC59" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.3 Funciones combinatorias </h2>



<dl>
<dt><u>Operador:</u> <b>!!</b>
<a name="IDX344"></a>
</dt>
<dd><p>El operador doble factorial.
</p>
<p>Para un n&uacute;mero entero, de punto flotante o racional <code>n</code>,
<code>n!!</code> se evaluar&aacute; como el producto de <code>n (n-2) (n-4) (n-6) ... (n - 2 (k-1))</code>
donde <code>k</code> es igual a <code>entier(n/2)</code>, que es, el mayor entero
menor o igual a <code>n/2</code>. 
Note que esta definici&oacute;n no coincide con otras definciones publicadas para argumentos, los cuales no son enteros. 
</p>

<p>Para un entero par (o impar) <code>n</code>, <code>n!</code> se evalua el producto de
todos los enteros pares (o impares) consecutivos desde 2 (o 1) por <code>n</code> inclusive.  
</p>
<p>Para un argumento <code>n</code> el cual no es un n&uacute;mero entero, punto flotante o racional, <code>n!!</code> produce una forma de nombre <code>genfact (n, n/2, 2)</code>. 
</p>

</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>binomial</b><i> (<var>x</var>, <var>y</var>)</i>
<a name="IDX345"></a>
</dt>
<dd><p>Es el coeficiente binomial <code><var>x</var>!/(<var>y</var>! (<var>x</var> - <var>y</var>)!)</code>.
Si <var>x</var> y <var>y</var> son enteros, entonces se calcula el valor num&eacute;rico 
del coeficiente binomial. Si <var>y</var> o <var>x - y</var> son enteros, 
el coeficiente binomial se expresa como un polinomio.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) binomial (11, 7);
(%o1)                          330
(%i2) 11! / 7! / (11 - 7)!;
(%o2)                          330
(%i3) binomial (x, 7);
        (x - 6) (x - 5) (x - 4) (x - 3) (x - 2) (x - 1) x
(%o3)   -------------------------------------------------
                              5040
(%i4) binomial (x + 7, x);
      (x + 1) (x + 2) (x + 3) (x + 4) (x + 5) (x + 6) (x + 7)
(%o4) -------------------------------------------------------
                               5040
(%i5) binomial (11, y);
(%o5)                    binomial(11, y)
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>factcomb</b><i> (<var>expr</var>)</i>
<a name="IDX346"></a>
</dt>
<dd><p>Trata de combinar los coeficientes de los factoriales de <var>expr</var> con los mismos factoriales, convirtiendo, por ejemplo, <code>(n + 1)*n!</code> en <code>(n + 1)!</code>.
</p>
<p>Si la variable <code>sumsplitfact</code> vale <code>false</code> har&aacute; que <code>minfactorial</code> se aplique despu&eacute;s de <code>factcomb</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>factorial</b><i> (<var>x</var>)</i>
<a name="IDX347"></a>
</dt>
<dt><u>Operador:</u> <b>!</b>
<a name="IDX348"></a>
</dt>
<dd><p>Representa la funci&oacute;n factorial. Maxima considera <code>factorial (<var>x</var>)</code>
y <code><var>x</var>!</code> como sin&oacute;nimos.
</p>
<p>Para cualquier n&uacute;mero complejo <code>x</code>, excepto para
enteros negativos, <code>x!</code> se define como <code>gamma(x+1)</code>. 
</p>
<p>Para un entero <code>x</code>, <code>x!</code> se reduce al producto de los enteros
desde 1 hasta <code>x</code> inclusive. <code>0!</code> se reduce a 1.
Para un n&uacute;mero real o complejo en formato de coma flotante <code>x</code>, 
<code>x!</code> se reduce al valor de <code>gamma(x+1)</code>. Cuando
<code>x</code> es igual a <code>n/2</code>, siendo <code>n</code> un entero impar, entonces
<code>x!</code> se reduce a un factor racional multiplicado por <code>sqrt(%pi)</code>
(pues <code>gamma(1/2)</code>) es igual a <code>sqrt(%pi)</code>).
</p>
<p>Las variables opcionales <code>factlim</code> y <code>gammalim</code> controlan la
evaluaci&oacute;n num&eacute;rica de factoriales de argumentos enteros y racionales.
</p>
<p>Las funciones <code>minfactorial</code> y <code>factcomb</code> simplifican expresiones
que contiene factoriales.
</p>
<p>V&eacute;anse tambi&eacute;n <code>factlim</code>, <code>gammalim</code>, <code>minfactorial</code> y 
<code>factcomb</code>.
</p>
<p>Las funciones <code>gamma</code>, <code>bffac</code> y <code>cbffac</code> son variaciones de
la funci&oacute;n matem&aacute;tica gamma. Las funciones <code>bffac</code> y <code>cbffac</code> 
son llamadas internamente desde <code>gamma</code> para evaluar la funci&oacute;n gamma 
de n&uacute;meros reales y complejos decimales con precisi&oacute;n de reales grandes
(bigfloats).
</p>
<p>Las funciones <code>makegamma</code> substituye a <code>gamma</code> para factoriales 
y funciones relacionadas. 
</p>
<p>Maxima reconoce la derivada de la funci&oacute;n factorial y los l&iacute;mites
para ciertos valores espec&iacute;ficos, tales como los enteros negativos.
</p>
<p>La variable opcional <code>factorial_expand</code> controla la simplificaci&oacute;n de
expresiones como <code>(n+x)!</code>, para <code>n</code> entero.
</p>
<p>V&eacute;ase tambi&eacute;n <code>binomial</code>.
</p>
<p>Ejemplos:
</p>
<p>El factorial de un entero se reduce a un n&uacute;mero exacto, a menos que
el argumento sea mayor que <code>factlim</code>. Los factoriales de n&uacute;meros
reales o complejos se eval&uacute;an como decimales de coma flotante.
</p>
<pre class="example">(%i1) factlim:10;
(%o1)                                 10
(%i2) [0!, (7/2)!, 8!, 20!];
                            105 sqrt(%pi)
(%o2)                   [1, -------------, 40320, 20!]
                                 16
(%i3) [4.77!, (1.0+%i)!];
(%o3)    [81.44668037931197, 
          .3430658398165454 %i + .6529654964201665]
(%i4) [2.86b0!, (1.0b0+%i)!];
(%o4) [5.046635586910012b0, 
       3.430658398165454b-1 %i + 6.529654964201667b-1]
</pre>
<p>El factorial de una constante conocida o de una expresi&oacute;n general
no se calcula. Pero puede ser posible reducir el factorial despu&eacute;s de
evaluado el argumento.
</p>
<pre class="example">(%i1) [(%i + 1)!, %pi!, %e!, (cos(1) + sin(1))!];
(%o1)      [(%i + 1)!, %pi!, %e!, (sin(1) + cos(1))!]
(%i2) ev (%, numer, %enumer);
(%o2) [.3430658398165454 %i + .6529654964201665, 
       7.188082728976031, 
       4.260820476357003, 1.227580202486819]
</pre>
<p>Los factoriales son simplificados o reducidos, no evaluados.
As&iacute; <code>x!</code> puede ser reemplazado en una expresi&oacute;n 
nominal. 
</p>
<pre class="example">(%i1) '([0!, (7/2)!, 4.77!, 8!, 20!]);
          105 sqrt(%pi)
(%o1) [1, -------------, 81.44668037931199, 40320, 
               16
                             2432902008176640000]
</pre>
<p>Maxima reconoce la derivada de la funci&oacute;n factorial.
</p>
<pre class="example">(%i1) diff(x!,x);
(%o1)                           x! psi (x + 1)
                                      0
</pre>
<p>La variable opcional <code>factorial_expand</code> controla la simplificaci&oacute;n de
expresiones con la funci&oacute;n factorial.
</p>
<pre class="example">(%i1) (n+1)!/n!,factorial_expand:true;
(%o1)                                n + 1
</pre></dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>factlim</b>
<a name="IDX349"></a>
</dt>
<dd><p>Valor por defecto: -1
</p>
<p>La variable <code>factlim</code> especifica el mayor factorial que ser&aacute; expandido autom&aacute;ticamente.  Si su valor es -1, entonces se expandir&aacute;n todos los enteros.
</p>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>factorial_expand</b>
<a name="IDX350"></a>
</dt>
<dd><p>Valor por defecto: false
</p>
<p>La variable <code>factorial_expand</code> controla la simplificaci&oacute;n
de expresiones tales como <code>(n+1)!</code>, siendo <code>n</code> un entero. 
</p>
<p>V&eacute;ase <code>!</code> para un ejemplo.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>genfact</b><i> (<var>x</var>, <var>y</var>, <var>z</var>)</i>
<a name="IDX351"></a>
</dt>
<dd><p>Devuelve el factorial generalizado, definido como
<code>x (x-z) (x - 2 z) ... (x - (y - 1) z)</code>.  As&iacute;, para el entero <var>x</var>,
<code>genfact (x, x, 1) = x!</code> y <code>genfact (x, x/2, 2) = x!!</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>minfactorial</b><i> (<var>expr</var>)</i>
<a name="IDX352"></a>
</dt>
<dd><p>Busca en <var>expr</var> la presencia de dos factoriales que solo se
diferencien en una unidad; en tal caso, <code>minfactorial</code>
devuelve una expresi&oacute;n simplificada.
</p>
<pre class="example">(%i1) n!/(n+2)!;
                               n!
(%o1)                       --------
                            (n + 2)!
(%i2) minfactorial (%);
                                1
(%o2)                    ---------------
                         (n + 1) (n + 2)
</pre>
</dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>sumsplitfact</b>
<a name="IDX353"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>sumsplitfact</code> vale <code>false</code>,
<code>minfactorial</code> se aplica despu&eacute;s de  <code>factcomb</code>.
</p>
</dd></dl>









<hr size="6">
<a name="Funciones-radicales-exponenciales-y-logar_00edtmicas"></a>
<a name="SEC63"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC62" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC64" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC59" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.4 Funciones radicales, exponenciales y logar&iacute;tmicas </h2>


<dl>
<dt><u>Variable opcional:</u> <b>%e_to_numlog</b>
<a name="IDX354"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>%e_to_numlog</code> vale <code>true</code>, <code>r</code> es un n&uacute;mero racional y <code>x</code> una expresi&oacute;n, <code>%e^(r*log(x))</code> se reduce a <code>x^r</code> .  T&eacute;ngase en cuenta que la instrucci&oacute;n <code>radcan</code> tambi&eacute;n hace este tipo de transformaciones, as&iacute; como otras m&aacute;s complicadas. La instrucci&oacute;n <code>logcontract</code> &quot;contrae&quot; expresiones que contienen alg&uacute;n <code>log</code>.
</p></dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>%emode</b>
<a name="IDX355"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>%emode</code> vale <code>true</code>,
<code>%e^(%pi %i x)</code> se simplifica como sigue.
</p>
<p><code>%e^(%pi %i x)</code> se simplifica a <code>cos (%pi x) + %i sin (%pi x)</code> si <code>x</code> es
un n&uacute;mero decimal de coma flotante, un entero o un m&uacute;ltiplo de 1/2, 1/3, 1/4 o 1/6, y luego se sigue simplificando.
</p>
<p>Para otros valores num&eacute;ricos de <code>x</code>,
<code>%e^(%pi %i x)</code> se simplifica a <code>%e^(%pi %i y)</code> donde <code>y</code> es <code>x - 2 k</code>
para alg&uacute;n entero <code>k</code> tal que <code>abs(y) &lt; 1</code>.  
</p>
<p>Si <code>%emode</code> vale <code>false</code>, no se realizan simplificaciones especiales a <code>%e^(%pi %i x)</code>.
</p>
</dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>%enumer</b>
<a name="IDX356"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si la variable <code>%enumer</code> vale <code>true</code> hace que <code>%e</code> se reemplace por
2.718...  siempre que <code>numer</code> valga <code>true</code>. 
</p>
<p>Si <code>%enumer</code> vale <code>false</code>, esta sustituci&oacute;n se realiza s&oacute;lo si el exponente en <code>%e^x</code> tiene un valor num&eacute;rico.
</p>
<p>V&eacute;anse tambi&eacute;n <code>ev</code> y <code>numer</code>.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>exp</b><i> (<var>x</var>)</i>
<a name="IDX357"></a>
</dt>
<dd><p>Representa la funci&oacute;n exponencial.  
La expresi&oacute;n  <code>exp (<var>x</var>)</code> en la entrada se simplifica en <code>%e^<var>x</var></code>;
<code>exp</code> no aparece en expresiones simplificadas.
</p>
<p>Si la variable <code>demoivre</code> vale <code>true</code> hace que <code>%e^(a + b %i)</code> se simplifique a
<code>%e^(a (cos(b) + %i sin(b)))</code> si <code>b</code> no contiene a <code>%i</code>. V&eacute;ase <code>demoivre</code>.
</p>
<p>Si la variable <code>%emode</code> vale <code>true</code>, 
hace que  <code>%e^(%pi %i x)</code> se simplifique. V&eacute;ase <code>%emode</code>.
</p>
<p>Si la variable <code>%enumer</code> vale <code>true</code> hace que <code>%e</code> se reemplace por
2.718...  siempre que <code>numer</code> valga <code>true</code>. V&eacute;ase <code>%enumer</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>li</b><i> [<var>s</var>] (<var>z</var>)</i>
<a name="IDX358"></a>
</dt>
<dd><p>Representa la funci&oacute;n polilogar&iacute;tmica de orden <var>s</var> y argumento <var>z</var>,
definida por la serie infinita
</p>
<pre class="example">                                 inf
                                 ====   k
                                 \     z
                        Li (z) =  &gt;    --
                          s      /      s
                                 ====  k
                                 k = 1
</pre>
<p><code>li [1]</code> es <code>- log (1 - z)</code>.
<code>li [2]</code> y <code>li [3]</code> son las funciones di- y trilogaritmo, respectivamente.
</p>
<p>Cuando el orden es 1, el polilogaritmo se simplifica a <code>- log (1 - z)</code>,
el cual a su vez se reduce a un valor num&eacute;rico si <var>z</var> es un n&uacute;mero
real o complejo en coma flotante o si est&aacute; presente el t&eacute;rmino <code>numer</code>.
</p>
<p>Cuando el orden es 2 &oacute; 3,
el polilogaritmo se reduce a un valor num&eacute;rico si <var>z</var> es
un n&uacute;mero real en coma flotante o si est&aacute; presente el t&eacute;rmino <code>numer</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) assume (x &gt; 0);
(%o1)                        [x &gt; 0]
(%i2) integrate ((log (1 - t)) / t, t, 0, x);
(%o2)                       - li (x)
                                2
(%i3) li [2] (7);
(%o3)                        li (7)
                               2
(%i4) li [2] (7), numer;
(%o4)        1.24827317833392 - 6.113257021832577 %i
(%i5) li [3] (7);
(%o5)                        li (7)
                               3
(%i6) li [2] (7), numer;
(%o6)        1.24827317833392 - 6.113257021832577 %i
(%i7) L : makelist (i / 4.0, i, 0, 8);
(%o7)   [0.0, 0.25, 0.5, 0.75, 1.0, 1.25, 1.5, 1.75, 2.0]
(%i8) map (lambda ([x], li [2] (x)), L);
(%o8) [0, .2676526384986274, .5822405249432515, 
.9784693966661848, 1.64493407, 2.190177004178597
 - .7010261407036192 %i, 2.374395264042415
 - 1.273806203464065 %i, 2.448686757245154
 - 1.758084846201883 %i, 2.467401098097648
 - 2.177586087815347 %i]
(%i9) map (lambda ([x], li [3] (x)), L);
(%o9) [0, .2584613953442624, 0.537213192678042, 
.8444258046482203, 1.2020569, 1.642866878950322
 - .07821473130035025 %i, 2.060877505514697
 - .2582419849982037 %i, 2.433418896388322
 - .4919260182322965 %i, 2.762071904015935
 - .7546938285978846 %i]
</pre>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>log</b><i> (<var>x</var>)</i>
<a name="IDX359"></a>
</dt>
<dd><p>Representa el logaritmo natural (en base <em>e</em>) de <var>x</var>.
</p>
<p>Maxima no tiene definida una funci&oacute;n para el logaritmo de base 10 u
otras bases. El usuario puede hacer uso de la definici&oacute;n 
<code>log10(x) := log(x) / log(10)</code>.
</p>
<p>La simplificaci&oacute;n y evaluaci&oacute;n de logaritmos se controla con
ciertas variables globales:
</p>
<dl compact="compact">
<dt> <code><code>logexpand</code></code></dt>
<dd><p>hace que <code>log(a^b)</code> se convierta en <code>b*log(a)</code>.
Si toma el valor <code>all</code>, <code>log(a*b)</code> tambi&eacute;n se reducir&aacute; a  <code>log(a)+log(b)</code>.
Si toma el valor <code>super</code>, entonces <code>log(a/b)</code> tambi&eacute;n se reducir&aacute; a
<code>log(a)-log(b)</code>, siendo <code>a/b</code> racional con <code>a#1</code>, 
(la expresi&oacute;n <code>log(1/b)</code>, para <code>b</code> entero, se simplifica siempre). 
Si toma el valor  <code>false</code>, se desactivar&aacute;n todas estas simplificaciones.
</p>
</dd>
<dt> <code><code>logsimp</code></code></dt>
<dd><p>si vale <code>false</code>, entonces no se transforma <code>%e</code> a potencias que contengan logaritmos.
</p>
</dd>
<dt> <code><code>lognegint</code></code></dt>
<dd><p>si vale <code>true</code> se aplica la regla <code>log(-n)</code> -&gt; <code>log(n)+%i*%pi</code>,
siendo <code>n</code> un entero positivo.
</p>
</dd>
<dt> <code><code>%e_to_numlog</code></code></dt>
<dd><p>si vale <code>true</code>, <code>r</code> es un n&uacute;mero racional y <code>x</code> una expresi&oacute;n,
<code>%e^(r*log(x))</code> se reduce a <code>x^r</code>. T&eacute;ngase en cuenta que la 
instrucci&oacute;n <code>radcan</code> tambi&eacute;n hace este tipo de transformaciones, 
as&iacute; como otras m&aacute;s complicadas. La instrucci&oacute;n <code>logcontract</code>
&quot;contrae&quot; expresiones que contengan alg&uacute;n <code>log</code>.
</p></dd>
</dl>

</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>logabs</b>
<a name="IDX360"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Cuando se calculan integrales indefinidas en las que se generan logaritmos, como en <code>integrate(1/x,x)</code>, el resultado se devuelve de la forma  <code>log(abs(...))</code> si <code>logabs</code> vale <code>true</code>, o de la forma <code>log(...)</code> si
<code>logabs</code> vale <code>false</code>. En la integraci&oacute;n definida se hace la asignaci&oacute;n <code>logabs:true</code>, ya que aqu&iacute; es normalmente necesario evaluar la integral indefinida en los extremos del intervalo de integraci&oacute;n.
</p>
</dd></dl>

<dl>
<dt><u>Variable opcional:</u> <b>logarc</b>
<a name="IDX361"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>logarc</b><i> (<var>expr</var>)</i>
<a name="IDX362"></a>
</dt>
<dd><p>Si la variable global <code>logarc</code> toma el valor <code>true</code>,
las funciones circulares e hiperb&oacute;licas inversas se 
reemplazan por funciones logar&iacute;tmicas equivalentes.
El valor por defecto de <code>logarc</code> es <code>false</code>.
</p>
<p>La funci&oacute;n <code>logarc(<var>expr</var>)</code> realiza la anterior transformaci&oacute;n
en la expresi&oacute;n <var>expr</var> sin necesidad de alterar el valor de la
variable global <code>logarc</code>.
</p>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>logconcoeffp</b>
<a name="IDX363"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Controla qu&eacute; coeficientes se contraen cuando se utiliza <code>logcontract</code>. Se le puede asignar el nombre de una funci&oacute;n de predicado de un argumento; por ejemplo, si se quiere introducir ra&iacute;ces cuadradas, se puede hacer <code>logconcoeffp:'logconfun$ logconfun(m):=featurep(m,integer) or ratnump(m)$</code> .  Entonces 
<code>logcontract(1/2*log(x));</code> devolver&aacute; <code>log(sqrt(x))</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>logcontract</b><i> (<var>expr</var>)</i>
<a name="IDX364"></a>
</dt>
<dd><p>Analiza la expresi&oacute;n <var>expr</var> recursivamente, transformando subexpresiones de la forma <code>a1*log(b1) + a2*log(b2) + c</code> en <code>log(ratsimp(b1^a1 * b2^a2)) + c</code>
</p>
<pre class="example">(%i1) 2*(a*log(x) + 2*a*log(y))$
(%i2) logcontract(%);
                                 2  4
(%o2)                     a log(x  y )

</pre>
<p>Si se hace <code>declare(n,integer);</code> entonces <code>logcontract(2*a*n*log(x));</code> da
<code>a*log(x^(2*n))</code>.  Los coeficientes que se contraen de esta manera son aquellos que como el 2 y el <code>n</code> satisfacen 
<code>featurep(coeff,integer)</code>. El usuario puede controlar qu&eacute; coeficientes se contraen asign&aacute;ndole a la variable global <code>logconcoeffp</code> el nombre de una funci&oacute;n de predicado de un argumento; por ejemplo, si se quiere introducir ra&iacute;ces cuadradas, se puede hacer <code>logconcoeffp:'logconfun$ logconfun(m):=featurep(m,integer) or ratnump(m)$</code> .  Entonces <code>logcontract(1/2*log(x));</code> devolver&aacute; <code>log(sqrt(x))</code>.
</p>
</dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>logexpand</b>
<a name="IDX365"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>logexpand</code> vale <code>true</code> hace que <code>log(a^b)</code> se convierta
en <code>b*log(a)</code>. Si toma el valor <code>all</code>, <code>log(a*b)</code> tambi&eacute;n se
reducir&aacute; a  <code>log(a)+log(b)</code>. Si toma el valor <code>super</code>, entonces 
<code>log(a/b)</code> tambi&eacute;n se reducir&aacute; a <code>log(a)-log(b)</code>, siendo 
<code>a/b</code> racional con <code>a#1</code>,  (la expresi&oacute;n <code>log(1/b)</code>, para
<code>b</code> entero, se simplifica siempre). Si toma el valor  <code>false</code>,
se desactivar&aacute;n todas estas simplificaciones.
</p></dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>lognegint</b>
<a name="IDX366"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>lognegint</code> vale <code>true</code> se aplica la regla <code>log(-n)</code> -&gt; <code>log(n)+%i*%pi</code> siendo <code>n</code> un entero positivo.
</p>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>logsimp</b>
<a name="IDX367"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>logsimp</code> vale <code>false</code>, entonces no se transforma <code>%e</code> a potencias que contengan logaritmos.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>plog</b><i> (<var>x</var>)</i>
<a name="IDX368"></a>
</dt>
<dd><p>Representa la rama principal del logaritmo natural complejo con <code>-%pi</code> &lt; <code>carg(<var>x</var>)</code> &lt;= <code>+%pi</code> .
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>sqrt</b><i> (<var>x</var>)</i>
<a name="IDX369"></a>
</dt>
<dd><p>Ra&iacute;z cuadrada de <var>x</var>. Se representa internamente por <code><var>x</var>^(1/2)</code>.  V&eacute;ase tambi&eacute;n <code>rootscontract</code>.
</p>
<p>Si la variable <code>radexpand</code> vale <code>true</code> har&aacute; que las ra&iacute;ces <code>n</code>-&eacute;simas de los factores de un producto que sean potencias de <code>n</code> sean extra&iacute;das del radical; por ejemplo, <code>sqrt(16*x^2)</code> se convertir&aacute; en <code>4*x</code> s&oacute;lo si <code>radexpand</code> vale <code>true</code>.
</p>
</dd></dl>









<hr size="6">
<a name="Funciones-trigonom_00e9tricas"></a>
<a name="SEC64"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC63" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC65" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC59" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.5 Funciones trigonom&eacute;tricas </h2>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC65">10.5.1 Introducci&oacute;n a la trigonometr&iacute;a</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">  
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC66">10.5.2 Funciones y variables para trigonometr&iacute;a</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top"> 
</td></tr>
</table>


<hr size="6">
<a name="Introducci_00f3n-a-la-trigonometr_00eda"></a>
<a name="SEC65"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC64" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC66" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC64" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 10.5.1 Introducci&oacute;n a la trigonometr&iacute;a </h3>


<p>Maxima reconoce muchas funciones trigonom&eacute;tricas. No est&aacute;n programadas todas las identidades trigonom&eacute;tricas, pero el usuario puede a&ntilde;adir muchas de ellas haciendo uso de las t&eacute;cnicas basadas en patrones.  Las funciones trigonom&eacute;tricas definidas en Maxima son:  <code>acos</code>,
<code>acosh</code>, <code>acot</code>, <code>acoth</code>, <code>acsc</code>,
<code>acsch</code>, <code>asec</code>, <code>asech</code>, <code>asin</code>, 
<code>asinh</code>, <code>atan</code>, <code>atanh</code>, <code>cos</code>, 
<code>cosh</code>, <code>cot</code>, <code>coth</code>, <code>csc</code>, <code>csch</code>, 
<code>sec</code>, <code>sech</code>, <code>sin</code>, <code>sinh</code>, <code>tan</code> y 
<code>tanh</code>. Hay tambi&eacute;n un determinado n&uacute;mero de instrucciones especiales para manipular funciones trigonom&eacute;tricas;  v&eacute;anse a este respecto <code>trigexpand</code>,
<code>trigreduce</code> y la variable <code>trigsign</code>.  Dos paquetes adicionales ampl&iacute;an las reglas de simplificaci&oacute;n de Maxima, <code>ntrig</code> y <code>atrig1</code>.  Ejec&uacute;tese <code>describe(<var>command</var>)</code> para m&aacute;s detalles.
</p>







<hr size="6">
<a name="Funciones-y-variables-para-trigonometr_00eda"></a>
<a name="SEC66"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC65" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC67" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC64" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 10.5.2 Funciones y variables para trigonometr&iacute;a </h3>




<dl>
<dt><u>Variable opcional:</u> <b>%piargs</b>
<a name="IDX370"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>%piargs</code> vale <code>true</code>, las funciones trigonom&eacute;tricas
se simplifican a constantes algebraicas cuando el argumento es m&uacute;ltiplo
entero de 
<em>%pi</em>, <em>%pi/2</em>, <em>%pi/3</em>, <em>%pi/4</em> o <em>%pi/6</em>.
</p>
<p>Maxima conoce algunas identidades aplicables cuando <em>%pi</em>, etc.,
se multiplican por una variable entera (esto es, un s&iacute;mbolo
declarado como entero).
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) %piargs : false$
(%i2) [sin (%pi), sin (%pi/2), sin (%pi/3)];
                                %pi       %pi
(%o2)            [sin(%pi), sin(---), sin(---)]
                                 2         3
(%i3) [sin (%pi/4), sin (%pi/5), sin (%pi/6)];
                      %pi       %pi       %pi
(%o3)            [sin(---), sin(---), sin(---)]
                       4         5         6
(%i4) %piargs : true$
(%i5) [sin (%pi), sin (%pi/2), sin (%pi/3)];
                                sqrt(3)
(%o5)                    [0, 1, -------]
                                   2
(%i6) [sin (%pi/4), sin (%pi/5), sin (%pi/6)];
                         1         %pi   1
(%o6)                [-------, sin(---), -]
                      sqrt(2)       5    2
(%i7) [cos (%pi/3), cos (10*%pi/3), tan (10*%pi/3),
       cos (sqrt(2)*%pi/3)];
                1    1               sqrt(2) %pi
(%o7)          [-, - -, sqrt(3), cos(-----------)]
                2    2                    3
</pre>

<p>Se aplican ciertas identidades cuando <em>%pi</em> o <em>%pi/2</em> se multiplican por una variable entera.
</p>
<pre class="example">(%i1) declare (n, integer, m, even)$
(%i2) [sin (%pi * n), cos (%pi * m), sin (%pi/2 * m),
       cos (%pi/2 * m)];
                                      m/2
(%o2)                  [0, 1, 0, (- 1)   ]
</pre>
</dd></dl>




<dl>
<dt><u>Variable opcional:</u> <b>%iargs</b>
<a name="IDX371"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Cuando <code>%iargs</code> vale <code>true</code>, las funciones trigonom&eacute;tricas
se simplifican a funciones hiperb&oacute;licas
si el argumento es aparentemente un m&uacute;ltiplo de la unidad imaginaria <em>%i</em>.
</p>
<p>La simplificaci&oacute;n se lleva a cabo incluso cuando el argumento es manifiestamente real;
Maxima s&oacute;lo se fija en si el argumento es un m&uacute;ltiplo literal de <em>%i</em>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) %iargs : false$
(%i2) [sin (%i * x), cos (%i * x), tan (%i * x)];
(%o2)           [sin(%i x), cos(%i x), tan(%i x)]
(%i3) %iargs : true$
(%i4) [sin (%i * x), cos (%i * x), tan (%i * x)];
(%o4)           [%i sinh(x), cosh(x), %i tanh(x)]
</pre>
<p>La simplificaci&oacute;n se aplica incluso en el caso de que
el argumento se reduzca a un n&uacute;mero real.
</p>
<pre class="example">(%i1) declare (x, imaginary)$
(%i2) [featurep (x, imaginary), featurep (x, real)];
(%o2)                     [true, false]
(%i3) sin (%i * x);
(%o3)                      %i sinh(x)
</pre>
</dd></dl>





<dl>
<dt><u>Function:</u> <b>acos</b><i> (<var>x</var>)</i>
<a name="IDX372"></a>
</dt>
<dd><p>Arco coseno.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>acosh</b><i> (<var>x</var>)</i>
<a name="IDX373"></a>
</dt>
<dd><p>Arco coseno hiperb&oacute;lico.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>acot</b><i> (<var>x</var>)</i>
<a name="IDX374"></a>
</dt>
<dd><p>Arco cotangente.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>acoth</b><i> (<var>x</var>)</i>
<a name="IDX375"></a>
</dt>
<dd><p>Arco cotangente hiperb&oacute;lica.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>acsc</b><i> (<var>x</var>)</i>
<a name="IDX376"></a>
</dt>
<dd><p>Arco cosecante.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>acsch</b><i> (<var>x</var>)</i>
<a name="IDX377"></a>
</dt>
<dd><p>Arco cosecante hiperb&oacute;lica.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>asec</b><i> (<var>x</var>)</i>
<a name="IDX378"></a>
</dt>
<dd><p>Arco secante.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>asech</b><i> (<var>x</var>)</i>
<a name="IDX379"></a>
</dt>
<dd><p>Arco secante hiperb&oacute;lica.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>asin</b><i> (<var>x</var>)</i>
<a name="IDX380"></a>
</dt>
<dd><p>Arco seno.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>asinh</b><i> (<var>x</var>)</i>
<a name="IDX381"></a>
</dt>
<dd><p>Arco seno hiperb&oacute;lico.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>atan</b><i> (<var>x</var>)</i>
<a name="IDX382"></a>
</dt>
<dd><p>Arco tangente.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>atan2</b><i> (<var>y</var>, <var>x</var>)</i>
<a name="IDX383"></a>
</dt>
<dd><p>Calcula el valor de <code>atan(<var>y</var>/<var>x</var>)</code> en el intervalo de <code>-%pi</code> a <code>%pi</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>atanh</b><i> (<var>x</var>)</i>
<a name="IDX384"></a>
</dt>
<dd><p>Arco tangente hiperb&oacute;lica.
</p>
</dd></dl>

<dl>
<dt><u>Paquete:</u> <b>atrig1</b>
<a name="IDX385"></a>
</dt>
<dd><p>El paquete <code>atrig1</code> contiene ciertas reglas de simplificaci&oacute;n adicionales para las funciones trigonom&eacute;tricas inversas. Junto con las reglas que ya conoce Maxima, los siguientes &aacute;ngulos est&aacute;n completamente implementados:
<code>0</code>, <code>%pi/6</code>, <code>%pi/4</code>, <code>%pi/3</code> y <code>%pi/2</code>.  
Los &aacute;ngulos correspondientes en los otros tres cuadrantes tambi&eacute;n est&aacute;n disponibles.  
Para hacer uso de estas reglas, ejec&uacute;tese <code>load(atrig1);</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>cos</b><i> (<var>x</var>)</i>
<a name="IDX386"></a>
</dt>
<dd><p>Coseno.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>cosh</b><i> (<var>x</var>)</i>
<a name="IDX387"></a>
</dt>
<dd><p>Coseno hiperb&oacute;lico.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>cot</b><i> (<var>x</var>)</i>
<a name="IDX388"></a>
</dt>
<dd><p>Cotangente.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>coth</b><i> (<var>x</var>)</i>
<a name="IDX389"></a>
</dt>
<dd><p>Cotangente hiperb&oacute;lica.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>csc</b><i> (<var>x</var>)</i>
<a name="IDX390"></a>
</dt>
<dd><p>Cosecante.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>csch</b><i> (<var>x</var>)</i>
<a name="IDX391"></a>
</dt>
<dd><p>Cosecante hiperb&oacute;lica.
</p>
</dd></dl>


<dl>
<dt><u>Variable opcional:</u> <b>halfangles</b>
<a name="IDX392"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>halfangles</code> vale <code>true</code>, las funciones
trigonom&eacute;tricas con argumentos del tipo <code><var>expr</var>/2</code>
se simplifican a funciones con argumentos <var>expr</var>.
</p>
<p>Para un argumento real <var>x</var> en el intervalo <code>0 &lt; x &lt; 2*%pi</code>
el seno del semi&aacute;ngulo se simplifica como
</p>
<pre class="example">                    sqrt(1 - cos(x))
                    ----------------
                        sqrt(2)
</pre>
<p>Se necesita un factor relativamente complicado para que esta f&oacute;rmula
sea tambi&eacute;n v&aacute;lida para cualquier argumento complejo <var>z</var>:
</p>
<pre class="example">           realpart(z)
     floor(-----------)
              2 %pi
(- 1)                   (1 - unit_step(- imagpart(z))

                      realpart(z)            realpart(z)
                floor(-----------) - ceiling(-----------)
                         2 %pi                  2 %pi
          ((- 1)                                          + 1))
</pre>
<p>Maxima reconoce este factor y otros similares para las funciones <code>sin</code>, 
<code>cos</code>, <code>sinh</code> y <code>cosh</code>. Para valores especiales del argumento
<em>z</em>, estos factores se simplifican de forma apropiada.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) halfangles:false;
(%o1)                                false
(%i2) sin(x/2);
                                        x
(%o2)                               sin(-)
                                        2
(%i3) halfangles:true;
(%o3)                                true
(%i4) sin(x/2);
                                                    x
                                            floor(-----)
                                                  2 %pi
                      sqrt(1 - cos(x)) (- 1)
(%o4)                 ----------------------------------
                                   sqrt(2)
(%i5) assume(x&gt;0, x&lt;2*%pi)$
(%i6) sin(x/2);
                               sqrt(1 - cos(x))
(%o6)                          ----------------
                                   sqrt(2)
</pre>
</dd></dl>


<dl>
<dt><u>Paquete:</u> <b>ntrig</b>
<a name="IDX393"></a>
</dt>
<dd><p>El paquete <code>ntrig</code> contiene un conjunto de reglas de simplificaci&oacute;n que se pueden usar para simplificar funciones trigonom&eacute;tricas cuyos argumentos son de la forma
<code><var>f</var>(<var>n</var> %pi/10)</code> donde <var>f</var> es cualquiera de las funciones 
<code>sin</code>, <code>cos</code>, <code>tan</code>, <code>csc</code>, <code>sec</code> o <code>cot</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>sec</b><i> (<var>x</var>)</i>
<a name="IDX394"></a>
</dt>
<dd><p>Secante.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>sech</b><i> (<var>x</var>)</i>
<a name="IDX395"></a>
</dt>
<dd><p>Secante hiperb&oacute;lica.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>sin</b><i> (<var>x</var>)</i>
<a name="IDX396"></a>
</dt>
<dd><p>Seno.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>sinh</b><i> (<var>x</var>)</i>
<a name="IDX397"></a>
</dt>
<dd><p>Seno hiperb&oacute;lico.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>tan</b><i> (<var>x</var>)</i>
<a name="IDX398"></a>
</dt>
<dd><p>Tangente.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>tanh</b><i> (<var>x</var>)</i>
<a name="IDX399"></a>
</dt>
<dd><p>Tangente hiperb&oacute;lica.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>trigexpand</b><i> (<var>expr</var>)</i>
<a name="IDX400"></a>
</dt>
<dd><p>Expande funciones trigonom&eacute;tricas e hiperb&oacute;licas de sumas de &aacute;ngulos y de m&uacute;ltiplos de &aacute;ngulos presentes en <var>expr</var>.  Para mejorar los resultados, <var>expr</var> deber&iacute;a expandirse. Para facilitar el control por parte del usuario de las simplificaciones, esta funci&oacute;n tan solo expande un nivel de cada vez, expandiendo sumas de &aacute;ngulos o de m&uacute;ltiplos de &aacute;ngulos. A fin de obtener una expansi&oacute;n completa en senos y coseno, se le dar&aacute; a la variable <code>trigexpand</code> el valor <code>true</code>.
</p>
<p>La funci&oacute;n <code>trigexpand</code> est&aacute; controlada por las siguientes variables:
</p>
<dl compact="compact">
<dt> <code>trigexpand</code></dt>
<dd><p>Si vale <code>true</code>, provoca la expansi&oacute;n de todas las expresiones que contengan senos y cosenos.
</p></dd>
<dt> <code>trigexpandplus</code></dt>
<dd><p>Controla la regla de la suma para <code>trigexpand</code>, la expansi&oacute;n de una suma como <code>sin(x + y)</code> se llevar&aacute; a cabo s&oacute;lo si <code>trigexpandplus</code> vale <code>true</code>.
</p></dd>
<dt> <code>trigexpandtimes</code></dt>
<dd><p>Controla la regla del producto para <code>trigexpand</code>, la expansi&oacute;n de un producto como <code>sin(2 x)</code> se llevar&aacute; a cabo s&oacute;lo si <code>trigexpandtimes</code> vale <code>true</code>.
</p></dd>
</dl>

<p>Ejemplos:
</p>
<pre class="example">(%i1) x+sin(3*x)/sin(x),trigexpand=true,expand;
                         2           2
(%o1)               - sin (x) + 3 cos (x) + x
(%i2) trigexpand(sin(10*x+y));
(%o2)          cos(10 x) sin(y) + sin(10 x) cos(y)
</pre>
</dd></dl>

<dl>
<dt><u>Variable optativa:</u> <b>trigexpandplus</b>
<a name="IDX401"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>La variable <code>trigexpandplus</code> controla la regla de la suma para <code>trigexpand</code>.  As&iacute;, si la instrucci&oacute;n <code>trigexpand</code> se utiliza o si la variable <code>trigexpand</code> vale <code>true</code>, se realizar&aacute; la expansi&oacute;n de sumas como <code>sin(x+y)</code> s&oacute;lo si <code>trigexpandplus</code> vale <code>true</code>.
</p>
</dd></dl>

<dl>
<dt><u>Variable optativa:</u> <b>trigexpandtimes</b>
<a name="IDX402"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>La variable <code>trigexpandtimes</code> controla la regla del producto para <code>trigexpand</code>.  As&iacute;, si la instrucci&oacute;n <code>trigexpand</code> se utiliza o si la variable <code>trigexpand</code> vale <code>true</code>, se realizar&aacute; la expansi&oacute;n de productos como <code>sin(2*x)</code> s&oacute;lo si <code>trigexpandtimes</code> vale <code>true</code>.
</p>
</dd></dl>

<dl>
<dt><u>Variable optativa:</u> <b>triginverses</b>
<a name="IDX403"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>La variable <code>triginverses</code> controla la simplificaci&oacute;n de la composici&oacute;n de funciones trigonom&eacute;tricas e hiperb&oacute;licas con sus funciones inversas.
</p>
<p>Si vale <code>all</code>, tanto <code>atan(tan(<var>x</var>))</code>  como <code>tan(atan(<var>x</var>))</code> se reducen a <var>x</var>.  
</p>
<p>Si vale <code>true</code>, se desactiva la simplificaci&oacute;n de <code><var>arcfun</var>(<var>fun</var>(<var>x</var>))</code>.
</p>
<p>Si vale <code>false</code>, se desactivan las simplificaciones de 
<code><var>arcfun</var>(<var>fun</var>(<var>x</var>))</code> y 
<code><var>fun</var>(<var>arcfun</var>(<var>x</var>))</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>trigreduce</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX404"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>trigreduce</b><i> (<var>expr</var>)</i>
<a name="IDX405"></a>
</dt>
<dd><p>Combina productos y potencias de senos y cosenos trigonom&eacute;tricos e hiperb&oacute;licos de <var>x</var>, transform&aacute;ndolos en otros que son m&uacute;ltiplos de <var>x</var>.  Tambi&eacute;n intenta eliminar estas funciones cuando aparecen en los denominadores.  Si no se introduce el argumento <var>x</var>, entonces se utilizan todas las variables de <var>expr</var>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>poissimp</code>.
</p>
<pre class="example">(%i1) trigreduce(-sin(x)^2+3*cos(x)^2+x);
               cos(2 x)      cos(2 x)   1        1
(%o1)          -------- + 3 (-------- + -) + x - -
                  2             2       2        2
</pre>

<p>Las rutinas de simplificaci&oacute;n trigonom&eacute;trica utilizan informaci&oacute;n declarada en algunos casos sencillos. Las declaraciones sobre variables se utilizan como se indica a continuaci&oacute;n:
</p>
<pre class="example">(%i1) declare(j, integer, e, even, o, odd)$
(%i2) sin(x + (e + 1/2)*%pi);
(%o2)                        cos(x)
(%i3) sin(x + (o + 1/2)*%pi);
(%o3)                       - cos(x)

</pre>
</dd></dl>

<dl>
<dt><u>Variable optativa:</u> <b>trigsign</b>
<a name="IDX406"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>trigsign</code> vale <code>true</code>, se permite la simplificaci&oacute;n de argumentos negativos en funciones trigonom&eacute;tricas, como en <code>sin(-x)</code>, que se transformar&aacute; en <code>-sin(x)</code> s&oacute;lo si <code>trigsign</code> vale <code>true</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>trigsimp</b><i> (<var>expr</var>)</i>
<a name="IDX407"></a>
</dt>
<dd><p>Utiliza las identidades <em>sin(x)^2 + cos(x)^2 = 1</em> y
<em>cosh(x)^2 - sinh(x)^2 = 1</em> para simplificar expresiones que contienen <code>tan</code>, <code>sec</code>,
etc., en expresiones con <code>sin</code>, <code>cos</code>, <code>sinh</code>, <code>cosh</code>.
</p>
<p>Las funciones <code>trigreduce</code>, <code>ratsimp</code> y <code>radcan</code> puden seguir siendo &uacute;tiles para continuar el proceso de simplificaci&oacute;n.
</p>
<p>La instrucci&oacute;n <code>demo (&quot;trgsmp.dem&quot;)</code> muestra algunos ejemplos de <code>trigsimp</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>trigrat</b><i> (<var>expr</var>)</i>
<a name="IDX408"></a>
</dt>
<dd><p>Devuelve una forma can&oacute;nica simplificada cuasi-lineal de una expresi&oacute;n trigonom&eacute;trica;
<var>expr</var> es una fracci&oacute;n racional que contiene <code>sin</code>, <code>cos</code> o <code>tan</code>, 
cuyos argumentos son formas lineales respecto de ciertas variables (o kernels) y <code>%pi/<var>n</var></code>
(<var>n</var> entero) con coeficientes enteros. El resultado es una fracci&oacute;n simplificada con 
el numerador y denominador lineales respecto de <code>sin</code> y <code>cos</code>. As&iacute;,
 <code>trigrat</code> devuelve una expresi&oacute;n lineal siempre que sea posible.
</p>
<pre class="example">(%i1) trigrat(sin(3*a)/sin(a+%pi/3));
(%o1)            sqrt(3) sin(2 a) + cos(2 a) - 1
</pre>
<p>El siguiente ejemplo se ha tomado de
Davenport, Siret y Tournier, <i>Calcul Formel</i>, Masson (o en ingl&eacute;s,
Addison-Wesley), secci&oacute;n 1.5.5, teorema de Morley.
</p>
<pre class="example">(%i1) c : %pi/3 - a - b$
(%i2) bc : sin(a)*sin(3*c)/sin(a+b);
                                          %pi
                  sin(a) sin(3 (- b - a + ---))
                                           3
(%o2)             -----------------------------
                           sin(b + a)
(%i3) ba : bc, c=a, a=c;
                                         %pi
                    sin(3 a) sin(b + a - ---)
                                          3
(%o3)               -------------------------
                                  %pi
                          sin(a - ---)
                                   3
(%i4) ac2 : ba^2 + bc^2 - 2*bc*ba*cos(b);
         2         2         %pi
      sin (3 a) sin (b + a - ---)
                              3
(%o4) ---------------------------
                2     %pi
             sin (a - ---)
                       3
                                       %pi
 - (2 sin(a) sin(3 a) sin(3 (- b - a + ---)) cos(b)
                                        3
             %pi            %pi
 sin(b + a - ---))/(sin(a - ---) sin(b + a))
              3              3
      2       2              %pi
   sin (a) sin (3 (- b - a + ---))
                              3
 + -------------------------------
                2
             sin (b + a)
(%i5) trigrat (ac2);
(%o5) - (sqrt(3) sin(4 b + 4 a) - cos(4 b + 4 a)
 - 2 sqrt(3) sin(4 b + 2 a) + 2 cos(4 b + 2 a)
 - 2 sqrt(3) sin(2 b + 4 a) + 2 cos(2 b + 4 a)
 + 4 sqrt(3) sin(2 b + 2 a) - 8 cos(2 b + 2 a) - 4 cos(2 b - 2 a)
 + sqrt(3) sin(4 b) - cos(4 b) - 2 sqrt(3) sin(2 b) + 10 cos(2 b)
 + sqrt(3) sin(4 a) - cos(4 a) - 2 sqrt(3) sin(2 a) + 10 cos(2 a)
 - 9)/4
</pre>
</dd></dl>








<hr size="6">
<a name="N_00fameros-aleatorios"></a>
<a name="SEC67"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC66" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC59" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.6 N&uacute;meros aleatorios </h2>



<dl>
<dt><u>Funci&oacute;n:</u> <b>make_random_state</b><i> (<var>n</var>)</i>
<a name="IDX409"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>make_random_state</b><i> (<var>s</var>)</i>
<a name="IDX410"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>make_random_state</b><i> (true)</i>
<a name="IDX411"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>make_random_state</b><i> (false)</i>
<a name="IDX412"></a>
</dt>
<dd><p>Un objeto de estado aleatorio representa el estado del generador de n&uacute;meros aleatorios. El estado consiste en 627 cadenas binarias de 32 bits.
</p>
<p>La llamada <code>make_random_state (<var>n</var>)</code> devuelve un nuevo objeto de estado aleatorio creado a partir de una semilla entera igual a <var>n</var> m&oacute;dulo 2^32. El argumento <var>n</var> puede ser negativo.
</p>
<p>La llamada <code>make_random_state (<var>s</var>)</code> devuelve una copia del estado aleatorio <var>s</var>.
</p>
<p>La llamada <code>make_random_state (true)</code> devuelve un nuevo objeto de estado aleatorio, cuya semilla se genera a partir de la hora actual del reloj del sistema como semilla.
</p>
<p>La llamada <code>make_random_state (false)</code> devuelve una copia del estado actual del generador de n&uacute;meros aleatorios.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>set_random_state</b><i> (<var>s</var>)</i>
<a name="IDX413"></a>
</dt>
<dd><p>Establece <var>s</var> como estado del generador de n&uacute;meros aleatorios.
</p>
<p>La funci&oacute;n <code>set_random_state</code> devuelve <code>done</code> en todo caso.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>random</b><i> (<var>x</var>)</i>
<a name="IDX414"></a>
</dt>
<dd><p>Devuelve un n&uacute;mero seudoaleatorio. Si <var>x</var> es un entero, <code>random (<var>x</var>)</code> devuelve un
entero entre 0 y <code><var>x</var> - 1</code>, ambos inclusive. Si <var>x</var> es un decimal en punto flotante,
<code>random (<var>x</var>)</code> devuelve un decimal no negativo en punto flotante menor que <var>x</var>.
La funci&oacute;n <code>random</code> emite un mensaje de error si <var>x</var> no es ni entero ni de punto flotante,
o si <var>x</var> no es positivo.
</p>
<p>Las funciones <code>make_random_state</code> y <code>set_random_state</code>
permiten controlar el estado del generador de n&uacute;meros aleatorios.
</p>
<p>El generador de n&uacute;meros aleatorios de Maxima implementa el algoritmo de Mersenne twister MT 19937.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) s1: make_random_state (654321)$
(%i2) set_random_state (s1);
(%o2)                         done
(%i3) random (1000);
(%o3)                          768
(%i4) random (9573684);
(%o4)                        7657880
(%i5) random (2^75);
(%o5)                11804491615036831636390
(%i6) s2: make_random_state (false)$
(%i7) random (1.0);
(%o7)                   .2310127244107132
(%i8) random (10.0);
(%o8)                   4.394553645870825
(%i9) random (100.0);
(%o9)                   32.28666704056853
(%i10) set_random_state (s2);
(%o10)                        done
(%i11) random (1.0);
(%o11)                  .2310127244107132
(%i12) random (10.0);
(%o12)                  4.394553645870825
(%i13) random (100.0);
(%o13)                  32.28666704056853
</pre>
</dd></dl>






<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC59" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC68" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>diciembre, 10 2012</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
