Repository: chriskmanx/qmole
Catalog: QMOLEDEV/libgnome-2.0.2/po/*.po
Languages: bs, de, es, hi, ja, sk, tr

source: Error Messages
de: Fehler
es: Mensajes de error
ja: エラーメッセージ
sk: Chybové správy
tr: Hata Mesajlarý

source: GNOME system events
de: Sound-Ereignisse für GNOME
es: Eventos sistema de GNOME
ja: GNOME システムイベント
sk: Systémové udalosti GNOME
tr: GNOME sistem olaylarý

source: Informational Messages
de: Informationen
es: Mensajes informativos
ja: 情報メッセージ
sk: Informaèné správy
tr: Bilgilendirme Mesajlarý

source: Login
de: Anmeldung zur Sitzung
es: Apertura de sesión
ja: ログイン
sk: Prihlásenie
tr: Giriþ

source: Logout
de: Abmeldung von der Sitzung
es: Salida de sesión
ja: ログアウト
sk: Odhlásenie
tr: Çýkýþ

source: Miscellaneous Messages
de: Sonstige Meldungen
es: Mensajes misceláneos
ja: その他のメッセージ
sk: Rôzne správy
tr: Çeþitli Mesajlar

source: Question Dialogs
de: Fragen
es: Diálogos con preguntas
ja: 質問ダイアログ
sk: Dialógové okno s otázkou
tr: Soru Pencereleri

source: Warning Messages
de: Warnungen
es: Mensajes de advertencia
ja: 警告メッセージ
sk: Upozoròovacie správy
tr: Uyarý Mesajlarý

source: Action button click
de: Beim Klicken auf einen Knopf
es: Acción de clic del ratón
ja: アクションボタンのクリック
sk: Kliknutie akèného tlaèítka

source: Check box toggled
de: Beim Ändern einer Checkbox
es: Cambio de una "checkbox"
ja: チェックボックスのトグル
sk: Prepnuté za¹krtávacie políèko

source: Menu item activation
de: Beim Aktivieren eines Menüeintrags
es: Activación de un elemento de menú
ja: メニューアイテムの選択
sk: Aktivovanie polo¾ky menu
tr: Menü öðe etkileþimi

source: User interface events
de: Ereignisse bei der Benutzung der Oberfläche
es: Eventos de la interfaz usuario
ja: ユーザインターフェイスのイベント
sk: Udalosti pou¾ívateµského rozhrania
tr: Kullanýcý arayüz olaylarý

source: Cannot find a terminal, using xterm, even if it may not work
bs: Ne mogu naći terminal, koristiću xterm čak i ako možda neće raditi
de: Terminalemulator konnte nicht gefunden werden; xterm wird trotz möglicher Fehlfunktion verwendet.
es: No pude encontrar un terminal, usando xterm, auncuando puede no funcionar
hi: xterm का प्रयोग करने वाला, भले ही कार्य नहीं कर रहा हो टर्मिनल नहीं मिला
ja: ターミナルが見つかりませんので、たとえ動かなくても、xterm を使います。
sk: Nemô¾em nájs» terminál, pou¾ijem xterm, aj keï nemusí fungova»
tr: Terminal bulunamadý, xterm kullanýlýyor

source: GNOME GConf Support
bs: GNOME GConf podrška
de: GNOME-GConf-Unterstützung
es: Soporte para GNOME GConf
hi: जीनोम जीकान्फ सपोर्ट
ja: GNOME GConf サポート
sk: Podpora GNOME GConf
tr: GNOME GConf Desteði

source: Unable to find the GNOME_FILE_DOMAIN_APP_HELP domain
bs: Ne mogu pronaći GNOME_FILE_DOMAIN_APP_HELP domenu
de: GNOME_FILE_DOMAIN_APP_HELP kann nicht gefunden werden
es: No pude encontrar el dominio GNOME_FILE_DOMAIN_APP_HELP
hi: GNOME डोमेन नहीं मिल सका
ja: GNOME_FILE_DOMAIN_APP_HELP ドメインを発見できません
sk: Nemô¾em nájs» doménu GNOME_FILE_DOMAIN_APP_HELP

source: Unable to find the GNOME_FILE_DOMAIN_HELP domain.
es: No pude encontrar el dominio GNOME_FILE_DOMAIN_HELP.
ja: GNOME_FILE_DOMAIN_HELP ドメインを発見できません
sk: Nemô¾em nájs» doménu GNOME_FILE_DOMAIN_HELP.

source: Unable to show help as %s is not a directory. Please check your installation.
es: No pude mostrar la ayuda ya que %s no es un directorio. Compruebe su instalación.
ja: %s はディレクトリでないのでヘルプを表示できません。インストール状況をチェックしてください
sk: Nemô¾em zobrazi» pomocníka, preto¾e %s nie je adresár. Skontrolujte, prosím, va¹u in¹taláciu.

source: Unable to find the help files in either %s or %s. Please check your installation
es: No pude encontrar los archivos de ayuda en %s ni en %s. Compruebe su instalación.
ja: %s や %s のどちらにもヘルプファイルを発見できません。インストール状況をチェックしてください
sk: Nemô¾em nájs» súbory pomocníka v %s ani v %s. Skontrolujte, prosím, va¹u in¹taláciu.

source: Unable to find doc_id %s in the help path
bs: Ne mogu pronaći doc_id %s u putanji za pomoć
de: Dokumentenkennung %s konnte nicht im Hilfepfad gefunden werden
es: No pude encontrar doc_id %s en la ruta de la ayuda
hi: हैल्प-पाथ में सहायता प्रपत्र %s नहीं मिला
ja: ヘルプパスに doc_id %s を見つけられません
sk: Nemô¾em nájs» doc_id %s v ceste pomocníka
tr: Yardým dosyalarý arasýnda %s belge numarasý bulunamadý

source: Help document %s/%s not found
bs: Dokument s pomoći %s/%s nije pronađen
de: Hilfedokument %s/%s wurde nicht gefunden
es: Documento de ayuda %s/%s no encontrado
hi: सहायता प्रपत्र %s/%s नहीं मिला
ja: ヘルプドキュメント %s/%s が見つかりません
sk: Dokument pomocníka %s/%s nebol nájdený
tr: %s/%s yardým belgesi bulunamadý

source: Too many alias levels for a locale, may indicate a loop
bs: Previše alijas nivoa za locale, možda ukazuje na loop (kružnu zavisnost)
de: Zu viele Alias-Ebenen für eine Locale, existiert eine Schleife?
es: Demasiados niveles de alias para un locale, puede indicar un bucle
hi: स्थानीय के कई सारे स्तर मौजूद है, यह एक लूप को दर्शाते हैं
ja: ロケールのエイリアスが多すぎます。おそらくループしてます
sk: Príli¹ veµa úrovní prezývok pre locale, toto mô¾e indikova» sluèku
tr: Yerel için çok fazla alias seviyesi var , bir iç döngü ile yapýlabilir

source: Bonobo Support
bs: Bonobo podrška
de: Bonobo-Unterstützung
es: Soporte para Bonobo
hi: Bonobo सपोर्ट
ja: Bonobo サポート
sk: Podpora Bonobo
tr: Bonobo Desteði

source: Bonobo activation Support
bs: Podrška za aktiviranje Bonobo-a
de: Unterstützung von Bonobo Activation
es: Soporte para activación de bonobo
ja: Bonobo の活性化のサポート
sk: Podpora Bonobo aktivácie
tr: Bonobo aktiþleþtirme Desteði

source: Could not create per-user gnome configuration directory `%s': %s
bs: Ne mogu napraviti gnome konfiguracijski direktorij "po korisniku" `%s': %s
de: Benutzerspezifisches GNOME-Konfigurationsverzeichnis »%s« konnte nicht angelegt werden: %s
es: No pude crear un directorio para la configuración de usuario '%s': %s
hi: प्रत्येक उपयोगकर्ता के लिए जीनोम कानफिगरेशन डायरेक्टरी %s नहीं बनायी जा सकती
ja: ユーザ毎の GNOME の設定ディレクトリ '%s' を作成できませんでした: %s
sk: Nemô¾em vytvori» pou¾ívateµský konfiguraèný adresár gnome "%s": %s
tr: Kullanýcý baþýna gnome ayarlayýcý dizini `%s' yaratýlamadý: %s

source: Could not set mode 0700 on private per-user gnome configuration directory `%s': %s
bs: Ne mogu staviti mod 0700 na privatni "po korisniku" gnome konfiguracijski direktorij `% s': %s
de: Für das private benutzerspezifische GNOME-Konfigurationsverzeichnis »%s« konnte der Modus 0700 nicht gesetzt werden: %s
es: No pude poner el modo 0700 al directorio de configuración de usuario %s: %s
hi: प्रत्येक उपयोगकर्ता के लिए जीनोम कानफिगरेशन डायरेक्टरी का मोड 0700 समायोजित नहीं किया जा सकता
ja: ユーザ毎の GNOME のプライベートな設定ディレクトリ '%s' のモードを 0700 にできませんでした: %s
sk: Nemô¾em nastavi» mód 0700 na súkromnom pou¾ívateµskom konfiguraènom adresári gnome "%s": %s
tr: 0700 chmod deðeri özel kiþisel gnome ayarlayýcý dizinine uygulanamýyor `%s': %s

source: Could not create gnome accelerators directory `%s': %s
bs: Ne mogu napraviti direktorij gnome akceleratora `%s': %s
de: GNOME-Tastaturkürzel-Verzeichnis »%s« konnte nicht angelegt werden: %s
es: No pude crear el directorio de aceleradores gnome `%s': %s
hi: जीनोम acc डायरेक्टरी %s का निर्माण नहीं किया जा सका
ja: GNOME のアクセラレータのディレクトリ '%s' を作成できませんでした: %s
sk: Nemô¾em vytvori» adresár akcelerátorov gnome "%s": %s
tr: Gnome hýzlandýrýcý dizinler yaratýlamýyor `%s': %s

source: Disable sound server usage
bs: Isključi korištenje zvučnog servera
de: Benutzung des Soundservers deaktivieren
es: Deshabilitar el uso del servidor de sonido
hi: ध्वनि सर्वर का उपयोग न करें
ja: 音サーバを使わない
sk: Zakáza» pou¾itie zvukového servera
tr: Ses Sunucusunun kullanýmýný pasifleþtir

source: Enable sound server usage
bs: Uključi korištenje zvučnog servera
de: Benutzung des Soundservers aktivieren
es: Habilitar el uso del servidor de sonido
hi: ध्वनि सर्वर का उपयोग करें
ja: 音サーバを使う
sk: Povoli» pou¾itie zvukového servera
tr: Ses Sunucusunun kullanýmýný Aktifleþtir

source: Host:port on which the sound server to use is running
bs: Računar:port na kojem je zvučni server pokrenut
de: Host:Port, auf dem der zu benutzende Soundserver läuft
es: Ordenador:puerto en el que se está ejecuntando el servidor de sonido
hi: ध्वनि सर्वर चलने के लिए प्रयुक्त होस्ट पोर्ट (होस्ट पोर्ट जिसका प्रयोग ध्वनि सर्वर चलने के लिए किया जा रहा है)
ja: 使用する音サーバの作動している ホスト:ポート
sk: Hostiteµ:port, na ktorom be¾í zvukový server, ktorý chcete pou¾i»
tr: Sunucu:Ses Sunucusunun kullandýðý kapý(port)

source: HOSTNAME:PORT
es: ORDENADOR:PUERTO
hi: होस्ट नाम : पोर्ट
sk: HOSTITE¥:PORT
tr: SUNUCU_ADI:KAPI(port)

source: GNOME Virtual Filesystem
bs: GNOME virtualni datotečni sistem
de: GNOMEs virtuelles Dateisystem
es: Sistema de archivos virtual de GNOME
hi: जीनोम आभासी फाइल सिस्टम
ja: GNOME 仮想ファイルシステム
sk: Virtuálny súborový systém GNOME
tr: GNOME Sanal DosyaSistemi

source: GNOME Library
bs: GNOME biblioteka
de: GNOME-Bibliothek
es: Librería de GNOME
hi: जीनोम लायब्रेरी
ja: GNOME ライブラリ
sk: Kni¾nica GNOME
tr: GNOME Kütüphanesi

source: Popt Table
bs: Popt tabela
de: Popt-Tabelle
es: Tabla popt
hi: Popt टेबल
ja: popt テーブル
sk: Tabuµka popt
tr: Popt Tablosu

source: The table of options for popt
bs: Tabela s opcijama za popt
de: Die Tabelle der Einstellungen für popt
es: La tabla de opciones para popt
hi: Popt टेबल के लिए विकल्प
ja: pop オプションのテーブル
sk: Tabuµka volieb pre popt

source: Popt Flags
bs: Popt zastave (flags)
de: Popt-Optionen
es: Opciones popt
hi: Popt फ्लैग
ja: popt フラグ
sk: Príznaky popt
tr: Popt Bayraklarý

source: The flags to use for popt
bs: Zastave koje se koriste za popt
de: Die für popt zu setzenden Optionen
es: Las opciones a usar para popt
hi: Popt के लिए प्रयुक्त फ्लैग
ja: popt で使用するフラグ
sk: Príznaky pou¾iteµné s popt
tr: Popt için kullanýlan bayraklar

source: Popt Context
bs: Popt kontekst
de: Popt-Kontext
es: Contexto popt
hi: Popt संदर्भ
ja: popt コンテキスト
sk: Kontext popt

source: The popt context pointer that GnomeProgram is using
bs: Popt kontekst pokazivač koji se koristi u GnomeProgram-u
de: Der popt-Kontextzeiger, den GnomeProgram verwendet
es: El puntero del contexto popt que el programa Gnome esta usando
hi: जीनोम प्रोग्राम द्वारा प्रयुक्त popt संदर्भ सूचक
ja: GnomeProgram が使用する popt コンテキスト ポインタ
sk: Ukazovateµ popt kontextu, ktorý pou¾íva GnomeProgram

source: Human readable name
bs: Ime čitljivo ljudskom oku
de: Menschenlesbarer Name
es: Nombre leible por humanos
hi: मनुष्य द्वारा पढ़ा जा सकने वाला नाम
ja: 可読な名称
sk: Názov èitateµný pre µudí
tr: Okunabilir ismi

source: Human readable name of this application
bs: Ime ovog programa čitljivo ljudskom oku
de: Menschenlesbarer Name dieser Anwendung
es: Nombre leible por humanos de esta aplicación
hi: मनुष्य द्वारा पढ़ा जा सकने वाला इस अनुप्रयोग का नाम
ja: このアプリケーションの可読な名称
sk: Názov tejto aplikácie èitateµný pre µudí
tr: Bu programýn okunabilir ismi

source: GNOME path
bs: GNOME putanja
de: GNOME-Pfad
es: Path GNOME
hi: जीनोम पाथ
ja: GNOME パス
sk: Cesta GNOME
tr: GNOME yol

source: Path in which to look for installed files
bs: Putanja za traženje instaliranih datoteka
de: Pfad für die Suche nach installierten Dateien
es: Path en el que buscar archivos instalados
hi: संस्थापित फाइलों को खोजे जाने वाला पाथ
ja: インストールされたファイルを探すパス
sk: Cesta, na ktorej mám hµada» nain¹talované súbory
tr: Yüklenen dosyalara bakýlacak yol(patika)

source: App ID
de: Anwendungskennung
hi: अनुप्रयोग आई.डी.
ja: アプリ ID
sk: ID aplikácie
tr: Uygulama No

source: ID string to use for this application
bs: Identifikacijska riječ za ovaj program
de: Für diese Anwendung zu verwendende Kennungszeichenfolge
es: Cadena ID a usar para esta aplicación
hi: इस अनुप्रयोग के लिए प्रयुक्त आई.डी. स्ट्रिंग
ja: このアプリケーションで使用する ID 文字列
sk: Identifikaèný re»azec pou¾itý pre túto aplikáciu

source: App version
bs: App verzija
de: Anwendungsversion
es: Versión de la aplicación
hi: अनुप्रयोग संस्करण
ja: アプリ バージョン
sk: Verzia aplikácie
tr: Program Sürümü

source: Version of this application
bs: Verzija ovog programa
de: Version dieser Anwendung
es: Versión de esta aplicación
hi: इस अनुप्रयोग का संस्करण
ja: このアプリケーションのバージョン
sk: Verzia tejto aplikácie
tr: Bu programýn sürümü

source: GNOME Prefix
bs: GNOME Prefiks
de: GNOME-Präfix
es: Prefijo GNOME
hi: जीनोम प्रिफिक्स
ja: GNOME プリフィックス
sk: Predpona GNOME
tr: GNOME Öneki

source: Prefix where GNOME was installed
bs: Prefiks gdje je GNOME instaliran
de: Präfix, mit dem GNOME installiert wurde
es: Directorio donde se instaló GNOME
hi: प्रिफिक्स जहां जीनोम संस्थापित किया गया था
ja: GNOME がインストールされたプリフィックス
sk: Adresár, kde je nain¹talované GNOME
tr: GNOME'un kurulduðu yer

source: GNOME Libdir
de: GNOME-Bibliotheksverzeichnis
es: Directorio de la librería de GNOME
hi: जीनोम लायब्रेरी डायरेक्टरी
sk: Adresár kni¾níc GNOME
tr: GNOME Kütüphane Yolu

source: Library prefix where GNOME was installed
bs: Prefiks biblioteke gdje je GNOME instaliran
de: Bibliothekspräfix, mit dem GNOME installiert wurde
es: Directorio donde se instalaron las librerias de GNOME
hi: लायब्रेरी प्रिफिक्स जहां जीनोम जहां जीनोम संस्थापित किया गया था
ja: GNOME のライブラリがインストールされたプリフィックス
sk: Adresár kni¾níc, kde je nain¹talované GNOME
tr: GNOME kütüphanesinin kurulduðu yer

source: GNOME Datadir
de: GNOME-Datenverzeichnis
es: Directorio de datos de GNOME
hi: जीनोम डाटा डायरेक्टरी
sk: Dátový adresár GNOME
tr: GNOME Veri Yolu

source: Data prefix where GNOME was installed
bs: Data prefiks gdje je GNOME instaliran
de: Datenpräfix, mit dem GNOME installiert wurde
es: Directorio de datos donde se instaló GNOME
hi: डाटा प्रिफिक्स जहां जीनोम संस्थापित किया गया था
ja: GNOME のデータがインストールされたプリフィックス
sk: Dátový adresár, kde je nain¹talované GNOME
tr: GNOME verilerinin kurulduðu yer

source: GNOME Sysconfdir
de: GNOME-Konfigurationsverzeichnis
es: Directorio de configuración de GNOME
hi: जीनोम सिस्टम कानफिगरेशन डायरेक्टरी
sk: Adresár konfigurácie GNOME
tr: GNOME Sistem Yapýlandýrma Dizini

source: Configuration prefix where GNOME was installed
bs: Prefiks konfiguracije gdje je GNOME instaliran
de: Konfigurationspräfix, mit dem GNOME installiert wurde
es: Directorio de configuración donde se instaló GNOME
hi: कानफिगरेशन प्रिफिक्स जहां जीनोम संस्थापित किया गया था
ja: GNOME の設定がインストールされたプリフィックス
sk: Adresár konfigurácie, kde je nain¹talované GNOME
tr: GNOME yapýlandýrma dosyalarýnýn kurulduðu yer

source: GNOME App Prefix
bs: GNOME App Prefiks
de: Anwendungsverzeichnis
es: Directorio de applicaciones GNOME
hi: जीनोम अनुप्रयोग प्रिफिक्स
ja: GNOME アプリ プリフィックス
sk: Adresár aplikácie GNOME
tr: GNOME Uygulama Öneki

source: Prefix where this application was installed
bs: Prefiks gdje je ova aplikacija instalirana
de: Präfix, mit dem diese Anwendung installiert wurde
es: Directorio donde se instaló esta aplicación
hi: प्रिफिक्स जहां यह अनुप्रयोग संस्थापित किया गया था
ja: このアプリケーションがインストールされたプリフィックス
sk: Adresár, kde bola nain¹talovaná táto aplikácia

source: GNOME App Libdir
de: GNOME-Bibliotheksverzeichnis
es: Directorio de librerías de aplicaciones de GNOME
hi: जीनोम अनुप्रयोग लायब्रेरी डायरेक्टरी
ja: GNOME アプリ Libdir
sk: Adresár kni¾níc aplikácie GNOME
tr: GNOME Uygulama Kütüphane Yolu

source: Library prefix where this application was installed
bs: Prefiks biblioteke gdje je ovaj program instaliran
de: Bibliothekspräfix, mit dem diese Anwendung installiert wurde
es: Directorio de librerías donde se instaló esta aplicación
hi: लायब्रेरी प्रिफिक्स जहां यह अनुप्रयोग संस्थापित किया गया था
ja: このアプリケーションのライブラリがインストールされたプリフィックス
sk: Adresár kni¾níc, kde bola nain¹talovaná táto aplikácia

source: GNOME App Datadir
de: Anwendungsdatenverzeichnis
es: Directorio de datos de aplicaciones GNOME
hi: जीनोम अनुप्रयोग डाटा डायरेक्टरी
ja: GNOME アプリ Datadir
sk: Dátový adresár aplikácie GNOME
tr: GNOME Uygulama Veri Dizini

source: Data prefix where this application was installed
bs: Data prefiks gdje je ova aplikacija instalirana
de: Anwendungsspezifischer Datenpräfix, mit dem diese Anwendung installiert wurde
es: Directorio de datos donde se instaló esta aplicacion
hi: डाटा प्रिफिक्स जहां यह अनुप्रयोग संस्थापित किया गया था
ja: このアプリケーションのデータがインストールされたプリフィックス
sk: Dátový adresár, kde bola nain¹talovaná táto aplikácia

source: GNOME App Sysconfdir
de: GNOME-Anwendungskonfigurationsverzeichnis
es: Directorio de configuración de aplicaciones GNOME
hi: जीनोम अनुप्रयोग सिस्टम कानफिगरेशन डायरेक्टरी
ja: GNOME アプリ Sysconfdir
sk: Adresár konfigurácie aplikácie GNOME

source: Configuration prefix where this application was installed
bs: Prefiks konfiguracije gdje je ovaj program instaliran
de: Anwendungsspezifischer Konfigurationspräfix, mit dem diese Anwendung installiert wurde
es: Directorio de configuración donde se instaló esta aplicación
hi: कानफिगरेशन प्रिफिक्स जहां यह अनुप्रयोग संस्थापित किया गया था
ja: このアプリケーションの設定がインストールされたプリフィックス
sk: Adresár konfigurácie, kde bola nain¹talovaná táto aplikácia

source: Create Directories
bs: Napravi direktorije
de: Verzeichnisse anlegen
es: Crear directorios
hi: डायरेक्टरी का निर्माण करें
ja: ディレクトリ作成
sk: Vytvori» adresáre
tr: Dizinleri Oluþtur

source: Create standard GNOME directories on startup
bs: Napravi standardne GNOME direktorije pri pokretanju
de: GNOME-Standardverzeichnisse beim Start anlegen
es: Crear directorios estandar de GNOME en el arranque
hi: प्रारंभ होते समय मानक जीनोम डायरेक्टरी का निर्माण करें
ja: 起動時に標準的な GNOME ディレクトリを作成する
sk: Vytvori» ¹tandardné adresáre GNOME pri ¹tarte
tr: Baþlangýçta standart GNOME dizinlerini oluþtur

source: Enable Sound
bs: Omogući zvuk
de: Ton aktivieren
es: Habilitar sonido
hi: आवाज चालू करें
ja: 音を有効に
sk: Povoli» zvuk
tr: Sesi Etkinleþtir

source: Enable sound on startup
bs: Omogući zvuk pri pokretanju
de: Ton beim Start aktivieren
es: Habilitar el servidor de sonido al arrancar
hi: प्रारंभ होते समय ध्वनि छमता चालू करें
ja: 起動時に音を有効にする
sk: Povoli» zvuk pri ¹tarte
tr: Baþlangýçta sesi aç

source: Espeaker
es: Altavoz
hi: स्पीकर
sk: Ereproduktor

source: How to connect to esd
bs: Kako se priključiti na esd
de: Methode zur Verbindung mit esd
es: Como conectar a esd
hi: ईएसडी से कैसे संबंध स्थापित करें
ja: esd にどのように接続するか
sk: Ako sa pripoji» k esd

source: Help options
bs: Opcije za pomoć
de: Hilfeoptionen
es: Opción de ayuda
hi: सहायता विकल्प
ja: ヘルプオプション
sk: Voµby pomocníka
tr: Yardým Seçeneði

source: Application options
bs: Programske opcije
de: Anwendungsoptionen
es: Opciones de la aplicación
hi: अनुप्रयोग विकल्प
ja: アプリケーションのオプション
sk: Voµby aplikácie
tr: Uygulama seçenekleri

source: Dynamic modules to load
bs: Moduli za dinamičko učitavanje
de: Zu ladende dynamische Module
es: Modulos dinámicos a cargar
hi: डायनामिक माड्यूल्स लोड करें
ja: 読み込むダイナミックモジュール
sk: Nahra» dynamické moduly
tr: Yüklenecek Dinamik modüller

source: MODULE1,MODULE2,...
bs: MODUL1,MODUL2,...
de: MODUL1,MODUL2,...
hi: माड्यूल & माड्यूल 2....
sk: MODUL1,MODUL2,...
tr: MODÜL1,MODÜL2,...

source: Extra Moniker factory
bs: Fabrika ekstra moniker-a
de: Zusätzliche Monikerfabrik
hi: अतिरिक्त मानीकर फैक्ट्री
ja: エクストラ モニカ ファクトリ
sk: Továreò extra monikera

source: GConf moniker
hi: जीकान्फ मानीकर
ja: GConf モニカ
sk: Moniker GConf

source: config indirect moniker
de: Indirekten Moniker konfigurieren
es: moniker de configuración indirecta
ja: 間接設定モニカ
sk: Nepriamy konfiguraèný moniker

source: Unknown type
bs: Nepoznat tip
de: Unbekannter Typ
es: Tipo desconocido
hi: अग्यात प्रकार
ja: 不明なタイプ
sk: Neznámy typ
tr: Bilinmeyen tür

source: Key %s not found in configuration
bs: Znak %s nije pronađen u konfiguraciji
de: Schlüssel »%s« wurde in der Konfiguration nicht gefunden
es: La clave %s no se encontró en la configuración
hi: कानफिगरेशन में %s कुंजी नहीं मिली
ja: キー %s が設定されていません
sk: Kµúè %s nebol nájdený v konfigurácii
