<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on diciembre, 10 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Manual de Maxima: 8. Expresiones</title>

<meta name="description" content="Manual de Maxima: 8. Expresiones">
<meta name="keywords" content="Manual de Maxima: 8. Expresiones">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="es" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Expresiones"></a>
<a name="SEC50"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_7.html#SEC49" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC51" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC47" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 8. Expresiones </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC51">8.1 Introducci&oacute;n a las expresiones</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC52">8.2 Nombres y verbos</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC53">8.3 Identificadores</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC54">8.4 Desigualdades</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC55">8.5 Funciones y variables para expresiones</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Introducci_00f3n-a-las-expresiones"></a>
<a name="SEC51"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC50" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC52" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC50" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC50" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 8.1 Introducci&oacute;n a las expresiones </h2>

<p>Existe un cierto n&uacute;mero de palabras reservadas
que no deber&iacute;an
utilizarse como nombres de variables. Su uso podr&iacute;a causar 
errores sint&aacute;cticos. 
</p>
<pre class="example">integrate            next           from                 diff            
in                   at             limit                sum             
for                  and            elseif               then            
else                 do             or                   if              
unless               product        while                thru            
step                                                                     
</pre>
<p>La mayor&iacute;a de los objetos en Maxima son expresiones. Una secuencia
de expresiones puede constituir una expresi&oacute;n, separ&aacute;ndolas por
comas y colocando par&eacute;ntesis alrededor de ellas. Esto es similar a 
las <i>expresiones con coma</i> en <b>C</b>. 
</p>
<pre class="example">(%i1) x: 3$
(%i2) (x: x+1, x: x^2);
(%o2)                          16
(%i3) (if (x &gt; 17) then 2 else 4);
(%o3)                           4
(%i4) (if (x &gt; 17) then x: 2 else y: 4, y+x);
(%o4)                          20
</pre>
<p>Incluso los bucles en Maxima son expresiones, aunque el valor que
 retornan (<code>done</code>) no es muy &uacute;til. 
</p>
<pre class="example">(%i1) y: (x: 1, for i from 1 thru 10 do (x: x*i))$
(%i2) y;
(%o2)                         done
</pre>
<p>pero quiz&aacute;s se quiera incluir un tercer t&eacute;rmino en la <i>expresi&oacute;n con coma</i> para que devuelva el valor de inter&eacute;s. 
</p>
<pre class="example">(%i3) y: (x: 1, for i from 1 thru 10 do (x: x*i), x)$
(%i4) y;
(%o4)                        3628800
</pre>









<hr size="6">
<a name="Nombres-y-verbos"></a>
<a name="SEC52"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC51" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC53" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC50" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC50" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 8.2 Nombres y verbos </h2>

<p>Maxima distingue entre operadores que son &quot;nombres&quot; y operadores que son &quot;verbos&quot;.
Un verbo es un operador que puede ser ejecutado.
Un nombre es un operador que aparece como un s&iacute;mbolo en una expresi&oacute;n pero sin ser ejecutado.
Por defecto, los nombres de funciones son verbos.
Un verbo puede transformarse en nombre utilizando el ap&oacute;strofo o aplicando la funci&oacute;n <code>nounify</code>.
Un nombre puede transformarse en verbo aplicando la funci&oacute;n <code>verbify</code>.
La variable <code>nouns</code> hace que <code>ev</code> eval&uacute;e los nombres presentes en una expresi&oacute;n.
</p>
<p>La forma verbal se distingue mediante la precedencia del car&aacute;cter d&oacute;lar <code>$</code> al correspondiente s&iacute;mbolo de Lisp.
Por otro lado, la forma nominal se distingue mediante la precedencia del car&aacute;cter porcentaje <code>%</code> al correspondiente s&iacute;mbolo de Lisp. 
Algunos nombres gozan de propiedades especiales para su representaci&oacute;n, como <code>'integrate</code> o <code>'derivative</code>
(devuelto por <code>diff</code>), pero la mayor&iacute;a no.
Por defecto, las formas nominal y verbal de una funci&oacute;n son id&eacute;nticas cuando se muestran en un terminal.
La variable global <code>noundisp</code> hace que Maxima muestre los nombres precedidos del ap&oacute;strofo <code>'</code>.
</p>
<p>V&eacute;anse tambi&eacute;n <code>noun</code>, <code>nouns</code>, <code>nounify</code> y <code>verbify</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) foo (x) := x^2;
                                     2
(%o1)                     foo(x) := x
(%i2) foo (42);
(%o2)                         1764
(%i3) 'foo (42);
(%o3)                        foo(42)
(%i4) 'foo (42), nouns;
(%o4)                         1764
(%i5) declare (bar, noun);
(%o5)                         done
(%i6) bar (x) := x/17;
                                     x
(%o6)                    ''bar(x) := --
                                     17
(%i7) bar (52);
(%o7)                        bar(52)
(%i8) bar (52), nouns;
                               52
(%o8)                          --
                               17
(%i9) integrate (1/x, x, 1, 42);
(%o9)                        log(42)
(%i10) 'integrate (1/x, x, 1, 42);
                             42
                            /
                            [   1
(%o10)                      I   - dx
                            ]   x
                            /
                             1
(%i11) ev (%, nouns);
(%o11)                       log(42)
</pre>







<hr size="6">
<a name="Identificadores"></a>
<a name="SEC53"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC52" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC54" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC50" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC50" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 8.3 Identificadores </h2>


<p>En Maxima, los identificadores pueden contener caracteres alfab&eacute;ticos, n&uacute;meros del 0 al 9 y cualquier otro car&aacute;cter precedido de la barra invertida <code>\</code>.
</p>
<p>Un identificador puede comenzar con un car&aacute;cter num&eacute;rico si &eacute;ste va precedido de la barra invertida <code>\</code>.
Los caracteres num&eacute;ricos que ocupen la segunda posici&oacute;n o posterior no necesitan ir precedidos de la barra invertida.
</p>
<p>Los caracteres pueden declararse como alfab&eacute;ticos con la funci&oacute;n <code>declare</code>.
As&iacute; declarados, no necesitan ir precedidos de la barra invertida en un identificador.
En principio, los caracteres alfab&eacute;ticos son las letras de <code>A</code> a <code>Z</code> y
<code>a</code> a <code>z</code>, junto con  <code>%</code> y <code>_</code>.
</p>
<p>Maxima distingue min&uacute;sculas y may&uacute;sculas. Los identificadores <code>foo</code>, <code>FOO</code> y <code>Foo</code> son distintos.
V&eacute;ase <a href="maxima_37.html#SEC202">Lisp y Maxima</a> para m&aacute;s informaci&oacute;n.
</p>
<p>Un identificador en Maxima es un s&iacute;mbolo Lisp que comienza con el s&iacute;mbolo d&oacute;lar <code>$</code>.
Cualquier otro s&iacute;mbolo de Lisp va precedido de la interrogaci&oacute;n <code>?</code> cuando aparece en Maxima.
V&eacute;ase <a href="maxima_37.html#SEC202">Lisp y Maxima</a> para m&aacute;s informaci&oacute;n.
</p>
<p>Ejemplos:
</p>

<pre class="example">(%i1) %an_ordinary_identifier42;
(%o1)               %an_ordinary_identifier42
(%i2) embedded\ spaces\ in\ an\ identifier;
(%o2)           embedded spaces in an identifier
(%i3) symbolp (%);
(%o3)                         true
(%i4) [foo+bar, foo\+bar];
(%o4)                 [foo + bar, foo+bar]
(%i5) [1729, \1729];
(%o5)                     [1729, 1729]
(%i6) [symbolp (foo\+bar), symbolp (\1729)];
(%o6)                     [true, true]
(%i7) [is (foo\+bar = foo+bar), is (\1729 = 1729)];
(%o7)                    [false, false]
(%i8) baz\~quux;
(%o8)                       baz~quux
(%i9) declare (&quot;~&quot;, alphabetic);
(%o9)                         done
(%i10) baz~quux;
(%o10)                      baz~quux
(%i11) [is (foo = FOO), is (FOO = Foo), is (Foo = foo)];
(%o11)                [false, false, false]
(%i12) :lisp (defvar *my-lisp-variable* '$foo)
*MY-LISP-VARIABLE*
(%i12) ?\*my\-lisp\-variable\*;
(%o12)                         foo
</pre>








<hr size="6">
<a name="Desigualdades"></a>
<a name="SEC54"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC53" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC55" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC50" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC50" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 8.4 Desigualdades </h2>


<p>Maxima dispone de los operadores de desigualdad <code>&lt;</code>, <code>&lt;=</code>, <code>&gt;=</code>, <code>&gt;</code>, <code>#</code> y <code>notequal</code>.
V&eacute;ase <code>if</code> para una descripci&oacute;n de las expresiones condicionales.
</p>






<hr size="6">
<a name="Funciones-y-variables-para-expresiones"></a>
<a name="SEC55"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC54" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC50" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC50" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 8.5 Funciones y variables para expresiones </h2>


<dl>
<dt><u>Funci&oacute;n:</u> <b>alias</b><i> (<var>new_name_1</var>, <var>old_name_1</var>, ..., <var>new_name_n</var>, <var>old_name_n</var>)</i>
<a name="IDX228"></a>
</dt>
<dd><p>provee un nombre
alternativo para una (bien sea definida por el usuario o por el sistema) funci&oacute;n, variable, arreglo, etc. 
Cualquier n&uacute;mero par de argumentos puede ser usado. 
</p></dd></dl>


<dl>
<dt><u>Variable del sistema:</u> <b>aliases</b>
<a name="IDX229"></a>
</dt>
<dd><p>Valor por defecto: <code>[]</code>
</p>
<p>La variable <code>aliases</code> es la lista de &aacute;tomos que tienen un &quot;alias&quot; definido por el usuario (establecido mediante las funciones  <code>alias</code>, <code>ordergreat</code> o <code>orderless</code> o declarando el &aacute;tomo como un <code>noun</code> (nombre) con <code>declare</code>.
</p></dd></dl>



<dl>
<dt><u>Clave:</u> <b>allbut</b>
<a name="IDX230"></a>
</dt>
<dd><p>Opera con los comandos <code>part</code> (como <code>part</code>, <code>inpart</code>, <code>substpart</code>,
<code>substinpart</code>, <code>dpart</code> y <code>lpart</code>). Por ejemplo:
</p>
<pre class="example">(%i1) expr : e + d + c + b + a;
(%o1)                   e + d + c + b + a
(%i2) part (expr, [2, 5]);
(%o2)                         d + a
</pre>
<p>mientras que: 
</p>
<pre class="example">(%i1) expr : e + d + c + b + a;
(%o1)                   e + d + c + b + a
(%i2) part (expr, allbut (2, 5));
(%o2)                       e + c + b
</pre>
<p>La funci&oacute;n <code>kill</code> tambi&eacute;n reconoce a <code>allbut</code>.
</p>
<pre class="example">(%i1) [aa : 11, bb : 22, cc : 33, dd : 44, ee : 55];
(%o1)                 [11, 22, 33, 44, 55]
(%i2) kill (allbut (cc, dd));
(%o0)                         done
(%i1) [aa, bb, cc, dd];
(%o1)                   [aa, bb, 33, 44]
</pre>
<p>La sentencia <code>kill(allbut(<var>a_1</var>, <var>a_2</var>, ...))</code>
tiene el mismo efecto que <code>kill(all)</code>, excepto que no
elimina los s&iacute;mbolos <var>a_1</var>, <var>a_2</var>, ... .
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>args</b><i> (<var>expr</var>)</i>
<a name="IDX231"></a>
</dt>
<dd><p>Devuelve la lista de argumentos de <code>expr</code>, que puede ser cualquier tipo de expresi&oacute;n a excepci&oacute;n de un &aacute;tomo. Tan solo se muestran los argumentos del operador principal; subexpresiones de <code>expr</code> aparecen como elementos o subexpresiones de elementos de la lista de argumentos.
</p>
<p>El orden de los miembros de la lista puede depender de la variable global <code>inflag</code>.
</p>
<p>La llamada <code>args (<var>expr</var>)</code> es equivalente a <code>substpart (&quot;[&quot;, <var>expr</var>, 0)</code>.
</p>
<p>V&eacute;anse tambi&eacute;n <code>substpart</code> y <code>op</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>atom</b><i> (<var>expr</var>)</i>
<a name="IDX232"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un &aacute;tomo (n&uacute;mero, nombre o cadena alfanum&eacute;rica) y <code>false</code> en caso contario. As&iacute;, <code>atom(5)</code> devolver&aacute; <code>true</code>, mientras que <code>atom(a[1])</code> y <code>atom(sin(x))</code> dar&aacute;n como resultado <code>false</code> (dando por hecho que tanto <code>a[1]</code> como <code>x</code> no tienen valores asignados).
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>box</b><i> (<var>expr</var>)</i>
<a name="IDX233"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>box</b><i> (<var>expr</var>, <var>a</var>)</i>
<a name="IDX234"></a>
</dt>
<dd><p>Devuelve <var>expr</var> encerrada en una caja.
El valor devuelto es una expresi&oacute;n con <code>box</code> como operador y <var>expr</var> como argumento.
Se dibujar&aacute; una caja cuando <code>display2d</code> valga <code>true</code>.
</p>
<p>La llamada <code>box (<var>expr</var>, <var>a</var>)</code>
encierra <var>expr</var> en una caja etiquetada con el s&iacute;mbolo <var>a</var>.
La etiqueta se recorta si es m&aacute;s larga que el ancho de la caja.
</p>
<p>La funci&oacute;n <code>box</code> eval&uacute;a su argumento. Sin embargo, la expresi&oacute;n 
encerrada no se eval&uacute;a, siendo exclu&iacute;da de los c&aacute;lculos.
</p>
<p>La variable <code>boxchar</code> guarda el car&aacute;cter a utilizar para dibujar la caja en las funciones <code>box</code>, <code>dpart</code> y <code>lpart</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) box (a^2 + b^2);
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                            &quot; 2    2&quot;
(%o1)                       &quot;b  + a &quot;
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i2) a : 1234;
(%o2)                         1234
(%i3) b : c - d;
(%o3)                         c - d
(%i4) box (a^2 + b^2);
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o4)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) box (a^2 + b^2, term_1);
                      term_1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o5)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) 1729 - box (1729);
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%o6)                     1729 - &quot;1729&quot;
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%i7) boxchar: &quot;-&quot;;
(%o7)                           -
(%i8) box (sin(x) + cos(y));
                        -----------------
(%o8)                   -cos(y) + sin(x)-
                        -----------------
</pre>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>boxchar</b>
<a name="IDX235"></a>
</dt>
<dd><p>Valor por defecto: <code>&quot;</code>
</p>
<p>La variable <code>boxchar</code> guarda el car&aacute;cter a utilizar para dibujar la caja en las funciones <code>box</code>, <code>dpart</code> y <code>lpart</code>.
</p>
<p>Todas las cajas en una expresi&oacute;n se dibujan con el valor actual de <code>boxchar</code>, car&aacute;cter que no se almacena con las expresi&oacute;n encerrada.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>collapse</b><i> (<var>expr</var>)</i>
<a name="IDX236"></a>
</dt>
<dd><p>Colapsa <var>expr</var> haciendo que todas las subexpresiones que sean iguales
compartan las mismas celdas, ahorrando espacio. <code>collapse</code> es una
subrutina utilizada por la instrucci&oacute;n <code>optimize</code>. El uso de 
<code>collapse</code> puede ser &uacute;til despu&eacute;s de  cargar un fichero 
creado con <code>save</code>. Se pueden colapsar varias expresiones de forma
conjunta utilizando <code>collapse ([<var>expr_1</var>, ..., <var>expr_n</var>])</code>.
Tambi&eacute;n se pueden colapsar los elementos del array <code>A</code>
haciendo <code>collapse (listarray ('A))</code>.
</p></dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>disolate</b><i> (<var>expr</var>, <var>x_1</var>, ..., <var>x_n</var>)</i>
<a name="IDX237"></a>
</dt>
<dd><p>Es similar a <code>isolate (<var>expr</var>, <var>x</var>)</code>, excepto que permite al usuario aislar m&aacute;s de una variable simult&aacute;neamente. Puede ser &uacute;til para hacer un cambio de variables en integrales m&uacute;ltiples en las que tales variables dependan de de dos o m&aacute;s variables de integraci&oacute;n.  Esta funci&oacute;n se carga autom&aacute;ticamente desde 
<tt>`simplification/disol.mac'</tt>.  Se dispone de una demostyraci&oacute;n en <code>demo(&quot;disol&quot;)$</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>dispform</b><i> (<var>expr</var>)</i>
<a name="IDX238"></a>
</dt>
<dt><u>Function:</u> <b>dispform</b><i> (<var>expr</var>, all)</i>
<a name="IDX239"></a>
</dt>
<dd><p><code>dispform(<var>expr</var>)</code> devuelve la representaci&oacute;n externa de
<var>expr</var> respecto del operador del nivel superior.
<code>dispform(<var>expr</var>, all)</code> devuelve la representaci&oacute;n
externa respecto de todos los operadores que haya en <var>expr</var>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>part</code>, <code>inpart</code> y <code>inflag</code>.
</p>
<p>Ejemplos:
</p>
<p>La representaci&oacute;n interna de <code>- x</code> es &quot;menos uno 
multiplicado por <code>x</code>&quot;, mientras que la representaci&oacute;n externa es
&quot;menos <code>x</code>&quot;.
</p>
<pre class="example">(%i1) - x;
(%o1)                          - x
(%i2) ?format (true, &quot;~S~%&quot;, %);
((MTIMES SIMP) -1 $X)
(%o2)                         false
(%i3) dispform (- x);
(%o3)                          - x
(%i4) ?format (true, &quot;~S~%&quot;, %);
((MMINUS SIMP) $X)
(%o4)                         false
</pre>
<p>La representaci&oacute;n interna de <code>sqrt(x)</code> es 
&quot;<code>x</code> elevado a 1/2&quot;, mientras que su representaci&oacute;n
externa es &quot;ra&iacute;z de <code>x</code>&quot;.
</p>
<pre class="example">(%i1) sqrt (x);
(%o1)                        sqrt(x)
(%i2) ?format (true, &quot;~S~%&quot;, %);
((MEXPT SIMP) $X ((RAT SIMP) 1 2))
(%o2)                         false
(%i3) dispform (sqrt (x));
(%o3)                        sqrt(x)
(%i4) ?format (true, &quot;~S~%&quot;, %);
((%SQRT SIMP) $X)
(%o4)                         false
</pre>
<p>Utilizaci&oacute;n del argumento opcional <code>all</code>.
</p>
<pre class="example">(%i1) expr : sin (sqrt (x));
(%o1)                     sin(sqrt(x))
(%i2) freeof (sqrt, expr);
(%o2)                         true
(%i3) freeof (sqrt, dispform (expr));
(%o3)                         true
(%i4) freeof (sqrt, dispform (expr, all));
(%o4)                         false
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>dpart</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX240"></a>
</dt>
<dd><p>Selecciona la misma expresi&oacute;n que <code>part</code>, pero en lugar de devolver esa expresi&oacute;n como su valor, devuelve la expresi&oacute;n completa con la subexpresi&oacute;n seleccionada dentro de una caja. La caja es parte de la expresi&oacute;n.
</p>
<pre class="example">(%i1) dpart (x+y/z^2, 1, 2, 1);
                             y
(%o1)                       ---- + x
                               2
                            &quot;&quot;&quot;
                            &quot;z&quot;
                            &quot;&quot;&quot;
</pre></dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>exptisolate</b>
<a name="IDX241"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>V&eacute;ase <code>isolate</code>.
</p>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>exptsubst</b>
<a name="IDX242"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>exptsubst</code> vale <code>true</code> permite la sustituci&oacute;n <code>y</code> por <code>%e^x</code> en <code>%e^(a x)</code>.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>freeof</b><i> (<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</i>
<a name="IDX243"></a>
</dt>
<dd><p><code>freeof (<var>x_1</var>, <var>expr</var>)</code>
devuelve <code>true</code> si ninguna subexpresi&oacute;n de <var>expr</var> coincide con <var>x_1</var>,
o si <var>x_1</var> aparece como variable muda en <var>expr</var>, o si <var>x_1</var> no es ni
una forma nominal ni verbal de cualesquiera operadores presentes en <var>expr</var>,
devolviendo <code>false</code> en otro caso.
</p>
<p>La llamada <code>freeof (<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</code>
equivale a <code>freeof (<var>x_1</var>, <var>expr</var>) and ... and freeof (<var>x_n</var>, <var>expr</var>)</code>.
</p>
<p>Los argumentos <var>x_1</var>, ..., <var>x_n</var> 
pueden seer nombres de funciones y variables, nombres subindicados,
operadores (encerrados entre comillas dobles) o expresiones generales.
</p>
<p>La funci&oacute;n <code>freeof</code> eval&uacute;a sus argumentos.
</p>
<p>Una variable es una variable muda en una expresi&oacute;n si no tiene valor asignado fuera de la expresi&oacute;n.
Variable mudas reconocidas por  <code>freeof</code> son el &iacute;ndice de una suma o producto, la variable l&iacute;mite en <code>limit</code>,
la variable de integraci&oacute;n en la versi&oacute;n de integral definida de <code>integrate</code>,
la variable original en <code>laplace</code>,
variables formales en expresiones <code>at</code> y
los argumentos de las expresiones  <code>lambda</code>.
</p>
<p>La versi&oacute;n indefinida de  <code>integrate</code> no est&aacute; libre de su variable de integraci&oacute;n.
</p>
<p>Ejemplos:
</p>
<p>Los argumentos son nombres de funciones, variables, nombres subindicados, operaores y expresiones. La llamada <code>freeof (a, b, expr)</code> equivale a <code>freeof (a, expr) and freeof (b, expr)</code>.
</p>
<pre class="example">(%i1) expr: z^3 * cos (a[1]) * b^(c+d);
                                 d + c  3
(%o1)                   cos(a ) b      z
                             1
(%i2) freeof (z, expr);
(%o2)                         false
(%i3) freeof (cos, expr);
(%o3)                         false
(%i4) freeof (a[1], expr);
(%o4)                         false
(%i5) freeof (cos (a[1]), expr);
(%o5)                         false
(%i6) freeof (b^(c+d), expr);
(%o6)                         false
(%i7) freeof (&quot;^&quot;, expr);
(%o7)                         false
(%i8) freeof (w, sin, a[2], sin (a[2]), b*(c+d), expr);
(%o8)                         true
</pre>
<p><code>freeof</code> eval&uacute;a sus argumentos.
</p>
<pre class="example">(%i1) expr: (a+b)^5$
(%i2) c: a$
(%i3) freeof (c, expr);
(%o3)                         false
</pre>
<p><code>freeof</code> no considera funciones equivalentes.
La simplificaci&oacute;n puede dar una expresi&oacute;n equivalente pero diferente.
</p>
<pre class="example">(%i1) expr: (a+b)^5$
(%i2) expand (expr);
          5        4       2  3       3  2      4      5
(%o2)    b  + 5 a b  + 10 a  b  + 10 a  b  + 5 a  b + a
(%i3) freeof (a+b, %);
(%o3)                         true
(%i4) freeof (a+b, expr);
(%o4)                         false
(%i5) exp (x);
                                 x
(%o5)                          %e
(%i6) freeof (exp, exp (x));
(%o6)                         true
</pre>
<p>Un sumatorio o integral definida est&aacute; libre de su variable muda.
Una integral indefinida de  <code>integrate</code> no est&aacute; libre de su variable de integraci&oacute;n.
</p>
<pre class="example">(%i1) freeof (i, 'sum (f(i), i, 0, n));
(%o1)                         true
(%i2) freeof (x, 'integrate (x^2, x, 0, 1));
(%o2)                         true
(%i3) freeof (x, 'integrate (x^2, x));
(%o3)                         false
</pre></dd></dl>




<dl>
<dt><u>Variable opcional:</u> <b>inflag</b>
<a name="IDX244"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>inflag</code> vale <code>true</code>, las funciones para la extracci&oacute;n de partes inspeccionan la forma interna de <code>expr</code>.
</p>
<p>N&oacute;tese que el simplificador reordena expresiones.
As&iacute;,  <code>first (x + y)</code> devuelve <code>x</code> si <code>inflag</code>
vale <code>true</code> y <code>y</code> si <code>inflag</code> vale <code>false</code>.
(<code>first (y + x)</code> devuelve el mismo resultado.)
</p>
<p>Adem&aacute;s, d&aacute;ndole a  <code>inflag</code> el valor <code>true</code> y llamando a <code>part</code> o  a <code>substpart</code> es lo mismo que llamar a <code>inpart</code> o a <code>substinpart</code>.
</p>
<p>Las funciones que se ven afectadas por el valor de <code>inflag</code> son:
<code>part</code>, <code>substpart</code>, <code>first</code>, <code>rest</code>, <code>last</code>, <code>length</code>,
la construcci&oacute;n <code>for</code> ... <code>in</code>,
<code>map</code>, <code>fullmap</code>, <code>maplist</code>, <code>reveal</code> y <code>pickapart</code>.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>inpart</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX245"></a>
</dt>
<dd><p>Similar a <code>part</code>, pero trabaja con la representaci&oacute;n interna de la expresi&oacute;n, siendo m&aacute;s r&aacute;pida. Se debe tener cuidado con el orden de subexpresiones en sumas y productos, pues el orden de las variables en la forma interna es normalmente diferente al que se muestra por el terminal, y cuando se trata con el signo menos unario, resta y divisi&oacute;n, pues estos operadores desaparecen de la expresi&oacute;n. Las llamadas <code>part (x+y, 0)</code> o <code>inpart (x+y, 0)</code> devuelven <code>+</code>, siendo necesario encerrar el operador entre comillas dobles cuando se haga referencia a&eacute;l. Por ejemplo,
<code>... if inpart (%o9,0) = &quot;+&quot; then ...</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) x + y + w*z;
(%o1)                      w z + y + x
(%i2) inpart (%, 3, 2);
(%o2)                           z
(%i3) part (%th (2), 1, 2);
(%o3)                           z
(%i4) 'limit (f(x)^g(x+1), x, 0, minus);
                                  g(x + 1)
(%o4)                 limit   f(x)
                      x -&gt; 0-
(%i5) inpart (%, 1, 2);
(%o5)                       g(x + 1)
</pre>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>isolate</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX246"></a>
</dt>
<dd><p>Devuelve <var>expr</var> con subexpresiones que son sumas y que no contienen variables reemplazadas por etiquetas de expresiones intermedias (tales etiquetas son s&iacute;mbolos at&oacute;micos como <code>%t1</code>, <code>%t2</code>, ...).  Esta funci&oacute;n es de utilidad para evitar la expansi&oacute;n innecesaria de subexpresiones que no contienen la variable de inter&eacute;s. Puesto que las etiquetas intermedias toman el valor de subexpresiones pueden ser todas sustituidas evaluando la expresi&oacute;n en la que aparecen.
</p>
<p>Si la variable <code>exptisolate</code>, cuyo valor por defecto es <code>false</code>, vale <code>true</code> har&aacute; que <code>isolate</code> busque exponentes de &aacute;tomos (como <code>%e</code>) que contengan la variable.
</p>
<p>Si <code>isolate_wrt_times</code> vale <code>true</code>, entonces <code>isolate</code> tambi&eacute;n aislar&aacute; respecto de los productos. V&eacute;ase <code>isolate_wrt_times</code>.
</p>
<p>Para ejemplos, ejec&uacute;tese <code>example (isolate)</code>.
</p>
</dd></dl>

<dl>
<dt><u>Variable opcional:</u> <b>isolate_wrt_times</b>
<a name="IDX247"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>isolate_wrt_times</code> vale <code>true</code>, entonces <code>isolate</code> tambi&eacute;n aislar&aacute; respecto de los productos. Comp&aacute;rese el comportamiento de <code>isolate</code> al cambiar el valor de esta variable global en el siguiente ejemplo,
</p>
<pre class="example">(%i1) isolate_wrt_times: true$
(%i2) isolate (expand ((a+b+c)^2), c);

(%t2)                          2 a


(%t3)                          2 b


                          2            2
(%t4)                    b  + 2 a b + a

                     2
(%o4)               c  + %t3 c + %t2 c + %t4
(%i4) isolate_wrt_times: false$
(%i5) isolate (expand ((a+b+c)^2), c);
                     2
(%o5)               c  + 2 b c + 2 a c + %t4
</pre>
</dd></dl>




<dl>
<dt><u>Variable opcional:</u> <b>listconstvars</b>
<a name="IDX248"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>listconstvars</code> vale <code>true</code>, har&aacute; que <code>listofvars</code> incluya <code>%e</code>, <code>%pi</code>, <code>%i</code> y cualquier otra variable que sea declarada constante de las que aparezcan en el argumento de <code>listofvars</code>.
Estas constantes se omiten por defecto.
</p>
</dd></dl>

<dl>
<dt><u>Variable opcional:</u> <b>listdummyvars</b>
<a name="IDX249"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>listdummyvars</code> vale <code>false</code>, las &quot;variables mudas&quot; de la expresi&oacute;n no ser&aacute;n inclu&iacute;das en la lista devuelta por <code>listofvars</code>. (La definici&oacute;n de &quot;variables mudas&quot; se encuentra en la descripci&oacute;n de <code>freeof</code>.
&quot;Variables mudas&quot; son objetos matem&aacute;ticos como el &iacute;ndice de un sumatorio o producto, una variable l&iacute;mite o la variable de una integraci&oacute;n definida.)
Ejemplo:
</p>
<pre class="example">(%i1) listdummyvars: true$
(%i2) listofvars ('sum(f(i), i, 0, n));
(%o2)                        [i, n]
(%i3) listdummyvars: false$
(%i4) listofvars ('sum(f(i), i, 0, n));
(%o4)                          [n]
</pre>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>listofvars</b><i> (<var>expr</var>)</i>
<a name="IDX250"></a>
</dt>
<dd><p>Devuelve una lista con las variables presentes en <var>expr</var>.
</p>
<p>Si la variable <code>listconstvars</code> vale <code>true</code> entonces
<code>listofvars</code> incluir&aacute; <code>%e</code>, <code>%pi</code>, <code>%i</code>
y cualquier otra variable declarada constante de las que aparezcan
en <var>expr</var>.  Estas constantes se omiten por defecto.
</p>
<p>V&eacute;ase tambi&eacute;n la variable opcional <code>listdummyvars</code> para
excluir o incluir variables ficticias en la lista de variables.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) listofvars (f (x[1]+y) / g^(2+a));
(%o1)                     [g, a, x , y]
                                  1
</pre>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>lfreeof</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX251"></a>
</dt>
<dd><p>Para cada miembro  <var>m</var> de <var>list</var>, realiza la llamada <code>freeof (<var>m</var>, <var>expr</var>)</code>.
Devuelve <code>false</code> si alguna de estas llamadas a <code>freeof</code> retorn&oacute; <code>false</code>, y <code>true</code> en caso contrario.
</p></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>lpart</b><i> (<var>label</var>, <var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX252"></a>
</dt>
<dd><p>Similar a <code>dpart</code> pero utiliza una caja etiquetada. Una caja etiquetada es similar a la que produce <code>dpart</code>, pero con un nombre en la l&iacute;nea superior.
</p></dd></dl>




<dl>
<dt><u>Propiedad:</u> <b>mainvar</b>
<a name="IDX253"></a>
</dt>
<dd><p>Se pueden declarar variables de tipo <code>mainvar</code>.  El orden de los &aacute;tomos 
es: n&uacute;meros &lt; constantes (como <code>%e</code> o <code>%pi</code>) &lt;
escalares &lt; otras variables &lt; &quot;mainvars&quot;.  Por ejemplo, comp&aacute;rese <code>expand ((X+Y)^4)</code>
con <code>(declare (x, mainvar), expand ((x+y)^4))</code>.  (Nota: Se debe tener cuidado si se quiere hacer uso de esta declaraci&oacute;n. Por ejemplo, si se resta una expresi&oacute;n en la que <code>x</code> ha sido declarada como <code>mainvar</code> de otra en la que <code>x</code> no es <code>mainvar</code>, puede ser necesario volver a simplificar, <code>ev (expr, simp)</code>, a fin de obtener cancelaciones.  Adem&aacute;s, si se guarda una expresi&oacute;n en la que <code>x</code> es <code>mainvar</code>, quiz&aacute;s sea necesario guardar tambi&eacute;n <code>x</code>.)
</p>
</dd></dl>



<dl>
<dt><u>Propiedad:</u> <b>noun</b>
<a name="IDX254"></a>
</dt>
<dd><p>El s&iacute;mbolo <code>noun</code> es una de las opciones de la instrucci&oacute;n <code>declare</code>. Hace que una funci&oacute;n se declare como &quot;nombre&quot;, lo que significa que no se evaluar&aacute; autom&aacute;ticamente.
</p>
</dd></dl>




<dl>
<dt><u>Variable opcional:</u> <b>noundisp</b>
<a name="IDX255"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>noundisp</code> vale <code>true</code>, los nombres se muestran precedidos de un ap&oacute;strofo. Siempre debe valer <code>true</code> cuando se quiera representar la definici&oacute;n de funciones.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>nounify</b><i> (<var>f</var>)</i>
<a name="IDX256"></a>
</dt>
<dd><p>Devuelve la forma nominal de la funci&oacute;n cuyo nombre es <var>f</var>.  Puede ser &uacute;til cuando se quiera hacer referencia al nombre de una funci&oacute;n sin que &eacute;sta se ejecute.  N&oacute;tese que algunas funciones verbales devolver&aacute;n su forma nominal si no pueden ser evaluadas para ciertos argumentos.  Esta es tambi&eacute;n la expresi&oacute;n que se obtiene cuando la llamada a una funci&oacute;n va precedida por del ap&oacute;strofo.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>nterms</b><i> (<var>expr</var>)</i>
<a name="IDX257"></a>
</dt>
<dd><p>Devuelve el n&uacute;mero de t&eacute;rminos que  <var>expr</var> llegar&iacute;a a tener si fuese completamente expandida y no hubiesen cancelaciones ni combinaciones de t&eacute;rminos semejantes.
N&oacute;tese que expresiones como <code>sin (<var>expr</var>)</code>, <code>sqrt (<var>expr</var>)</code>, <code>exp (<var>expr</var>)</code>, etc.
cuentan como un s&oacute;lo t&eacute;rmino, independientemente de cu&aacute;ntos t&eacute;rminos tenga a su vez <var>expr</var> en caso de tratarse de una suma.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>op</b><i> (<var>expr</var>)</i>
<a name="IDX258"></a>
</dt>
<dd><p>Devuelve el operador principal de la expresi&oacute;n <var>expr</var>. La llamada
<code>op (<var>expr</var>)</code> equivale a <code>part (<var>expr</var>, 0)</code>. 
</p>
<p>La funci&oacute;n <code>op</code> devuelve una cadena si el operador principal es un operador prefijo, infijo (binario o <code>n</code>-ario), postfijo, &quot;bi-fijo&quot; o &quot;no-fijo&quot; (&quot;bi-fijo&quot;  se refiere a un par de s&iacute;mbolos que encierran su o sus argumentos, y &quot;no-fijo&quot; es un operador que no necesita argumentos).
Si <var>expr</var> es la expresi&oacute;n de una funci&oacute;n
subindicada, <code>op</code> devuelve la funci&oacute;n subindicada;
en cuyo caso el valor devuelto no es un &aacute;tomo.
En otro caso, <var>expr</var> es la expresi&oacute;n de una funci&oacute;n array u
ordinaria, y entonces <code>op</code> devuelve un s&iacute;mbolo.
</p>
<p>La funci&oacute;n <code>op</code> observa el valor de la variable global <code>inflag</code>.
</p>
<p>La funci&oacute;n <code>op</code> eval&uacute;a sus argumentos.
</p>
<p>V&eacute;ase tambi&eacute;n <code>args</code>.
</p>
<p>Ejemplos:
</p>

<pre class="example">(%i1) stringdisp: true$
(%i2) op (a * b * c);
(%o2)                          &quot;*&quot;
(%i3) op (a * b + c);
(%o3)                          &quot;+&quot;
(%i4) op ('sin (a + b));
(%o4)                          sin
(%i5) op (a!);
(%o5)                          &quot;!&quot;
(%i6) op (-a);
(%o6)                          &quot;-&quot;
(%i7) op ([a, b, c]);
(%o7)                          &quot;[&quot;
(%i8) op ('(if a &gt; b then c else d));
(%o8)                         &quot;if&quot;
(%i9) op ('foo (a));
(%o9)                          foo
(%i10) prefix (foo);
(%o10)                        &quot;foo&quot;
(%i11) op (foo a);
(%o11)                        &quot;foo&quot;
(%i12) op (F [x, y] (a, b, c));
(%o12)                        F
                               x, y
(%i13) op (G [u, v, w]);
(%o13)                          G
</pre>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>operatorp</b><i> (<var>expr</var>, <var>op</var>)</i>
<a name="IDX259"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>operatorp</b><i> (<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</i>
<a name="IDX260"></a>
</dt>
<dd><p>La llamada <code>operatorp (<var>expr</var>, <var>op</var>)</code> devuelve <code>true</code>
si <var>op</var> es igual al operador de <var>expr</var>.
</p>
<p>La llamada <code>operatorp (<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</code> devuelve <code>true</code>
si alg&uacute;n elemento  <var>op_1</var>, ..., <var>op_n</var> es igual al operador de <var>expr</var>.
</p>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>opsubst</b>
<a name="IDX261"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Si <code>opsubst</code> vale <code>false</code>, <code>subst</code> no sustituye el operdor de una expresi&oacute;n, de manera que <code>(opsubst: false, subst (x^2, r, r+r[0]))</code> trabajar&aacute; correctamente.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>optimize</b><i> (<var>expr</var>)</i>
<a name="IDX262"></a>
</dt>
<dd><p>Devuelve una expresi&oacute;n que produce el mismo valor y efectos secundarios que <var>expr</var>, pero de forma m&aacute;s eficiente al evitar recalcular subexpresiones comunes. La funci&oacute;n <code>optimize</code> tambi&eacute;n tiene el efecto secundario de colapsar su argumento de manera que se compartan todas sus subexpresiones comunes.
H&aacute;gase <code>example (optimize)</code> para ver ejemplos.
</p>
</dd></dl>

<dl>
<dt><u>Variable opcional:</u> <b>optimprefix</b>
<a name="IDX263"></a>
</dt>
<dd><p>Valor por defecto: <code>%</code>
</p>
<p>La variable <code>optimprefix</code> es el prefijo utilizado para los s&iacute;mbolos generados por la instrucci&oacute;n <code>optimize</code>.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>ordergreat</b><i> (<var>v_1</var>, ..., <var>v_n</var>)</i>
<a name="IDX264"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>orderless</b><i> (<var>v_1</var>, ..., <var>v_n</var>)</i>
<a name="IDX265"></a>
</dt>
<dd><p><code>ordergreat</code> cambia el orden can&oacute;nico de las expresiones de
Maxima, de manera que <var>v_1</var> prevalece sobre <var>v_2</var>, que
prevalece sobre ..., que prevalece sobre <var>v_n</var>, que prevalece
sobre cualquier otro s&iacute;mbolo no presente en la
lista de argumentos.
</p>
<p><code>orderless</code> cambia el orden can&oacute;nico de las expresiones de
Maxima, de manera que <var>v_1</var> precede a <var>v_2</var>, que precede a ...,
que precede a <var>v_n</var>, que precede a cualquier otra variable no 
presente en la lista de argumentos.
</p>
<p>El orden impuesto por <code>ordergreat</code> y <code>orderless</code> se 
destruye con <code>unorder</code>. <code>ordergreat</code> y <code>orderless</code>
s&oacute;lo se pueden llamar una vez, a menos que se invoque a <code>unorder</code>.
La &uacute;ltima llamada a <code>ordergreat</code> y <code>orderless</code> es la que
se mantiene activa.
</p>
<p>V&eacute;ase tambi&eacute;n <code>ordergreatp</code>.
</p>
</dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>ordergreatp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX266"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>orderlessp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX267"></a>
</dt>
<dd><p><code>ordergreatp</code> devuelve <code>true</code> si <var>expr_1</var> prevalece sobre
<var>expr_2</var> en el orden can&oacute;nico de las expresiones de Maxima, o
<code>false</code> en caso contrario.
</p>
<p><code>orderlessp</code> devuelve <code>true</code> si <var>expr_1</var> precede a
<var>expr_2</var> en el orden can&oacute;nico de las expresiones de Maxima, o
<code>false</code> en caso contrario.
</p>
<p>Todos los &aacute;tomos y expresiones de Maxima son comparables bajo 
<code>ordergreatp</code> y <code>orderlessp</code>, aunque existen ejemplos aislados
de expresiones para los que estos predicados no son transitivos.
</p>
<p>La ordenaci&oacute;n can&oacute;nica de &aacute;tomos (s&iacute;mbolos, n&uacute;meros
literales y cadenas) es la siguiente: (enteros y decimales en coma flotante)
preceden a (n&uacute;meros decimales grandes o <i>bigfloats</i>), que preceden a (constantes
declaradas), que preceden a (cadenas), que preceden a (escalares declarados), que preceden a 
(primer argumento de <code>orderless</code>), que precede a ..., que precede a (&uacute;ltimo
argumento de <code>orderless</code>), que precede a (otros s&iacute;mbolos), que
preceden a (&uacute;ltimo argumento de <code>ordergreat</code>), que precede a ..., que
precede a (primer argumento de <code>ordergreat</code>), que precede a (variables
principales declaradas).
</p>
<p>Para las expresiones no at&oacute;micas, la ordenaci&oacute;n can&oacute;nica se deriva de la
ordenaci&oacute;n de &aacute;tomos. Para los operadores nativos <code>+</code>, <code>*</code> y <code>^</code>,
los criterios de ordenaci&oacute;n no son sencillos de resumir.
Para otros operadores nativos, y todas las dem&aacute;s funciones y operadores,
las expresiones se ordenan por sus argumentos (empezando por el primero),
despu&eacute;s por el nombre del operador o funci&oacute;n. En caso de expresiones
con sub&iacute;ndices, el s&iacute;mbolo subindicado se
considera operador y el sub&iacute;ndice un argumento del mismo.
</p>
<p>El orden can&oacute;nico de expresiones se modifica mediante las funciones
<code>ordergreat</code> y <code>orderless</code>, as&iacute; como por las 
declaraciones <code>mainvar</code>, <code>constant</code> y <code>scalar</code>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>sort</code>.
</p>
<p>Ejemplos:
</p>
<p>Ordenaci&oacute;n de s&iacute;mbolos comunes y constantes.
N&oacute;tese que <code>%pi</code> no se ordena en funci&oacute;n de su valor
num&eacute;rico.
</p>
<pre class="example">(%i1) stringdisp : true;
(%o1)                         true
(%i2) sort ([%pi, 3b0, 3.0, x, X, &quot;foo&quot;, 3, a, 4, &quot;bar&quot;, 4.0, 4b0]);
(%o2) [3, 3.0, 4, 4.0, 3.0b0, 4.0b0, %pi, &quot;bar&quot;, &quot;foo&quot;, a, x, X]
</pre>
<p>Efecto producido por las funciones <code>ordergreat</code> y <code>orderless</code>.
</p>
<pre class="example">(%i1) sort ([M, H, K, T, E, W, G, A, P, J, S]);
(%o1)           [A, E, G, H, J, K, M, P, S, T, W]
(%i2) ordergreat (S, J);
(%o2)                         done
(%i3) orderless (M, H);
(%o3)                         done
(%i4) sort ([M, H, K, T, E, W, G, A, P, J, S]);
(%o4)           [M, H, A, E, G, K, P, T, W, J, S]
</pre>
<p>Efecto producido por las declaraciones <code>mainvar</code>, <code>constant</code> y <code>scalar</code>.
</p>
<pre class="example">(%i1) sort ([aa, foo, bar, bb, baz, quux, cc, dd, A1, B1, C1]);
(%o1)   [aa, bar, baz, bb, cc, dd, foo, quux, A1, B1, C1]
(%i2) declare (aa, mainvar);
(%o2)                         done
(%i3) declare ([baz, quux], constant);
(%o3)                         done
(%i4) declare ([A1, B1], scalar);
(%o4)                         done
(%i5) sort ([aa, foo, bar, bb, baz, quux, cc, dd, A1, B1, C1]);
(%o5)   [baz, quux, A1, B1, bar, bb, cc, dd, foo, C1, aa]
</pre>
<p>Ordenaci&oacute;n de expresiones no at&oacute;micas.
</p>
<pre class="example">(%i1) sort ([1, 2, n, f(1), f(2), f(2, 1), g(1), g(1, 2), g(n), f(n, 1)]);
(%o1) [1, 2, f(1), g(1), g(1, 2), f(2), f(2, 1), n, g(n), 
                                                         f(n, 1)]
(%i2) sort ([foo(1), X[1], X[k], foo(k), 1, k]);
(%o2)            [1, foo(1), X , k, foo(k), X ]
                              1              k
</pre></dd></dl>


<dl>
<dt><u>Funci&oacute;n:</u> <b>part</b><i> (<var>expr</var>, <var>n_1</var>, ..., <var>n_k</var>)</i>
<a name="IDX268"></a>
</dt>
<dd><p>Devuelve partes de la forma mostrada de <code>expr</code>. Obtiene la 
parte de <code>expr</code> que se especifica por los &iacute;ndices 
<var>n_1</var>, ..., <var>n_k</var>.  Primero se obtiene la parte <var>n_1</var> de 
<code>expr</code>, despu&eacute;s la parte <var>n_2</var> del resultado anterior, 
y as&iacute; sucesivamente.  El resultado que se obtiene es 
la parte <var>n_k</var> de ... la parte <var>n_2</var> de la parte <var>n_1</var> de <code>expr</code>.
Si no se especifican &iacute;ndices, devuelve <code>expr</code>.
</p>
<p>La funci&oacute;n <code>part</code> se puede utilizar para obtener un elemento 
de una lista, una fila de una matriz, etc.
</p>
<p>Si el &uacute;ltimo argumento de la funci&oacute;n <code>part</code> es una lista de 
&iacute;ndices, entonces se toman varias subexpresiones, cada 
una de las cuales correspondiente a un &iacute;ndice de la lista.
As&iacute;, <code>part (x + y + z, [1, 3])</code> devuelve <code>z+x</code>.
</p>
<p>La variable <code>piece</code> guarda la &uacute;ltima expresi&oacute;n seleccionada
con la funci&oacute;n <code>part</code>. Se actualiza durante la ejecuci&oacute;n de
la funci&oacute;n, por lo que puede ser referenciada en la misma funci&oacute;n.
</p>
<p>Si <code>partswitch</code> vale <code>true</code> entonces de devuelve <code>end</code>
cuando no exista la parte seleccionada de una expresi&oacute;n, si vale
<code>false</code> se mostrar&aacute; un mensaje de error.
</p>
<p>V&eacute;anse tambi&eacute;n <code>inpart</code>, <code>substpart</code>, <code>substinpart</code>,
<code>dpart</code> y <code>lpart</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) part(z+2*y+a,2);
(%o1)                                 2 y
(%i2) part(z+2*y+a,[1,3]);
(%o2)                                z + a
(%i3) part(z+2*y+a,2,1);
(%o3)                                  2
</pre>
<p>La instrucci&oacute;n <code>example (part)</code> muestra m&aacute;s ejemplos.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>partition</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX269"></a>
</dt>
<dd><p>Devuelve una lista con dos expresiones, que son: (1) los factores de 
<var>expr</var> si es un producto, los t&eacute;rminos de <var>expr</var> si es una
suma, o los elementos de <var>expr</var>, si es una lista, que no contengan
a <var>x</var>, (2) los factores, t&eacute;rminos o lista que contengan a <var>x</var>.
</p>
<pre class="example">(%i1) partition (2*a*x*f(x), x);
(%o1)                     [2 a, x f(x)]
(%i2) partition (a+b, x);
(%o2)                      [b + a, 0]
(%i3) partition ([a, b, f(a), c], a); 
(%o3)                  [[b, c], [a, f(a)]]
</pre>
</dd></dl>

<dl>
<dt><u>Variable opcional:</u> <b>partswitch</b>
<a name="IDX270"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si <code>partswitch</code> vale <code>true</code> entonces de devuelve <code>end</code> cuando no exista la parte seleccionada de una expresi&oacute;n, si vale <code>false</code> se mostrar&aacute; un mensaje de error.
</p>
</dd></dl>

<dl>
<dt><u>Funci&oacute;n:</u> <b>pickapart</b><i> (<var>expr</var>, <var>n</var>)</i>
<a name="IDX271"></a>
</dt>
<dd><p>Asigna etiquetas de expresiones intermedias a subexpresiones de <var>expr</var> al nivel de profundidad <var>n</var>, que es un entero. A las subexpresiones a un nivel de profundidad mayor o menor no se les asignan etiquetas. La funci&oacute;n
<code>pickapart</code> devuelve una expresi&oacute;n en t&eacute;rminos de expresiones intermedias equivalente a la expresi&oacute;n original <var>expr</var>.
</p>
<p>V&eacute;anse tambi&eacute;n <code>part</code>, <code>dpart</code>, <code>lpart</code>, <code>inpart</code> y <code>reveal</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) expr: (a+b)/2 + sin (x^2)/3 - log (1 + sqrt(x+1));
                                          2
                                     sin(x )   b + a
(%o1)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2
(%i2) pickapart (expr, 0);

                                          2
                                     sin(x )   b + a
(%t2)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2

(%o2)                          %t2
(%i3) pickapart (expr, 1);

(%t3)                - log(sqrt(x + 1) + 1)


                                  2
                             sin(x )
(%t4)                        -------
                                3


                              b + a
(%t5)                         -----
                                2

(%o5)                    %t5 + %t4 + %t3
(%i5) pickapart (expr, 2);

(%t6)                 log(sqrt(x + 1) + 1)


                                  2
(%t7)                        sin(x )


(%t8)                         b + a

                         %t8   %t7
(%o8)                    --- + --- - %t6
                          2     3
(%i8) pickapart (expr, 3);

(%t9)                    sqrt(x + 1) + 1


                                2
(%t10)                         x

                  b + a              sin(%t10)
(%o10)            ----- - log(%t9) + ---------
                    2                    3
(%i10) pickapart (expr, 4);

(%t11)                     sqrt(x + 1)

                      2
                 sin(x )   b + a
(%o11)           ------- + ----- - log(%t11 + 1)
                    3        2
(%i11) pickapart (expr, 5);

(%t12)                        x + 1

                   2
              sin(x )   b + a
(%o12)        ------- + ----- - log(sqrt(%t12) + 1)
                 3        2
(%i12) pickapart (expr, 6);
                  2
             sin(x )   b + a
(%o12)       ------- + ----- - log(sqrt(x + 1) + 1)
                3        2
</pre>
</dd></dl>

<dl>
<dt><u>Variable del sistema:</u> <b>piece</b>
<a name="IDX272"></a>
</dt>
<dd><p>Guarda la &uacute;ltima expresi&oacute;n seleccionada por las funciones <code>part</code>.
</p>

</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>psubst</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX273"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>psubst</b><i> (<var>a</var>, <var>b</var>, <var>expr</var>)</i>
<a name="IDX274"></a>
</dt>
<dd><p><code>psubst(<var>a</var>, <var>b</var>, <var>expr</var>)</code> es simliar a <code>subst</code>.  V&eacute;ase 
<code>subst</code>.
</p>
<p>A diferencia de <code>subst</code>, la funci&oacute;n <code>psubst</code> hace sustituciones
en paralelo si su primer argumento es una lista de ecuaciones.
</p>
<p>V&eacute;ase tambi&eacute;n <code>sublis</code> para hacer sustituciones en paralelo.
</p>
<p>Ejemplo:
</p>
<p>El primer ejemplo muestra la sustituci&oacute;n en paralelo con <code>psubst</code>.
El segundo ejemplo muestra el resultado de la funci&oacute;n <code>subst</code>,
que realiza la sustituci&oacute;n en serie.
</p>
<pre class="example">(%i4) psubst ([a^2=b, b=a], sin(a^2) + sin(b));
(%o4)                           sin(b) + sin(a)
(%i5) subst ([a^2=b, b=a], sin(a^2) + sin(b));
(%o5)                              2 sin(a)
</pre>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>rembox</b><i> (<var>expr</var>, unlabelled)</i>
<a name="IDX275"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>rembox</b><i> (<var>expr</var>, <var>label</var>)</i>
<a name="IDX276"></a>
</dt>
<dt><u>Funci&oacute;n:</u> <b>rembox</b><i> (<var>expr</var>)</i>
<a name="IDX277"></a>
</dt>
<dd><p>Elimina cajas de <var>expr</var>.
</p>
<p>La llamada <code>rembox (<var>expr</var>, unlabelled)</code> elimina todas las cajas no etiquetadas de <var>expr</var>.
</p>
<p>La llamada <code>rembox (<var>expr</var>, <var>label</var>)</code> s&oacute;lo elimina las cajas etiquetadas con <var>label</var>.
</p>
<p>La llamada <code>rembox (<var>expr</var>)</code> elimina todas las caajs, independientemente de que est&eacute;n etiquetadas o no.
</p>
<p>Las cajas son dibujadas por las funciones <code>box</code>, <code>dpart</code> y <code>lpart</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) expr: (a*d - b*c)/h^2 + sin(%pi*x);
                                  a d - b c
(%o1)                sin(%pi x) + ---------
                                      2
                                     h
(%i2) dpart (dpart (expr, 1, 1), 2, 2);
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;    a d - b c
(%o2)               sin(&quot;%pi x&quot;) + ---------
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;      &quot;&quot;&quot;&quot;
                                     &quot; 2&quot;
                                     &quot;h &quot;
                                     &quot;&quot;&quot;&quot;
(%i3) expr2: lpart (BAR, lpart (FOO, %, 1), 2);
                  FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;a d - b c&quot;
(%o3)             &quot;sin(&quot;%pi x&quot;)&quot; + &quot;---------&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;  &quot;&quot;&quot;&quot;   &quot;
                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;  &quot; 2&quot;   &quot;
                                   &quot;  &quot;h &quot;   &quot;
                                   &quot;  &quot;&quot;&quot;&quot;   &quot;
                                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i4) rembox (expr2, unlabelled);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;a d - b c&quot;
(%o4)              &quot;sin(%pi x)&quot; + &quot;---------&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;    2    &quot;
                                  &quot;   h     &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) rembox (expr2, FOO);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;a d - b c&quot;
(%o5)              sin(&quot;%pi x&quot;) + &quot;---------&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;  &quot; 2&quot;   &quot;
                                  &quot;  &quot;h &quot;   &quot;
                                  &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) rembox (expr2, BAR);
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   a d - b c
(%o6)              &quot;sin(&quot;%pi x&quot;)&quot; + ---------
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;     &quot;&quot;&quot;&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;     &quot; 2&quot;
                                      &quot;h &quot;
                                      &quot;&quot;&quot;&quot;
(%i7) rembox (expr2);
                                  a d - b c
(%o7)                sin(%pi x) + ---------
                                      2
                                     h
</pre>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>reveal</b><i> (<var>expr</var>, <var>nivel</var>)</i>
<a name="IDX278"></a>
</dt>
<dd><p>Reemplaza partes de <var>expr</var> al <var>nivel</var> especificado y las sutituye por descripciones cortas.
</p>
<ul>
<li>
Las sumas y restas se reemplazan por <code>Sum(<var>n</var>)</code>,
siendo <var>n</var> el n&uacute;mero de t&eacute;rminos de la suma.
</li><li>
Los productos se reemplazan por <code>Product(<var>n</var>)</code>,
siendo <var>n</var> el n&uacute;mero de factores del producto.
</li><li>
Las potencias se reemplazan por <code>Expt</code>. 
</li><li>
Los cocientes se reemplazan por <code>Quotient</code>.
</li><li>
El s&iacute;mbolo negativo se reemplaza por <code>Negterm</code>.
</li><li>
Las listas se reemplazan por <code>List(<var>n</var>)</code>, siendo <var>n</var> el n&uacute;mero de
elementos de la lista.
</li></ul>

<p>Si el entero  <var>depth</var> es mayor o igual que la profundidad m&aacute;xima de <var>expr</var>,
<code>reveal (<var>expr</var>, <var>depth</var>)</code> devuelve <var>expr</var> sin modificar.
</p>
<p>La funci&oacute;n <code>reveal</code> eval&uacute;a sus argumentos y devuelve la expresi&oacute;n con las modificaciones solicitadas.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) e: expand ((a - b)^2)/expand ((exp(a) + exp(b))^2);
                          2            2
                         b  - 2 a b + a
(%o1)               -------------------------
                        b + a     2 b     2 a
                    2 %e      + %e    + %e
(%i2) reveal (e, 1);
(%o2)                       Quotient
(%i3) reveal (e, 2);
                             Sum(3)
(%o3)                        ------
                             Sum(3)
(%i4) reveal (e, 3);
                     Expt + Negterm + Expt
(%o4)               ------------------------
                    Product(2) + Expt + Expt
(%i5) reveal (e, 4);
                       2                 2
                      b  - Product(3) + a
(%o5)         ------------------------------------
                         Product(2)     Product(2)
              2 Expt + %e           + %e
(%i6) reveal (e, 5);
                         2            2
                        b  - 2 a b + a
(%o6)              --------------------------
                       Sum(2)     2 b     2 a
                   2 %e       + %e    + %e
(%i7) reveal (e, 6);
                          2            2
                         b  - 2 a b + a
(%o7)               -------------------------
                        b + a     2 b     2 a
                    2 %e      + %e    + %e
</pre></dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>sublis</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX279"></a>
</dt>
<dd><p>Hace sustituciones m&uacute;ltiples en paralelo dentro de las expresiones.
<var>list</var> es una lista de ecuaciones, cuyos miembros izquierdos deben
ser &aacute;tomos.
</p>
<p>La variable <code>sublis_apply_lambda</code> controla la simplificaci&oacute;n
despu&eacute;s de <code>sublis</code>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>psubst</code> para hacer sustituciones en paralelo.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) sublis ([a=b, b=a], sin(a) + cos(b));
(%o1)                    sin(b) + cos(a)
</pre></dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>sublis_apply_lambda</b>
<a name="IDX280"></a>
</dt>
<dd><p>Valor por defecto: <code>true</code>
</p>
<p>Controla si los <code>lambda</code> sustituidos son aplicados en la simplificaci&oacute;n despu&eacute;s de invocar a <code>sublis</code>, o si se tiene que hacer un <code>ev</code> para hacerlo. Si <code>sublis_apply_lambda</code> vale <code>true</code>, significa que se ejecute la aplicaci&oacute;n.
</p>
</dd></dl>



<dl>
<dt><u>Variable opcional:</u> <b>subnumsimp</b>
<a name="IDX281"></a>
</dt>
<dd><p>Valor por defecto: <code>false</code>
</p>
<p>Si vale <code>true</code>, las funciones <code>subst</code> y <code>psubst</code> puede sustituir
una variable subindicada <code>f[x]</code> por un n&uacute;mero simplemente utilizando el
s&iacute;mbolo <code>f</code>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>subst</code>.
</p>
<pre class="example">(%i1) subst(100,g,g[x]+2);

subst: cannot substitute 100 for operator g in expression g
                                                           x
 -- an error. To debug this try: debugmode(true);

(%i2) subst(100,g,g[x]+2),subnumsimp:true;
(%o2)                          102
</pre>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>subst</b><i> (<var>a</var>, <var>b</var>, <var>c</var>)</i>
<a name="IDX282"></a>
</dt>
<dd><p>Sustituye <var>a</var> por <var>b</var> en <var>c</var>. El argumento  <var>b</var> debe ser un &aacute;tomo o una subexpresi&oacute;n completa de <var>c</var>.  Por ejemplo, <code>x+y+z</code> es una subexpresi&oacute;n completa de  <code>2*(x+y+z)/w</code> mientras que <code>x+y</code> no lo es. Cuando <var>b</var> no cumple esta caracter&iacute;stica, se puede utilizar en algunos casos <code>substpart</code> o <code>ratsubst</code>
(ver m&aacute;s abajo).  Alternativamente, si <var>b</var> no es de la forma <code>e/f</code> entonces se puede usar <code>subst (a*f, e, c)</code>, pero si <var>b</var> es de la forma <code>e^(1/f)</code> se debe usar <code>subst (a^f, e, c)</code>.  La instrucci&oacute;n <code>subst</code> tambi&eacute;n reconoce <code>x^y</code> en <code>x^-y</code>, de manera que  <code>subst (a, sqrt(x), 1/sqrt(x))</code> da <code>1/a</code>. Los argumentos <var>a</var> y <var>b</var> tambi&eacute;n pueden ser operadores de una expresi&oacute;n acotados por comillas dobles <code>&quot;</code> o nombres de funciones.  Si se quiere sustituir la variable independiente en expresiones con derivadas se debe utilizar la funci&oacute;n <code>at</code> (ver m&aacute;s abajo).
</p>
<p>La funci&oacute;n <code>subst</code> es sin&oacute;nimo de <code>substitute</code>.
</p>
<p>La llamada <code>subst (<var>eq_1</var>, <var>expr</var>)</code> o 
<code>subst ([<var>eq_1</var>, ..., <var>eq_k</var>], <var>expr</var>)</code>
est&aacute;n permitidas. Las <var>eq_i</var> son ecuaciones que indican las sustituciones a realizar.
Para cada ecuaci&oacute;n, el miembro izquierdo ser&aacute; sustituido por la expresi&oacute;n del 
miembro derecho en <var>expr</var>. Las ecuaciones se sustituyen secuencialmente de
izquierda a derecha en <var>expr</var>. V&eacute;anse las funciones <code>sublis</code> y <code>psubst</code> 
para sustituciones en paralelo.
</p>
<p>Si la variable <code>exptsubst</code> vale <code>true</code> se permiten ciertas
sustituciones de exponentes; por ejemplo, sustituir <code>y</code> por <code>%e^x</code>
en <code>%e^(a*x)</code>.
</p>
<p>Si <code>opsubst</code> vale <code>false</code>,
<code>subst</code> no intentar&aacute; sustituir un operador de una expresi&oacute;n. Por ejemplo, 
<code>(opsubst: false, subst (x^2, r, r+r[0]))</code> trabajar&aacute; sin problemas.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) subst (a, x+y, x + (x+y)^2 + y);
                                    2
(%o1)                      y + x + a
(%i2) subst (-%i, %i, a + b*%i);
(%o2)                       a - %i b
</pre>
<p>La sustituci&oacute;n se hace secuencialmente seg&uacute;n una lista de
ecuaciones. Comp&aacute;rese con la sustituci&oacute;n en paralelo.
</p>
<pre class="example">(%i3) subst([a=b, b=c], a+b);
(%o3)                                 2 c
(%i4) sublis([a=b, b=c], a+b);
(%o4)                                c + b
</pre>

<p>Para m&aacute;s ejemplos, ejec&uacute;tese <code>example (subst)</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>substinpart</b><i> (<var>x</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX283"></a>
</dt>
<dd><p>Es similar a <code>substinpart</code>, pero trabaja con la representaci&oacute;n interna de <var>expr</var>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) x . 'diff (f(x), x, 2);
                              2
                             d
(%o1)                   x . (--- (f(x)))
                               2
                             dx
(%i2) substinpart (d^2, %, 2);
                                  2
(%o2)                        x . d
(%i3) substinpart (f1, f[1](x + 1), 0);
(%o3)                       f1(x + 1)
</pre>
<p>Si el &uacute;ltimo argumento pasado a la funci&oacute;n <code>part</code> es una
lista de &iacute;ndices, se obtendr&aacute; la lista de subexpresiones
correspondientes a cada uno de los &iacute;ndices.
</p>
<pre class="example">(%i1) part (x + y + z, [1, 3]);
(%o1)                         z + x
</pre>
<p>La variable <code>piece</code> guarda el valor de la &uacute;ltima expresi&oacute;n seleccionada al
utilizar las funciones <code>part</code>. El valor es asignado durante la 
ejecuci&oacute;n de la funci&oacute;n y puede ser utilizada tal como se muestra m&aacute;s
abajo. Si a <code>partswitch</code> se le asigna el valor <code>true</code> entonces se
devolver&aacute; <code>end</code> cuando no existe la parte solicitada; con otro
valor devuelve un mensaje de error.
</p>
<pre class="example">(%i1) expr: 27*y^3 + 54*x*y^2 + 36*x^2*y + y + 8*x^3 + x + 1;
              3         2       2            3
(%o1)     27 y  + 54 x y  + 36 x  y + y + 8 x  + x + 1
(%i2) part (expr, 2, [1, 3]);
                                  2
(%o2)                         54 y
(%i3) sqrt (piece/54);
(%o3)                        abs(y)
(%i4) substpart (factor (piece), expr, [1, 2, 3, 5]);
                               3
(%o4)               (3 y + 2 x)  + y + x + 1
(%i5) expr: 1/x + y/x - 1/z;
                             1   y   1
(%o5)                      - - + - + -
                             z   x   x
(%i6) substpart (xthru (piece), expr, [2, 3]);
                            y + 1   1
(%o6)                       ----- - -
                              x     z
</pre>
<p>Adem&aacute;s, d&aacute;ndole a <code>inflag</code> el valor <code>true</code> y llamando a
<code>part</code> o <code>substpart</code> es lo mismo que invocar a  <code>inpart</code> o <code>substinpart</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>substpart</b><i> (<var>x</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX284"></a>
</dt>
<dd><p>Sustituye por <var>x</var> la subexpresi&oacute;n que se obtiene de aplicar el resto de
argumentos a la funci&oacute;n <code>part</code>, devolviendo el nuevo valor de <var>expr</var>.
<var>x</var> puede ser un operador que sustituya otro operador de <var>expr</var>. En
ciertos casos, <var>x</var> necesita estar entrecomillado por comillas dobles (<code>&quot;</code>);
por ejemplo, de <code>substpart (&quot;+&quot;, a*b, 0)</code> se obtiene <code>b + a</code>.
</p>
<p>Ejemplo:
</p>
<pre class="example">(%i1) 1/(x^2 + 2);
                               1
(%o1)                        ------
                              2
                             x  + 2
(%i2) substpart (3/2, %, 2, 1, 2);
                               1
(%o2)                       --------
                             3/2
                            x    + 2
(%i3) a*x + f(b, y);
(%o3)                     a x + f(b, y)
(%i4) substpart (&quot;+&quot;, %, 1, 0);
(%o4)                    x + f(b, y) + a
</pre>
<p>Adem&aacute;s, d&aacute;ndole a <code>inflag</code> el valor <code>true</code> y llamando a
<code>part</code> o <code>substpart</code> es lo mismo que invocar a  <code>inpart</code> o <code>substinpart</code>.
</p>
</dd></dl>



<dl>
<dt><u>Funci&oacute;n:</u> <b>symbolp</b><i> (<var>expr</var>)</i>
<a name="IDX285"></a>
</dt>
<dd><p>Devuelve <code>true</code> si <var>expr</var> es un s&iacute;mbolo y <code>false</code> en caso contrario.
La llamada <code>symbolp(x)</code> equivale al predicado <code>atom(x) and not numberp(x)</code>.
</p>
<p>V&eacute;ase tambi&eacute;n <code>Identifiers</code>.
</p>
</dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>unorder</b><i> ()</i>
<a name="IDX286"></a>
</dt>
<dd><p>Desactiva las asociaciones creadas por la &uacute;ltima utilizaci&oacute;n de los comandos de ordenaci&oacute;n <code>ordergreat</code> y <code>orderless</code>, los cuales no pueden ser utilizados m&aacute;s de una vez sin invocar a <code>unorder</code>. 
</p>
<p><code>unorder</code> no sustituye en expresiones los s&iacute;mbolos originales
por los alias introducidos por <code>ordergreat</code> y <code>orderless</code>. Es por ello
que tras la ejecucin de <code>unorder</code> los alias aparecen en expresiones
anteriores.
</p>
<p>V&eacute;ase tambi&eacute;n <code>ordergreat</code> y <code>orderless</code>.
</p>
<p>Ejemplos:
</p>
<p><code>ordergreat(a)</code> introduce un alias para el s&iacute;mbolo <code>a</code>,
raz&oacute;n por la cual la diferencia de <code>%o2</code> y <code>%o4</code> no se anula.
<code>unorder</code> no restablece el s&iacute;mbolo <code>a</code> y el alias
aparece en el resultado <code>%o7</code>.
</p>
<pre class="example">(%i1) 
(%o1)                          []
(%i2) b*x+a^2;
                                   2
(%o2)                       b x + a
(%i3) ordergreat(a);
(%o3)                         done
(%i4) b*x+a^2;
                             2
(%o4)                       a  + b x
(%i5) %th(1)-%th(3);
                              2    2
(%o5)                        a  - a
(%i6) unorder();
(%o6)                          [a]
(%i7) %th(2);
                                2    2
(%o7)                      _101a  - a
</pre></dd></dl>




<dl>
<dt><u>Funci&oacute;n:</u> <b>verbify</b><i> (<var>f</var>)</i>
<a name="IDX287"></a>
</dt>
<dd><p>Devuelve la forma verbal del nombre de funci&oacute;n <var>f</var>.
</p>
<p>V&eacute;anse tambi&eacute;n <code>verb</code>, <code>noun</code> y <code>nounify</code>.
</p>
<p>Ejemplos:
</p>
<pre class="example">(%i1) verbify ('foo);
(%o1)                          foo
(%i2) :lisp $%
$FOO
(%i2) nounify (foo);
(%o2)                          foo
(%i3) :lisp $%
%FOO
</pre>
</dd></dl>

<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC50" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC56" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_82.html#SEC377" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>diciembre, 10 2012</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
