Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: The LDIF file contains several data records that are usually loaded into an LDAP server. Each data record in the LDIF file is uniquely identified by a "Distinguished Name" (or DN). The suffix is appended to the "Relative Distinguished Name" (or RDN) to create the DN. Please select one of the available RDN options that will be used to create the DN.
pl: Plik LDIF zawiera szereg danych zwykle ³adowanych do serwera LDAP. Ka¿dy element z pliku LDIF posiada unikalny identyfikator "Wyró¿niona Nazwa" (lub WN). Przyrostek jest dodawany do "Relatywnie Wyró¿nionej Nazwy" (lub RWN) aby stworzyæ WN. Proszê wybraæ jedn± z dostêpnych opcji RWN która zostanie u¿yta do stworzenia WN.

source: Use DN attribute if present in data
pl: U¿yj atrybutu WN je¿eli obecny w danych

source: The addressbook may contain entries that were previously imported from an LDIF file. The "Distinguished Name" (DN) user attribute, if present in the address book data, may be used in the exported LDIF file. The RDN selected above will be used if the DN user attribute is not found.
pl: Ksi±¿ka adresowa mo¿e zawieraæ wpisy które zosta³y wcze¶niej zaimportowane z pliku LDIF. "Wyró¿niona Nazwa" (WN) atrybutu u¿ytkownika, je¶li obecna w ksi±¿ce adresowej, mo¿e zostaæ u¿yta w eksportowanym pliku LDIF. RWN zaznaczone powy¿ej zostanie u¿yte je¿eli atrybut u¿ytkownika WN nie zostanie znaleziony.

source: Exclude record if no Email Address
pl: Pomijaj wpisy bez adresu E-Mail

source: An addressbook may contain entries without Email Addresses. Check this option to ignore these records.
pl: Ksi±¿ka adresowa mo¿e zawieraæ wpisy bez adresu E-Mail. Zaznaczenie tej opcji powoduje, ¿e takie wpisy bêd± ignorowane.

source: Export Address Book to LDIF File
pl: Eksportowanie ksi±¿ki adresowej do pliku LDIF

source: Distinguished Name
pl: Unikalna nazwa

source: Export to mbox file
pl: _Eksportuj do pliku mbox...

source: Locate the folder to export and specify the mbox file.
pl: Wybierz katalog, do którego chcesz eksportowaæ i podaj plik mbox.

source: Source folder:
pl: Katalog ¼ród³owy:

source: Mbox file:
pl: Lokalny plik mbox

source: Target mbox filename can't be left empty.
pl: Wynikowa nazwa pliku mbox nie mo¿e byæ pusta.

source: Source folder can't be left empty.
pl: Katalog wynikowy nie mo¿e byæ pusty.

source: Couldn't find the source folder.
pl: Nie mo¿na odnale¼æ katalogu ¼ród³owego.

source: Select exporting file
pl: Wybierz plik eksportu

source: Full Name
pl: Pe³na nazwa

source: Attributes
pl: Atrybuty

source: Claws Mail Address Book
pl: Ksi±¿ka adresowa Claws Mail

source: Name already exists but is not a directory.
pl: Wybrana nazwa wystêpuje ale nie jest katalogiem.

source: No permissions to create directory.
pl: Nie mam prawa utworzyæ katalogu.

source: Name is too long.
pl: Nazwa jest za d³uga

source: Not specified.
pl: Nie okre¶lono

source: Inbox
pl: Przychodz±ca

source: Sent
pl: Wys³ane

source: Queue
pl: Kolejka

source: Trash
pl: Wysypisko

source: Drafts
pl: Kopie robocze

source: Processing (%s)...
pl: Przetwarzanie (%s)...

source: Copying %s to %s...
pl: Kopiowanie %s do %s...

source: Moving %s to %s...
pl: Przenoszenie %s do %s...

source: Updating cache for %s...
pl: Aktualizacja pamiêci podrêcznej dla %s ...

source: Processing messages...
pl: Przetwarzanie wiadomo¶ci...

source: Synchronising %s for offline use...
pl: Synchronizowanie %s do u¿ytku w trybie offline...

source: Select folder
pl: Wybierz katalog

source: NewFolder
pl: Nowy katalog

source: '%c' can't be included in folder name.
pl: '%c' nie mo¿e wystêpowaæ w nazwie katalogu.

source: The folder '%s' already exists.
pl: Katalog '%s' ju¿ istnieje.

source: Can't create the folder '%s'.
pl: Nie mo¿na utworzyæ katalogu '%s'.

source: Mark all re_ad
pl: _Zaznacz wszystkie jako przeczytane

source: R_un processing rules
pl: Uruchom regu³y przetwarzania

source: _Search folder...
pl: _Przeszukaj katalog...

source: Process_ing...
pl: _Przetwarzanie...

source: Empty _trash...
pl: Opró¿nij kosz...

source: Send _queue...
pl: Wy¶lij _oczekuj±ce wiadomo¶ci...

source: New
pl: Nowe

source: Unread
pl: Nieprzeczytane

source: Total
pl: Wszystkie

source: Setting folder info...
pl: Ustawianie informacji o katalogu...

source: Mark all as read
pl: Zaznacz wszystkie jako przeczytane

source: Do you really want to mark all mails in this folder as read ?
pl: Czy naprawdê chcesz zaznaczyæ wszystkie wiadomo¶ci w tym folderze jako przeczytane?

source: Scanning folder %s%c%s ...
pl: Przeszukiwanie katalogu %s%c%s ...

source: Scanning folder %s ...
pl: Przeszukiwanie katalogu %s ...

source: Rebuild folder tree
pl: Przebuduj drzewo katalogów

source: Rebuilding the folder tree will remove local caches. Do you want to continue?
pl: Przebudowanie drzewa katalogów usunie lokalne pliki podrêczne (cache). Czy chcesz kontynuowaæ?

source: Rebuilding folder tree...
pl: Przebudowywanie drzewa katalogu...

source: Scanning folder tree...
pl: Przeszukiwanie drzewa katalogu ...

source: Couldn't scan folder %s
pl: Nie mo¿na otworzyæ katalogu %s

source: Checking for new messages in all folders...
pl: Sprawdzanie za nowymi wiadomo¶ciami we wszystkich folderach...

source: Folder could not be opened.
pl: Katalog nie móg³ zostaæ otworzony

source: Empty trash
pl: Opró¿nij wysypisko

source: Delete all messages in trash?
pl: Usun±æ wszystkie wiadomo¶ci z kosza?

source: +_Empty trash
pl: +Opró¿nij _kosz

source: Offline warning
pl: Ostrze¿enie o trybie offline

source: You're working offline. Override?
pl: Pracujesz w trybie offline. Czy chcesz przej¶æ do trybu online?

source: Send queued messages
pl: Wy¶lij zakolejkowane wiadomo¶ci

source: Send all queued messages?
pl: Wys³aæ wszystkie oczekuj±ce wiadomo¶ci?

source: _Send
pl: _Wy¶lij

source: Some errors occurred while sending queued messages.
pl: B³êdy podczas wysy³ania zakolejkowanych wiadomo¶ci.

source: Some errors occurred while sending queued messages: %s
pl: Pojawi³y siê b³êdy podczas wysy³ania zakolejkowanych wiadomo¶ci: %s

source: Do you really want to copy folder '%s' in '%s' ?
pl: Czy naprawdê chcesz utworzyæ katalog '%s' jako podkatalog '%s' ?

source: Do you really want to make folder '%s' a subfolder of '%s' ?
pl: Czy naprawdê chcesz utworzyæ katalog '%s' jako podkatalog '%s' ?

source: Copy folder
pl: Kopiuj katalog

source: Move folder
pl: Przenie¶ katalog

source: Copying %s to %s...
pl: Kopiowanie %s do %s...

source: Moving %s to %s...
pl: Przenoszenie %s do %s...

source: Source and destination are the same.
pl: ¬ród³o i przeznaczenie s± takie same.

source: Can't copy a folder to one of its children.
pl: Nie mo¿na skopiowaæ folderu do jego w³asnego podkatalogu.

source: Can't move a folder to one of its children.
pl: Nie mo¿na przenie¶æ folderu do jego w³asnego podkatalogu.

source: A folder cannot be moved between different mailboxes.
pl: Nie mo¿na przenie¶æ folderu miêdzy ró¿nymi skrzynkami.

source: Copy failed!
pl: Skopiowanie nie powiod³o siê!

source: Move failed!
pl: Przeniesienie nie powiod³o siê

source: Processing configuration for folder %s
pl: Przetwarzanie konfiguracji dla katalogu %s

source: The destination folder can only be used to store subfolders.
pl: Katalog docelowy mo¿e przechowywaæ tylko podkatalogi.

source: Newsgroup subscription
pl: Subskrypcja grup dyskusyjnych

source: Select newsgroups for subscription:
pl: Wybierz grupy news do które chcesz subskrybowaæ:

source: Find groups:
pl: Znajd¼ grupê:

source: Search
pl: Szukaj

source: Newsgroup name
pl: Nazwa grupy news:

source: Messages
pl: Wiadomo¶ci

source: Type
pl: Typ

source: moderated
pl: moderowana

source: readonly
pl: tylko-do-odczytu

source: unknown
pl: nieznana

source: Can't retrieve newsgroup list.
pl: Nie uda³o siê pobraæ listy grup news.

source: Done.
pl: Zrobiono.

source: %d newsgroups received (%s read)
pl: %d pobranych nazw grup (%s przeczytano)

source: Claws Mail is a lightweight, fast and highly-configurable email client. For further information visit the Claws Mail website:
pl: Claws Mail jest lekkim, szybkim klientem e-mail z du¿± ilo¶ci± opcji konfiguracyjnych Aby uzyskaæ wiêcej informacji dotycz±cych programu odwied¼ stronê Claws Mail:

source: System Information
pl: Informacje o systemie

source: GTK+ %d.%d.%d / GLib %d.%d.%d Locale: %s (charset: %s) Operating System: %s %s (%s)
pl: Wersja GTK+: %d.%d.%d / Glib %d.%d.%d Ustawienia lokalne: %s (kodowanie znaków: %s) Wersja Systemu Operacyjnego: %s %s (%s)

source: GTK+ %d.%d.%d / GLib %d.%d.%d Locale: %s (charset: %s) Operating System: %s
pl: Wersja GTK+: %d.%d.%d / GLib %d.%d.%d Ustawienia lokalne: %s (kodowanie znaków: %s) Wersja Systemu Operacyjnego: %s

source: GTK+ %d.%d.%d / GLib %d.%d.%d Locale: %s (charset: %s) Operating System: unknown
pl: Wersja GTK+: %d.%d.%d / GLib %d.%d.%d Ustawienia lokalne: %s (kodowanie znaków: %s) Wersja Systemu Operacyjnego: nieznana

source: The Claws Mail Team
pl: Zespó³ Claws Mail

source: Previous team members
pl: Poprzedni cz³onkowie zespo³u

source: The translation team
pl: Zespó³ t³umaczy

source: Documentation team
pl: Zespó³ zajmuj±cy siê dokumentacj±

source: Icons
pl: Ikony

source: Contributors
pl: Osoby które pomog³y przy tworzeniu programu:

source: Compiled-in Features
pl: Funkcje programu w³±czone podczas kompilacji

source: compface|adds support for the X-Face header
pl: dodaje obs³ugê nag³ówka X-Face

source: Enchant|adds support for spell checking
pl: dodaje obs³ugê sprawdzania pisowni

source: GnuTLS|adds support for encrypted connections to servers
pl: dodaje obs³ugê szyfrowanych po³±czeñ z serwerami

source: IPv6|adds support for IPv6 addresses, the new Internet addressing protocol
pl: dodaje obs³ugê adresów IPv6, nowego internetowego protoko³u adresowania

source: iconv|allows converting to and from different character sets
pl: pozwala na konwersjê do lub z ró¿nych kodowañ znaków

source: JPilot|adds support for PalmOS addressbooks
pl: dodaje obs³ugê ksi±¿ek adresowych PalmOs

source: LDAP|adds support for LDAP shared addressbooks
pl: dodaje obs³ugê wspó³dzielonych ksi±¿ek adresowych LDAP

source: libetpan|adds support for IMAP and NNTP servers
pl: dodaje obs³ugê serwerów IMAP i NNTP

source: libSM|adds support for session handling
pl: dodaje obs³ugê sesji

source: NetworkManager|adds support for detection of network connection changes
pl: dodaje obs³ugê wykrywania zmian w konfiguracji sieci

source: This program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3, or (at your option) any later version.
pl: Niniejszy program jest wolnym oprogramowaniem; mo¿esz go rozprowadzaæ dalej i/lub modyfikowaæ na warunkach Powszechnej Licencji Publicznej GNU, wydanej przez Fundacjê Wolnego Oprogramowania - w wersji 2, 3 lub ka¿dej pó¼niejszej.

source: This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
pl: Niniejszy program rozpowszechniany jest z nadziej±, i¿ bêdzie on u¿yteczny - jednak BEZ JAKIEJKOLWIEK GWARANCJI, nawet domy¶lnej gwarancji PRZYDATNO¦CI HANDLOWEJ albo PRZYDATNO¦CI DO OKRE¦LONYCH ZASTOSOWAÑ. W celu uzyskania bli¿szych informacji - Powszechna Licencja Publiczna GNU.

source: You should have received a copy of the GNU General Public License along with this program. If not, see <
pl: Z pewno¶ci± wraz z niniejszym programem otrzyma³e¶ te¿ egzemplarz Powszechnej Licencji Publicznej GNU (GNU General Public License);je¶li nie, odwied¼ <

source: About Claws Mail
pl: O Claws Mail

source: _Info
pl: _Informacja

source: _Authors
pl: _Autorzy

source: _Features
pl: _Funkcje

source: _License
pl: _Licencja

source: _Release Notes
pl: _Adnotacje wydania

source: Orange
pl: Pomarañczowy

source: Red
pl: Czerwony

source: Pink
pl: Ró¿owy

source: Sky blue
pl: B³êkitny

source: Blue
pl: Niebieski

source: Green
pl: Zielony

source: Brown
pl: Br±zowy

source: Grey
pl: Szary

source: Light brown
pl: Jasnobr±zowy

source: Dark red
pl: Ciemnoczerwony

source: Dark pink
pl: Ciemnoró¿owy

source: Steel blue
pl: Stalowoniebieski

source: Gold
pl: Z³oty

source: Bright green
pl: Jasnozielony

source: No dictionary selected.
pl: Nie wybrano ¿adnego s³ownika

source: Couldn't initialize %s speller.
pl: Nie mo¿na zainicjowaæ sprawdzania pisowni %s

source: Couldn't initialize Enchant broker.
pl: Nie mo¿na zainicjowaæ Enchant broker

source: Couldn't initialize %s dictionary:
pl: Nie mo¿na zainicjowaæ %s s³ownika:

source: No misspelled word found.
pl: Nie znaleziono b³êdnych s³ów

source: Replace unknown word
pl: Zmieñ nieznane s³owo

source: <span weight="bold" size="larger">Replace "%s" with: </span>
pl: <span weight="bold" size="larger">Zamieñ "%s" na: </span>

source: Holding down Control key while pressing Enter will learn from mistake.
pl: Trzymanie wci¶niêtego klawisza Control oraz wci¶niêcie ENTER spowoduje nauczenie siê z b³êdu.

source: More...
pl: Wiêcej...

source: Accept in this session
pl: Akceptuj w tej sesji

source: Add to personal dictionary
pl: Dodaj do s³ownika osobistego

source: Replace with...
pl: Zamieñ u¿ywaj±c...

source: Check with %s
pl: Sprawd¼ u¿ywaj±c %s

source: (no suggestions)
pl: (brak sugestii)

source: Dictionary: %s
pl: S³ownik: %s

source: Use alternate (%s)
pl: U¿yj alternatywnego (%s)

source: Use both dictionaries
pl: U¿yj obu s³owników

source: Check while typing
pl: Sprawdzanie podczas pisania

source: The spell checker could not change dictionary. %s
pl: Operacja zmiany s³ownika nie powiod³a siê. %s

source: The spell checker could not change the alternate dictionary. %s
pl: Operacja zmiany s³ownika nie powiod³a siê. %s

source: Date
pl: Data

source: Date:
pl: Data:

source: From
pl: Od

source: From:
pl: Od:

source: Sender
pl: Nadawca

source: Sender:
pl: Nadawca:

source: Reply-To
pl: Adres zwrotny

source: To
pl: Do

source: Cc
pl: Kopia

source: Bcc
pl: Ukryta kopia

source: In-Reply-To
pl: W odpowiedzi na

source: References
pl: Odniesienia

source: References:
pl: Odniesienia:

source: Subject
pl: Temat

source: Comments
pl: Komentarze

source: Comments:
pl: Komentarze:

source: Keywords
pl: S³owa kluczowe

source: Keywords:
pl: S³owa kluczowe

source: Resent-Date
pl: Data ponownego wys³ania

source: Resent-Date:
pl: Data ponownego wys³ania:

source: Return-Path
pl: ¦cie¿ka zwrotna

source: Return-Path:
pl: ¦cie¿ka zwrotna:

source: Received
pl: Odebrano

source: Received:
pl: Odebrano:

source: Newsgroups
pl: Grupy news

source: Followup-To
pl: Odpowiedzi-Do

source: Delivered-To
pl: Dostarczone do

source: Delivered-To:
pl: Dostarczone do:

source: Seen
pl: Widziane

source: Seen:
pl: Widziane:

source: Status
pl: Stan

source: Status:
pl: Stan:

source: Face
pl: Twarz

source: Face:
pl: Twarz:

source: Disposition-Notification-To
pl: Potwierdzenie przeczytania na adres

source: Disposition-Notification-To:
pl: Potwierdzenie przeczytania na adres:

source: Content-Transfer-Encoding
pl: Kodowanie transferu

source: Content-Transfer-Encoding:
pl: Kodowanie transferu:

source: MIME-Version
pl: Wersja MIME

source: MIME-Version:
pl: Wersja MIME:

source: Precedence
pl: Pierwszeñstwo

source: Precedence:
pl: Pierwszeñstwo:

source: Organization
pl: Organizacja

source: Organization:
pl: Organizacja:

source: Mailing-List
pl: Lista dyskusyjna

source: Mailing-List:
pl: Lista dyskusyjna:

source: List-Post
pl: Wy¶lij posta

source: List-Post:
pl: Wy¶lij posta:

source: List-Subscribe
pl: Subskrybuj listê

source: List-Subscribe:
pl: Subskrybuj listê:

source: List-Unsubscribe
pl: Wypisanie z listy

source: List-Unsubscribe:
pl: Wypisanie z listy:

source: List-Help
pl: Pomoc Listy

source: List-Help:
pl: Pomoc Listy:

source: List-Archive
pl: Archiwum Listy

source: List-Archive:
pl: Archiwum Listy:

source: List-Owner
pl: W³a¶ciciel Listy

source: List-Owner:
pl: W³a¶ciciel Listy:

source: X-Label
pl: X-Etykieta

source: X-Label:
pl: X-Etykieta:

source: X-Face
pl: X-Twarz

source: X-Face:
pl: X-Twarz:

source: In reply to
pl: W odpowiedzi na

source: In reply to:
pl: W odpowiedzi na:

source: To or Cc
pl: Do lub Kopia

source: To or Cc:
pl: Do lub Kopia:

source: From, To or Subject
pl: Nadawca, Adresat lub Temat

source: From, To or Subject:
pl: Nadawca, Adresat lub Temat:

source: New message
pl: Nowa wiadomo¶æ

source: Unread message
pl: Nieprzeczytana wiadomo¶æ

source: Message has been replied to
pl: Na wiadomo¶æ odpowiedziano do

source: Message has been forwarded
pl: Wiadomo¶æ zosta³a przekazana dalej

source: Message is in an ignored thread
pl: Wiadomo¶æ znajduje siê w ignorowanym w±tku

source: Message is in a watched thread
pl: Wiadomo¶æ znajduje siê w ¶ledzonym w±tku

source: Message is spam
pl: Wiadomo¶æ to spam

source: Message has attachment(s)
pl: Wiadomo¶æ posiada za³±cznik(i)

source: Digitally signed message
pl: Wiadomo¶æ podpisana elektronicznie

source: Encrypted message
pl: Zaszyfrowana wiadomo¶æ

source: Message is signed and has attachment(s)
pl: Wiadomo¶æ jest podpisana i posiada za³±cznik(i)

source: Message is encrypted and has attachment(s)
pl: Wiadomo¶æ jest zaszyfrowana i posiada za³±cznik(i)

source: Marked message
pl: Zaznaczona wiadomo¶æ

source: Message is marked for deletion
pl: Wiadomo¶æ wyznaczona do usuniêcia

source: Message is marked for moving
pl: Wiadomo¶æ wyznaczona do przeniesienia

source: Message is marked for copying
pl: Wiadomo¶æ wyznaczona do kopiowania

source: Locked message
pl: Zablokowana wiadomo¶æ

source: Folder (normal, opened)
pl: Katalog (normalny, otwarty)

source: Folder with read messages hidden
pl: Katalog z przeczytanymi ukrytymi wiadomo¶ciami

source: Folder contains marked messages
pl: Katalog zawiera zaznaczone wiadomo¶ci

source: Icon Legend
pl: Opis ikon

source: <span weight="bold">The following icons are used to show the status of messages and folders:</span>
pl: <span weight="bold">Nastêpuj±ce ikony s³u¿± do przedstawiania statusu wiadomo¶ci i katalogów:</span>

source: Input password for %s on %s:
pl: Wprowad¼ has³o dla %s na %s:

source: Input password for %s:
pl: Wprowad¼ has³o dla %s:

source: Input password:
pl: Wprowad¼ has³o:

source: Input password
pl: Wprowad¼ has³o

source: Remember password for this session
pl: Zapamiêtanie has³a w tej sesji

source: Remember this
pl: Zapamiêtaj

source: Clear _Log
pl: Wyczy¶æ _Dziennik

source: Version:
pl: Wersja:

source: Error:
pl: B³±d:

source: Plugin is not functional.
pl: Wtyczka nie funkcjonuje.

source: Select the Plugins to load
pl: Wybierz wtyczkê do za³adowania

source: The following error occurred while loading %s : %s
pl: Nastêpuj±cy b³±d wyst±pi³ podczas ³adowania %s : %s

source: Plugins
pl: Wtyczki

source: Load...
pl: £aduj Wtyczkê...

source: Unload
pl: Wy³±cz wtyczkê

source: Description
pl: Opis

source: More plugins are available from the Claws Mail website.
pl: Wiêcej wtyczek jest dostêpnych na stronie Claws Mail.

source: Get more...
pl: Pobierz wiêcej...

source: Click here to load one or more plugins
pl: Kliknij tutaj aby za³adowaæ jedn± lub wiêcej wtyczek

source: Unload the selected plugin
pl: Wy³aduj Wtyczkê

source: Loaded plugins
pl: Aktywne wtyczki

source: Page Index
pl: Spis Stron

source: _Hide
pl: Ukryj

source: Account
pl: Konto

source: all messages
pl: wszystkie wiadomo¶ci

source: messages which contain S in the message body
pl: wiadomo¶ci które zawieraj± S w tre¶ci wiadomo¶ci

source: messages which contain S in the whole message
pl: wiadomo¶ci które zawieraj± S w ca³ej wiadomo¶ci

source: messages carbon-copied to S
pl: wiadomo¶ci skopiowane do S

source: message is either to: or cc: to S
pl: wiadomo¶æ jest albo do: albo kopia: do S

source: deleted messages
pl: usuniête wiadomo¶ci

source: messages which contain S in the Sender field
pl: wiadomo¶ci które zawieraj± S w polu nadawcy

source: true if execute "S" succeeds
pl: prawdziwe je¶li "S" powiedzie siê

source: messages originating from user S
pl: wiadomo¶ci od u¿ytkownika S

source: forwarded messages
pl: przekazane wiadomo¶ci

source: messages which contain header S
pl: wiadomo¶ci które zawieraj± nag³ówek S

source: messages which contain S in Message-ID header
pl: wiadomo¶ci które zawieraj± S w polu Message-ID nag³ówka

source: messages which contain S in In-Reply-To header
pl: wiadomo¶ci które zawieraj± S w nag³ówku In-Reply-To

source: messages which are marked with color #
pl: wiadomo¶ci które s± oznaczone kolorem #

source: locked messages
pl: zablokowane wiadomo¶ci

source: messages which are in newsgroup S
pl: wiadomo¶ci które s± w grupie S

source: new messages
pl: nowe wiadomo¶ci

source: old messages
pl: stare wiadomo¶ci

source: incomplete messages (not entirely downloaded)
pl: niekompletne wiadomo¶ci (czê¶ciowo pobrane)

source: messages which have been replied to
pl: wiadomo¶ci na które odpowiedziano

source: read messages
pl: przeczytanych wiadomo¶ci

source: messages which contain S in subject
pl: wiadomo¶ci zawieraj±ce S w tytule

source: messages which have been sent to S
pl: wiadomo¶ci które zosta³y wys³ane do S

source: messages which tags contain S
pl: wiadomo¶ci których etykiety zawieraj± S

source: messages which have tag(s)
pl: wiadomo¶ci które zawieraj±ce etykietê/etykiety

source: marked messages
pl: zaznaczone wiadomo¶ci

source: unread messages
pl: nieprzeczytane wiadomo¶ci

source: messages which contain S in References header
pl: wiadomo¶ci zawieraj±ce S w nag³ówku Referencje

source: messages returning 0 when passed to command - %F is message file
pl: wiadomo¶ci które po przetworzeniu przez polecenie zwracaj± 0 - %F jest plikiem z wiadomo¶ci±

source: messages which contain S in X-Label header
pl: wiadomo¶ci zawieraj±ce S w nag³ówku X-Label

source: logical AND operator
pl: operator logiczny AND (I/Oraz)

source: logical OR operator
pl: operator logiczny LUB

source: logical NOT operator
pl: logiczny operator NIE

source: case sensitive search
pl: szukanie z rozró¿nieniem na wielko¶æ liter

source: all filtering expressions are allowed
pl: wszystkie wyra¿enia filtruj±ce s± dozwolone

source: Extended Search
pl: Rozszerzone wyszukiwanie

source: Extended Search allows the user to define criteria that messages must have in order to match and be displayed in the message list. The following symbols can be used:
pl: Wyszukiwanie w trybie rozszerzonym pozwala zdefiniowaæ kryteria, które musz± byæ spe³nione, aby wiadomo¶æ zosta³a wy¶wietlona. W tym trybie wyszukiwania mo¿na u¿ywaæ nastêpuj±cych symboli:

source: From/To/Subject/Tag
pl: Od/Do/Temat/Etykieta

source: Recursive
pl: Rekursywne

source: Sticky
pl: Przyklejony

source: Type-ahead
pl: Podpowied¼

source: Run on select
pl: Zastosuj tylko do zaznaczonych

source: Clear the current search
pl: Wyczy¶æ aktualne zapytanie

source: Edit search criteria
pl: Edytuj kryteria szukania

source: Information about extended symbols
pl: Informacja o rozszerzonych symbolach

source: Correct
pl: Prawid³owe

source: Owner
pl: W³a¶ciciel

source: Signer
pl: Podpisa³

source: Name:
pl: Nazwa:

source: Organization:
pl: Organizacja:

source: Location:
pl: Lokalizacja:

source: Fingerprint:
pl: Odcisk klucza:

source: Signature status:
pl: Stan podpisu:

source: Expires on:
pl: Wygasa:

source: SSL certificate for %s
pl: Certyfikat SSL dla %s

source: Signature status: %s
pl: Stan podpisu: %s

source: _View certificate
pl: _Podgl±d certyfikatu

source: _Cancel connection
pl: Anuluj po³±czenie

source: _Accept and save
pl: _Akceptuj i zapisz

source: _Accept
pl: _Akceptuj

source: New certificate:
pl: Nowy certyfikat:

source: Known certificate:
pl: Znany certyfikat:

source: _View certificates
pl: Po_ka¿ certyfikaty

source: Tags:
pl: Etykiety:

source: (No From)
pl: (Brak nadawcy)

source: (No Subject)
pl: (Bez tematu)

source: Error:
pl: B³±d:
