Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: Insert X-Bogosity header
pl: Wstawianie nag³ówka X-Bogosity

source: Only done for messages in MH folders
pl: Wykonywanw jedynie na wiadomo¶ciach w skrzynkach MH

source: Whitelist senders found in address book/folder
pl: Pomijanie wiadomo¶ci od osób z ksi±¿ki adresowej

source: Messages coming from your address book contacts will be received in the normal folder even if detected as spam
pl: Wiadomo¶ci od kontaktów z Twojej ksi±¿ki adresowej bêd± przechowywane w normalnych katalogach nawet je¶li zostan± rozpoznane jako spam

source: Select ...
pl: Wybierz ...

source: Click this button to select a book or folder in the address book
pl: Naci¶nij ten przycisk aby wybraæ ksi±¿kê lub katalog w ksi±¿ce adresowej

source: Learn whitelisted emails as ham
pl: Zapamiêtaj adresy e-mail z bia³ej listy jako po¿±dane

source: If Bogofilter thought an email was spam or unsure, but it was whitelisted, learn it as ham.
pl: Je¶li Bogofilter uzna³ wiadomo¶æ e-mail jako spam lub niepewn±, ale znajduje siê ona na bia³ej li¶cie, zapamiêtaj j± jako po¿±dan±.

source: Bogofilter call
pl: Wywo³anie Bogofilter

source: Path to bogofilter executable
pl: ¦cie¿ka do programu Bogofilter

source: Mark spam as read
pl: Zaznacz wiadomo¶ci ze spamem jako przeczytane

source: This Plugin is only a demo of how to write plugins for Claws Mail. It installs a hook for new log output and writes it to stdout. It is not really useful.
pl: Ta wtyczka jest tylko prezentacja jak pisaæ wtyczki dla Claws Mail. Instaluje mo¿liwo¶æ logowania informacji i wypisuje je do standardowego wyj¶cia. Nie jest do niczego przydatna

source: Dillo Browser
pl: Przegl±darka Dillo

source: Load remote links in mails
pl: Wczytywanie danych ze zdalnych ³±cz

source: Equivalent to Dillo's '--local' option
pl: Odpowiednik opcji '--local' z programu Dillo

source: You can still load remote links by reloading the page
pl: Nadal mo¿esz wczytywaæ odno¶niki prze³adowuj±c stronê

source: Only for senders found in address book/folder
pl: Tylko we wiadomo¶ciach od osób z ksi±¿ki adresowej

source: Full window mode (hide controls)
pl: Tryb pe³noekranowy (ukrywa kontrolki)

source: Equivalent to Dillo's '--fullwindow' option
pl: Odpowiednik opcji '--fullwindow' z programu Dillo

source: Dillo HTML Viewer
pl: Przegl±darka HTML Dillo

source: Can't find the dillo executable in PATH. Is it installed?
pl: Nie mo¿na odnale¼æ programu dillo w PATH. Sprawd¼ czy dillo jest zainstalowane.

source: This plugin renders HTML mail using the Dillo web browser. Options can be found in /Configuration/Preferences/Plugins/Dillo Browser
pl: Ta wtyczka wy¶wietla wiadomo¶ci HTML u¿ywaj±c przegl±darki Dillo. Opcje mo¿na znale¼æ w /Konfiguracja/Ustawienia... Wtyczki/Przegl±darka Dillo

source: Passphrase
pl: Has³o

source: [no user id]
pl: [brak identyfikatora]

source: <span weight="bold" size="larger">%sPlease enter the passphrase for the new key:</span> %.*s
pl: <span weight="bold" size="larger">%sProszê podaæ has³o dla nowego klucza:</span> %.*s

source: Passphrases did not match.
pl: Has³a nie s± identyczne.

source: <span weight="bold" size="larger">Please re-enter the passphrase for the new key:</span> %.*s
pl: <span weight="bold" size="larger">Proszê podaæ has³o dla nowego klucza:</span> %.*s

source: <span weight="bold" size="larger">%sPlease enter the passphrase for:</span> %.*s
pl: <span weight="bold" size="larger">%sProszê podaæ has³o dla:</span> %.*s

source: Bad passphrase.
pl: Niew³a¶ciwe has³o.

source: Key import
pl: Import klucza

source: This key is not in your keyring. Do you want Claws Mail to try and import it from a keyserver?
pl: Ten klucz jest nieznany. Czy chcesz aby Claws Mail spróbowa³ zaimportowaæ go z serwera kluczy?

source: Key ID
pl: ID klucza

source: This key is not in your keyring.
pl: Ten klucz jest nieznany.

source: It should be possible to import it
pl: Powinno byæ mo¿liwe jego zaimportowanie

source: when working online, or
pl: pracuj±c online, lub

source: with the following command:
pl: z u¿yciem nastêpuj±cej komendy:

source: Importing key ID
pl: Importowanie klucza o ID

source: This key has been imported to your keyring.
pl: Ten klucz zosta³ pomy¶lnie zaimportowany.

source: This key couldn't be imported to your keyring.
pl: Ten klucz nie zosta³ pomy¶lnie zaimportowany.

source: Key servers are sometimes slow.
pl: Serwery kluczy s± czasem powolne.

source: You can try to import it manually with the command:
pl: Mo¿esz spróbowaæ zaimportowaæ go rêcznie poleceniem:

source: Key import isn't implemented in Windows.
pl: Importowanie kluczy nie jest obs³ugiwane w ¶rodowisku Windows.

source: This key is in your keyring.
pl: Ten klucz jest ju¿ zaimportowany.

source: This plugin handles PGP core operations, it is used by other plugins, like PGP/Mime. Options can be found in /Configuration/Preferences/Plugins/GPG and /Configuration/[Account Preferences]/Plugins/GPG The plugin uses the GPGME library as a wrapper for GnuPG. GPGME is copyright 2001 by Werner Koch <dd9jn@gnu.org>
pl: Ta wtyczka zajmuje siê obs³ug± niskopoziomowych operacji PGP, jest u¿ywana przez inne wtyczki, jak np. PGP/Mime. Opcje znajduj± siê w /Konfiguracja/Ustawienia.. Wtyczki/GPG oraz /Konfiguracja/[Ustawienia konta]/Wtyczki/GPG Wtyczka u¿ywa biblioteki GPGME jako parsera dla GnuPG. Prawa autorskie dla GPGME posiada Werner Koch <dd9jn@gnu.org>

source: Core operations
pl: G³ówne operacje

source: Automatically check signatures
pl: Automatyczne sprawdzanie podpisów

source: Use gpg-agent to manage passwords
pl: U¿yj programu gpg-agent do zarz±dzania has³ami

source: Store passphrase in memory
pl: Tymczasowe przechowywanie has³a w pamiêci

source: Expire after
pl: Usuwanie po

source: Setting to '0' will store the passphrase for the whole session
pl: (Ustawienie '0' powoduje przechowywanie has³a przez ca³± sesjê

source: minute(s)
pl: min.

source: Grab input while entering a passphrase
pl: Przechwytywanie wej¶cia podczas wprowadzania has³a

source: Display warning on start-up if GnuPG doesn't work
pl: Wy¶wietlanie ostrze¿enia je¶li GnuPG nie dzia³a przy starcie

source: Sign key
pl: Podpisz klucz

source: Use default GnuPG key
pl: U¿yj domy¶lnego klucza GnuPG

source: Select key by your email address
pl: Wybierz klucz poprzez twój adres e-mail

source: Specify key manually
pl: Okre¶l klucz rêcznie

source: User or key ID:
pl: U¿ytkownik lub klucz ID:

source: No secret key found.
pl: Nie znaleziono klucza prywatnego

source: Generate a new key pair
pl: Generuj now± parê kluczy

source: No exact match for '%s'; please select the key.
pl: Nie znaleziono '%s', wybierz klucz.

source: Collecting info for '%s' ... %c
pl: Zbieranie informacji dla "%s" ... %c

source: Undefined
pl: Niezdefiniowane

source: Never
pl: Nigdy

source: Marginal
pl: Marginalne

source: Ultimate
pl: Nieograniczone

source: Select Keys
pl: Wybierz klucze

source: Key ID
pl: ID klucza

source: Trust
pl: Zaufany klucz

source: _Select
pl: _Wybierz

source: _Other
pl: _Inne

source: Do_n't encrypt
pl: B_rak szyfrowania

source: Add key
pl: Dodaj klucz

source: Enter another user or key ID:
pl: Wprowad¼ innego u¿ytkownika lub ID klucza:

source: No signature found
pl: Nie znaleziono podpisu

source: The signature can't be checked - %s
pl: Ten podpis nie mo¿e zostaæ sprawdzony - %s

source: The signature has not been checked.
pl: Ten podpis nie by³ sprawdzony.

source: PGP Core: Can't get key - no gpg-agent running.
pl: B³±d systemu PGP: Nie mo¿na pobraæ klucza - agent gpg nie jest uruchomiony.

source: Good signature from %s.
pl: Poprawny podpis od %s.

source: Good signature (untrusted) from %s.
pl: Poprawny podpis (niski stopieñ zaufania) od %s.

source: Expired signature from %s.
pl: Przedawniony podpis od %s.

source: Expired key from %s.
pl: Przedawniony klucz od %s.

source: Bad signature from %s.
pl: Niew³a¶ciwy podpis od %s.

source: Key 0x%s not available to verify this signature.
pl: Klucz 0x%s nie jest dostêpny i nie mo¿na zweryfikowaæ tego podpisu.

source: Error checking signature: no status
pl: B³±d podczas sprawdzania podpisu: brak statusu

source: Error checking signature: %s
pl: B³±d podczas sprawdzania podpisu: %s

source: Signature made using %s key ID %s
pl: Podpis wykonano za pomoc± %s, ID klucza %s

source: Good signature from uid "%s" (Validity: %s)
pl: Poprawny podpis od "%s" (Zaufanie: %s)

source: Expired signature from uid "%s" (Validity: %s)
pl: Przedawniony podpis od "%s" (Zaufanie: %s)

source: BAD signature from "%s"
pl: NIEW£A¦CIWY podpis od "%s"

source: uid "%s" (Validity: %s)
pl: uid "%s" (Zaufanie: %s)

source: WARNING: Signer's address "%s" does not match DNS entry
pl: UWAGA: Adres podpisuj±cego "%s" nie zgadza siê z wpisem w DNS

source: Verified signer's address is "%s"
pl: Potwierdzony adres podpisuj±cego, to "%s"

source: Couldn't get data from message, %s
pl: Nie mo¿na informacji z komunikatu, %s

source: Couldn't initialize data, %s
pl: Nie mo¿na zainicjowaæ danych, %s

source: Secret key not found (%s)
pl: Klucz prywatny nie zosta³ odnaleziony (%s)

source: Secret key specification is ambiguous
pl: Specyfikacja klucza prywatnego jest nieprawid³owa

source: Error setting secret key: %s
pl: B³±d podczas konfiguracji klucza prywatnego: %s

source: Gpgme protocol '%s' is unusable: Engine '%s' isn't installed properly.
pl: Protokó³ GPGme '%s' nie nadaje siê do u¿ytku: Silnik '%s' nie jest zainstalowany poprawnie.

source: Gpgme protocol '%s' is unusable: Engine '%s' version %s is installed, but version %s is required.
pl: Protokó³ GPGme '%s' nie nadaje siê do u¿ytku: Zainstalowany jest silnik '%s' w wersji %s ale do poprawnego dzia³ania wymagana jest wersja %s.

source: Gpgme protocol '%s' is unusable (unknown problem)
pl: Protokó³ Gpgme '%s' nie nadaje siê do u¿ytku (nieznany problem)

source: GnuPG is not installed properly, or needs to be upgraded. OpenPGP support disabled.
pl: GnuPG nie jest poprawnie zainstalowany, lub musi zostaæ uaktualniony Obs³uga OpenPGP zosta³a wy³±czona.

source: You have to save the account's information with "OK" before being able to generate a key pair.
pl: Musisz zapisaæ informacjê o koncie przy u¿yciu "OK" zanim bêdziesz móg³ wygenerowaæ parê kluczy.

source: No PGP key found
pl: Nie znaleziono klucza PGP

source: Claws Mail did not find a secret PGP key, which means that you won't be able to sign emails or receive encrypted emails. Do you want to create a new key pair now?
pl: Claws Mail nie odnalaz³ prywatnego klucza PGP co oznacza, ¿e nie bêdziesz móg³ podpisywaæ i otrzymywaæ zaszyfrowanych wiadomo¶ci. Chcesz stworzyæ teraz now± parê kluczy?

source: Couldn't generate a new key pair: %s
pl: Nie uda³o siê wygenerowaæ nowej pary kluczy: %s

source: Generating your new key pair... Please move the mouse around to help generate entropy...
pl: Generowanie nowej pary kluczy... Poruszaj myszk± aby pomóc w generacji entropii...

source: Couldn't generate a new key pair: unknown error
pl: Generowanie kluczy nie powiod³o siê: nieznany b³±d

source: Your new key pair has been generated. Its fingerprint is: %s Do you want to export it to a keyserver?
pl: Nowa para kluczy zosta³a wygenerowana. Ich odcisk to: %s Chcesz wyeksportowaæ j± na serwer kluczy?

source: Key generated
pl: Klucz wygenerowany

source: Key exported.
pl: Klucz wyeksportowany.

source: Couldn't export key.
pl: Eksport klucza nie powiód³ siê.

source: Key export isn't implemented in Windows.
pl: Eksport kluczy nie jest wspierany w Windows

source: Incorrect part
pl: niew³a¶ciwa czê¶æ

source: Not a text part
pl: To nie jest czê¶æ tekstu

source: Couldn't get text data.
pl: Nie mo¿na pobraæ tekstowej czê¶ci wiadomo¶ci.

source: Couldn't convert text data to any sane charset.
pl: Nie mo¿na przekonwertowaæ tekstowej czê¶ci wiadomo¶ci na ¿aden znany system kodowania znaków.

source: Couldn't initialize GPG context, %s
pl: Nie powiod³a siê inicjalizacja kontekstu GPG, %s

source: Couldn't parse mime part.
pl: Przetwarzanie czê¶ci MIME nie powiod³o.

source: Couldn't open decrypted file %s
pl: Nie mo¿na otworzyæ rozszyfrowanego pliku %s

source: Couldn't write to decrypted file %s
pl: Nie mo¿na zapisywaæ do rozszyfrowanego pliku %s

source: --- Start of PGP/Inline encrypted data ---
pl: --- Pocz±tek zaszyfrowanych danych PGP/Inline ---

source: --- End of PGP/Inline encrypted data ---
pl: --- Koniec zaszyfrowanych danych PGP/Inline ---

source: Couldn't close decrypted file %s
pl: Nie mo¿na zamkn±æ rozszyfrowanego pliku %s

source: Couldn't scan decrypted file.
pl: Nie powiod³o siê skanowanie odszyfrowanego pliku.

source: Couldn't scan decrypted file parts.
pl: Nie powiod³o siê skanowanie czê¶ci odszyfrowanego pliku.

source: Couldn't create temporary file.
pl: Nie mo¿na by³o stworzyæ pliku tymczasowego.

source: Data signing failed, %s
pl: Podpisywanie danych nie powiod³o siê, %s

source: Data signing failed due to invalid signer: %s
pl: Podpisywanie danych nie powiod³o siê z powodu niew³a¶ciwego autora podpisu, %s

source: Data signing failed, no results.
pl: Podpisywanie danych nie powiod³o siê, brak wyników.

source: Data signing failed, no contents.
pl: Podpisywanie danych nie powiod³o siê, brak danych.

source: Please note that attachments are not encrypted by the PGP/Inline system, nor are email headers, like Subject.
pl: Pamiêtaj, ¿e zarówno za³±czniki jak i nag³ówki wiadomo¶ci (np. Temat) nie s± szyfrowane w systemie PGP/Inline

source: Couldn't add GPG key %s, %s
pl: Nie uda³o siê dodaæ klucza GPG %s, %s

source: Couldn't create temporary file, %s
pl: Nie mo¿na utworzyæ pliku tymczasowego, %s

source: Encryption failed, %s
pl: B³±? przy szyfrowniu, %s

source: This plugin handles the deprecated Inline method of signing and/or encrypting mails. You can decrypt mails, verify signatures or sign and encrypt your own mails. It can be selected as the Default Privacy System in /Configuration/[Account Preferences]/Privacy and when composing a message from /Options/Privacy System The plugin uses the GPGME library as a wrapper for GnuPG. GPGME is copyright 2001 by Werner Koch <dd9jn@gnu.org>
pl: Ta wtyczka obs³uguje przestarza³± metodê "Inline" podpisywania i szyfrowania wiadomo¶ci. Dziêki niej mo¿na odszyfrowaæ wiadomo¶ci, zweryfikowaæ podpisy, podpisaæ i zaszyfrowaæ w³asne wiadomo¶ci. Mo¿na wybraæ tê wtyczkê jako domy¶lny system ochrony prywatno¶ci wybieraj±c /Konfiguracja/Edycja Konta/..., zak³adka Prywatno¶æ opcja "Domy¶lny System ochrony prywatno¶ci". Wtyczka wykorzystuje bibliotekê GPGME, do uzyskania dostêpu do GnuPG. Prawa autorskie dla GPGME - Werner Koch <dd9jn@gnu.org>

source: Signature boundary not found.
pl: Nie znaleziono koñca sygantury.

source: Couldn't parse decrypted file.
pl: Nie mo¿na przetworzyæ zdeszyfrowanego pliku.

source: Couldn't parse decrypted file parts.
pl: Nie mo¿na przetworzyæ czê¶ci zdeszyfrowanego pliku.

source: Couldn't create temporary file: %s
pl: Nie mo¿na utworzyæ pliku tymczasowego: %s

source: Please note that email headers, like Subject, are not encrypted by the PGP/Mime system.
pl: Pamiêtaj, ¿e nag³ówki wiadomo¶ci (np. Temat) nie s± szyfrowane w systemie PGP/Mime

source: This plugin handles PGP/MIME signed and/or encrypted mails. You can decrypt mails, verify signatures or sign and encrypt your own mails. It can be selected as the Default Privacy System in /Configuration/[Account Preferences]/Privacy and when composing a message from /Options/Privacy System The plugin uses the GPGME library as a wrapper for GnuPG. GPGME is copyright 2001 by Werner Koch <dd9jn@gnu.org>
pl: Ta wtyczka s³u¿y do obs³ugi wiadomo¶ci podpisanych lub zaszyfrowanych przy pomocy PGP/MIME. Dziêki niej mo¿na odszyfrowaæ wiadomo¶ci, zweryfikowaæ podpisy, podpisaæ i zaszyfrowaæ w³asne wiadomo¶ci. Mo¿na wybraæ tê wtyczkê jako domy¶lny system ochrony prywatno¶ci wybieraj±c /Konfiguracja/Edycja Konta/..., zak³adka Prywatno¶æ opcja "Domy¶lny System ochrony prywatno¶ci". Wtyczka wykorzystuje bibliotekê GPGME, do uzyskania dostêpu do GnuPG. Prawa autorskie dla GPGME posiada Werner Koch <dd9jn@gnu.org>

source: This plugin handles S/MIME signed and/or encrypted mails. You can decrypt mails, verify signatures or sign and encrypt your own mails. It can be selected as the Default Privacy System in /Configuration/[Account Preferences]/Privacy and when composing a message from /Options/Privacy System This plugin uses the GPGME library as a wrapper for GnuPG. This plugin also needs gpgsm, gnupg-agent and dirmngr installed and configured. Information about how to get S/MIME certificates working with GPGSM can be found at: http://www.claws-mail.org/faq/index.php/S/MIME_howto GPGME is copyright 2001 by Werner Koch <dd9jn@gnu.org>
pl: Ta wtyczka s³u¿y do obs³ugi wiadomo¶ci podpisanych lub zaszyfrowanych przy pomocy S/MIME. Dziêki niej mo¿na odszyfrowaæ wiadomo¶ci, zweryfikowaæ podpisy, podpisaæ i zaszyfrowaæ w³asne wiadomo¶ci. Mo¿na wybraæ tê wtyczkê jako domy¶lny system ochrony prywatno¶ci wybieraj±c /Konfiguracja/Edycja Konta/..., zak³adka Prywatno¶æ opcja "Domy¶lny System ochrony prywatno¶ci". Wtyczka wykorzystuje bibliotekê GPGME, do uzyskania dostêpu do GnuPG. Do poprawnego dzia³ania tej wtyczki konieczne jest posiadanie zainstalowanego i skonfigurowanego gpgsm, gnupg-agent i dirmngr Prawa autorskie dla GPGME posiada Werner Koch <dd9jn@gnu.org>

source: Couldn't set GPG protocol, %s
pl: Nie powiod³o siê ustawianie protoko³u GPG, %s

source: Couldn't open temporary file
pl: Nie mo¿na by³o stworzyæ pliku tymczasowego

source: Couldn't write to temporary file
pl: Nie mo¿na zapisywaæ do pliku tymczasowego

source: Couldn't close temporary file
pl: Nie mo¿na zamkn±æ pliku tymczasowego

source: Please note that email headers, like Subject, are not encrypted by the S/MIME system.
pl: Pamiêtaj, ¿e nag³ówki wiadomo¶ci (np. Temat) nie s± szyfrowane w systemie S/Mime

source: SpamAssassin plugin couldn't connect to spamd.
pl: Wtyczka SpamAssasin nie mo¿e po³±czyæ siê ze spamd.

source: SpamAssassin plugin filtering failed.
pl: Filtrowanie wiadomo¶ci przez wtyczkê SpamAssassin nie powiod³o siê.

source: SpamAssassin plugin is disabled by its preferences.
pl: SpamAssassin jest wy³±czony w preferencjach.

source: SpamAssassin: filtering message...
pl: filtrowanie wiadomo¶ci SpamAssassin...

source: The SpamAssassin plugin couldn't filter a message. The probable cause of the error is an unreachable spamd daemon. Please make sure spamd is running and accessible.
pl: Wtyczka SpamAssassin nie by³a w stanie filtrowaæ tej wiadomo¶ci. Prawdopodobn± tego przyczyn± jest niedostêpno¶æ demona spamd. Upewnij siê, ¿e spamd jest uruchomiony i dostêpny.

source: Claws Mail needs network access in order to feed this mail(s) to the remote learner.
pl: Claws Mail potrzebuje dostêpu do sieci aby przekazaæ wiadomo¶ci to zdalnego odbiorcy.

source: Failed to get username
pl: Nie powiod³o siê pobranie nazwy u¿ytkownika

source: SpamAssassin plugin is loaded but disabled by its preferences.
pl: Wtyczka SpamAssassin jest za³adowana lecz zdezaktywowana w preferencjach.

source: This plugin can check all messages that are received from an IMAP, LOCAL or POP account for spam using a SpamAssassin server. You will need a SpamAssassin Server (spamd) running somewhere. It can also be used for marking messages as Ham or Spam. When a message is identified as spam it can be deleted or saved in a specially designated folder. Options can be found in /Configuration/Preferences/Plugins/SpamAssassin
pl: Ta wtyczka sprawdza wszystkie wiadomo¶ci, otrzymywane z kont IMAP, LOCAL lub POP w poszukiwaniu spamu. Wykorzystuje do tego celu serwer SpamAssassin. Do poprawnego funkcjonowania tej wtyczki niezbêdny jest wiêc dostêp do jakiego¶ serwera SpamAssassin (spamd). Kiedy wiadomo¶æ zostanie zidentyfikowana jako spam mo¿e zostaæ skasowana, albo zapisana w specjalnym katalogu. Opcje konfiguracyjne wtyczki znajduj± siê w /Konfiguracja/Ustawienia/Wtyczki/SpamAssasin

source: Unix Socket
pl: Gniazdo Uniksa

source: Enable SpamAssassin plugin
pl: W³±cz wtyczkê SpamAssassin

source: Type of transport
pl: Rodzaj transportu

source: User
pl: U¿ytkownik

source: User to use with spamd server
pl: U¿ytkownik którego u¿yæ z serwerem spamd

source: Hostname or IP address of spamd server
pl: Nazwa lub adres IP komputera z uruchomionym serwerem spamd

source: Port of spamd server
pl: Port na którym jest uruchomiony serwer spamd

source: Path of Unix socket
pl: ¦cie¿ka gniazda Uniksa

source: Maximum time allowed for checking. If the check takes longer it will be aborted.
pl: Maksymalny czas przeznaczony na sprawdzanie. Po jego up³ywie sprawdzanie zostanie przerwane.

source: seconds
pl: sekundy

source: Trayicon
pl: Ikonka

source: _Get Mail
pl: _Pobierz pocztê

source: E_mail from account
pl: _Napisz email z konta

source: Open A_ddressbook
pl: Otwórz ksi±¿kê a_dresow±

source: E_xit Claws Mail
pl: W_yj¶cie z Claws Mail

source: _Work Offline
pl: _Pracuj w trybie offline

source: New %d, Unread: %d, Total: %d
pl: %d nowych, %d nieprzeczytanych, razem %d

source: This plugin places a mailbox icon in the system tray that indicates if you have new or unread mail. The mailbox is empty if you have no unread mail, otherwise it contains a letter. A tooltip shows new, unread and total number of messages.
pl: Ta wtyczka umieszcza ikonê skrzynki pocztowej w systemowym trayu (zwanym te¿ obszarem powiadamiania), która informuje Ciê o nowej i nieprzeczytanej poczcie. Skrzynka jest pusta je¶li nie ma nieprzeczytanych wiadomo¶ci, w przeciwnym wypadku widoczny jest list. Opis ikony pokazuje ilo¶æ nowych, nieprzeczytanych i wszystkich wiadomo¶ci.

source: Hide at start-up
pl: Przetwarzanie przy uruchamianiu

source: Hide Claws Mail at start-up
pl: Ukryj Claws Mail podczas uruchomienia

source: Close to tray
pl: Zamkniêcie minimalizuje do ikonki

source: Hide Claws Mail using the tray icon instead of closing it when the window close button is clicked
pl: Ukrywa Claws Mail w trayu zamiast go zamkn±æ w momencie naci¶niêcia przycisku zamykaj±cego okno

source: Minimize to tray
pl: Minimalizacja okna minimalizuje do ikonki

source: Hide Claws Mail using the tray icon instead of minimizing it
pl: Ukrywa Claws Mail w trayu zamiast go zamkn±æ w momencie naci¶niêcia przycisku minimalizacji okna

source: Required APOP timestamp not found in greeting
pl: Przy powitaniu zabrak³o wymaganego znacznika czasowego APOP

source: Timestamp syntax error in greeting
pl: B³±d sk³adni przy znaczniku czasowym powitania

source: Timestamp syntax error in greeting (not ASCII)
pl: B³±d sk³adni przy znaczniku czasowym powitania (nie jest w ASCII)

source: POP3 protocol error
pl: B³±d protoko³u POP3

source: invalid UIDL response: %s
pl: niew³a¶ciwa odpowied¼ UIDL: %s

source: POP3: Deleting expired message %d [%s]
pl: POP3: Usuwanie przeterminowanych wiadomo¶ci %d [%s]

source: POP3: Skipping message %d [%s] (%d bytes)
pl: POP3: Pomijanie wiadomo¶ci %d [%s] (%d bajtów)

source: mailbox is locked
pl: skrzynka zablokowana

source: Session timeout
pl: up³yn±³ limit czasu sesji

source: command not supported
pl: komenda nie wspierana

source: error occurred on POP3 session
pl: wyst±pi³ b³±d podczas sesji POP3

source: TOP command unsupported
pl: komenda TOP nie jest obs³ugiwana

source: Local mbox file
pl: Lokalny plik mbox

source: None (SMTP only)
pl: ¯aden (tylko SMTP)

source: Name of account
pl: Nazwa konta

source: Set as default
pl: Ustaw jako domy¶lne konto

source: Personal information
pl: Informacje osobiste

source: Full name
pl: Pe³na nazwa

source: Mail address
pl: Adres e-mail

source: Server information
pl: Informacje o serwerze

source: <span weight="bold">Warning: this version of Claws Mail has been built without IMAP and News support.</span>
pl: <span weight="bold">Ostrze¿enie: ta wersja Claws Mail nie obs³uguje serwerów News i IMAP.</span>

source: This server requires authentication
pl: Ten serwer wymaga uwierzytelniania
