Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: - To open with an external program, select
pl: Aby otworzyæ w zewnêtrznym programie wybierz 'Otwórz'

source: 'Open'
pl: 'Otwórz'

source: (alternately double-click, or click the middle
pl: (mo¿na równie¿ podwójnie klikn±æ, lub klikn±æ ¶rodkowym

source: mouse button)
pl: przyciskiem myszy)

source: - Or use
pl: - Lub u¿yj

source: 'Open with...'
pl: 'Otwórz z...'

source: The command to view attachment as text failed: %s Exit code %d
pl: Nie uda³o siê uruchomiæ programu, który mia³ wy¶wietliæ za³±cznik jako tekst: %s Kod wyj¶cia %d

source: Tags:
pl: Etykiety:

source: The real URL is different from the displayed URL. <b>Displayed URL:</b> %s <b>Real URL:</b> %s Open it anyway?
pl: Prawdziwy adres URL jest inny ni¿ wy¶wietlany w wiadomo¶ci <b>Wy¶wietlany URL:</b> %s <b>Prawdziwy URL:</b> %s Czy nadal chcesz go otworzyæ?

source: Phishing attempt warning
pl: Ostrze¿enie przed prób± oszustwa.

source: _Open URL
pl: _Otwórz adres URL

source: Send Queued Messages
pl: Wysy³a skolejkowane wcze¶niej wiadomo¶ci

source: Compose Email
pl: Otwiera okno do pisania nowej wiadomo¶ci

source: Compose News
pl: Tworzy nowego posta

source: Reply to Message
pl: Odpowiada na wiadomo¶æ

source: Reply to Sender
pl: Odpowiada nadawcy

source: Reply to All
pl: Odpowiada wszystkim

source: Reply to Mailing-list
pl: Odpowiedz Grupie Dyskusyjnej

source: Open email
pl: Otwórz email

source: Forward Message
pl: Przekazuje wiadomo¶æ

source: Trash Message
pl: Wyrzuca wiadomo¶æ do kosza

source: Delete Message
pl: Usuñ wiadomo¶æ

source: Go to Previous Unread Message
pl: Przejd¼ do poprzedniej nieprzeczytanej wiadomo¶ci

source: Go to Next Unread Message
pl: Przechodzi do nastêpnej nieprzeczytanej wiadomo¶ci

source: Print
pl: Drukuj

source: Learn Spam or Ham
pl: Naucz siê rozpoznaæ spam

source: Open folder/Go to folder list
pl: Otwórz katalog/Przejd¼ do listy katalogów

source: Send Message
pl: Wysy³a wiadomo¶æ

source: Put into queue folder and send later
pl: Umieszcza wiadomo¶æ w katalogu z wiadomo¶ciami do pó¼niejszego wys³ania

source: Save to draft folder
pl: Zapisuje wiadomo¶æ w katalogu kopii roboczych

source: Insert file
pl: Wstaw plik

source: Attach file
pl: Do³±cz plik

source: Insert signature
pl: Wstaw podpis

source: Edit with external editor
pl: Edytuj w zewnêtrznym edytorze

source: Wrap long lines of current paragraph
pl: Zawija d³ugie linie w aktualnym akapicie

source: Wrap all long lines
pl: Zawijaj wszystkie d³ugie linie

source: Check spelling
pl: Sprawd¼ pisowniê

source: Claws Mail Actions Feature
pl: Funkcjonalno¶æ Akcji Claws Mails

source: Cancel receiving
pl: Zaniechaj pobieranie

source: Close window
pl: Zamknij Okno

source: Folders
pl: Katalogi

source: Get Mail
pl: Pobierz pocztê

source: Get
pl: Pobierz

source: Toolbar|Compose
pl: Nowa wiadomo¶æ

source: All
pl: Wszystkie

source: List
pl: Lista

source: Prev
pl: Poprzednie

source: Next
pl: Nastêpne

source: Draft
pl: Kopie robocze

source: Insert sig.
pl: Wstaw podpis

source: Edit
pl: Edycja

source: Wrap para.
pl: Zawijaj para.

source: Wrap all
pl: Zawijaj wszystko

source: Compose News message
pl: Tworzy nowego posta

source: Learn spam
pl: Oznacza wiadomo¶æ jako spam

source: Ham
pl: Dobra

source: Learn ham
pl: Oznacza wiadomo¶æ jak woln± od spamu

source: Go to folder list
pl: Przejd¼ do listy katalogów

source: Open preferences
pl: Otwórz Ustawienia

source: Compose with selected Account
pl: Tworzenie z wybranego konta

source: Learn as...
pl: Rozpoznaj jako...

source: Learn as _Spam
pl: Oznacz jako Spam

source: Learn as _Ham
pl: Oznacz jako woln± od spamu

source: Reply to Message options
pl: Wy¶wietla opcja odpowiadania

source: _Reply with quote
pl: Odpowiedz z _cytatem

source: Reply without _quote
pl: Odpowiedz bez _cytatu

source: Reply to Sender options
pl: Wy¶wietla opcje odpowiadania nadawcy

source: Reply to All options
pl: Wy¶wietla opcje odpowiadania wszystkim

source: Reply to Mailing-list options
pl: Wy¶wietla opcje odpowiadania grupie dyskusyjnej

source: Forward Message options
pl: Wy¶wietla opcje przekazywania wiadomo¶ci

source: There are no URLs in this email.
pl: W tej wiadomo¶ci nie ma ¿adnych adresów URL.

source: Available URLs:
pl: Dostêpne adresy:

source: Dialog title|Open URLs
pl: Otwórz adresy URL

source: Please select the URL to open.
pl: Proszê wybierz adres URL do otwarcia.

source: Select All
pl: W_ybierz wszystko

source: Welcome Mail Subject|Welcome to Claws Mail
pl: Witamy w Claws Mail

source: Welcome to Claws Mail --------------------- Now that you have set up your account you can fetch your mail by clicking the 'Get Mail' button at the left of the toolbar. Claws Mail has lots of extra features accessible via plugins, like anti-spam filtering and learning (via the Bogofilter or SpamAssassin plugins), privacy protection (via PGP/Mime), an RSS aggregator, a calendar, and much more. You can load them from the menu entry '/Configuration/Plugins'. You can change your Account Preferences by using the menu entry '/Configuration/Preferences for current account' and change the general Preferences by using '/Configuration/Preferences'. You can find further information in the Claws Mail manual, which can be accessed by using the menu entry '/Help/Manual' or online at the URL given below. Useful URLs ----------- Homepage: <%s> Manual: <%s> FAQ: <%s> Themes: <%s> Mailing Lists: <%s> LICENSE ------- Claws Mail is free software, released under the terms of the GNU General Public License, version 3 or later, as published by the Free Software Foundation, 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA. The license can be found at <%s>. DONATIONS --------- If you wish to donate to the Claws Mail project you can do so at <%s>.
pl: Witamy w Claws Mail ----------------------- Twoje konto pocztowe jest ju¿ skonfigurowane, wiêc mo¿esz odebraæ swoj± pocztê klikaj±c na przycisk "Pobierz Pocztê" z paska narzêdziowego. Funkcjonalno¶æ programu Claws Mail mo¿na rozszerzaæ za pomoc± dodatkowych wtyczek Dostêpne jest kilka rodzajów wtyczek do filtrowania niechcianych wiadomo¶ci (spamu) z mechanizmem uczenia siê (przy u¿yciu Bogofilter lub SpamAssasin). Istniej± wtyczki do ochrony prywatno¶ci (PGP/Mime), agregator RSS, kalendarz i wiele innych Wszystkie wtyczki mo¿na w³±czyæ i wy³±czyæ wybieraj±c z menu Konfiguracja/Wtyczki. Mo¿esz w ka¿dej chwili zmieniæ parametry swojego konta wybieraj±c z menu "/Konfiguracja/Ustawiania dla bie¿±cego konta" Parametry bardziej ogólne (dotycz±ce pracy ca³ego programu) dostêpne s± w /Konfiguracja/Ustawienia Wiêcej informacji odno¶nie pracy z programem znajduje siê w podrêczniku u¿ytkownika Claws Mail. Mo¿na go przeczytaæ wybieraj±c /Pomoc/Podrêcznik u¿ytkownika lub w internecie pod podanymi poni¿ej adresami. Przydatne adresy: ----------------- Strona domowa: <%s> Podrêcznik u¿ytkownika: <%s> FAQ: <%s> Zestawy ikon: <%s> Listy dyskusyjne: <%s> LICENCJA -------- Claws Mail jest Wolnym oprogramowaniem, rozpowszechnianym na warunkach Powszechnej Licencji Publicznej GNU w wersji 3 lub pó¼niejszej. Licencja ta zosta³a opublikowana przez Fundacjê Wolnego Oprogramowania (51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA) Tre¶æ licencji znajduje siê pod adresem <%s>. DOTACJE ------- Je¿eli chcesz przekazaæ jakikolwiek dar pieniê¿ny dla projektu Claws Mail, to mo¿esz to zrobiæ pod adresem <%s>.

source: Please enter the mailbox name.
pl: Proszê podaæ nazwê skrzynki (mailbox).

source: Please enter your name and email address.
pl: Proszê podaæ swoje imiê i nazwisko oraz adres email.

source: Please enter your receiving server and username.
pl: Proszê podaæ adres serwera do odbierania poczty i nazwê u¿ytkownika.

source: Please enter your username.
pl: Proszê podaæ swoj± nazwê u¿ytkownika (login).

source: Please enter your SMTP server.
pl: Proszê podaæ adres serwera SMTP.

source: Please enter your SMTP username.
pl: Proszê podaæ swoj± nazwê u¿ytkownika (login) SMTP.

source: <span weight="bold">Your name:</span>
pl: <span weight="bold">Twoje imiê i nazwisko:</span>

source: <span weight="bold">Your email address:</span>
pl: <span weight="bold">Twój adres email:</span>

source: Your organization:
pl: Organizacja:

source: <span weight="bold">Mailbox name:</span>
pl: <span weight="bold">Nazwa skrzynki pocztowej:</span>

source: You can also specify an absolute path, for example: "/home/john/Documents/Mail"
pl: Mo¿esz podaæ równie¿ pe³n± ¶cie¿kê, np "/home/janek/Dokumenty/Poczta/"

source: on internal memory
pl: na pamiêci wewnêtrznej

source: on external memory card
pl: na zewnêtrznej karcie pamiêci

source: on internal memory card
pl: na wewnêtrznej karcie pamiêci

source: <span weight="bold">Store data</span>
pl: <span weight="bold">Przechowywanie danych</span>

source: You can specify the port number by appending it at the end: "mail.example.com:25"
pl: Mo¿esz podaæ numer portu dopisuj±c go na koñcu: "mail.serwer.com:25"

source: <span weight="bold">SMTP server address:</span>
pl: <span weight="bold">Adres serwera SMTP:</span>

source: Use authentication
pl: U¿yj uwierzytelnienia

source: Use SSL to connect to SMTP server
pl: U¿ywanie SSL do wysy³ania poczty

source: Use SSL via STARTTLS
pl: U¿ywanie SSL via STARTTLS

source: Client SSL certificate (optional)
pl: Certyfikat SSL klienta (opcjonalny)

source: <span weight="bold">Server address:</span>
pl: <span weight="bold">Adres serwera:</span>

source: <span weight="bold">Local mailbox:</span>
pl: <span weight="bold">Lokalna skrzynka (mailbox):</span>

source: <span weight="bold">Server type:</span>
pl: <span weight="bold">Rodzaj serwera:</span>

source: You can specify the port number by appending it at the end: "mail.example.com:110"
pl: Mo¿esz podaæ numer portu dopisuj±c go na koñcu: "mail.serwer.com:110"

source: <span weight="bold">Username:</span>
pl: <span weight="bold">Nazwa u¿ytkownika:</span>

source: Password:
pl: Has³o:

source: Use SSL to connect to receiving server
pl: U¿ywanie SSL do odbierania poczty

source: IMAP server directory:
pl: Katalog serwera IMAP4:

source: Show only subscribed folders
pl: Poka¿ tylko zasubskrybowane katalogi

source: <span weight="bold">Warning: this version of Claws Mail has been built without IMAP support.</span>
pl: <span weight="bold">Ostrze¿enie: ta wersja Claws Mail nie obs³uguje IMAP.</span>

source: Claws Mail Setup Wizard
pl: Kreator konfiguracji Claws Mail

source: Welcome to Claws Mail
pl: Witaj w Claws Mail

source: Welcome to the Claws Mail setup wizard. We will begin by defining some basic information about you and your most common mail options so that you can start to use Claws Mail in less than five minutes.
pl: Witaj w kreatorze konfiguracji Claws Mail. Ten kreator pomo¿e zdefiniowaæ podstawowe informacje o u¿ytkowniku, oraz parametrach konta pocztowego. Dziêki czemu po mniej ni¿ piêciu minutach Claws Mail bêdzie gotowy do pracy.

source: About You
pl: Informacje o u¿ytkowniku

source: Bold fields must be completed
pl: Nale¿y wype³niæ wszystkie pogrubione pola

source: Receiving mail
pl: Odbieranie poczty

source: Sending mail
pl: Wysy³anie poczty

source: Saving mail on disk
pl: Zapisywanie poczty na dysku

source: Configuration finished
pl: Konfiguracja zakoñczona

source: Claws Mail is now ready. Click Save to start.
pl: Program Claws Mail jest gotowy do pracy. Kliknij przycisk Zapisz, aby zapisaæ konfiguracjê i rozpocz±æ pracê z programem.
