Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: Some composing windows are open. Please close all the composing windows before editing the accounts.
pl: Niektóre okna edycji s± otwarte. Zamknij wszystkie okna edycji przed zmianami ustawieñ konta.

source: Can't create folder.
pl: Nie mo¿na utworzyæ katalogu.

source: Edit accounts
pl: Edycja kont

source: Using 'Get Mail' will retrieve messages from your Accounts in the order given, the checkbox indicates which accounts will be included. Bold text indicates the default account.
pl: U¿ycie 'Pobierz pocztê' odbierze wiadomo¶ci z Twoich kont w podanej kolejno¶ci, pole wyboru w kolumnie 'P' decyduje, które konta zostan± uwzglêdnione.

source: _Set as default account
pl: Ustaw jako domy¶lne konto

source: Accounts with remote folders cannot be copied.
pl: Konta zawieraj±ce zdalne katalogi nie mog± byæ skopiowane

source: Copy of %s
pl: Kopia %s

source: Do you really want to delete the account '%s'?
pl: Czy naprawdê chcesz usun±æ konto '%s'?

source: (Untitled)
pl: (Bez tytu³u)

source: Delete account
pl: Usuñ konto

source: Accounts List Get Column Name|G
pl: P

source: 'Get Mail' retrieves mail from the checked accounts
pl: 'Pobierz z wszystkich kont' odbierze pocztê z zaznaczonych kont

source: Name
pl: Nazwa

source: Protocol
pl: Protokó³

source: Server
pl: Serwer

source: Could not get message file %d
pl: Nie mo¿na pobraæ pliku z komunikatami %d

source: Could not get message part.
pl: Nie mo¿na pobraæ czê¶ci wiadomo¶ci.

source: Can't get part of multipart message: %s
pl: Nie mo¿na pobraæ czê¶ci wiadomo¶ci wieloczê¶ciowej: %s

source: The selected action cannot be used in the compose window because it contains %%f, %%F, %%as or %%p.
pl: Wybrana akcja nie mo¿e byæ u¿yta w oknie kompozycji poniewa¿ zawiera %%f, %%F, %%as lub %%p.

source: There is no filtering action set
pl: Nie przypisano ¿adnych akcji do tego filtra

source: Invalid filtering action(s): %s
pl: Niepoprawne akcje filtrowania: %s

source: Command could not be started. Pipe creation failed. %s
pl: Polecenie nie mo¿e zostaæ wykonane. Utworzenie potoku nie powiod³o siê. %s

source: Could not fork to execute the following command: %s %s
pl: Nie mo¿na utworzyæ procesu potomnego dla nastêpuj±cego polecenia: %s %s

source: Completed
pl: Ukoñczono

source: --- Running: %s
pl: --- Uruchamianie: %s

source: --- Ended: %s
pl: --- Zakoñczono: %s

source: Action's input/output
pl: wej¶cie/wyj¶cie dla Akcji

source: Enter the argument for the following action: ('%%h' will be replaced with the argument) %s
pl: Podaj argument dla nastêpuj±cej akcji: ('%%h' zostanie zast±pione przez) %s

source: Action's hidden user argument
pl: Ukryty argument u¿ytkownika dla Akcji

source: Enter the argument for the following action: ('%%u' will be replaced with the argument) %s
pl: Podaj argument dla nastêpuj±cej akcji: ('%%u' zostanie zast±pione przez) %s

source: Action's user argument
pl: Argument u¿ytkownika Akcji

source: Group
pl: Grupa

source: date of birth
pl: data urodzenia

source: address
pl: adres

source: phone
pl: telefon

source: mobile phone
pl: telefon komórkowy

source: organization
pl: organizacja

source: office address
pl: adres biura

source: office phone
pl: telefon do biura

source: website
pl: strona internetowa

source: Attribute name
pl: Nazwa cechy

source: Delete all attribute names
pl: Usuñ wszystkie nazwy cech

source: Do you really want to delete all attribute names?
pl: Czy naprawdê chcesz usun±æ wszystkie nazwy cech?

source: Delete attribute name
pl: Usuñ nazwê cechy

source: Do you really want to delete this attribute name?
pl: Czy naprawdê usun±æ tê nazwê cechy?

source: Reset to default
pl: Domy¶lne

source: Do you really want to replace all attribute names with the default set?
pl: Czy naprawdê chcesz zast±piæ wszystkie nazwy cech warto¶ciami domy¶lnymi?

source: _Delete
pl: _Usuñ

source: Delete _all
pl: Kasuj _wszystko

source: _Reset to default
pl: _Domy¶lne

source: Attribute name is not set.
pl: Nie okre¶lono nazwy cechy.

source: Dialog title|Edit attribute names
pl: Edycja nazw cech

source: New attribute name:
pl: Nazwa cechy:

source: Adding or removing attribute names won't affect attributes already set for contacts.
pl: Dodawanie lub usuwanie cech nie wp³ynie na cechy ju¿ ustawione dla kontaktów.

source: Add to address book
pl: Dodaj do ksi±¿ki adresowej

source: Contact
pl: Kontakt

source: Address
pl: Adres

source: Remarks
pl: Uwagi

source: Select Address Book Folder
pl: Wybierz katalog z ksi±¿k± adresow±

source: Failed to save image: %s
pl: Nie uda³o siê zapisaæ obrazka: %s

source: Add address(es)
pl: Dodaj adres(y)

source: Can't add the specified address
pl: Wybrany adres nie mo¿e byæ dodany

source: Email Address
pl: Adres e-mail

source: _Book
pl: _Ksi±¿ka

source: _Edit
pl: _Edycja

source: _Tools
pl: _Narzêdzia

source: _Help
pl: Pomo_c

source: New _Book
pl: Nowa _ksi±¿ka

source: New _Folder
pl: Nowy _Folder

source: New _vCard
pl: Nowa _wizytówka

source: New _JPilot
pl: Nowy _JPilot

source: New LDAP _Server
pl: Nowy serwer LDAP

source: _Edit book
pl: _Edytuj ksi±¿kê

source: _Delete book
pl: _Usuñ ksi±¿kê

source: _Save
pl: Z_apisz...

source: _Close
pl: Zamknij

source: _Select all
pl: W_ybierz wszystko

source: C_ut
pl: Wy_tnij

source: _Copy
pl: _Kopiuj

source: _Paste
pl: _Wstaw

source: New _Address
pl: Nowy _adres

source: New _Group
pl: Nowa _grupa

source: _Mail To
pl: _Wy¶lij wiadomo¶æ do

source: Import _LDIF file...
pl: Importuj plik _LDIF...

source: Import M_utt file...
pl: Importuj plik _Mutta...

source: Import _Pine file...
pl: Importuj plik _Pine...

source: Export _HTML...
pl: Wyeksportuj do _HTML...

source: Export LDI_F...
pl: Wyeksportuj do LDI_F...

source: Find duplicates...
pl: Znajd¼ duplikaty...

source: Edit custom attributes...
pl: Edycja atrybutów u¿ytkownika...

source: _About
pl: Informacje o

source: _Browse Entry
pl: _Przegl±danie wpisu

source: Unknown
pl: Nieznany

source: Success
pl: Sukces

source: Bad arguments
pl: Z³e argumenty

source: File not specified
pl: Nie okre¶lono pliku

source: Error opening file
pl: B³±d podczas otwierania pliku

source: Error reading file
pl: B³±d podczas czytania pliku

source: End of file encountered
pl: Napotkano koniec pliku

source: Error allocating memory
pl: B³±d alokacji pamiêci

source: Bad file format
pl: Format pliku nieprawid³owy

source: Error writing to file
pl: B³±d zapisu pliku

source: Error opening directory
pl: B³±d podczas otwierania katalogu

source: No path specified
pl: Nie okre¶lono ¶cie¿ki

source: Error connecting to LDAP server
pl: B³±d przy próbie po³±czenia z serwerem LDAP

source: Error initializing LDAP
pl: B³±d podczas inicjalizacji LDAP

source: Error binding to LDAP server
pl: B³±d podczas pod³±czania adresu serwera LDAP

source: Error searching LDAP database
pl: B³±d podczas wyszukiwania w bazie LDAP

source: Timeout performing LDAP operation
pl: Przekroczono limit czasu podczas wykonywania operacji LDAP

source: Error in LDAP search criteria
pl: B³±d w kryteriach wyszukiwania LDAP

source: No LDAP entries found for search criteria
pl: Nie znaleziono wpisów LDAP powi±zanych z kryterium wyszukiwania

source: LDAP search terminated on request
pl: przeszukiwanie LDAP zosta³o przerwane na ¿±danie

source: Error starting TLS connection
pl: B³±d podczas nawi±zywania po³±czenia TLS

source: Distinguished Name (dn) is missing
pl: Brak unikatowej nazwy (dn)

source: Missing required information
pl: Brak wymaganych informacji

source: Another contact exists with that key
pl: Istnieje ju¿ kontakt o takim kluczu

source: Strong(er) authentication required
pl: Wymagana jest bezpieczniejsza metoda autoryzacji

source: Sources
pl: ¬ród³a

source: Address book
pl: Ksi±¿ka adresowa

source: Lookup name:
pl: Sprawd¼ nazwisko:

source: Delete address(es)
pl: Usuñ adres(y)

source: This address data is readonly and cannot be deleted.
pl: Te dane adresowe s± tylko do odczytu i nie mog± byæ usuwane.

source: Delete group
pl: Usuñ grupê

source: Really delete the group(s)? The addresses it contains will not be lost.
pl: Czy chcesz usun±æ grupê(y)? Wszystkie znajduj±ce siê tam adresy zostan± usuniête.

source: Really delete the address(es)?
pl: Czy naprawdê chcesz usun±æ adres(y)?

source: Cannot paste. Target address book is readonly.
pl: Nie mo¿na wkleiæ. Docelowa ksi±¿ka adresowa jest tylko do odczytu.

source: Cannot paste into an address group.
pl: Nie mo¿na wkleiæ do grupy adresowej.

source: Do you want to delete the query results and addresses in '%s' ?
pl: Czy chcesz usun±æ wyniki zapytania i adresy w `%s' ?

source: Delete
pl: Usuñ

source: Do you want to delete '%s' ? If you delete the folder only, the addresses it contains will be moved into the parent folder.
pl: Czy chcesz usun±æ '%s'? Je¿eli usuniesz tylko folder, adresy w nim zawarte zostan± przeniesione do katalogu nadrzêdnego.

source: Delete folder
pl: Usuñ katalog

source: +Delete _folder only
pl: +Usuñ tylko _katalog

source: Delete folder and _addresses
pl: Usuñ katalog i _adresy

source: Do you want to delete '%s'? The addresses it contains will not be lost.
pl: Czy chcesz usun±æ '%s'? Wszystkie znajduj±ce siê tam adresy zostan± usuniête.

source: Do you want to delete '%s'? The addresses it contains will be lost.
pl: Czy chcesz usun±æ '%s'? Wszystkie znajduj±ce siê tam adresy zostan± usuniête.

source: Search '%s'
pl: Szukaj '%s'

source: New Contacts
pl: Nowe kontakty

source: New user, could not save index file.
pl: Nowy u¿ytkownik, nie mo¿na by³o zapisaæ pliku indeksowego.

source: New user, could not save address book files.
pl: Nowy u¿ytkownik, nie mo¿na by³o zapisaæ plików ksi±¿ki adresowej.

source: Old address book converted successfully.
pl: Dawna ksi±¿ka adresowa zosta³a pomy¶lnie skonwertowana.

source: Old address book converted, could not save new address index file.
pl: Stara ksi±¿ka adresowa skonwertowana, jednak nie powiód³ siê zapis nowego pliku indeksowego

source: Could not convert address book, but created empty new address book files.
pl: Nie mo¿na by³o skonwertowaæ ksi±¿ki adresowej, lecz utworzono puste pliki nowej ksi±¿ki adresowej.

source: Could not convert address book, could not save new address index file.
pl: Nie mo¿na skonwertowaæ ksi±¿ki adresowej, nie mo¿na zapisaæ nowego pliku indeksowego adresu.

source: Could not convert address book and could not create new address book files.
pl: Nie mo¿na by³o skonwertowaæ ksi±¿ki adresowej, oraz nie mo¿na by³o utworzyæ nowych plików ksi±¿ki adresowej.

source: Addressbook conversion error
pl: B³±d konwersji ksi±¿ki adresowej

source: Addressbook Error
pl: B³±d ksi±¿ki adresowej

source: Could not read address index
pl: Nie mo¿na by³o otworzyæ indeksu adresów

source: Busy searching...
pl: Zajêty przeszukiwaniem...

source: Interface
pl: Interfejs

source: Address Book
pl: Ksi±¿ka adresowa

source: Person
pl: Osoba

source: Folder
pl: Katalog

source: LDAP servers
pl: Serwery LDAP

source: LDAP Query
pl: Zapytanie LDAP

source: Any
pl: Wszystkie

source: Please specify name for address book.
pl: Okre¶l nazwê dla ksi±¿ki adresowej.

source: Please select the mail headers to search.
pl: Zaznacz nag³ówki wiadomo¶ci do przeszukania.

source: Collecting addresses...
pl: Zbieranie adresów...

source: Addresses collected successfully.
pl: Zbieranie adresów zakoñczone sukcesem.

source: Current folder:
pl: Aktualny katalog:

source: Address book name:
pl: Nazwa ksi±¿ki adresowej:

source: Address book folder size:
pl: Rozmiar katalogu ksi±¿ki adresowej:j

source: Maximum amount of entries per folder within the newly created address book
pl: Okre¶la maksymaln± ilo¶æ wpisów w ka¿dym katalogu nowo utworzonej ksi±¿ki adresowej

source: Process these mail header fields
pl: Przetwarzane nag³ówki

source: Include subfolders
pl: Uwzglêdniaj podkatalogi

source: Header Name
pl: Nazwa nag³ówka

source: Address Count
pl: Liczba adresów

source: Header Fields
pl: Pola nag³ówków

source: Finish
pl: Koniec

source: Collect email addresses from selected messages
pl: Wyci±gaj adresy e-mail z nastêpuj±cych wiadomo¶ci

source: Collect email addresses from folder
pl: Zgromad¼ adresy e-mail z katalogu

source: Common addresses
pl: Wspólne adresy

source: Personal addresses
pl: Adresy osobiste

source: Common address
pl: Wspólny adres

source: Personal address
pl: Osobisty adres

source: Address(es) update
pl: Aktualizacja adresów

source: Update failed. Changes not written to Directory.
pl: Aktualizacja nie powiod³a siê. Zmiany nie zosta³y zapisane do Katalogu.

source: Show duplicates in the same book
pl: Pokazywanie duplikatów z tej samej ksi±¿ki

source: Show duplicates in different books
pl: Pokazywanie duplikatów z ró¿nych ksi±¿ek

source: Find address book email duplicates
pl: Znajd¼ duplikaty adresów e-mail w ksi±¿ce adresowej

source: Claws Mail will now search for duplicate email addresses in the address book.
pl: Claws Mail przeszuka Twoj± ksi±¿kê adresow± w poszukiwaniu duplikatów adresów e-mail.

source: No duplicate email addresses found in the address book
pl: Nie znaleziono duplikatów adresów e-mail

source: Duplicate email addresses
pl: Duplikaty adresów e-mail

source: Address book path
pl: ¦cie¿ka do ksi±¿ki adresowej

source: Delete address
pl: Usuñ adresy

source: Notice
pl: Notatka

source: Warning
pl: Ostrze¿enie

source: Error
pl: B³±d

source: _View log
pl: _Poka¿ log

source: Show this message next time
pl: Wy¶wietl tê wiadomo¶æ nastêpnym razem

source: Browse Directory Entry
pl: Przegl±danie zawarto¶ci katalogu

source: Server Name :
pl: Nazwa serwera :

source: Distinguished Name (dn) :
pl: Unikatowa nazwa (dn):

source: LDAP Name
pl: Nazwa LDAP

source: Attribute Value
pl: Warto¶æ Atrybutu

source: Nothing
pl: Nic

source: a viewer
pl: Przegl±darka

source: a MIME parser
pl: parser MIME

source: folders
pl: Katalogi

source: filtering
pl: Filtrowanie...

source: a privacy interface
pl: system prywatno¶ci

source: a notifier
pl: powiadamiacz

source: an utility
pl: narzêdzie

source: things
pl: rzeczy

source: This plugin provides %s (%s), which is already provided by the %s plugin.
pl: Ta wtyczka oferuje obs³ugê %s (%s) co jest ju¿ wykonywane przez wtyczkê %s.

source: Plugin already loaded
pl: Wtyczka jest ju¿ za³adowana

source: Failed to allocate memory for Plugin
pl: Nie uda³o siê przydzieliæ odpowiedniej ilo¶ci pamiêci dla wtyczki

source: This module is for Claws Mail GTK1.
pl: Ten modu³ dzia³a tylko z Claws Mail GTK1.

source: Your version of Claws Mail is newer than the version the '%s' plugin was built with.
pl: Twoja wersja Claws Mail jest nowsza ni¿ ta dla której wtyczka %s zosta³a skompilowana.

source: Your version of Claws Mail is newer than the version the plugin was built with.
pl: Twoja wersja Claws Mail jest nowsza ni¿ ta dla której ta wtyczka zosta³a skompilowana.

source: Your version of Claws Mail is too old for the '%s' plugin.
pl: Twoja wersja Claws Mail jest za stara aby u¿yæ wtyczki '%s'.

source: Your version of Claws Mail is too old for the plugin.
pl: Twoja wersja Claws Mail jest za stara aby u¿yæ tej wtyczki.

source: SSL handshake failed
pl: B³±d po³±czenia SSL

source: bad SMTP response
pl: z³a odpowied¼ SMTP

source: error occurred on SMTP session
pl: wyst±pi³ b³±d podczas sesji SMTP

source: error occurred on authentication
pl: wyst±pi³ b³±d podczas uwierzytelniania

source: Message is too big (Maximum size is %s)
pl: Wiadomo¶æ jest zbyt du¿a (Maksymalny rozmiar to %s)

source: couldn't start TLS session
pl: nie mo¿na nawi±zaæ sesji TLS

source: write on fd%d: %s
pl: zapis do fd%d: %s

source: Uncheckable
pl: Nie mo¿na sprawdziæ

source: Self-signed certificate
pl: Podpisany certyfikat

source: Revoked certificate
pl: Uniewa¿niony certyfikat

source: No certificate issuer found
pl: Nie znaleziono wydawcy certyfikatu

source: Certificate issuer is not a CA
pl: Wydawca certyfikatu nie jest CA

source: <not in certificate>
pl: <nie wystêpuje w certyfikacie>

source: (Subject cleared by RegExp)
pl: (Temat wyczyszczony przez Wyra¿enie Regularne)

source: Complete day name for use by strftime|Sunday
pl: Niedziela

source: Complete day name for use by strftime|Monday
pl: Poniedzia³ek

source: Complete day name for use by strftime|Tuesday
pl: Wtorek

source: Complete day name for use by strftime|Wednesday
pl: ¦roda

source: Complete day name for use by strftime|Thursday
pl: Czwartek

source: Complete day name for use by strftime|Friday
pl: Pi±tek

source: Complete day name for use by strftime|Saturday
pl: Sobota

source: Complete month name for use by strftime|January
pl: Styczeñ

source: Complete month name for use by strftime|February
pl: Luty

source: Complete month name for use by strftime|March
pl: Marzec

source: Complete month name for use by strftime|April
pl: Kwiecieñ

source: Complete month name for use by strftime|May
pl: Maj

source: Complete month name for use by strftime|June
pl: Czerwiec

source: Complete month name for use by strftime|July
pl: Lipiec

source: Complete month name for use by strftime|August
pl: Sierpieñ

source: Complete month name for use by strftime|September
pl: Wrzesieñ

source: Complete month name for use by strftime|October
pl: Pa¼dziernik

source: Complete month name for use by strftime|November
pl: Listopad

source: Complete month name for use by strftime|December
pl: Grudzieñ

source: Abbr. day name for use by strftime|Sun
pl: Nie

source: Abbr. day name for use by strftime|Mon
pl: Pon

source: Abbr. day name for use by strftime|Tue
pl: Wt

source: Abbr. day name for use by strftime|Wed
pl: ¦r

source: Abbr. day name for use by strftime|Thu
pl: Czw

source: Abbr. day name for use by strftime|Fri
pl: Pi±

source: Abbr. day name for use by strftime|Sat
pl: Sob

source: Abbr. month name for use by strftime|Jan
pl: Sty

source: Abbr. month name for use by strftime|Feb
pl: Lut

source: Abbr. month name for use by strftime|Mar
pl: Mar

source: Abbr. month name for use by strftime|Apr
pl: Kwi

source: Abbr. month name for use by strftime|May
pl: Maj

source: Abbr. month name for use by strftime|Jun
pl: Cze

source: Abbr. month name for use by strftime|Jul
pl: Lip

source: Abbr. month name for use by strftime|Aug
pl: Sie

source: Abbr. month name for use by strftime|Sep
pl: Wrz

source: Abbr. month name for use by strftime|Oct
pl: Pa¼

source: Abbr. month name for use by strftime|Nov
pl: Lis

source: Abbr. month name for use by strftime|Dec
pl: Gru

source: For use by strftime (morning)|AM
pl: Rano

source: For use by strftime (afternoon)|PM
pl: Po po³udniu

source: For use by strftime (morning, lowercase)|am
pl: rano

source: For use by strftime (afternoon, lowercase)|pm
pl: po po³udniu

source: For use by strftime (default date+time format)|%a %b %e %H:%M:%S %Y
pl: %a %b %e %H:%M:%S %Y

source: For use by strftime (default date format)|%m/%d/%y
pl: %m-%d-%y

source: For use by strftime (default time format)|%H:%M:%S
pl: %H:%M:%S

source: For use by strftime (default 12-hour time format)|%I:%M:%S %p
pl: %I:%M:%S %p

source: _Add...
pl: Dod_aj...

source: _Remove
pl: _Usuñ

source: _Properties...
pl: _W³a¶ciwo¶ci...

source: _Message
pl: _Wiadomo¶æ

source: _Spelling
pl: Pi_sownia

source: _Options
pl: _Opcje

source: S_end
pl: Wy¶lij

source: Send _later
pl: Wy¶lij pó¼niej

source: _Attach file
pl: Do³±cz plik

source: _Insert file
pl: Wstaw plik

source: Insert si_gnature
pl: Wstaw podpis

source: _Undo
pl: _Cofnij

source: _Redo
pl: P_onów

source: Cu_t
pl: Wy_tnij

source: Select _all
pl: W_ybierz wszystko

source: A_dvanced
pl: Zaawansowane

source: Move a character backward
pl: Przesuñ o znak w ty³

source: Move a character forward
pl: Przesuñ o znak w przód

source: Move a word backward
pl: Przesuñ o s³owo w ty³

source: Move a word forward
pl: Przesuñ o s³owo w przód

source: Move to beginning of line
pl: Przesuñ do pocz±tku linii

source: Move to end of line
pl: Przesuñ do koñca linii

source: Move to previous line
pl: Przesuñ do poprzedniej linii

source: Move to next line
pl: Przesuñ do nastêpnej linii

source: Delete a character backward
pl: Wykasuj znak za kursorem

source: Delete a character forward
pl: Wykasuj znak przed kursorem

source: Delete a word backward
pl: Wykasuj s³owo za kursorem

source: Delete a word forward
pl: Wykasuj s³owo przed kursorem

source: Delete line
pl: Usuñ liniê

source: Delete to end of line
pl: Wykasuj do koñca linii

source: _Find
pl: _Szukaj

source: _Wrap current paragraph
pl: Za_wiñ obecny akapit

source: Wrap all long _lines
pl: Zawijaj wszystkie d³ugie linie

source: Edit with e_xternal editor
pl: Edytuj w zewnêtrznym edytorze

source: _Check all or check selection
pl: Sprawd¼ wszystko albo zazna_czone

source: _Highlight all misspelled words
pl: P_odkre¶l wszystkie b³êdnie napisane s³owa

source: Check _backwards misspelled word
pl: Szukaj od ty³u b³êdnie napisanych s³ów

source: _Forward to next misspelled word
pl: _Przeskocz w przód do kolejnego b³êdnie napisanego s³owa

source: Reply _mode
pl: Tryb odpowiadania

source: Privacy _System
pl: Ochrona prywatno¶ci

source: _Priority
pl: Pri_orytet

source: Character _encoding
pl: _Kodowanie znaków

source: Western European
pl: Europa Zachodnia

source: Baltic
pl: Ba³tyckie

source: Hebrew
pl: Hebrajskie

source: Arabic
pl: Arabskie

source: Cyrillic
pl: Cyrylica

source: Japanese
pl: Japonia

source: Chinese
pl: Chiñskie

source: Korean
pl: Koreañskie

source: Thai
pl: Tajskie

source: _Address book
pl: Ksi±¿ka _adresowa

source: _Template
pl: Wzorce

source: Actio_ns
pl: Akcje

source: Aut_o wrapping
pl: Automatyczne zawijanie

source: Auto _indent
pl: Automatyczne wciêcia

source: Si_gn
pl: Podpisz

source: _Encrypt
pl: _Szyfruj

source: _Request Return Receipt
pl: ¯±daj potwierdzenia dostarczenia

source: Remo_ve references
pl: Usuñ odniesienia

source: Show _ruler
pl: Poka¿ li_nijkê

source: _Normal
pl: Z_wyk³y

source: _All
pl: W_szystkie

source: _Sender
pl: Nadawca

source: _Mailing-list
pl: Lista dyskusyjna

source: _Highest
pl: Najwy¿szy

source: Hi_gh
pl: Wysoki

source: Lo_w
pl: Niski

source: _Lowest
pl: Najni¿szy

source: _Automatic
pl: Automatycznie

source: 7bit ASCII (US-ASC_II)
pl: 7 bitów ASCII (US-ASCII)

source: Central European (ISO-8859-_2)
pl: Europa ¦rodkowa (ISO-8859-2)

source: Greek (ISO-8859-_7)
pl: Grecja (ISO-8859-7)

source: Turkish (ISO-8859-_9)
pl: Turcja (ISO-8859-9)

source: New message From format error.
pl: B³êdny format nadawcy wiadomo¶ci.

source: New message subject format error.
pl: B³êdny format tematu wiadomo¶ci.

source: The body of the "New message" template has an error at line %d.
pl: B³±d w tre¶ci wiadomo¶ci w linii %d.

source: Unable to reply. The original email probably doesn't exist.
pl: Nie mo¿na odpowiedzieæ. Oryginalny email prawdopodobnie nie istnieje.

source: The "From" field of the "Reply" template contains an invalid email address.
pl: Pole "Od" wzorca "Odpowiedz" zawiera nieprawid³owy adres email.

source: The body of the "Reply" template has an error at line %d.
pl: B³±d formatu wzorca (tre¶æ wiadomo¶ci).w linii %d.

source: The "From" field of the "Forward" template contains an invalid email address.
pl: Pole "Od" wzorca "Przeka¿" zawiera nieprawid³owy adres email.

source: The body of the "Forward" template has an error at line %d.
pl: B³±d formatu wzorca (tre¶æ wiadomo¶ci).w linii %d.

source: Fw: multiple emails
pl: Fw: kilka wiadomo¶ci email

source: The body of the "Redirect" template has an error at line %d.
pl: B³±d w formacie wiadomo¶ci przekierowuj±cej w linii %d.

source: Cc:
pl: Kopia:

source: Bcc:
pl: Ukryta kopia:

source: Reply-To:
pl: Odpowiedz-Do:

source: Newsgroups:
pl: Grupy news:

source: Followup-To:
pl: Odpowiedzi-Do(FUT):

source: In-Reply-To:
pl: W odpowiedzi na:

source: To:
pl: Do:

source: Couldn't attach a file (charset conversion failed).
pl: Nie mo¿na do³±czyæ pliku (konwersja strony kodowej nie powiod³a siê).
