Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: first marked email
pl: Przejd¼ do pierwszej oznaczonej wiadomo¶ci

source: first new email
pl: Przejd¼ do pierwszej nowej wiadomo¶ci

source: first unread email
pl: Przejd¼ do pierwszej nieprzeczytanej wiadomo¶ci

source: last opened email
pl: Przejd¼ do ostatniej otwartej wiadomo¶ci

source: last email in the list
pl: Przejd¼ do ostatniej wiadomo¶ci na li¶cie

source: first email in the list
pl: pierwsza wiadomo¶æ na li¶cie

source: Selection when entering a folder
pl: Zaznaczanie wiadomo¶ci podczas otwierania katalogu

source: Possible selections
pl: Dostêpne dzia³ania

source: Selection on folder opening
pl: Dzia³ania wykonywane po otwarciu katalogu

source: This name is used as the Menu item
pl: Ta nazwa jest u¿ywana jako nazwa menu

source: Override composing account's From header. This doesn't change the composing account.
pl: Nadpisz nag³ówek Od podczas tworzenia nowej wiadomo¶ci. Nie zmienia to konta u¿ywanego do tworzenia wiadomo¶ci.

source: Append the new template above to the list
pl: Dopisuje nowy wzorcze do listy powy¿ej

source: Replace the selected template in list with the template above
pl: Zastêpuje wybrany wzorzec na li¶cie powy¿szym wzorcem

source: Delete the selected template from the list
pl: Usuwa wybrany szablon z listy

source: Show information on configuring templates
pl: Wy¶wietla informacje o konfigurowaniu wzorców

source: Move the selected template to the top
pl: Przesuwa wybrany wzorzec na sam± górê

source: Move the selected template up
pl: Przesuwa wybrany wzorzec do góry

source: Move the selected template down
pl: Przesuwa wybrany wzorzec na dó³

source: Move the selected template to the bottom
pl: Przesuwa wybrany wzorzec na sam dó³

source: Template configuration
pl: Konfiguracja Wzorców

source: Templates list not saved
pl: Lista wzorców nie zosta³a zapisana

source: The templates list has been modified. Close anyway?
pl: Lista wzorców zosta³a zmodyfikowana. Naprawdê zamkn±æ?

source: The template's name is not set.
pl: Nie podano nazwy wzorca.

source: The "From" field of the template contains an invalid email address.
pl: Pole "Od" wzorca zawiera nieprawid³owy adres e-mail.

source: The "To" field of the template contains an invalid email address.
pl: Pole "Do" wzorca zawiera nieprawid³owy adres e-mail.

source: The "Cc" field of the template contains an invalid email address.
pl: Pole "Cc" wzorca zawiera nieprawid³owy adres e-mail.

source: The "Bcc" field of the template contains an invalid email address.
pl: Pole "Bcc" wzorca zawiera nieprawid³owy adres e-mail.

source: The "Subject" field of the template is invalid.
pl: Pole "Temat" wzorca jest nieprawid³owe.

source: Delete template
pl: Usuñ wzorzec

source: Do you really want to delete this template?
pl: Czy naprawdê chcesz usun±æ ten wzorzec?

source: Delete all templates
pl: Usuñ wszystkie wzorce

source: Do you really want to delete all the templates?
pl: Czy naprawdê chcesz usun±æ wszystkie wzorce?

source: Current templates
pl: Obecne wzorce

source: Template
pl: Wzorzec

source: Default internal theme
pl: Domy¶lny wewnêtrzny motyw

source: Themes
pl: Motywy

source: Only root can remove system themes
pl: Tylko u¿ytkownik root mo¿e usun±æ motywy systemowe

source: Remove system theme '%s'
pl: Usuniêcie motywu systemowego '%s'

source: Remove theme '%s'
pl: Usuniêcie motywu '%s'

source: Are you sure you want to remove this theme?
pl: Czy naprawdê chcesz usun±æ ten motyw?

source: File %s failed while removing theme.
pl: Wyst±pi³ b³±d pliku %s podczas usuwania motywu.

source: Removing theme directory failed.
pl: Usuniêcie katalogu motywu zakoñczy³o siê niepowodzeniem.

source: Theme removed successfully
pl: Motyw zosta³ pomy¶lnie usuniêty

source: Select theme folder
pl: Wybierz katalog motywu

source: Install theme '%s'
pl: Instalowanie motywu '%s'

source: This folder doesn't seem to be a theme folder. Install anyway?
pl: Ten katalog nie wygl±da na katalog motywów. Kontynuowaæ instalacjê?

source: Do you want to install theme for all users?
pl: Czy chcesz zainstalowaæ motyw dla wszystkich u¿ytkowników systemu?

source: Theme exists
pl: Motyw istnieje

source: A theme with the same name is already installed in this location. Do you want to replace it?
pl: Motyw o tej samej nazwie jest ju¿ zainstalowany w tym miejscu. Czy chcesz go nadpisaæ?

source: Couldn't delete the old theme in %s.
pl: Nie uda³o siê skasowaæ motywu z : %s.

source: Couldn't create destination directory %s.
pl: Nie mo¿na utworzyæ katalogu docelowego %s.

source: Theme installed successfully.
pl: Motyw zosta³ zainstalowany prawid³owo

source: Failed installing theme
pl: Wyst±pi³ b³±d podczas instalowania motywu.

source: File %s failed while installing theme.
pl: Wyst±pi³ b³±d pliku %s podczas instalowania motywu.

source: %d themes available (%d user, %d system, 1 internal)
pl: dostêpne motywy - %d (%d u¿ytkownika, %d systemowe, 1 wewnêtrzny)

source: Internal theme has %d icons
pl: Wewnêtrzny motyw ma %d ikon

source: No info file available for this theme
pl: Brak pliku informacyjnego dla tego motywu

source: Error: couldn't get theme status
pl: B³±d: Nie mo¿na odczytaæ stanu motywów

source: %d files (%d icons), size: %s
pl: %d plików (w tym ikony: %d), rozmiar: %s

source: Selector
pl: Wybór

source: Install new...
pl: Zainstaluj nowe...

source: Information
pl: Informacje

source: Author:
pl: Autor:

source: Preview
pl: Podgl±d

source: Use this
pl: U¿yj

source: Remove
pl: Usuñ

source: Selected Action already set. Please choose another Action from List
pl: Wybrana Akcja ju¿ ustawiona. Proszê wybraæ inn± Akcjê z Listy

source: Item has no icon defined.
pl: Element nie ma zdefiniowanej ikonki.

source: Item has no text defined.
pl: Element nie ma zdefiniowanego tekstu.

source: Toolbar item
pl: Element paska narzêdzi

source: Item type
pl: Rodzaj elementu

source: Internal Function
pl: Funkcja wewnêtrzna

source: User Action
pl: Akcja U¿ytkownika

source: Event executed on click
pl: Dzia³anie do wykonania po klikniêciu

source: Toolbar text
pl: Tekst paska narzêdzi

source: Icon
pl: Ikona

source: Toolbars
pl: Pasek narzêdzi

source: Main Window
pl: Okno g³ówne

source: Message Window
pl: Okno wiadomo¶ci

source: Compose Window
pl: Okno tworzenia nowego listu

source: Icon text
pl: Tekst ikony

source: Mapped event
pl: Przypisane dzia³anie

source: Toolbar item icon
pl: Ikonka paska narzêdzi

source: Auto wrapping
pl: Automatyczne zawijanie

source: Wrap quotation
pl: Zawijanie cytatów

source: Wrap pasted text
pl: Zawijanie d³ugich linii we wklejonym tek¶cie.

source: Auto indent
pl: Automatyczne wciêcia

source: Wrapping
pl: Zawijanie linii

source: Print preview
pl: Podgl±d wydruku

source: First page
pl: Pierwsza strona

source: Last page
pl: Ostatnia strona

source: Zoom 100%
pl: Powiêksza do 100%

source: Zoom fit
pl: Dopasowuje powiêkszenie do rozmiaru ekranu

source: Zoom in
pl: Powiêksza

source: Zoom out
pl: Pomniejsza

source: Page %d
pl: Strona nr %d

source: No information available
pl: Brak informacji

source: No recipient keys defined.
pl: Nie zdefiniowano kluczy odbiorcy.

source: [Error decoding BASE64]
pl: [B³±d podczas dekodowania BASE64]

source: Already trying to send.
pl: W³a¶nie trwa wysy³anie.

source: Couldn't open file %s.
pl: Nie mo¿na otworzyæ pliku %s.

source: Couldn't encrypt the email: %s
pl: Nie uda³o siê zaszyfrowaæ wiadomo¶ci: %s

source: Queued message header is broken.
pl: Nag³ówek skolejkowanej wiadomo¶ci jest uszkodzony.

source: An error happened during SMTP session.
pl: Wyst±pi³ b³±d podczas sesji SMTP.

source: No specific account has been found to send, and an error happened during SMTP session.
pl: Nie zosta³o odnalezione odpowiednie konto do wysy³ania i wyst±pi³ b³±d podczas sesji SMTP.

source: Couldn't determine sending informations. Maybe the email hasn't been generated by Claws Mail.
pl: Nie mo¿na ustaliæ informacji o wysy³ce. Prawdopodobnie email nie by³ wygenerowany przez Claws Mail.

source: Couldn't create temporary file for news sending.
pl: Nie mo¿na by³o stworzyæ pliku tymczasowego do wys³ania postu na grupy.

source: Error when writing temporary file for news sending.
pl: B³±d podczas zapisywania do pliku tymczasowego do wys³ania postu na grupy.

source: Error occurred while posting the message to %s.
pl: B³±d podczas wysy³ania wiadomo¶ci do %s

source: Filtering messages...
pl: Filtrowanie wiadomo¶ci...

source: <span weight="bold">symbols:</span>
pl: <span weight="bold">symbole:</span>

source: customized date format (see 'man strftime')
pl: W³asny format daty (zobacz `man strftime')

source: email address of sender
pl: adres e-mail nadawcy

source: full name of sender
pl: pe³ne dane nadawcy

source: first name of sender
pl: imiê nadawcy

source: last name of sender
pl: nazwisko nadawcy

source: initials of sender
pl: Inicja³y Nadawcy

source: message body
pl: tre¶æ wiadomo¶ci

source: quoted message body
pl: zacytowana tre¶æ wiadomo¶ci

source: message body without signature
pl: tre¶æ wiadomo¶ci bez podpisu

source: quoted message body without signature
pl: zacytowana tre¶æ wiadomo¶æ bez podpisu

source: message tags
pl: Etykiety wiadomo¶ci

source: current dictionary
pl: aktualny s³ownik

source: cursor position
pl: pozycje kursora

source: account property: your name
pl: w³a¶ciwo¶æ konta: Twoje imiê

source: account property: your email address
pl: w³a¶ciwo¶æ konta: twój adres email

source: account property: account name
pl: w³a¶ciwo¶æ konta: nazwa konta

source: account property: organization
pl: w³a¶ciwo¶æ konta: organizacja

source: account property: signature
pl: w³a¶ciwo¶æ konta: podpis

source: account property: signature path
pl: w³a¶ciwo¶æ konta: ¶cie¿ka do podpisu

source: account property: default dictionary
pl: w³a¶ciwo¶æ konta: nazwa konta

source: address book <span style="oblique">completion</span>: Cc
pl: ksi±¿ka adresowa <span style="oblique">uzupe³nianie</span>: Cc

source: address book <span style="oblique">completion</span>: From
pl: ksi±¿ka adresowa <span style="oblique">uzupe³nianie</span>: Od

source: address book <span style="oblique">completion</span>: To
pl: ksi±¿ka adresowa <span style="oblique">uzupe³nianie</span>: Do

source: literal backslash
pl: znak odwróconego uko¶nika

source: literal question mark
pl: znak zapytania

source: literal exclamation mark
pl: znak wykrzyknika

source: literal pipe
pl: znak rury

source: literal opening curly brace
pl: znak otwarcia nawiasu klamrowego

source: literal closing curly brace
pl: znak zamkniêcia nawiasu klamrowego

source: <span weight="bold">commands:</span>
pl: <span weight="bold">polecenia:</span>

source: insert <span style="oblique">expr</span> if x is set, where x is one of the [dfNFLIstcnriT, ad, af, ao, as, asp, aT, ABc, ABf, ABt] symbols (or their long equivalent)
pl: wstawia <span style="oblique">expr</span> gdy x jest ustawione. X mo¿e byæ jednym z nastêpuj±cych symboli: [dfNFLIstcnriT, ad, af, ao, aT, ABc, ABf, ABt] (lub ich d³ugim odpowiednikiem)

source: insert <span style="oblique">expr</span> if x is not set, where x is one of the [dfNFLIstcnriT, ad, af, ao, as, asp, aT, ABc, ABf, ABt] symbols (or their long equivalent)
pl: wstawia <span style="oblique">expr</span> gdy x nie jest ustawione. X mo¿e byæ jednym z nastêpuj±cych symboli: [dfNFLIstcnriT, ad, af, ao, aT, ABc, ABf, ABt] (lub ich d³ugim odpowiednikiem)

source: insert file: <span style="oblique">sub_expr</span> is evaluated as the path of the file to insert
pl: wstaw plik: <span style="oblique">sub_expr </span> jest nazw± pliku do wstawienia

source: insert program output: <span style="oblique">sub_expr</span> is evaluated as a command-line to get the output from
pl: wstaw wynik programu: <span style="oblique">sub_expr </span>jest komend±, z której pobierane jest wyj¶cie

source: insert user input: <span style="oblique">sub_expr</span> is a variable to be replaced by user-entered text
pl: wstaw dan± u¿ytkownika: <span style="oblique">sub_expr</span> jest zmienn± podmienian± na tekst wprowadzony przez u¿ytkownika

source: attach file: <span style="oblique">sub_expr</span> is evaluated as the path of the file to attach
pl: wstaw plik: <span style="oblique">sub_expr </span> jest ¶cie¿ka do pliku, który ma byæ wstawiony

source: <span weight="bold">definition of terms:</span>
pl: <span weight="bold">Opis symboli:</span>

source: text that can contain any of the symbols or commands above
pl: tekst który mo¿e zawieraæ wszystkie znaki lub komendy opisane powy¿ej

source: text that can contain any of the symbols (no commands) above
pl: tekst który mo¿e zawieraæ wszystkie znaki powy¿ej (polecenia nie s± dozwolone)

source: completion from address book only works with the first address of the header, it outputs the full name of the contact if that address matches exactly one contact in the address book
pl: Uzupe³nienie nazwy na podstawie danych z ksi±¿ki adresowej. Je¿eli pierwszy adresu z nag³ówków wystêpuje jeden raz w ksi±¿ce adresowej zwraca pe³n± nazwê kontaktu

source: Description of symbols
pl: Opis symboli

source: The following symbols and commands can be used:
pl: Mo¿na u¿ywaæ nastêpuj±cych symboli:

source: Use template when composing new messages
pl: U¿ycie poni¿szego szablonu podczas pisania nowych wiadomo¶ci

source: Override From header. This doesn't change the account used to compose the new message.
pl: Nadpisuj nag³ówek From (nadawcê). Nie zmienia to konta u¿ywanego do tworzenia wiadomo¶ci.

source: Use template when replying to messages
pl: U¿ycie poni¿szego szablonu podczas odpowiadania na wiadomo¶æ

source: Override From header. This doesn't change the account used to reply.
pl: Nadpisuj nag³ówek From (nadawcê). Nie zmienia to konta u¿ywanego do odpowiadania.

source: Quotation mark
pl: Znak cytowania

source: Use template when forwarding messages
pl: U¿ycie poni¿szego szablonu podczas przekazywania wiadomo¶ci

source: Override From header. This doesn't change the account used to forward.
pl: Nadpisuj nag³ówek From (nadawcê). Nie zmienia to konta u¿ywanego do przekazywania wiadomo¶ci.

source: Defaults
pl: Domy¶lne

source: The "From" field of the "New message" template contains an invalid email address.
pl: Pole "Od" wzorca "Nowa wiadomo¶æ" zawiera nieprawid³owy adres e-mail.

source: The "Subject" field of the "New message" template is invalid.
pl: Pole "Temat" wzorca "Nowa wiadomo¶æ" jest nieprawid³owe.

source: The "Quotation mark" field of the "Reply" template is invalid.
pl: Pole "Znak cytowania" wzorca "Odpowied¼" jest nieprawid³owe.

source: The "Quotation mark" field of the "Forward" template is invalid.
pl: Pole "Znak cytowania" wzorca "Przeka¿" jest nieprawid³owe.

source: Enter text to replace '%s'
pl: Wpisz tekst zastêpuj±cy '%s'

source: Enter variable
pl: Wprowad¼ zmienn±

source: Sending message using command: %s
pl: Wysy³anie wiadomo¶ci za pomoc± polecenia: %s

source: Couldn't execute command: %s
pl: Nie mo¿na wykonaæ polecenia: %s

source: Error occurred while executing command: %s
pl: Wyst±pi³ b³±d podczas wykonywania polecenia: %s

source: Connecting
pl: Pod³±czanie

source: Doing POP before SMTP...
pl: Wykonywanie POP przez SMTP

source: POP before SMTP
pl: POP przed SMTP

source: Mail sent successfully.
pl: Wiadomo¶æ zosta³a poprawnie wys³ana.

source: Sending HELO...
pl: Wysy³anie HELO...

source: Authenticating
pl: Uwierzytelnianie

source: Sending message...
pl: Wysy³anie wiadomo¶ci...

source: Sending EHLO...
pl: Wysy³anie EHLO...

source: Sending MAIL FROM...
pl: Wysy³anie MAIL FROM...

source: Sending RCPT TO...
pl: Wysy³anie RCPT TO...

source: Sending DATA...
pl: Wysy³anie DATA...

source: Quitting...
pl: Wychodzenie...

source: Sending message (%d / %d bytes)
pl: Wysy³anie wiadomo¶ci (%d / %d bajtów)

source: Sending message
pl: Wysy³anie wiadomo¶ci

source: Error occurred while sending the message.
pl: B³±d podczas wysy³ania wiadomo¶ci.

source: Error occurred while sending the message: %s
pl: Wyst±pi³ b³±d podczas wysy³ania wiadomo¶ci: %s

source: Mailbox setting
pl: Ustawienia skrzynki

source: First, you have to set the location of mailbox. You can use existing mailbox in MH format if you have the one. If you're not sure, just select OK.
pl: Najpierw wybierz miejsce skrzynki. Je¶li posiadasz, to mo¿esz u¿yæ istniej±cej skrzynki w formacie MH. Je¶li nie jeste¶ pewien, wybierz OK.

source: Source of the message
pl: ¬ród³o wiadomo¶ci

source: %s - Source
pl: %s - ¬ród³o

source: Saved SSL Certificates
pl: Zapisane certyfikaty SSL

source: Delete certificate
pl: Skasuj certyfikat

source: Do you really want to delete this certificate?
pl: Czy naprawdê chcesz usun±æ ten certyfikat?

source: Search messages
pl: Przeszukaj wiadomo¶ci

source: Match any of the following
pl: Dopasuj jedno z nastêpuj±cych

source: Match all of the following
pl: Dopasuj wszystkie kryteria z nastêpuj±cych

source: Body:
pl: Tre¶æ:

source: Condition:
pl: Warunek:

source: Find _all
pl: Znajd¼ _wszystkie

source: Searching in %s...
pl: Wyszukiwanie w (%s)...

source: Beginning of list reached; continue from end?
pl: Osi±gniêto pocz±tek listy; zacz±æ od koñca?

source: End of list reached; continue from beginning?
pl: Osi±gniêto koniec listy; zacz±æ od pocz±tku?

source: Create _filter rule
pl: Twórz now± regu³ê f_iltra

source: Toggle quick search bar
pl: W³±cz/Wy³±cz pasek szybkiego wyszukiwania

source: Toggle multiple selection
pl: Prze³±cz wybór wielu elementów na raz

source: Process mark
pl: Znacznik procesu

source: Some marks are left. Process them?
pl: Niektóre znaczniki pozosta³y. Przefiltrowaæ je?

source: Scanning folder (%s)...
pl: Skanowanie katalogu (%s)...

source: No more unread messages
pl: Brak nieprzeczytanych wiadomo¶ci

source: No unread message found. Search from the end?
pl: Nie znaleziono nieprzeczytanych wiadomo¶ci. Szukaæ od koñca?

source: Internal error: unexpected value for prefs_common.next_unread_msg_dialog
pl: B³±d wewnêtrzny: niespodziewana warto¶æ w prefs_common.next_unread_msg_dialog

source: No unread messages.
pl: Brak nieprzeczytanych wiadomo¶ci

source: No unread message found. Go to next folder?
pl: Nie znaleziono nieprzeczytanych wiadomo¶ci. Przej¶æ do nastêpnego folderu?

source: No more new messages
pl: Brak nowych wiadomo¶ci

source: No new message found. Search from the end?
pl: Nie znaleziono nowych wiadomo¶ci. Szukaæ od koñca?

source: No new messages.
pl: Brak nowych wiadomo¶ci.

source: No new message found. Go to next folder?
pl: Nie znaleziono nowych wiadomo¶ci. Przej¶æ do nastêpnego folderu?

source: No more marked messages
pl: Brak zaznaczonych wiadomo¶ci

source: No marked message found. Search from the end?
pl: Nie znaleziono zaznaczonych wiadomo¶ci. Szukaæ od koñca?

source: No marked messages.
pl: Brak zaznaczonych wiadomo¶ci

source: No marked message found. Go to next folder?
pl: Nie znaleziono zaznaczonych wiadomo¶ci. Przej¶æ do nastêpnego folderu?

source: No more labeled messages
pl: Brak kolorowanych wiadomo¶ci

source: No labeled message found. Search from the end?
pl: Nie znaleziono kolorowanych wiadomo¶ci. Szukaæ od koñca?

source: No labeled messages.
pl: Brak kolorowanych wiadomo¶ci

source: No labeled message found. Search from the beginning?
pl: Brak kolorowanych wiadomo¶ci. Szukaæ od pocz±tku?

source: Attracting messages by subject...
pl: £±czenie wiadomo¶ci wg tematu...

source: %d deleted
pl: %d usuniêto

source: %s%d moved
pl: %s%d przeniesiono

source: %s%d copied
pl: %s%d skopiowano

source: %d new, %d unread, %d total (%s)
pl: %d nowych, %d nieprzeczytanych, razem %d (%s)

source: <b>Message summary</b> <b>New:</b> %d <b>Unread:</b> %d <b>Total:</b> %d <b>Size:</b> %s <b>Marked:</b> %d <b>Replied:</b> %d <b>Forwarded:</b> %d <b>Locked:</b> %d <b>Ignored:</b> %d <b>Watched:</b> %d
pl: <b>Podsumowanie wybranych wiadomo¶ci</b> <b>Nowe:</b> %d <b>Nieprzeczytane:</b> %d <b>Wszystkie:</b> %d <b>Rozmiar:</b> %s <b>Wybrane:</b> %d <b>Opowiedziane:</b> %d <b>Przekazane:</b> %d <b>Zablokowane:</b> %d <b>Ignorowane:</b> %d <b>¦ledzone w±tki:</b> %d

source: %d/%d selected (%s/%s), %d unread
pl: wybrano %d/%d (%s/%s). Nieprzeczytanych - %d

source: Sorting summary...
pl: Sortowanie podsumowania...

source: Setting summary from message data...
pl: Ustawianie podsumowania z danych wiadomo¶ci...

source: (No Date)
pl: (Bez daty)

source: (No Recipient)
pl: (Brak adresata)

source: You're not the author of the article.
pl: Nie jeste¶ autorem artyku³u

source: Do you really want to delete the selected message?
pl: Czy naprawdê chcesz usun±æ %d wybran± wiadomo¶æ?

source: Delete message(s)
pl: Usuñ wiadomo¶æ(-ci)

source: Destination is same as current folder.
pl: Folder docelowy taki sam jak bie¿±cy.

source: Destination to copy is same as current folder.
pl: Folder docelowy taki sam jak bie¿±cy.

source: Append or Overwrite
pl: Dodaj lub Nadpisz

source: Append or overwrite existing file?
pl: Dodaæ do, czy nadpisaæ istniej±cy plik?

source: _Append
pl: _Dopisz

source: _Overwrite
pl: _Nadpisz

source: You are about to print %d messages, one by one. Do you want to continue?
pl: Zamierzasz wydrukowaæ %d wiadomo¶ci. Na pewno chcesz kontynuowaæ ?

source: Building threads...
pl: Tworzenie w±tków...

source: Skip these rules
pl: Pomiñ te regu³ki

source: Apply these rules regardless of the account they belong to
pl: Wykonaj te regu³ki bez wzglêdu na to z jakim kontem s± powi±zane

source: Apply these rules if they apply to the current account
pl: Wykonaj te regu³ki je¶li powi±zane s± z bie¿±cym kontem

source: Filtering
pl: Filtrowanie...

source: There are some filtering rules that belong to an account. Please choose what to do with these rules:
pl: Istniej± regu³ki powi±zane z tym kontem. Wybierz co zrobiæ z tymi regu³kami:

source: _Filter
pl: _Filtr

source: Filtering...
pl: Filtrowanie...

source: Processing configuration
pl: Konfiguracja przetwarzania

source: Ignored thread
pl: Ignorowany w±tek

source: Watched thread
pl: ¦ledzony w±tek

source: Replied - click to see reply
pl: Otrzymano odpowied¼ - kliknij aby zobaczyæ odpowied¼

source: To be moved
pl: Przeznaczone do przeniesienia

source: To be copied
pl: Do skopiowania

source: Signed, has attachment(s)
pl: Podpisana, posiada za³±cznik(i)

source: Encrypted, has attachment(s)
pl: Wiadomo¶æ jest zaszyfrowana i posiada za³±cznik(i)

source: Encrypted
pl: Zaszyfrowana wiadomo¶æ

source: Has attachment(s)
pl: Wiadomo¶æ posiada za³±cznik(i)

source: Regular expression (regexp) error: %s
pl: B³±d regularnego wyra¿enia (regexp): %s

source: Go back to the folder list (You have unread messages)
pl: Powrót do listy katalogów (Masz nieprzeczytane wiadomo¶ci)

source: Go back to the folder list
pl: Powrót do listy katalogów

source: _Open in web browser
pl: _Otwórz w przegl±darce

source: Copy this _link
pl: Kopiuj adres ³±cza

source: Add to _Address book
pl: Dodaj do ksi±¿ki adresowej

source: Copy this add_ress
pl: Kopiuj ten _adres

source: _Open image
pl: _Otwórz obrazek

source: _Save image...
pl: Zapi_sz obrazek...

source: [%s %s (%d bytes)]
pl: [%s %s (%d bajtów)]

source: [%s (%d bytes)]
pl: [%s (%d bajtów)]

source: This message can't be displayed. This is probably due to a network error. Use
pl: Ta wiadomo¶æ nie mo¿e byæ wy¶wietlona. Prawdopodobnie jest to spowodowane problemami z po³±czeniem sieciowym. U¿yj

source: in the Tools menu for more information.
pl: w menu Narzêdzia w celu zasiêgniêcia informacji.

source: The following can be performed on this part
pl: Na tej czê¶ci mo¿na wykonaæ nastêpuj±ce operacje

source: by right-clicking the icon or list item:
pl: poprzez prawe klikniêcie na ikonie lub elemencie listy:

source: - To save, select
pl: - Aby zapisaæ wybierz

source: 'Save as...'
pl: 'Zapisz jako...'

source: - To display as text, select
pl: Aby wy¶wietliæ jako tekst wybierz 'Wy¶wietl jako tekst'

source: 'Display as text'
pl: 'Wy¶wietl jako tekst'
