Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: --version -v output version information and exit
pl: --version -v wy¶wietla informacjê o wersji i wychodzi

source: --version-full -V output version and built-in features information and exit
pl: --version-full -V wy¶wietla informacje o wbudowanych funkcjach programu i koñczy swoje dzianie

source: --config-dir output configuration directory
pl: --config-dir wyj¶ciowy katalog konfiguracyjny

source: --alternate-config-dir [dir] use specified configuration directory
pl: --alternate-config-dir [katalog] korzysta z podanego katalogu jako katalogu konfiguracyjnego

source: Unknown option
pl: Nieznany opcja

source: Processing (%s)...
pl: Przetwarzanie (%s)...

source: top level folder
pl: katalog górnego poziomu

source: Queued messages
pl: Skolejkowane wiadomo¶ci

source: Some unsent messages are queued. Exit now?
pl: Niektóre niewys³ane wiadomo¶ci zosta³y skolejkowane. Wyj¶æ?

source: NetworkManager: network is online.
pl: NetworkManager: sieæ jest w³±czona.

source: NetworkManager: network is offline.
pl: NetworkManager: sieæ jest roz³±czona.

source: _File
pl: _Plik

source: _View
pl: _Widok

source: _Configuration
pl: Konfigura_cja

source: _Add mailbox
pl: Dodaj skrzynkê

source: _Import mbox file...
pl: Import pliku mbox...

source: _Export to mbox file...
pl: _Eksportuj do pliku mbox...

source: _Export selected to mbox file...
pl: _Eksportuj wybrane do pliku mbox...

source: Empty all _Trash folders
pl: Opró¿nij wszystkie kosze

source: Page setup...
pl: Uk³ad strony...

source: _Print...
pl: _Drukuj...

source: Synchronise folders
pl: _Synchronizuj katalogi

source: E_xit
pl: Koniec

source: Select _thread
pl: Zaznacz ca³y w±tek

source: _Delete thread
pl: Usuñ w±tek

source: _Find in current message...
pl: Znajd¼ w bie¿±cych wiadomo¶ciach...

source: _Quick search
pl: _Szybkie wyszukiwanie

source: Show or hi_de
pl: Poka¿ lub uk_ryj

source: _Toolbar
pl: Pasek narzêdzi

source: Set displayed _columns
pl: Ustaw wy¶wietlane kolumny

source: La_yout
pl: _Uk³ad

source: _Sort
pl: _Sortuj

source: _Attract by subject
pl: _Pow±tkowane

source: E_xpand all threads
pl: Ro_zwiñ wszystkie w±tki

source: Co_llapse all threads
pl: _Zwiñ wszystkie w±tki

source: _Go to
pl: Prze_jd¼ do

source: _Previous message
pl: Poprzednia wiadomo¶æ

source: _Next message
pl: Nastêpna wiadomo¶æ

source: P_revious unread message
pl: Poprzednia nieprzeczytana wiadomo¶æ

source: N_ext unread message
pl: Nastêpna nieprzeczytana wiadomo¶æ

source: Previous ne_w message
pl: Poprzednia nowa wiadomo¶æ

source: Ne_xt new message
pl: Nastêpna nowa wiadomo¶æ

source: Previous _marked message
pl: Poprzedniej zaznaczonej wiadomo¶ci

source: Next m_arked message
pl: Nastêpnej zaznaczonej wiadomo¶ci

source: Previous _labeled message
pl: Poprzedniej wiadomo¶ci z etykiet±

source: Next la_beled message
pl: Nastêpnej wiadomo¶ci z etykiet±

source: Parent message
pl: Nadrzêdnej wiadomo¶ci

source: Next unread _folder
pl: Nastêpnego katalogu z ni_eprzeczytanymi wiadomo¶ciami

source: _Other folder...
pl: Inny katalog...

source: Previous page
pl: Poprzednia strona

source: Next page
pl: Nastêpna strona

source: Decode
pl: Dekodowanie

source: Open in new _window
pl: Otwórz w _nowym oknie

source: Mess_age source
pl: ¬ród³o wiado_mo¶ci

source: Open
pl: Otwórz

source: Quotes
pl: Cytowanie

source: _Update summary
pl: Od¶wie¿enie _podsumowania

source: Recei_ve
pl: Odbieranie

source: Get from _current account
pl: Pobierz z aktualnego konta

source: Get from _all accounts
pl: Pobierz ze wszystkich kont

source: Cancel receivin_g
pl: Anuluj pobieranie

source: _Send queued messages
pl: Wy¶lij oczekuj±ce wiadomo¶ci

source: Compose a_n email message
pl: Napisz _now± wiadomo¶æ

source: Compose a news message
pl: Tworzy nowego posta

source: _Reply
pl: _Odpowiedz

source: Repl_y to
pl: Odpowiedz do

source: Follow-up and reply to
pl: _Odpowiedz na grupê i nadawcy

source: _Forward
pl: Prze_ka¿

source: For_ward as attachment
pl: Prz_eka¿ jako za³±cznik

source: Redirec_t
pl: Prze_kieruj

source: Mailing-_List
pl: Lista dyskusyjna

source: Post
pl: Wy¶lij

source: Help
pl: Pomo_c

source: Unsubscribe
pl: _Usuñ subskrypcjê

source: View archive
pl: Podgl±d archiwum

source: Contact owner
pl: W³a¶ciciel kontaktu

source: M_ove...
pl: _Przenie¶...

source: _Copy...
pl: _Kopiuj...

source: Move to _trash
pl: Przenie¶ do _kosza

source: _Delete...
pl: _Usuñ...

source: Cancel a news message
pl: Usuñ swojego posta z grup

source: _Mark
pl: _Zaznacz

source: _Unmark
pl: Odznacz

source: Mark as unr_ead
pl: Zaznacz jako nieprzeczytane

source: Mark as rea_d
pl: Zaznacz jako przeczytane

source: Mark all read
pl: _Zaznacz wszystkie jako przeczytane

source: Ignore thread
pl: Ignoruj w±tek

source: Unignore thread
pl: Cofnij ignorowanie w±tku

source: Watch thread
pl: ¦led¼ w±tek

source: Unwatch thread
pl: Cofnij ¶ledzenie w±tku

source: Lock
pl: Zablokowane

source: Unlock
pl: Odblokowanie

source: Color la_bel
pl: Kolor etykiety

source: Ta_gs
pl: _Etykiety

source: Re-_edit
pl: Edytuj ponownie

source: Check signature
pl: Sprawd¼ podpis

source: Add sender to address boo_k
pl: Dodaj nadawcê do ksi±¿ki adresowej...

source: C_ollect addresses
pl: Zbierz adresy

source: _Filter all messages in folder
pl: _Filtruj wszystkie wiadomo¶ci z tego katalogu

source: Filter _selected messages
pl: _Filtruj wybrane wiadomo¶ci

source: Run folder pr_ocessing rules
pl: _Uruchom regu³y przetwarzania katalogu

source: _Create filter rule
pl: Twórz now± regu³ê f_iltra

source: _Automatically
pl: Automatycznie

source: By _From
pl: na podstawie nadawcy

source: By _To
pl: na podstawie adresata

source: By _Subject
pl: na podstawie tematu

source: Create processing rule
pl: Twórz regu³ê przetwarzania

source: List _URLs...
pl: Wy¶wietl URLe...

source: Ch_eck for new messages in all folders
pl: Sprawdzanie za nowymi wiadomo¶ciami we wszystkich folderach...

source: Delete du_plicated messages
pl: Usuñ _duplikaty wiadomo¶ci

source: In selected folder
pl: w wybranym katalogu

source: In all folders
pl: we wszystkich katalogach

source: E_xecute
pl: Wykonaj

source: Exp_unge
pl: Anuluj

source: SSL cer_tificates
pl: Certyfikaty SSL

source: Filtering Lo_g
pl: Dziennik filtrowania

source: Network _Log
pl: Dziennik sieci

source: _Forget all session passwords
pl: Wykasowanie wszystkich zapamiêtanych hase³ sesji

source: C_hange current account
pl: Zmieñ bie¿±_ce konto

source: _Preferences for current account...
pl: _Ustawienia dla bie¿±cego konta...

source: Create _new account...
pl: Utwórz _nowe konto...

source: _Edit accounts...
pl: Edycja kont...

source: P_references...
pl: Ustawienia...

source: Pre-pr_ocessing...
pl: Przetwarzanie wstêpne...

source: Post-pro_cessing...
pl: _Post-przetwarzanie...

source: _Filtering...
pl: Filtrowanie...

source: _Templates...
pl: Wzorce...

source: _Actions...
pl: Akcje...

source: Tag_s...
pl: Etykiety...

source: Plu_gins...
pl: Wtyczki...

source: _Manual
pl: _Podrêcznik u¿ytkownika

source: _Online User-contributed FAQ
pl: _FAQ w internecie

source: Icon _Legend
pl: Opis ikon

source: Set as default client
pl: Ustaw jako domy¶lne konto

source: Offline _mode
pl: Tryb offline

source: _Message view
pl: Widok wiadomo¶ci

source: Status _bar
pl: Pasek stanu

source: Column headers
pl: Nag³ówki kolumn

source: Th_read view
pl: W±_tkuj widok

source: _Hide read messages
pl: _Ukryj przeczytane wiadomo¶ci

source: Hide deleted messages
pl: Ukryj usuniête wiadomo¶ci

source: _Fullscreen
pl: _Pe³ny ekran

source: Show all _headers
pl: Poka¿ wszystkie na_g³ówki

source: Text _below icons
pl: Tekst pod ikonkami

source: Text be_side icons
pl: Tekst obok ikon

source: _Icons only
pl: Tylko Ikony

source: _Text only
pl: Tylko tekst

source: _Standard
pl: _Standardowy

source: _Three columns
pl: _Trzy kolumny

source: _Wide message
pl: Szeroki obszar wiadomo¶ci

source: W_ide message list
pl: Szeroka lista wiadomo¶ci

source: S_mall screen
pl: _Ma³y ekran

source: D_on't sort
pl: Brak sortowania

source: Ascending
pl: Rosn±co

source: Descending
pl: Malej±co

source: _Auto detect
pl: _Automatyczna detekcja

source: Apply tags...
pl: Przypisz etykiety...

source: Some error(s) happened. Click here to view log.
pl: Pojawi³ siê b³±d. Naci¶nij tutaj aby zobaczyæ dziennik.

source: You are online. Click the icon to go offline
pl: Jeste¶ teraz w trybie po³±czenia z sieci± (online). Klikniêcie na tê ikonkê spowoduje przej¶cie do trybu pracy bez po³±czenia z sieci± (offline)

source: You are offline. Click the icon to go online
pl: Pracujesz teraz w trybie bez po³±czenia z sieci± (offline). Klikniêcie na tê ikonkê spowoduje przej¶cie do trybu po³±czenia z sieci± (online)

source: Select account
pl: Wybierz konto

source: Network log
pl: Dziennik sieci

source: filtering log enabled
pl: logowanie filtrów w³±czone

source: filtering log disabled
pl: logowanie filtrów wy³±czone

source: Untitled
pl: Bez tytu³u

source: none
pl: ¿aden

source: Delete all messages in trash folders?
pl: Usun±æ wszystkie wiadomo¶ci z kosza?

source: Don't quit
pl: Nie zamykaj

source: Add mailbox
pl: Dodaj skrzynkê

source: Input the location of mailbox. If an existing mailbox is specified, it will be scanned automatically.
pl: Wprowad¼ miejsce skrzynki. Je¶li podasz istniej±c± skrzynkê, zostanie ona automatycznie przeskanowana.

source: The mailbox '%s' already exists.
pl: Skrzynka `%s' ju¿ istnieje.

source: Mailbox
pl: Skrzynka

source: Creation of the mailbox failed. Maybe some files already exist, or you don't have the permission to write there.
pl: B³±d tworzenia skrzynki. Byæ mo¿e pliki ju¿ istniej± lub nie masz praw do zapisu w tym miejscu

source: No posting allowed
pl: Wysy³anie zabronione

source: Mbox import has failed.
pl: Import z mbox nie powiód³ siê.

source: Export to mbox has failed.
pl: Nie uda³o siê wyeksportowaæ danych do pliku mbox.

source: Exit
pl: Koniec

source: Exit Claws Mail?
pl: Zakoñczyæ pracê z Claws Mail?

source: Folder synchronisation
pl: Synchronizacja katalogów

source: Do you want to synchronise your folders now?
pl: Czy chcesz zsynchronizowaæ swoje katalogi?

source: +_Synchronise
pl: +_Synchronizuj

source: Deleting duplicated messages...
pl: Kasowanie powielonych wiadomo¶ci...

source: Deleted %d duplicate message in %d folders.
pl: Kasowanie %d powielonej wiadomo¶ci z %d katalogów.

source: Processing rules to apply before folder rules
pl: Regu³y przetwarzania, które bêd± zastosowane przed przetwarzaniem w folderach

source: Processing rules to apply after folder rules
pl: Regu³y przetwarzania, które bêd± zastosowane po przetwarzaniu w folderach

source: Filtering configuration
pl: Konfiguracja filtrowania

source: Can not register as default client: impossible to get executable path.
pl: Nie mo¿na zarejestrowaæ jako domy¶lnego klienta: pobieranie ¶cie¿ki wykonania niemo¿liwe.

source: Claws Mail has been registered as default client.
pl: Claws Mail zosta³ zarejestrowany jako klient domyslny.

source: Can not register as default client: impossible to write to the registry.
pl: Nie mo¿na zarejestrowaæ jako domy¶lnego klienta: nie mo¿na zapisywaæ do rejestru.

source: Forgotten %d password in %d accounts.
pl: Skasowano %d has³o z %d konta.

source: %s header
pl: nag³ówek %s

source: header
pl: nag³ówek

source: header line
pl: linia z nag³ówka

source: body line
pl: linia tre¶ci wiadomo¶ci

source: Case sensitive
pl: Rozró¿nianie wielko¶ci liter

source: Case insensitive
pl: Brak rozró¿niania wielko¶ci liter

source: checking if message matches [ %s ]
pl: sprawdzanie czy wiadomo¶ci pasuj± [ %s ]

source: message matches
pl: wiadomo¶ci pasuj±

source: message does not match
pl: Nie znaleziono dopasowañ.

source: (none)
pl: (¿aden)

source: Could not open mbox file: %s
pl: Nie mo¿na otworzyæ pliku mbox: %s

source: Importing from mbox... (%d mails imported)
pl: Importowanie z pliku mbox... (zaimportowano %d)

source: Overwrite mbox file
pl: Nadpisaæ istniej±cy plik mbox?

source: This file already exists. Do you want to overwrite it?
pl: Ten plik ju¿ istnieje. Czy chcesz go nadpisaæ?

source: Overwrite
pl: Nadpisz

source: Could not create mbox file: %s
pl: Nie mo¿na utworzyæ pliku mbox: %s

source: Exporting to mbox...
pl: Eksportowanie do pliku mbox...

source: Find in current message
pl: Znajd¼ w bie¿±cych wiadomo¶ciach

source: Find text:
pl: Znajd¼ tekst:

source: Search failed
pl: Poszukiwanie nie powiod³o siê

source: Search string not found.
pl: Nie znaleziono szukanego ci±gu.

source: Beginning of message reached; continue from end?
pl: Osi±gniêto pocz±tek wiadomo¶ci; zacz±æ od koñca?

source: End of message reached; continue from beginning?
pl: Osi±gniêto koniec wiadomo¶ci; zacz±æ od pocz±tku?

source: Search finished
pl: Przeszukiwanie zakoñczone

source: Compose _new message
pl: Twórz _now± wiadomo¶æ

source: Claws Mail - Message View
pl: Claws Mail - Widok wiadomo¶ci

source: <No Return-Path found>
pl: <Nie znaleziono ¶cie¿ki powrotnej>

source: The notification address to which the return receipt is to be sent does not correspond to the return path: Notification address: %s Return path: %s It is advised to not to send the return receipt.
pl: Adres na, który ma byæ wys³ane potwierdzenie odbioru nie zgadza siê z adresem, z którego nadano wiadomo¶æ. Adres któremu ma zostaæ wys³ane potwierdzenie: %s Adres ¶cie¿ki zwrotu: %s Nie jest zalecane by wysy³aæ potwierdzenie odbioru.

source: _Don't Send
pl: _Nie wysy³aj

source: This message is asking for a return receipt notification but according to its 'To:' and 'CC:' headers it was not officially addressed to you. It is advised to not to send the return receipt.
pl: Autor tej wiadomo¶æ prosi³ o potwierdzenie odbioru. Zawarto¶æ nag³ówków (Pola "Do" i "Kopia do") wskazuj±, ¿e nie by³a¶/by³e¶ oficjalnym odbiorc± tej wiadomo¶ci. Zaleca siê nie potwierdzanie odbioru takich wiadomo¶ci.

source: Fetching message (%s)...
pl: Odbieranie wiadomo¶ci (%s)...

source: Couldn't decrypt: %s
pl: Nie mo¿na odszyfrowaæ: %s

source: Message doesn't conform to MIME standard. It may render wrongly.
pl: Wiadomo¶æ nie odpowiada standardom MIME. Mo¿e zostaæ nieprawid³owo pokazana.

source: Save as
pl: Zapisz jako

source: Overwrite existing file?
pl: Nadpisaæ istniej±cy plik?

source: Couldn't save the file '%s'.
pl: Nie mo¿na zapisaæ pliku '%s'.

source: Show all %s.
pl: Poka¿ wszystkie %s.

source: Only the first megabyte of text is shown.
pl: Wy¶wietlono tylko pierwszy megabajt tekstu.

source: You got a return receipt for this message : it has been displayed by the recipient.
pl: Otrzyma³e¶ potwierdzenie odbioru tej wiadomo¶ci :zosta³a pokazana wg odbiorcy.

source: You asked for a return receipt in this message.
pl: Autor tej wiadomo¶ci prosi³ o potwierdzenie dostarczenia.

source: This message asks for a return receipt.
pl: Autor tej wiadomo¶ci prosi³ o potwierdzenie dostarczenia.

source: Send receipt
pl: Wy¶lij potwierdzenie

source: This message has been partially retrieved, and has been deleted from the server.
pl: Ta wiadomo¶æ zosta³a pobrana czê¶ciowo i zosta³a skasowana z serwera

source: This message has been partially retrieved; it is %s.
pl: Wiadomo¶æ zosta³a czê¶ciowo pobrana, porzuciæ jej fragmenty - %s?

source: Mark for download
pl: Oznacz do pobrania

source: Mark for deletion
pl: Oznacz do usuniêcia

source: This message has been partially retrieved; it is %s and will be downloaded.
pl: Ta wiadomo¶æ zosta³a czê¶ciowo pobrana; jej %s zostanie pobrane.

source: Unmark
pl: Odznacz

source: This message has been partially retrieved; it is %s and will be deleted.
pl: Ta wiadomo¶æ zosta³a czê¶ciowo pobrana; zawiera %s i zostanie usuniêta.

source: Return Receipt Notification
pl: Potwierdzenie Odbioru Wiadomo¶ci

source: The message was sent to several of your accounts. Please choose which account do you want to use for sending the receipt notification:
pl: Wiadomo¶æ zosta³a wys³ana do wielu z Twoich kont. Proszê sprecyzowaæ którego konta chcesz u¿yæ do wys³ania potwierdzenia odbioru:

source: _Cancel
pl: _Anuluj

source: _Send Notification
pl: Wy¶lij _potwierdzenie odbioru

source: Cannot print: the message doesn't contain text.
pl: Nie mo¿na wydrukowaæ: wiadomo¶æ nie zawiera tekstu.

source: An error happened while learning.
pl: B³±d podczas uczenia.

source: can't copy message %s to %s
pl: nie mo¿na skopiowaæ %s do %s

source: Moving messages...
pl: Przenoszenie wiadomo¶ci...

source: Deleting messages...
pl: Usuwanie wiadomo¶ci...

source: Remove _mailbox...
pl: Usuñ _skrzynkê...

source: Really remove the mailbox '%s' ? (The messages are NOT deleted from the disk)
pl: Naprawdê chcesz usun±æ skrzynkê `%s' ? (Wiadomo¶ci NIE zostan± skasowane z dysku)

source: Remove mailbox
pl: Usuñ skrzynkê

source: _Save as...
pl: Zapi_sz jako...

source: Save _all...
pl: Zapi_sz wszystko...

source: MIME Type
pl: Typ MIME

source: View full information
pl: Wy¶wietl pe³ne informacje

source: Check again
pl: Sprawd¼ ponownie

source: Click the icon or hit 'C' to check it.
pl: Kliknij na ikonkê, lub wci¶nij klawisz 'C' aby go sprawdziæ.

source: Timeout checking the signature. Click the icon or hit 'C' to try again.
pl: Proces weryfikacji podpisu trwa³ zbyt d³ugo i zosta³ przerwany. Kliknij na ikonkê, lub wci¶nij klawisz 'C' aby ponowiæ tê operacjê.

source: Checking signature...
pl: Sprawdzanie podpisu...

source: Go back to email
pl: Powrót do wiadomo¶ci email

source: Couldn't save the part of multipart message: %s
pl: Nie mo¿na zapisaæ czê¶ci wiadomo¶ci wieloczê¶ciowej: %s

source: Overwrite existing file '%s'?
pl: Nadpisaæ istniej±cy plik '%s'?

source: Select destination folder
pl: Wybierz katalog docelowy

source: '%s' is not a directory.
pl: "%s" nie jest katalogiem.

source: No registered viewer for this file type.
pl: Brak zarejstrowanego programu do przegl±danie plików tego typu.

source: Open with
pl: Otwórz z

source: Enter the command-line to open file: ('%s' will be replaced with file name)
pl: Wprowad¼ nazwê programu, którym chcesz otworzyæ ten plik: ('%s' zostanie zast±pione nazw± pliku)

source: Execute untrusted binary?
pl: Uruchomiæ niepewny plik binarny?

source: This attachment is an executable file. Executing untrusted binaries is dangerous and could probably lead to compromission of your computer. Do you want to run this file?
pl: Ten za³±cznik jest plikiem wykonywalnym. Uruchamianie niepewnych plików binarnych jest niebezpieczne i mo¿e naraziæ na w³±manie twój komputer. Czy chcesz uruchomiæ ten plik?

source: Run binary
pl: Uruchom plik binarny

source: Error logging in to %s:%d ...
pl: B³±d podczas logowania do %s:%d ...

source: Error authenticating to %s:%d ...
pl: B³±d autoryzacji z serwrem %s:%d ...

source: Claws Mail needs network access in order to access the News server.
pl: Claws Mail potrzebuje po³±czenia z sieci± aby uzyskaæ dostêp do serwera news.

source: NNTP connection to %s:%d has been disconnected. Reconnecting...
pl: Po³±czenie NNTP do %s:%d zosta³o przerwane. £±czê jeszcze raz...

source: couldn't select group: %s
pl: nie mo¿na wybraæ grupy: %s

source: couldn't set group: %s
pl: nie mo¿na ustawiæ grupy: %s

source: invalid article range: %d - %d
pl: niepoprawny zakres artyku³u: %d - %d

source: couldn't get xhdr
pl: nie mo¿na pobraæ xhdr

source: getting xover %d - %d in %s...
pl: pobieranie xover %d - %d w %s...

source: couldn't get xover
pl: nie mo¿na pobraæ xover

source: invalid xover line
pl: niepoprawna linia xover:

source: You have one or more News accounts defined. However this version of Claws Mail has been built without News support; your News account(s) are disabled. You probably need to install libetpan and recompile Claws Mail.
pl: Masz zdefiniowane jedno lub wiêcej kont News. Jednak ta wersja Claws Mail zosta³a zbudowana bez obs³ugi News; Twoje konta NNTP zosta³y zdezaktywowane. Prawdopodobnie potrzebujesz zainstalowaæ libtepan lub przekompilowaæ Claws Mail.

source: _Subscribe to newsgroup...
pl: _Subskrybuj grupê news...

source: _Unsubscribe newsgroup
pl: _Odsubskrybuj grupê news

source: Really unsubscribe newsgroup '%s'?
pl: Naprawdê chcesz zakoñczyæ subskrypcjê grupy "%s" ?

source: Unsubscribe newsgroup
pl: Usuñ subskrypcjê grupê news

source: _Unsubscribe
pl: _Usuñ subskrypcjê grupy news

source: Rename newsgroup folder
pl: Zmieñ nazwê folderu grupy news

source: Bogofilter: fetching bodies...
pl: Bogofilter: pobiernie tre¶ci wiadomo¶ci...

source: Bogofilter: filtering messages...
pl: Bogofilter: filtrowanie wiadomo¶ci...

source: The Bogofilter plugin couldn't filter a message. The probable cause of the error is that it didn't learn from any mail. Use "/Mark/Mark as spam" and "/Mark/Mark as ham" to train Bogofilter with a few hundred spam and ham messages.
pl: Wtyczka Bogofilter nie mo¿e filtrowaæ wiadomo¶ci. Prawdopodobn± przyczyn± b³êdu jest to, ¿e rozpoznawa³ on jeszcze ¿adnych wiadomo¶ci. U¿yj"/Zaznacz/Zaznacz jako spam" i "/Zaznacz/Zaznacz jako dobra" by wytrenowaæ Bogofilter kilkuset wiadomo¶ciami spam i dobrymi.

source: The Bogofilter plugin couldn't filter a message. The command `%s %s %s` couldn't be run.
pl: Wtyczka Bogofilter nie mo¿e filtrowaæ wiadomo¶ci. Komenda '%s %s %s' nie mo¿e byæ uruchomiona.

source: Bogofilter: learning from message...
pl: Bogofilter: rozpoznawanie wiadomo¶ci...

source: Learning failed; `%s` returned with status %d.
pl: Rozpoznawanie nie powiod³o siê, %s zwróci³ status %d.

source: Bogofilter: learning from messages...
pl: Bogofilter: rozpoznawanie wiadomo¶ci...

source: Learning failed; `%s %s %s` returned with error: %s
pl: Rozpoznawanie nie powiod³o siê, '%s %s %s' zwróci³ b³±d: %s

source: Unknown error
pl: Nieznany b³±d

source: This plugin can check all messages that are received from an IMAP, LOCAL or POP account for spam using Bogofilter. You will need Bogofilter installed locally. Before Bogofilter can recognize spam messages, you have to train it by marking a few hundred spam and ham messages with the use of "/Mark/Mark as spam" and "/Mark/Mark as ham". When a message is identified as spam it can be deleted or saved in a specially designated folder. Options can be found in /Configuration/Preferences/Plugins/Bogofilter
pl: Ta wtyczka sprawdza wszystkie wiadomo¶ci, otrzymywane z kont IMAP, LOCAL lub POP w poszukiwaniu spamu u¿ywaj±c Bogofilter. Bêdziesz potrzebowa³ zainstalowanego Bogofilter. Zanim Bogofilter bêdzie móg³ rozpoznawaæ spam, musisz go wytrenowaæ poprzez zaznaczenie kilkuset wiadomo¶ci dobrych i niechcianych (spamu) u¿ywaj±c menu "/Zaznacz/Zaznacz jako spam" i "/Zaznacz/Zaznacz jako dobr±". Gdy wiadomo¶æ jest rozpoznana jako spam mo¿ê zostaæ usuniêta lub zapisana w specjalnym do tego przeznaczonym katalogu. Opcje wtyczki znajduj± siê w /Konfiguracja/Ustawienia/Wtyczki/Bogofilter

source: Spam detection
pl: Wykrywanie spamu

source: Spam learning
pl: Rozpoznawanie spamu

source: Process messages on receiving
pl: Przetwarzanie wiadomo¶ci podczas odbierania

source: Maximum size
pl: Maksymalny rozmiar

source: Messages larger than this will not be checked
pl: Wiadomo¶ci wiêksze ni¿ ta nie zostan± sprawdzone

source: Save spam in
pl: Zapisywanie spamu w

source: Folder for storing identified spam. Leave empty to use the trash folder.
pl: Katalog do zapisywania zidentyfikowanego spamu. Zostaw puste aby u¿yæ domy¶lnego katalogu dla ¶mieci.

source: Click this button to select a folder for storing spam
pl: Naci¶nij tutaj aby zaznaczyæ katalog do zapisywania spamu

source: When unsure, move to
pl: W razie niepewno¶ci przenoszenie do

source: Folder for storing mail for which spam status is Unsure. Leave empty to use the Inbox folder.
pl: Katalog do zapisywania wiadomo¶ci okre¶lonych jako niepewne. Zostaw puste aby u¿yæ katalogu Przychodz±ca.

source: Click this button to select a folder for storing Unsure mails.
pl: Kliknij na ten przycisk aby wybraæ katalog do zapisywania niepewnychwiadomo¶ci
