Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: Bold
pl: Pogrubione

source: Use different font for printing
pl: U¿ywaj innej czcionki do wydruków

source: Message Printing
pl: Drukowanie wiadomo¶ci

source: Display
pl: Wy¶wietlanie

source: Fonts
pl: Czcionki

source: Preferences
pl: Ustawienia

source: Automatically display attached images
pl: Automatyczne wy¶wietlanie za³±czonych obrazów

source: Resize attached images by default
pl: Automatyczne skalowanie za³±czonych obrazków

source: Clicking image toggles scaling
pl: Klikniêcie w³±cza skalowanie

source: Display images inline
pl: Wy¶wietlanie obrazków wewn±trz wiadomo¶ci

source: Print images
pl: Drukuj obrazki

source: Image Viewer
pl: Przegl±darka obrazów

source: Restrict the log window to
pl: Ogranicz wielko¶æ okna dziennika do

source: 0 to stop logging in the log window
pl: 0 by zatrzymaæ komunikaty w oknie dziennika

source: lines
pl: linie

source: Filtering/processing log
pl: Dziennik filtrowania/przetwarzania

source: Enable logging of filtering/processing rules
pl: W³±czenie dziennika filtrowania/przetwarzania

source: If checked, turns on logging of filtering and processing rules. The log is accessible from 'Tools/Filtering log'. Caution: enabling this option will slow down the filtering/processing, this might be critical when applying many rules upon thousands of messages.
pl: Gdy ta opcja jest w³±czona wszystkie operacje filtrowania i przetwarzania wiadomo¶æ bêd± zapisywana do odpowiedniego dziennika zdarzeñ. Mo¿na go w dowolnej chwili przejrzeæ wybieraj±c z menu Narzêdzia Dziennik filtrów/Dziennik przetwarzania. Nale¿y pamiêtaæ w³±czenie tej opcji mo¿e spowodowaæ spowolnienie procesów filtrowania/przetwarzania zw³aszcza gdy ilo¶æ wiadomo¶ci przekracza tysi±c.

source: Log filtering/processing when...
pl: Zapisuj do dziennik filtrowania/przetwarzania podczas..

source: filtering at incorporation
pl: filtrowania przy odbieraniu

source: pre-processing folders
pl: wstêpnego przetwarzania katalogów

source: manually filtering
pl: rêcznego filtrowania

source: post-processing folders
pl: ostatecznego przetwarzania katalogów

source: processing folders
pl: przetwarzania katalogów

source: Log level
pl: Poziom dziennika

source: Low
pl: Niski

source: Medium
pl: ¦redni

source: High
pl: Wysoki

source: Select the level of detail of the logging. Choose Low to see when rules are applied, which conditions match or don't match and what actions are performed. Choose Medium to see more details about the message that is being processed, and why rules are skipped. Choose High to explicitly show the reason why all rules are processed or skipped, and why all conditions are matched or not matched. Caution: the higher the level, the greater the impact on performance.
pl: Wybierz poziom szczegó³owo¶ci logowania w dzienniku. Wybierz Niski, aby widzieæ, kiedy s± stosowane regu³y, które warunki pasuj± a które nie i jakie akcje s± podejmowane. Wybierz ¦redni, aby widzieæ wiêcej szczegó³ów o wiadomo¶ciach, które s± przetwarzane i dlaczego regu³y s± pomijane. Wybierz Wysoki, aby dok³adnie pokazaæ powód, dla którego wszystkie regu³y s± stosowane lub pomijane, oraz dlaczego warunki pasuj± b±d¼ nie. Uwaga: im wy¿szy poziom logowania, tym wiêkszy wp³yw na wydajno¶æ.

source: Disk log
pl: Dziennik zapisany na dysk

source: Write the following information to disk...
pl: Zapisywanie poni¿szych informacji na dysk...

source: Warning messages
pl: Ostrze¿enia

source: Network protocol messages
pl: Komunikaty protoko³u sieciowego

source: Error messages
pl: Komunikaty o b³êdach

source: Status messages for filtering/processing log
pl: Informacje o stanie filtrowania/przetwarzania

source: Other
pl: Inne

source: Logging
pl: Dziennik zdarzeñ

source: more than
pl: wiêcej ni¿

source: less than
pl: mniej ni¿

source: weeks
pl: tygodni

source: higher than
pl: wy¿sza ni¿

source: lower than
pl: mniejsza ni¿

source: exactly
pl: równa dok³adnie

source: greater than
pl: wiêksza ni¿

source: smaller than
pl: mniejsza ni¿

source: bytes
pl: bajtów

source: kilobytes
pl: kilobajtów

source: megabytes
pl: megabajtów

source: contains
pl: zawiera

source: doesn't contain
pl: nie zawiera

source: headers part
pl: czê¶æ nag³ówka

source: body part
pl: tre¶æ wiadomo¶ci

source: whole message
pl: ca³a wiadomo¶æ

source: Marked
pl: Zaznacz

source: Deleted
pl: Usuniête

source: Replied
pl: Odpowiedziane

source: Forwarded
pl: Przekazane

source: Signed
pl: Podpisane

source: set
pl: ustaw

source: not set
pl: nie ustawiony

source: yes
pl: tak

source: no
pl: nie

source: Any tags
pl: Dowolne etykiety

source: Specific tag
pl: Wybrana etykieta

source: ignored
pl: ignorowane

source: not ignored
pl: nie ignorowane

source: watched
pl: ¶ledzone w±tki

source: not watched
pl: nie ¶ledzone

source: found
pl: znalezione

source: not found
pl: nie znalezione

source: 0 (Passed)
pl: 0 (Sukces)

source: non-0 (Failed)
pl: nie-0 (Nieudane)

source: Condition configuration
pl: Konfiguracja warunków

source: Match criteria:
pl: Dopasuj kryteria:

source: All messages
pl: Wszystkie wiadomo¶ci

source: Age
pl: Wiek

source: Phrase
pl: Fraza

source: Flags
pl: Flagi

source: Color labels
pl: Kolorowe etykiety

source: Thread
pl: W±tek

source: Partially downloaded
pl: Czê¶ciowo pobrane

source: External program test
pl: Test zewnêtrznym programem

source: Filtering Matcher Menu|All
pl: Wszystkie

source: Use regexp
pl: U¿yj wyra¿enia regularnego

source: Message must match
pl: Wiadomo¶æ musi pasowaæ

source: at least one
pl: przynajmniej jeden

source: all
pl: wszystkie

source: of above rules
pl: z powy¿szych regu³

source: Search pattern is not set.
pl: Wzorzec do poszukiwañ nie zosta³ ustawiony.

source: Test command is not set.
pl: Komenda testowa nie zosta³a ustawiona.

source: all addresses in all headers
pl: wszystkie adresy we wszystkich nag³ówkach

source: any address in any header
pl: jakikolwiek adres w jakimkolwiek nag³ówku

source: the address(es) in header '%s'
pl: adres(y) w nag³ówku '%s'

source: Book/folder path is not set. If you want to match %s against the whole address book, you have to select '%s' from the book/folder drop-down list.
pl: ¦cie¿ka do ksi±¿ki/katalogu nie jest ustawiona. Je¿eli chcesz szukaæ %s w ca³ej ksi±¿ce adresowej, wybierz '%s' z listy ksi±¿ek/katalogów.

source: Headers part
pl: Czê¶æ nag³ówka

source: Body part
pl: Czê¶æ wiadomo¶ci

source: Whole message
pl: Ca³a wiadomo¶æ

source: in
pl: w

source: content is
pl: tre¶æ jest

source: Age is
pl: Wiek jest

source: Flag
pl: Flaga

source: is
pl: jest

source: Name:
pl: Nazwa:

source: Label
pl: Etykieta

source: Value:
pl: Warto¶æ:

source: Score is
pl: Punktacja jest

source: points
pl: punkty

source: Size is
pl: Wielko¶æ

source: Scope:
pl: Zakres:

source: tags
pl: etykiety

source: type is
pl: rodzaj

source: Program returns
pl: Program zwraca

source: The entry was not saved. Close anyway?
pl: Wpis nie zapisany. Naprawdê zamkn±æ?

source: Match Type: 'Test'
pl: Rodzaj dopasowania: 'Test'

source: 'Test' allows you to test a message or message element using an external program or script. The program will return either 0 or 1. The following symbols can be used:
pl: 'Test' umo¿liwia przetestowanie wiadomo¶ci lub elementu wiadomo¶ci u¿ywaj±c zewnêtrznego programu lub skryptu. Program zwróci warto¶æ 0 lub 1. Mog± zostaæ u¿yte nastêpuj±ce symbole:

source: Current condition rules
pl: Obecne regu³y warunków

source: Headers
pl: Nag³ówki

source: Display header pane above message view
pl: Wy¶wietlanie panelu nag³ówków powy¿ej okna wiadomo¶ci

source: Display (X-)Face in message view
pl: Wy¶wietlanie obrazków X-Face w podgl±dzie wiadomo¶ci

source: Display Face in message view
pl: Wy¶wietlanie bu¼ki w widoku wiadomo¶ci

source: Display headers in message view
pl: Pokazywanie krótkich nag³ówków w widoku wiadomo¶ci

source: HTML messages
pl: Wiadomo¶ci HTML

source: Render HTML messages as text
pl: Przetwarzanie wiadomo¶ci HTML do czystego tekstu

source: Render HTML-only messages with plugin if possible
pl: Przetwarzanie wiadomo¶ci HTML za pomoc± wtyczki je¶li to mo¿liwe

source: Select the HTML part of multipart/alternative messages
pl: Wybierz czê¶æ HTML z wieloczê¶ciowych wiadomo¶ci

source: Line space
pl: Odstêpy miêdzy liniami

source: pixel(s)
pl: piksel(e)

source: Scroll
pl: Przewijanie

source: Half page
pl: Pó³ strony

source: Smooth scroll
pl: P³ynne przewijanie

source: Step
pl: Krok

source: Show attachment descriptions (rather than names)
pl: Pokazywanie opisów za³±czników (a nie nazwy)

source: Treat these characters as quotation marks:
pl: Traktuj te znaki jako znaczniki cytatu:

source: Text Options
pl: Opcje tekstowe

source: Message view
pl: Widok wiadomo¶ci

source: Enable coloration of message text
pl: Kolorowanie tekstu wiadomo¶ci

source: Quote
pl: Cytowanie

source: Cycle quote colors
pl: Powtarzanie kolorów cytatów

source: If there are more than 3 quote levels, the colors will be reused
pl: Je¶li wystêpuj± wiêcej ni¿ 3 poziomy cytowania kolory zostan± u¿yte ponownie

source: 1st Level
pl: Pierwszy poziom

source: Text
pl: Tekst

source: Tooltip|Pick color for 1st level text
pl: Wybierz kolor dla pierwszego poziomu tekstu

source: 2nd Level
pl: Drugi poziom

source: Tooltip|Pick color for 2nd level text
pl: Wybierz kolor dla trzeciego poziomu tekstu

source: 3rd Level
pl: Trzeci poziom

source: Tooltip|Pick color for 3rd level text
pl: Wybierz kolor dla pierwszego poziomu tekstu

source: Enable coloration of text background
pl: W³±cz kolorowanie t³a tekstu wiadomo¶ci

source: Tooltip|Pick color for 1st level text background
pl: Wybierz kolor dla pierwszego poziomu t³a

source: Background
pl: T³o

source: Tooltip|Pick color for 2nd level text background
pl: Wybierz kolor dla drugiego poziomu t³a

source: Tooltip|Pick color for 3rd level text background
pl: Wybierz kolor dla trzeciego poziomu t³a

source: Tooltip|Pick color for links
pl: Wybierz kolor linków

source: URI link
pl: £±cze URI

source: Tooltip|Pick color for signatures
pl: Wybierz kolor dla sygnaturek

source: Signatures
pl: Podpisy

source: Folder list
pl: Lista katalogów

source: Pick color for Target folder. Target folder is used when the option 'Execute immediately when moving or deleting messages' is turned off
pl: Wybierz kolor dla katalogu docelowego. Katalog docelowy jest u¿ywany gdy opcja 'Natychmiastowe wykonywanie dzia³añ przenoszenia lub kasowania wiadomo¶ci' jest wy³±czona

source: Target folder
pl: Katalog docelowy

source: Pick color for folders containing new messages
pl: Katalog zawieraj±cy nowe wiadomo¶ci

source: Folder containing new messages
pl: Katalog zawiera nowe wiadomo¶ci

source: Tooltip|Pick color for 'color %d'
pl: Wybierz kolor dla 'color %d'

source: Set label for 'color %d'
pl: Wybierz kolor dla 'color %d'

source: Dialog title|Pick color for 'color %d'
pl: Wybór koloru dla 'color %d'

source: Dialog title|Pick color for 1st level text
pl: Wybór koloru dla pierwszego poziomu tekstu

source: Dialog title|Pick color for 2nd level text
pl: Wybierz kolor dla drugiego poziomu tekstu

source: Dialog title|Pick color for 3rd level text
pl: Wybierz kolor dla trzeciego poziomu tekstu

source: Dialog title|Pick color for 1st level text background
pl: Wybierz kolor dla pierwszego poziomu t³a

source: Dialog title|Pick color for 2nd level text background
pl: Wybierz kolor dla drugiego poziomu t³a

source: Dialog title|Pick color for 3rd level text background
pl: Wybierz kolor dla trzeciego poziomu t³a

source: Dialog title|Pick color for links
pl: Wybierz kolor linków

source: Dialog title|Pick color for target folder
pl: Wybierz kolor dla docelowego katalogu

source: Dialog title|Pick color for signatures
pl: Wybierz kolor dla sygnaturek

source: Dialog title|Pick color for folder
pl: Wybierz kolor dla katalogu

source: Colors
pl: Kolory

source: Choose preset keyboard shortcuts
pl: Wybierz zestaw skróty klawiszowych

source: Select preset:
pl: Wybierz ustawienie:

source: You can also modify each menu shortcut by pressing any key(s) when focusing the mouse pointer on the item.
pl: Poza wyborem predefiniowanych zestawów skrótów klawiszowych mo¿na równie¿ modyfikowaæ skróty dla poszczególnych operacji dostêpnych w menu. Mo¿na to zrobiæ pod¶wietlaj±c wybran± pozycjê w menu (przesuwaj±c na ni± kursor myszki) i wciskaj±c wybran± kombinacjê klawiszy.

source: Add address to destination when double-clicked
pl: Dwukrotne klikniêcie dodaje adres do pola "Do" wiadomo¶ci

source: On exit
pl: Podczas wyj¶cia

source: Confirm on exit
pl: Potwierdzanie wyj¶cia

source: Empty trash on exit
pl: Opró¿nianie wysypiska przy wyj¶ciu

source: Warn if there are queued messages
pl: Informowanie o wiadomo¶ciach oczekuj±cych w kolejce

source: Keyboard shortcuts
pl: Skróty klawiszowe

source: Enable customisable keyboard shortcuts
pl: W³±cz mo¿liwo¶æ zmiany skrótów klawiszowych

source: If checked, you can change the keyboard shortcuts of most of the menu items by focusing on the menu item and pressing a key combination. Uncheck this option if you want to lock all existing keyboard shortcuts.
pl: Je¶li zaznaczone, mo¿liwe jest zmienianie skrótów klawiszowych wiêkszo¶ci komend w menu poprzez zaznaczenie ich i naci¶niêcie kombinacji klawiszy. Odznacz t± opcjê je¶li chcesz zablokowaæ mo¿liwo¶æ zmiany istniej±cych skrótów.

source: Choose preset keyboard shortcuts...
pl: Wybór pre-definiowanych zestawów skrótów klawiszowych...

source: Metadata handling
pl: Obs³uga metadanych

source: Safer mode asks the OS to write metadata to disk directly; it avoids data loss after crashes but can take some time.
pl: Bezpieczniejszy tryb zleca systemowi operacyjnemu zapisywanie metadanych na dysk bezpo¶rednio; pozwala to unikn±æ utraty danych po awarii, ale zajmuje wiêcej czasu.

source: Safer
pl: Bezpieczniej

source: Faster
pl: Szybciej

source: Socket I/O timeout
pl: Limit czasu operacji wej¶cia/wyj¶cia gniazda

source: Ask before emptying trash
pl: Potwierdzaj opró¿nienie katalogu Wysypisko

source: Ask about account specific filtering rules when filtering manually
pl: Pytaj o specyficzne regu³ki filtrowania konta podczas filtrowania rêcznego

source: Use secure file deletion if possible
pl: U¿ywanie bezpiecznego kasowania plików gdy tylko mo¿liwe

source: Use secure file deletion if possible (the 'shred' program is not available)
pl: U¿ywanie bezpiecznego kasowania plików gdy tylko mo¿liwe (program 'shred' nie jest dostêpny)

source: Use the 'shred' program to overwrite files with random data before deleting them. This slows down deletion. Be sure to read shred's man page for caveats.
pl: U¿ycie programu 'shred' do nadpisywania plików losowymi danymi przed ich usuniêciem. Wolniejsze ni¿ zwyk³e usuwanie. Upewnij siê, ¿e przeczyta³e¶ ostrze¿enia w dokumentacji programu shred.

source: Synchronise offline folders as soon as possible
pl: Synchronizuj katalogi offline tak szybko, jak to mo¿liwe

source: Miscellaneous
pl: Ró¿ne

source: On %d\n%f wrote:\n\n%q
pl: Dnia %D{%F}, o godz. %D{%T}\n%f napisa³(a):\n\n%q

source: External incorporation program
pl: Zewnêtrzny program inkorporacji

source: Use external program for receiving mail
pl: U¿ywanie zewnêtrznego programu do odbierania wiadomo¶ci

source: Automatic checking
pl: Automatyczne sprawdzanie

source: Check for new mail on start-up
pl: Sprawdzanie poczty przy starcie

source: Dialogs
pl: Okna dialogowe

source: Show receive dialog
pl: Pokazuj okno dialogowe przy odbieraniu

source: Always
pl: Zawsze

source: Only on manual receiving
pl: W przypadku rêcznego wywo³ania

source: Close receive dialog when finished
pl: Zamykanie okna pobierania po ukoñczeniu

source: Don't popup error dialog on receive error
pl: Brak okna dialogowego przy b³êdzie odbioru

source: After checking for new mail
pl: Po potrzymaniu nowych wiadomo¶ci

source: Go to Inbox
pl: Przejd¼ do skrzynki odbiorczej

source: Update all local folders
pl: Aktualizacja wszystkich lokalnych katalogów

source: Run command
pl: Uruchom polecenie

source: after automatic check
pl: po automatycznym sprawdzeniu

source: after manual check
pl: po rêcznym sprawdzeniu

source: Command to execute: (use %d as number of new mails)
pl: Komenda do uruchomienia: (u¿yj %d jako numeru nowych wiadomo¶ci)

source: Blink LED
pl: ¦wiecenie diodami LED

source: Play sound
pl: Odtwórz d¼wiêk

source: Show info banner
pl: Pokazuj baner informacyjny

source: Mail Handling
pl: Obs³uga poczty

source: Receiving
pl: Odbieranie

source: Save sent messages to Sent folder
pl: Zapisywanie wys³anych wiadomo¶ci w folderze Wys³ane

source: Confirm before sending queued messages
pl: Potwierdzanie wys³ania oczekuj±cych wiadomo¶ci

source: Never send Return Receipts
pl: Nigdy nie wysy³aj potwierdzeñ dostarczenia

source: Show send dialog
pl: Pokazywanie okna dialogowego przy wysy³aniu

source: Outgoing encoding
pl: Kodowanie znaków wychodz±cych wiadomo¶ci

source: If 'Automatic' is selected, the optimal encoding for the current locale will be used
pl: Je¶li wybrana jest opcja `Automatycznie', zostanie u¿yte optymalne kodowanie na podstawie ustawieñ lokalnych

source: Automatic (Recommended)
pl: Automatycznie (Zalecane)

source: 7bit ASCII (US-ASCII)
pl: 7 bitów ASCII (US-ASCII)

source: Western European (ISO-8859-1)
pl: Europa Zachodnia (ISO-8859-1)

source: Western European (ISO-8859-15)
pl: Europa Zachodnia (ISO-8859-15)

source: Central European (ISO-8859-2)
pl: Europa ¦rodkowa (ISO-8859-2)

source: Baltic (ISO-8859-13)
pl: Kraje Ba³tyckie (ISO-8859-13)

source: Baltic (ISO-8859-4)
pl: Kraje Ba³tyckie (ISO-8859-4)

source: Greek (ISO-8859-7)
pl: Grecja (ISO-8859-7)

source: Hebrew (ISO-8859-8)
pl: Hebrajski (ISO-8859-8)

source: Hebrew (Windows-1255)
pl: Hebrajski (Windows-1255)

source: Arabic (ISO-8859-6)
pl: Arabski (ISO-8859-6)

source: Arabic (Windows-1256)
pl: Arabski (Windows-1256)

source: Turkish (ISO-8859-9)
pl: Turcja (ISO-8859-9)

source: Cyrillic (ISO-8859-5)
pl: Cyrylica (ISO-8859-5)

source: Cyrillic (KOI8-R)
pl: Cyrylica (KOI8-R)

source: Cyrillic (KOI8-U)
pl: Cyrylica (KOI8-U)

source: Cyrillic (Windows-1251)
pl: Cyrylica (Windows-1251)

source: Japanese (ISO-2022-JP)
pl: Japonia (ISO-2022-JP)

source: Japanese (EUC-JP)
pl: Japonia (EUC-JP)

source: Japanese (Shift_JIS)
pl: Japonia (Shift_JIS)

source: Simplified Chinese (GB2312)
pl: Uproszczony Chiñski (GB2312)

source: Simplified Chinese (GBK)
pl: Uproszczony Chiñski (GBK)

source: Traditional Chinese (Big5)
pl: Tradycyjny Chiñski (Big5)

source: Traditional Chinese (EUC-TW)
pl: Tradycyjny Chiñski (EUC-TW)

source: Chinese (ISO-2022-CN)
pl: Chiñski (ISO-2022-CN)

source: Korean (EUC-KR)
pl: Korea (EUC-KR)

source: Thai (TIS-620)
pl: Tajlandzki (TIS-620)

source: Thai (Windows-874)
pl: Tajlandzki (Windows-874)

source: Transfer encoding
pl: Kodowanie transferu

source: Specify Content-Transfer-Encoding used when message body contains non-ASCII characters
pl: Wybierz Kodowanie transferu (Content-Transfer-Encoding) dla wiadomo¶æ zawieraj±cych znaki odmienne od formatu ASCII

source: Sending
pl: Wysy³anie

source: Pick color for misspelled word
pl: Wybierz kolor dla wyrazu o z³ej pisowni

source: Enable spell checker
pl: W³±cz sprawdzanie pisowni

source: Enable alternate dictionary
pl: W³±cz alternatywny s³ownik

source: Faster switching with last used dictionary
pl: Pozwala na szybsze prze³±czanie pomiêdzy u¿ywanymi s³ownikami.

source: Automatic spell checking
pl: Automatyczne sprawdzanie pisowni

source: Re-check message when changing dictionary
pl: Ponowne sprawdzanie wiadomo¶æ po zmianie s³ownika

source: Dictionary
pl: S³ownik

source: Check with both dictionaries
pl: Sprawd¼ w obu s³ownikach

source: Misspelled word color
pl: Kolor b³êdnie napisanego wyrazu:

source: Pick color for misspelled word. Use black to underline
pl: Wybierz kolor dla wyrazu o z³ej pisowni. Wybierz czarny aby podkre¶laæ

source: Spell Checking
pl: Sprawdzanie pisowni

source: the full weekday name
pl: pe³na nazwa dnia

source: the abbreviated month name
pl: pe³na skrócona nazwa miesi±ca

source: the full month name
pl: pe³na nazwa miesi±ca

source: the preferred date and time for the current locale
pl: preferowany czas i data dla bie¿±cego locale

source: the century number (year/100)
pl: numer wieku (rok/100)

source: the day of the month as a decimal number
pl: dzieñ jako liczba

source: the hour as a decimal number using a 24-hour clock
pl: godzina jako numer (zegar 24 godzinny)

source: the hour as a decimal number using a 12-hour clock
pl: godzina jako numer (zegar 12 godzinny)

source: the day of the year as a decimal number
pl: dzieñ roku jako liczba

source: the month as a decimal number
pl: miesi±c jako liczba

source: the minute as a decimal number
pl: minuta jako liczba

source: either AM or PM
pl: albo AM albo PM

source: the second as a decimal number
pl: drugie jako liczba

source: the day of the week as a decimal number
pl: dzieñ tygodnia jako liczba

source: the preferred date for the current locale
pl: preferowana data dla bie¿±cego locale

source: the last two digits of a year
pl: ostatnie dwie liczby roku

source: the year as a decimal number
pl: rok jako liczba

source: the time zone or name or abbreviation
pl: strefa czasu lub nazwa lub skrót

source: Date format
pl: Format daty

source: Specifier
pl: Wybierz plik

source: Example
pl: Przyk³ad

source: Display message number next to folder name
pl: Wy¶wietlanie ilo¶ci wiadomo¶ci obok nazwy katalogu

source: Unread messages
pl: Nieprzeczytane wiadomo¶ci

source: Unread and Total messages
pl: Wszystkie i nieprzeczytane wiadomo¶ci

source: Abbreviate newsgroup names longer than
pl: Skracanie nazw grup news d³u¿szych ni¿

source: letters
pl: liter(y)

source: Message list
pl: Lista wiadomo¶ci

source: Set default selection when entering a folder
pl: Dzia³ania wykonywane podczas otwierania katalogu

source: Show "no unread (or new) message" dialog
pl: Brak okna dialogowego o nowych i nieprzeczytanych wiadomo¶ciach

source: Assume 'Yes'
pl: Przyjmij 'Tak'

source: Assume 'No'
pl: Przyjmij 'Nie'

source: Open message when selected
pl: Otwieranie wybranej wiadomo¶ci

source: When message view is visible
pl: Gdy podgl±d wiadomo¶ci jest widoczny

source: Thread using subject in addition to standard headers
pl: U¿ywanie tematu jak i standardowych informacji z nag³ówka do grupowania wiadomo¶ci w w±tki

source: Execute immediately when moving or deleting messages
pl: Natychmiastowe wykonywanie dzia³añ przenoszenia lub kasowania wiadomo¶ci

source: Defers moving, copying and deleting of messages until you choose 'Tools/Execute'
pl: Opó¼nij przenoszenie, kopiowanie i usuwanie wiadomo¶ci do czasu wybrania 'Narzêdzia/Wykonaj'

source: Mark message as read
pl: Zaznacz wiadomo¶æ jako przeczytan±

source: when selected, after
pl: gdy zaznaczone, po

source: only when opened in a new window, or replied to
pl: tylko gdy otwarta w nowym oknie lub udzielono odpowiedzi

source: Display sender using address book
pl: Wy¶wietlanie nadawcy u¿ywaj±c danych z ksi±¿ki adresowej

source: Show tooltips
pl: Pokazuj wskazówki

source: Date format help
pl: Pomoc formatu daty

source: Translate header names
pl: T³umaczenie nazw nag³ówków

source: The display of standard headers (such as 'From:', 'Subject:') will be translated into your language.
pl: Nazwy standardowych nag³ówków (takich jak Od:,Temat:) bêd± przet³umaczone na twój jêzyk.

source: Summaries
pl: Widok podsumowania

source: Attachment
pl: Za³±cznik

source: Number
pl: Numer

source: Message list columns configuration
pl: Konfiguracja kolumn w widoku wiadomo¶ci

source: Select columns to be displayed in the message list. You can modify the order by using the Up / Down buttons or by dragging the items.
pl: Wybierz kolumny, które maj± byæ wy¶wietlone na li¶cie wiadomo¶ci. Mo¿esz modyfikowaæ kolejno¶æ za pomoc± przycisków "Do góry" "Na dó³", lub przesuwaj±c elementy mysz±.
