Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: Filename:
pl: Nazwa pliku:

source: Filesize:
pl: Wielko¶æ pliku:

source: Load Image
pl: £aduj obraz

source: IMAP4 connection broken
pl: Po³±czenie z IMAP4 zosta³o zerwane

source: IMAP error on %s: authenticated
pl: B³±d po³±czenia z serwerem IMAP %s: b³±d uwierzytelniania

source: IMAP error on %s: not authenticated
pl: B³±d po³±czenia z serwerem IMAP %s: b³±d uwierzytelniania

source: IMAP error on %s: bad state
pl: B³±d po³±czenia z serwerem IMAP %s: niew³a¶ciwy stan

source: IMAP error on %s: stream error
pl: B³±d po³±czenia z serwerem IMAP %s: b³±d strumienia

source: IMAP error on %s: parse error (very probably non-RFC compliance from the server)
pl: b³±d po³±czenia z serwerem IMAP %s: b³±d przetwarzania (prawdopodobnie serwer nie jest zgodny ze specyfikacj± opisan± w RFC)

source: IMAP error on %s: connection refused
pl: B³±d po³±czenia z serwerem IMAP %s: po³±czenie odrzucone

source: IMAP error on %s: memory error
pl: b³±d po³±czenia z serwerem IMAP %s: b³±d pamiêci

source: IMAP error on %s: fatal error
pl: B³±d po³±czenia z serwerem IMAP %s: b³±d krytyczny

source: IMAP error on %s: protocol error(very probably non-RFC compliance from the server)
pl: B³±d po³±czenia z serwerem IMAP %s: b³±d protoko³u (prawdopodobnie serwer nie jest zgodny ze specyfikacj± opisan± w RFC)

source: IMAP error on %s: connection not accepted
pl: B³±d po³±czenia z serwerem IMAP %s: po³±czenie nie zosta³o zaakceptowane

source: IMAP error on %s: APPEND error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu APPEND

source: IMAP error on %s: NOOP error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu NOOP

source: IMAP error on %s: LOGOUT error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu LOGOUT

source: IMAP error on %s: CAPABILITY error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu CAPABILITY

source: IMAP error on %s: CHECK error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu CHECK

source: IMAP error on %s: CLOSE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu CLOSE

source: IMAP error on %s: EXPUNGE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu EXPUNGE

source: IMAP error on %s: COPY error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu COPY

source: IMAP error on %s: UID COPY error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu UID COPY

source: IMAP error on %s: CREATE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu CREATE

source: IMAP error on %s: DELETE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu DELETE

source: IMAP error on %s: EXAMINE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu EXAMINE

source: IMAP error on %s: FETCH error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu FETCH

source: IMAP error on %s: UID FETCH error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu UID FETCH

source: IMAP error on %s: LIST error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu LIST

source: IMAP error on %s: LOGIN error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu LOGIN

source: IMAP error on %s: LSUB error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu LSUB

source: IMAP error on %s: RENAME error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu RENAME

source: IMAP error on %s: SEARCH error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu SEARCH

source: IMAP error on %s: UID SEARCH error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu UID SEARCH

source: IMAP error on %s: SELECT error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu SELECT

source: IMAP error on %s: STATUS error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu STATUS

source: IMAP error on %s: STORE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu STORE

source: IMAP error on %s: UID STORE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu UID STORE

source: IMAP error on %s: SUBSCRIBE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu SUBSCRIBE

source: IMAP error on %s: UNSUBSCRIBE error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu UNSUBSCRIBE

source: IMAP error on %s: STARTTLS error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu STARTTLS

source: IMAP error on %s: INVAL error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu INVAL

source: IMAP error on %s: EXTENSION error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu EXTENSION

source: IMAP error on %s: SASL error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu SASL

source: IMAP error on %s: SSL error
pl: B³±d serwera IMAP przy %s: B³±d przy wykonywaniu SSL

source: IMAP error on %s: Unknown error [%d]
pl: B³±d serwera IMAP przy %s: Nieznany b³±d [%d]

source: CRAM-MD5 logins only work if libetpan has been compiled with SASL support and the CRAM-MD5 SASL plugin is installed.
pl: Logowanie z u¿yciem CRAM-MD5 dzia³a tylko je¿eli biblioteka libtepan zosta³a skompilowana ze wsparciem SASL i wtyczka CRAM-MD5 SASL jest zainstalowana.

source: DIGEST-MD5 logins only work if libetpan has been compiled with SASL support and the DIGEST-MD5 SASL plugin is installed.
pl: Logowanie z u¿yciem CRAM-MD5 dzia³a tylko je¿eli biblioteka libtepan zosta³a skompilowana z obs³ug± SASL i wtyczka CRAM-MD5 SASL jest zainstalowana.

source: Connection to %s failed: login refused.%s
pl: £±czenie z %s zakoñczy³o siê niepowodzeniem: odmowa logowania.%s

source: Connection to %s failed: login refused.%s
pl: £±czenie z %s zakoñczy³o siê niepowodzeniem: odmowa logowania.%s

source: Connecting to %s failed
pl: Po³±czenie z %s zakoñczy³o siê niepowodzeniem

source: IMAP4 connection to %s has been disconnected. Reconnecting...
pl: Po³±czenie IMAP4 do %s zosta³o przerwane. £±czê jeszcze raz...

source: Claws Mail needs network access in order to access the IMAP server.
pl: Claws Mail potrzebuje dostêpu do sieci w celu dostêpu do serwera IMAP.

source: Insecure connection
pl: Po³±czenie nie jest bezpieczne

source: This connection is configured to be secured using SSL, but SSL is not available in this build of Claws Mail. Do you want to continue connecting to this server? The communication would not be secure.
pl: To po³±czenie jest skonfigurowane jako bezpieczne z u¿yciem SSL, ale SSL nie jest dostêpny w tej wersji Claws Mail. Czy chcesz kontynuowaæ ³±czenie do tego serwera? Po³±czenie nie bêdzie bezpieczne.

source: Con_tinue connecting
pl: Kon_tynuuj ³±czenie

source: Can't connect to IMAP4 server: %s:%d
pl: Nie mo¿na po³±czyæ siê z serwerem IMAP4: %s:%d

source: Can't connect to IMAP4 server: %s:%d
pl: Nie mo¿na po³±czyæ siê z serwerem IMAP4: %s:%d

source: Can't start TLS session.
pl: Nie mo¿na nawi±zaæ sesji TLS

source: Couldn't login to IMAP server %s.
pl: Nie uda³o siê nawi±zaæ po³±czenia z serwerem IMAP: %s.

source: Couldn't login to IMAP server %s.
pl: £±czenie z serwerem IMAP4: %s.

source: Adding messages...
pl: Dodawanie wiadomo¶ci...

source: Copying messages...
pl: Kopiowanie wiadomo¶ci...

source: can't set deleted flags
pl: nie mo¿na ustawiæ flagi skasowany

source: can't expunge
pl: nie mo¿na zlikwidowaæ

source: Looking for unsubscribed folders in %s...
pl: Szukanie niesubskrybowanych katalogów w %s...

source: Looking for subfolders of %s...
pl: Szukanie podkatalogów w %s ...

source: can't create mailbox: LIST failed
pl: nie mo¿na utworzyæ skrzynki: b³±d LIST.

source: can't create mailbox
pl: nie mo¿na utworzyæ skrzynki

source: New folder name must not contain the namespace path separator
pl: Nowa nazwa katalogu nie mo¿e zawieraæ odstêpów ani pól rozdzielaj±cych ¶cie¿kê

source: can't rename mailbox: %s to %s
pl: nie mo¿na zmieniæ nazwy skrzynki z %s do %s

source: can't delete mailbox
pl: nie mo¿na skasowaæ skrzynki

source: LIST failed
pl: Wykonanie komenda LIST nie powiod³o siê

source: Flagging messages...
pl: Filtrowanie wiadomo¶ci...

source: can't select folder: %s
pl: nie mo¿na wybraæ katalogu: %s

source: Server requires TLS to log in.
pl: Serwer wymaga TLS.

source: Can't refresh capabilities.
pl: Nie mo¿na od¶wie¿yæ w³a¶ciwo¶ci.

source: Connection to %s failed: server requires TLS, but Claws Mail has been compiled without OpenSSL support.
pl: Po³±czenie z %s nie powiod³o siê: serwer wymaga TLS, lecz Claws Mail skompilowane jest bez obs³ugi OpenSSL.

source: Server logins are disabled.
pl: Logowanie na serwer jest wy³±czone.

source: Fetching message...
pl: Odbieranie wiadomo¶ci...

source: can't set deleted flags: %d
pl: nie mo¿na ustawiæ flagi skasowany: %d

source: You have one or more IMAP accounts defined. However this version of Claws Mail has been built without IMAP support; your IMAP account(s) are disabled. You probably need to install libetpan and recompile Claws Mail.
pl: Masz zdefiniowane jedno lub wiêcej kont IMAP. Jednak ta wersja Claws Mail zosta³a zbudowana bez obs³ugi IMAP; Twoje konta IMAP zosta³y zdezaktywowane. Prawdopodobnie potrzebujesz zainstalowaæ libtepan lub przekompilowaæ Claws Mail.

source: Create _new folder...
pl: Stwórz _nowy katalog...

source: _Rename folder...
pl: _Zmieñ nazwê katalogu...

source: M_ove folder...
pl: _Przenie¶ katalog...

source: Cop_y folder...
pl: _Skopiuj katalog...

source: _Delete folder...
pl: _Usuñ katalog...

source: Synchronise
pl: Synchronizuj

source: Down_load messages
pl: Po_bierz wiadomo¶ci

source: S_ubscriptions
pl: Subskrypcje

source: _Subscribe...
pl: Subskrybuj...

source: _Unsubscribe...
pl: _Usuñ subskrypcjê...

source: _Check for new messages
pl: _Pobierz pocztê

source: C_heck for new folders
pl: _Sprawd¼ w poszukiwaniu nowych katalogów

source: R_ebuild folder tree
pl: _Przebuduj drzewo katalogów

source: Show only subscribed _folders
pl: Poka¿ tylko zasubskrybowane katalogi

source: Input the name of new folder: (if you want to create a folder to store subfolders only and no mail, append '/' to the folder name)
pl: Wprowad¼ nazwê nowego katalogu: (je¶li chcesz utworzyæ katalog by przechowywaæ w nim podkatalogi a nie przechowywaæ wiadomo¶ci, do³±cz `/' na koñcu nazwy)

source: Inherit properties from parent folder
pl: Dziedziczenie uprawnieñ z katalogu nadrzêdnego

source: Input new name for '%s':
pl: Wprowad¼ now± nazwê dla '%s':

source: Rename folder
pl: Zmieñ nazwê folderu

source: `%c' can't be included in folder name.
pl: `%c' nie mo¿e wystêpowaæ w nazwie katalogu.

source: The folder could not be renamed. The new folder name is not allowed.
pl: Nie uda³o siê zmieniæ nazwy katalogu. Nowa nazwa katalogu nie jest dozwolona.

source: All folders and messages under '%s' will be permanently deleted. Recovery will not be possible. Do you really want to delete?
pl: Wszystkie katalogi i wiadomo¶ci w '%s' zostan± trwale usuniête. Odzyskanie ich nie bêdzie mo¿liwe. Naprawdê chcesz skasowaæ ?

source: Can't remove the folder '%s'.
pl: Nie mo¿na usun±æ katalogu `%s'.

source: Do you want to search for unsubscribed subfolders of '%s'?
pl: Czy naprawdê wyszukaæ niezasubkrybowane podkatalogi w '%s'?

source: Search recursively
pl: Szukaj rekursywnie

source: Subscriptions
pl: Subskrypcje

source: +_Search
pl: +_Szukaj

source: Choose a subfolder of %s to subscribe to:
pl: Wybierz podkatalog z %s do subskrypcji:

source: Subscribe
pl: Subskrybuj

source: All of them
pl: Wszystkie

source: This folder is already subscribed and has no unsubscribed subfolders. If there are new folders, created and subscribed to from another client, use "Check for new folders" at the mailbox's root folder.
pl: Ten katalog jest aktualnie subskrybowany i nie posiada niesubskrybowanych podkatalogów. Je¶li istniej± nowe katalogi, utworzone i subsrybowane z innego klienta, u¿yj "Sprawd¼ w poszukiwaniu nowych katalogów" w g³ównym katalogu skrzynki pocztowej.

source: Do you want to %s the '%s' folder?
pl: Czy chcesz %s katalog '%s'?

source: subscribe
pl: subskrybuj

source: unsubscribe
pl: usuñ subskrypcjê

source: Apply to subfolders
pl: Zastosuj do podkatalogów

source: +_Subscribe
pl: +_Subskrybuj

source: +_Unsubscribe
pl: +_Usuñ subskrypcjê

source: Import mbox file
pl: Import pliku mbox

source: Locate the mbox file and specify the destination folder.
pl: Okre¶l docelowy plik ze skrzynk± (mbox) oraz docelowy katalog.

source: Destination folder:
pl: Katalog docelowy:

source: Source mbox filename can't be left empty.
pl: nazwa ¼ród³owej skrzynki mbox nie zosta³a podana.

source: Destination folder is not set. Import mbox file to the Inbox folder?
pl: Katalog docelowy nie jest ustawiony. Zaimportowaæ plik mbox do katalogu z poczt± przychodz±c±?

source: Can't find the destination folder.
pl: Nie mo¿na odnale¼æ docelowego katalogu.

source: Select importing file
pl: Wybierz importowany plik

source: Please specify address book name and file to import.
pl: Proszê podaæ nazwê ksi±¿ki adresowej oraz plik, który chcesz importowaæ.

source: Select and rename LDIF field names to import.
pl: Zaznacz i zmieñ nazwy pól LDIF do importowania

source: File imported.
pl: Plik zaimportowany.

source: Please select a file.
pl: Proszê wybraæ plik.

source: Address book name must be supplied.
pl: Ksi±¿ka adresowa musi byæ podana.

source: LDIF file imported successfully.
pl: Import pliku LDIF zakoñczony sukcesem.

source: Select LDIF File
pl: Wybierz plik LDIF

source: Specify the name for the address book that will be created from the LDIF file data.
pl: Wybierz nazwê dla ksi±¿ki adresowej, która zostanie utworzona z pliku LDIF.

source: File Name
pl: Nazwa pliku

source: The full file specification of the LDIF file to import.
pl: Pe³na nazwa pliku LDIF, który chcesz importowaæ.

source: Select the LDIF file to import.
pl: Wybierz plik LDIF do importu

source: R
pl: Z

source: LDIF Field Name
pl: Nazwa pola LDIF

source: Attribute Name
pl: Nazwa Atrybutu

source: LDIF Field
pl: Pole LDIF

source: Attribute
pl: Atrybut

source: Choose the LDIF field that will be renamed or selected for import in the list above. Reserved fields (marked with a tick in the "R" column), are automatically imported and cannot be renamed. A single click in the Select ("S") column will select the field for import with a tick. A single click anywhere in the row will select that field for rename in the input area below the list. A double click anywhere in the row will also select the field for import.
pl: Wybierz pola LDIF którym chcesz zmieniæ nazwy lub które chcesz importowaæ. Zarezerwowane pola (zaznaczone w kolumnie "R"), bêd± automatycznie importowane i ich nazwa nie mo¿e byæ zmieniona. Pojedyncze klikniêcie w kolumnie wyboru ("S") wybiera okre¶lone pole do importu. Pojedyncze klikniêcie na który¶ z wierszy wybiera okre¶lone pole do zmiany nazwy - nazwê nale¿y wprowadziæ w polu poni¿ej. Podwójne klikniêcie na który¶ z wierszy wybiera pole do importu.

source: The LDIF field can be renamed to the User Attribute name.
pl: Mo¿na zmieniæ nazwy pól LDIF zgodnie z atrybutem podanym przez u¿ytkownika

source: Select for Import
pl: do importu

source: Select the LDIF field for import into the address book.
pl: Wybiera pola LDIF, które chcesz importowaæ do ksi±¿ki adresowej.

source: Modify
pl: Zmieñ

source: This button will update the list above with the data supplied.
pl: Ten przycisk zaktualizuje powy¿sz± listê dostarczonymi danymi.

source: Records Imported :
pl: Ilo¶æ poprawnie zaimportowanych rekordów:

source: Import LDIF file into Address Book
pl: Importuj plik LDIF do Ksi±¿ki Adresowej

source: Proceed
pl: Wykonaj

source: Error importing MUTT file.
pl: B³±d importu pliku MUTTa.

source: Select MUTT File
pl: Wybierz plik MUTTa

source: Import MUTT file into Address Book
pl: Importuj plik MUTTa do Ksi±¿ki Adresowej

source: Please select a file to import.
pl: Proszê wybierz plik do importu.

source: Error importing Pine file.
pl: B³±d podczas importu pliku PINE.

source: Select Pine File
pl: Wybierz plik PINE.

source: Import Pine file into Address Book
pl: Importuj plik PINE do Ksi±¿ki Adresowej

source: Claws Mail needs network access in order to get mails.
pl: Claws Mail potrzebuje dostêpu do sieci aby pobraæ wiadomo¶ci.

source: %s failed
pl: Wykonanie komenda %s nie powiod³o siê

source: Retrieving new messages
pl: Pobieranie nowych wiadomo¶ci

source: Standby
pl: Oczekiwanie

source: Cancelled
pl: Anuluj

source: Retrieving
pl: Pobieranie

source: Done (%d message (%s) received)
pl: Wykonano (otrzymano %d wiadomo¶æ (%s))

source: Done (no new messages)
pl: Wykonano (brak nowych wiadomo¶ci)

source: Connection failed
pl: B³±d po³±czenia.

source: Auth failed
pl: B³±d autoryzacji

source: Locked
pl: Zablokowana

source: Timeout
pl: Limit czasu (sekundy)

source: Finished (%d new message)
pl: Skoñczono (%d nowa wiadomo¶æ)

source: Finished (no new messages)
pl: Skoñczono (brak nowych wiadomo¶ci)

source: %s: Retrieving new messages
pl: %s : Pobieranie nowych wiadomo¶ci

source: Can't connect to POP3 server: %s:%d
pl: Nie mo¿na po³±czyæ siê z serwerem POP3: %s:%d

source: Can't connect to POP3 server: %s:%d
pl: Nie mo¿na po³±czyæ siê z serwerem POP3: %s:%d

source: Authenticating...
pl: Autoryzacja...

source: Retrieving messages from %s (%s) ...
pl: Pobieranie wiadomo¶ci z %s (%s) ...

source: Getting the number of new messages (STAT)...
pl: Pobieranie liczby wiadomo¶ci (STAT)...

source: Getting the number of new messages (LAST)...
pl: Pobieranie liczby wiadomo¶ci (LAST)...

source: Getting the number of new messages (UIDL)...
pl: Pobieranie liczby wiadomo¶ci (UIDL)

source: Getting the size of messages (LIST)...
pl: Pobieranie wielko¶ci wiadomo¶ci (LIST)...

source: Quitting
pl: Wychodzenie

source: Retrieving message (%d / %d) (%s / %s)
pl: Pobieranie wiadomo¶ci (%d / %d) (%s / %s)

source: Retrieving (%d message (%s) received)
pl: Pobieranie (%d wiadomo¶ci, otrzymano %s)

source: Connection to %s:%d failed.
pl: Nie uda³o siê nawi±zaæ po³±czenia z %s:%d.

source: Error occurred while processing mail.
pl: B³±d podczas przetwarzania wiadomo¶ci.

source: Error occurred while processing mail: %s
pl: B³±d podczas przetwarzania wiadomo¶ci: %s

source: No disk space left.
pl: Brak miejsca na dysku.

source: Can't write file.
pl: Nie mo¿na zapisaæ pliku.

source: Socket error.
pl: B³±d gniazda.

source: Socket error on connection to %s:%d.
pl: B³±d gniazda podczas po³±czenia z %s:%d.

source: Connection closed by the remote host.
pl: Po³±czenie zosta³o przerwane przez zdalny komputer

source: Connection to %s:%d closed by the remote host.
pl: Po³±czenie z %s:%d zosta³o przerwane przez serwer.

source: Mailbox is locked.
pl: Skrzynka zablokowana.

source: Mailbox is locked: %s
pl: Skrzynka zablokowana: %s

source: Authentication failed.
pl: Uwierzytelnienie nie powiod³o siê.

source: Authentication failed: %s
pl: Uwierzytelnienie nie powiod³o siê: %s

source: Session timed out. You may be able to recover by increasing the timeout value in Preferences/Other/Miscellaneous.
pl: Up³yn±³ limit czasu sesji zakoñczony. Mo¿esz zwiêkszyæ limit w Ustawienia/Inne/Ró¿ne.

source: Connection to %s:%d timed out.
pl: Up³yn±³ limit czasu oczekiwania na po³±czenie z %s:%d.

source: Incorporation cancelled
pl: Inkorporacja zosta³a anulowana

source: Claws Mail: %d new message
pl: Claws Mail - %d nowa wiadomo¶æ

source: Unable to connect: you are offline.
pl: Nie mo¿na nawi±zaæ po³±czenia: pracujesz bez po³±czenia z sieci± (offline)

source: %s%sYou're working offline. Override for %d minutes?
pl: %s%sPracujesz w trybie offline. Chcesz przej¶æ do trybu online na %d minut?

source: %s%sYou're working offline. Override?
pl: %s%s Pracujesz w trybie offline. Czy chcesz przej¶æ do trybu online?

source: On_ly once
pl: Ty_lko raz

source: Nick Name
pl: Ksywka

source: File '%s' already exists. Can't create folder.
pl: Plik `%s' ju¿ istnieje. Nie mo¿na utworzyæ katalogu.

source: Exiting...
pl: Wychodzenie...

source: Configuration for %s found. Do you want to migrate this configuration?
pl: Znaleziono konfiguracjê dla wersji %s. Czy chcesz przenie¶æ t± konfiguracjê?

source: Your Sylpheed filtering rules can be converted by a script available at %s.
pl: Twoje regu³y filtrów mog± zostaæ przekonwertowane za pomoc± skryptu dostêpnego pod adresem %s.

source: Keep old configuration
pl: Zachowaj star± konfiguracjê

source: Keeping a backup will allow you to go back to an older version, but may take a while if you have cached IMAP or News data, and will take some extra room on your disk.
pl: Wykonywanie kopi zapasowej pozwoli na przywrócenie starszej wersji, lecz mo¿e chwile potrwaæ je¶li du¿o danych IMAP lub News i zajmie trochu dodatkowego miejsca na twoim dysku.

source: Migration of configuration
pl: Migracja konfiguracji

source: Copying configuration... This may take a while...
pl: Kopiowanie plików konfiguracyjnych...

source: Migration failed!
pl: Nie uda³o siê przenie¶æ starej konfiguracji!

source: Migrating configuration...
pl: Migracja konfiguracji...

source: g_thread is not supported by glib.
pl: glib nie obs³uguje g_thread.

source: Sylpheed-Claws 2.6.0 (or older)
pl: Sylpheed-Claws 2.6.0 (or starszy)

source: Sylpheed-Claws 1.9.15 (or older)
pl: Sylpheed-Claws 1.9.15 (lub starszy)

source: Sylpheed-Claws 1.0.5 (or older)
pl: Sylpheed-Claws 1.0.5 (lub starszy)

source: The following plugin failed to load. Check the Plugins configuration for more information: %s
pl: Jedna z wtyczek nie zosta³a za³adowana. Sprawd¼ konfiguracjê wtyczek aby uzyskaæ wiêcej informacji: %s

source: Claws Mail has detected a configured mailbox, but it is incomplete. It is possibly due to a failing IMAP account. Use "Rebuild folder tree" on the mailbox parent folder's context menu to try to fix it.
pl: Claws Mail wykry³o skonfigurowan± skrzynkê mailmbox, ale jest ona niekompletna. Prawdopodobnie spowodowane jest to wadliwym kontem IMAP.U¿yj "Przebuduj drzewo katalogów" z menu katalogu by spróbowaæ to naprawiæ.

source: Claws Mail has detected a configured mailbox, but could not load it. It is probably provided by an out-of-date external plugin. Please reinstall the plugin and try again.
pl: Claws Mail wykry³ skonfigurowany mailbox, ale nie móg³ go za³adowaæ. Prawdopodobnie jest to spowodowane przestarza³± zewnêtrzn± wtyczk±. Proszê przeinstalowaæ wtyczkê i spróbowaæ ponownie.

source: Claws Mail can not start without its data volume (%s).
pl: Claws Mail nie mo¿e zostaæ uruchomiony bez swojego wolumenu z danymi (%s).

source: Usage: %s [OPTION]...
pl: U¿ycie: %s [OPCJE]...

source: --compose [address] open composition window
pl: --compose [adres] otwiera okno tworzenia wiadomo¶ci

source: --subscribe [uri] subscribe to the given URI if possible
pl: --subscribe [uri] subskrybuje podany adres URI

source: --attach file1 [file2]... open composition window with specified files attached
pl: --attach plik1 [plik2]... otwórz okno kompozycji z za³±czonym wybranym plikiem

source: --receive receive new messages
pl: --receive odbiera nowe wiadomo¶ci

source: --receive-all receive new messages of all accounts
pl: --receive-all odbiera nowe wiadomo¶ci dla wszystkich kont

source: --send send all queued messages
pl: --send wysy³a zakolejkowane wiadomo¶ci

source: --status [folder]... show the total number of messages
pl: --status [folder]... pokazuje ca³kowit± ilo¶æ wiadomo¶ci

source: --status-full [folder]... show the status of each folder
pl: --status-full [folder]... pokazuje ilo¶æ wszystkich wiadomo¶ci

source: --select folder[/msg] jumps to the specified folder/message folder is a folder id like 'folder/sub_folder'
pl: --select katalog[/msg] Przechodzi do wybranego katalogu/wiadomo¶ci Katalog nale¿y podaæ w formie '#mh/Mailbox/inbox'

source: --online switch to online mode
pl: --online prze³±cza w tryb pracy z sieci±

source: --offline switch to offline mode
pl: --offline prze³±cza w tryb pracy z roz³±czon± sieci±

source: --exit --quit -q exit Claws Mail
pl: --exit --quit -q wy³±cza program Claws Mail

source: --debug debug mode
pl: --debug tryb debug

source: --help -h display this help and exit
pl: --help -h wy¶wietla tê pomoc i wychodzi
