Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: The following file has been attached: %s
pl: Nastêpuj±cy plik zosta³ do³±czony: %s

source: The "Quotation mark" of the template is invalid.
pl: "Znacznik cytatu" wzorca jest nieprawid³owy.

source: +_Insert
pl: Ws_taw

source: File %s is empty.
pl: Plik %s jest pusty.

source: Can't read %s.
pl: nie mo¿na otworzyæ %s

source: Message: %s
pl: Wiadomo¶æ: %s

source: [Edited]
pl: [Edytowany]

source: %s - Compose message%s
pl: %s - Tworzenie wiadomo¶ci %s

source: [no subject] - Compose message%s
pl: [brak tematu] - Tworzenie wiadomo¶ci %s

source: Compose message
pl: Napisz now± wiadomo¶æ

source: Account for sending mail is not specified. Please select a mail account before sending.
pl: Nie podano konta, z którego wysy³asz pocztê. Wybierz konto przed wys³aniem.

source: Send
pl: Wy¶lij

source: The only recipient is the default CC address. Send anyway?
pl: Jedynym odbior± jest domy¶lny odbiorca kopii wiadomo¶ci. Wys³aæ mimo to ?

source: +_Send
pl: +_Wy¶lij

source: The only recipient is the default BCC address. Send anyway?
pl: Jedyny odbiorca to domy¶lny adres BCC. Wys³aæ mimo to?

source: Recipient is not specified.
pl: Nie podano odbiorcy.

source: +_Queue
pl: +Kolejka

source: Subject is empty. %s
pl: Temat wiadomo¶ci jest pusty. %s

source: Send it anyway?
pl: Czy mimo to chcesz wys³aæ t± wiadomo¶æ ?

source: Queue it anyway?
pl: Czy mimo to chcesz dodaæ tê wiadomo¶æ do kolejki ?

source: Send later
pl: Wy¶lij pó¼niej

source: Could not queue message for sending: Charset conversion failed.
pl: Nie mo¿na dodaæ wiadomo¶ci do kolejki wysy³kowej: Konwersja strony kodowej nie powiod³a siê.

source: Could not queue message for sending: Couldn't get recipient encryption key.
pl: Nie mo¿na zakolejkowaæ wiadomo¶ci do wys³ania: Nie odnaleziono klucza szyfruj±cego odbiorcy.

source: Could not queue message for sending: Signature failed: %s
pl: Nie mo¿na zakolejkowaæ wiadomo¶ci do wys³ania: B³±d sygnatury %s

source: Could not queue message for sending: %s.
pl: Nie mo¿na dodaæ wiadomo¶ci do skrzynki nadawczej: %s.

source: Could not queue message for sending.
pl: Nie mo¿na zakolejkowaæ wiadomo¶ci do wys³ania.

source: The message was queued but could not be sent. Use "Send queued messages" from the main window to retry.
pl: Wiadomo¶æ zosta³a zakolejkowana, ale nie mog³a zostaæ wys³ana U¿yj "Wy¶lij zakolejkowane wiadomo¶ci" z g³ównego okna by ponowiæ.

source: %s Use "Send queued messages" from the main window to retry.
pl: %s Wiadomo¶æ zosta³a zakolejkowana, ale nie mog³a zostaæ wys³ana U¿yj "Wy¶lij zakolejkowane wiadomo¶ci" z g³ównego okna by spróbowaæ ponownie.

source: Can't convert the character encoding of the message to the specified %s charset. Send it as %s?
pl: Nie mo¿na przekonwertowaæ wiadomo¶ci do do wybranej %s . Wys³aæ jako %s ?

source: Line %d exceeds the line length limit (998 bytes). The contents of the message might be broken on the way to the delivery. Send it anyway?
pl: Linia %d przekracza limit d³ugo¶ci (998 bajtów). Tre¶æ tej wiadomo¶ci mo¿e ulec uszkodzeniu podczas dostarczania. Na pewno chcesz j± wys³aæ ?

source: Encryption warning
pl: Ostrze¿enie dotycz±ce szyfrowania

source: +C_ontinue
pl: +Kon_tynuuj

source: No account for sending mails available!
pl: Brak konta do wysy³ania poczty!

source: Selected account isn't NNTP: Posting is impossible.
pl: Wybrane konto nie jest kontem NNTP: Wys³anie wiadomo¶ci niemo¿liwe.

source: Attachment %s doesn't exist anymore. Ignore?
pl: Za³±cznik %s ju¿ nie istnieje. Zignorowaæ?

source: Cancel sending
pl: Przerwij wysy³anie

source: Ignore attachment
pl: Ignoruj za³±cznik

source: Add to address _book
pl: Dodaj do ksi±¿ki adresowej

source: Delete entry contents
pl: Usuñ zawarto¶æ wpisu

source: Use <tab> to autocomplete from addressbook
pl: Klawisz <tab> umo¿liwia automatyczne dope³nianie nazwami z ksi±¿ki adresowej

source: Mime type
pl: Typ MIME

source: Size
pl: Wielko¶æ

source: Save Message to
pl: Zapisz wiadomo¶æ do

source: _Browse
pl: _Przegl±daj

source: Hea_der
pl: Na_g³ówek

source: _Attachments
pl: Z_a³±czniki

source: Othe_rs
pl: In_ne

source: Subject:
pl: Temat:

source: Spell checker could not be started. %s
pl: Nie uda³o siê uruchomiæ sprawdzania pisowni. %s

source: From: <i>%s</i>
pl: Od: <i>%s</i>

source: Account to use for this email
pl: Bie¿±ce konto dla tej wiadomo¶ci

source: Sender address to be used
pl: Adres nadawcy

source: The privacy system '%s' cannot be loaded. You will not be able to sign or encrypt this message.
pl: System ochrony prywatno¶ci '%s' nie mo¿e zostaæ za³adowany. Nie bêdzie mo¿na ani podpisaæ ani zaszyfrowaæ tej wiadomo¶ci.

source: _None
pl: Brak

source: The body of the template has an error at line %d.
pl: B³±d formatu wzorca (tre¶æ wiadomo¶ci).w linii %d.

source: Template From format error.
pl: B³±d formatu wzorca (nadawca).

source: Template To format error.
pl: B³±d formatu wzorca (odbiorca).

source: Template Cc format error.
pl: B³±d formatu wzorca (kopia Cc).

source: Template Bcc format error.
pl: B³±d formatu wzorca (kopia Bcc).

source: Template subject format error.
pl: B³±d formatu wzorca (temat).

source: Invalid MIME type.
pl: Niepoprawny typ MIME.

source: File doesn't exist or is empty.
pl: Brak pliku lub pusty plik.

source: Properties
pl: W³a¶ciwo¶ci...

source: MIME type
pl: Typ MIME

source: Encoding
pl: Kodowanie

source: Path
pl: ¦cie¿ka

source: File name
pl: Nazwa pliku

source: The external editor is still working. Force terminating the process? process group id: %d
pl: Zewnêtrzny edytor wci±¿ pracuje. Zakoñczyæ proces si³owo? identyfikator grupy procesów: %d

source: Claws Mail needs network access in order to send this email.
pl: Claws Mail potrzebuje dostêpu do sieci aby wys³aæ tê wiadomo¶æ.

source: Could not queue message.
pl: Nie mo¿na zakolejkowaæ do wys³ania wiadomo¶ci: %s.

source: Could not queue message: %s.
pl: Nie mo¿na zakolejkowaæ do wys³ania wiadomo¶ci: %s.

source: Could not save draft.
pl: Nie mo¿na zapisaæ kopii roboczej.

source: Could not save draft
pl: Nie mo¿na zapisaæ kopii roboczej

source: Could not save draft. Do you want to cancel exit or discard this email?
pl: Nie mo¿na zapisaæ kopii roboczej Co chcesz zrobiæ z t± wiadomo¶ci± ?

source: _Cancel exit
pl: _Anuluj i wyjd¼

source: _Discard email
pl: Porzuæ

source: Select file
pl: Wybierz plik

source: File '%s' could not be read.
pl: Nie mo¿na odczytaæ pliku "%s".

source: File '%s' contained invalid characters for the current encoding, insertion may be incorrect.
pl: Plik "%s" zawiera nieprawid³owe znaki dla bie¿±cego kodowania, wstawianie mo¿e byæ niepoprawne.

source: Discard message
pl: Porzuæ wiadomo¶æ

source: This message has been modified. Discard it?
pl: Ta wiadomo¶æ zosta³a zmieniona, porzuciæ?

source: _Discard
pl: Por_zuæ

source: _Save to Drafts
pl: Zapisz w katalogu _kopii roboczych

source: Save changes
pl: Zapisz zmiany

source: This message has been modified. Save the latest changes?
pl: Ta wiadomo¶æ zosta³a zmieniona. Czy chcesz zapisaæ ostatnie zmiany?

source: _Don't save
pl: _Nie zapisuj

source: +_Save to Drafts
pl: + Zapisz w katalogu _kopii roboczych

source: Do you want to apply the template '%s' ?
pl: Czy chcesz do³±czyæ szablon '%s'?

source: Apply template
pl: Do³±cz szablon

source: _Replace
pl: Za_mieñ

source: _Insert
pl: Ws_taw

source: Insert or attach?
pl: Wstawiæ czy za³±czyæ?

source: Do you want to insert the contents of the file(s) into the message body, or attach it to the email?
pl: Wstawiæ tre¶æ pliku do wiadomo¶ci czy dodaæ go jako za³±cznik?

source: _Attach
pl: Z_a³±cz

source: Quote format error at line %d.
pl: B³±d formatu cytowania.w linii %d.

source: You are about to reply to %d messages. Opening the windows could take some time. Do you want to continue?
pl: Zamierzasz odopowiedzieæ na %d wiadomo¶ci. Otworzenie takiej ilo¶ci okien mo¿e zaj±æ trochê czasu. Na pewno chcesz kontynuowaæ ?

source: Claws Mail process (%ld) received signal %ld
pl: Proces Claws Mail (%ld) otrzyma³ sygna³ %ld

source: Claws Mail has crashed
pl: Claws Mail zakoñczy³ dzia³anie z powodu b³êdu

source: %s. Please file a bug report and include the information below.
pl: %s. Proszê wys³aæ raport o b³êdzie i do³±czyæ nastêpuj±ce informacje.

source: Debug log
pl: Dziennik debuggera

source: Close
pl: Zamknij

source: Save...
pl: Zapisz...

source: Create bug report
pl: Stwórz raport o b³êdzie

source: Save crash information
pl: Zapisz informacje o wykitowaniu

source: Add New Person
pl: Dodaj now± osobê

source: Adding a new person requires at least one of the following values to be set: - Display Name - First Name - Last Name - Nickname - any email address - any additional attribute Click OK to keep editing this contact. Click Cancel to close without saving.
pl: Dodanie nowej osoby wymaga ustawienia przynajmniej jednej z poni¿szych warto¶ci: - Nazwa - Imiê - Nazwisko - Psuedonim - adres e-mail - dodatkowe cechy Kliknij OK aby kontynuowaæ edycjê tego kontaktu. Kliknij Anuluj aby wyj¶æ bez zapisywania.

source: Adding a new person requires at least one of the following values to be set: - First Name - Last Name - any email address - any additional attribute Click OK to keep editing this contact. Click Cancel to close without saving.
pl: Dodanie nowej osoby wymaga ustawienia przynajmniej jednej z poni¿szych warto¶ci: - Nazwa - Imiê - Nazwisko - Psuedonim - adres e-mail - dodatkowe cechy Kliknij OK aby kontynuowaæ edycjê tego kontaktu. Kliknij Anuluj aby wyj¶æ bez zapisywania.

source: Edit Person Details
pl: Edytuj szczegó³y osobiste

source: An Email address must be supplied.
pl: Adres e-mail musi zostaæ wpisany.

source: A Name and Value must be supplied.
pl: Imiê i warto¶æ musz± zostaæ wpisane.

source: Discard
pl: Por_zuæ

source: Apply
pl: Zatwierd¼

source: Edit Person Data
pl: Edytuj informacje osobiste

source: Choose a picture
pl: Wybierz plik z obrazkiem

source: Failed to import image: %s
pl: Nie uda³o siê wczytaæ obrazka: %s

source: _Set picture
pl: _Ustaw obrazek

source: _Unset picture
pl: Wy³±cz _obrazek

source: Photo
pl: Zdjêcie

source: Display Name
pl: Wy¶wietlana nazwa

source: Last Name
pl: Nazwisko

source: First Name
pl: Imiê

source: Nickname
pl: Pseudonim

source: Value
pl: Warto¶æ

source: _User Data
pl: Dane _u¿ytkownika

source: _Email Addresses
pl: Adr_esy e-mail

source: O_ther Attributes
pl: In_ne Cechy

source: File appears to be OK.
pl: Plik zdaje siê byæ poprawny.

source: File does not appear to be a valid address book format.
pl: Plik nie wygl±da na prawid³owy format ksi±¿ki adresowej.

source: Could not read file.
pl: Nie mo¿na otworzyæ pliku.

source: Edit Addressbook
pl: Edytuj ksi±¿kê adresow±

source: Check File
pl: Sprawd¼ plik

source: File
pl: Plik

source: Add New Addressbook
pl: Ksi±¿ka adresowa

source: A Group Name must be supplied.
pl: Trzeba podaæ nazwê grupy

source: Edit Group Data
pl: Edytuj dane grupy

source: Group Name
pl: Nazwa grupy

source: Addresses in Group
pl: Adresy w grupie

source: Available Addresses
pl: Dostêpne adresy

source: Move Email Addresses to or from Group with arrow buttons
pl: Przesuñ adresy e-mail z lub do grupy u¿ywaj±c przycisków ze strza³kami.

source: Edit Group Details
pl: Edytuj dane grupy

source: Add New Group
pl: Dodaj now± grupê

source: Edit folder
pl: Edytuj katalog

source: Input the new name of folder:
pl: Podaj nazwê nowego katalogu:

source: New folder
pl: Nowy katalog

source: Input the name of new folder:
pl: Podaj nazwê nowego katalogu:

source: File does not appear to be JPilot format.
pl: Plik nie wygl±da na plik w formacie JPilot.

source: Select JPilot File
pl: Wybierz plik JPilot

source: Edit JPilot Entry
pl: Edytuj wpis JPilot

source: Additional e-Mail address item(s)
pl: Dodatkowe dane dot. adresów e-mail

source: Add New JPilot Entry
pl: Dodaj nowy wpis JPilot

source: Edit LDAP - Select Search Base
pl: Edytuj LDAP - Wybierz podstawowe regu³y wyszukiwania

source: Hostname
pl: Nazwa hosta

source: Search Base
pl: Podstawowe dane wyszukiwania

source: Available Search Base(s)
pl: Dostêpne podstawowe regu³y wyszukiwania

source: Could not read Search Base(s) from server - please set manually
pl: Nie mo¿na uzyskaæ Podstaw(y) Wyszukiwania z serwera - proszê ustawiæ rêcznie

source: Could not connect to server
pl: Nie mo¿na po³±czyæ siê z serwerem

source: A Name must be supplied.
pl: Nazwa musi zostaæ podana.

source: A Hostname must be supplied for the server.
pl: Nazwa hosta musi zostaæ podana dla serwera.

source: At least one LDAP search attribute should be supplied.
pl: Przynajmniej jeden atrybut przeszukiwania LDAP powinien zostaæ podany.

source: Connected successfully to server
pl: Pod³±czony prawid³owo do serwera

source: Edit LDAP Server
pl: Edytuj dane serwera LDAP

source: A name that you wish to call the server.
pl: Nazwa jak± chcesz nazywaæ serwer.

source: This is the hostname of the server. For example, "ldap.mydomain.com" may be appropriate for the "mydomain.com" organization. An IP address may also be used. You may specify "localhost" if running an LDAP server on the same computer as Claws Mail.
pl: To jest nazwa hosta serwera. Przyk³adowo "ldap.mojadomena.com" mo¿e byæ w³a¶ciw± nazw± dla organizacji "mojadomena.com". Równie dobrze mo¿na u¿yæ adresu IP. Je¿eli serwer LDAP dzia³a na tym samym komputerze co Claws Mail nale¿y wpisaæ "localhost".

source: The port number that the server listens on. Port 389 is the default.
pl: Numer portu na którym nas³uchuje serwer. Domy¶lnie jest to port 389.

source: Check Server
pl: Sprawd¼ Serwer

source: Press this button to test the connection to the server.
pl: Wci¶niêcie tego przycisku spowoduje przetestowanie po³±czenia do serwera.

source: This specifies the name of the directory to be searched on the server. Examples include: dc=claws-mail,dc=org ou=people,dc=domainname,dc=com o=Organization Name,c=Country
pl: Okre¶la nazwê katalogu który bêdzie przeszukiwany na serwerze.Przyk³ad zawiera: dc=claws-mail,dc=org ou=ludzie,dc=domena,dc=com o=nazwa organizacji,c=kraj

source: Press this button to lookup the name of available directory names on the server.
pl: Wyci¶niêcie tego przycisku spowoduje wyszukanie nazwy w katalogu nazw serwera.

source: Search Attributes
pl: Atrybuty przeszukiwania

source: A list of LDAP attribute names that should be searched when attempting to find a name or address.
pl: Lista nazw atrybutów LDAP, która powinna byæ szukana podczas próby odnalezienia nazwy lub adresu.

source: Defaults
pl: Domy¶lne

source: This resets the attribute names to a default value that should find most names and addresses during a name or address search process.
pl: Atrybuty nazw zostan± zresetowane do domy¶lnych warto¶ci które powinny odpowiadaæ wiêkszo¶ci nazw i adresów podczas szukania nazwy lub adresu.

source: Max Query Age (secs)
pl: Maksymalny wiek zapytania (sekundy)

source: This defines the maximum period of time (in seconds) that an address search result is valid for address completion purposes. Search results are stored in a cache until this period of time has passed and then retired. This will improve the response time when attempting to search for the same name or address on subsequent address completion requests. The cache will be searched in preference to performing a new server search request. The default value of 600 seconds (10 minutes), should be sufficient for most servers. A larger value will reduce the search time for subsequent searches. This is useful for servers that have slow response times at the expense of more memory to cache results.
pl: Definiuje maksymalny okres czasu (w sekundach) podczas którego wynik poszukiwania adresu jest aktualny w funkcji podpowiadania. Wyniki poszukiwañ s± przechowywane w pamiêci podrêcznej dopóki ten okres czasu nie up³ynie. Pozwala to na polepszenie szybko¶ci odpowiedzi w wypadku poszukiwania tej samej nazwy lub adresu w celu pokazania podpowiedzi. Najpierw bêdzie przeszukiwana pamiêæ podrêczna a dopiero potem bêd± wykonywane zapytania do serwera. Domy¶ln± warto¶ci± jest 60 sekund (10 min) co powinno byæ najbardziej odpowiednie dla wiêkszo¶ci serwerów. Wiêksza warto¶æ przyspieszy szybko¶æ sekwencyjnych poszukiwañ. Bêdzie ona u¿yteczna dla serwerów, które maja d³ugie czasy odpowiedzi przy czym zwiêkszy siê zu¿ycie pamiêci na pamiêæ podrêczn±.

source: Include server in dynamic search
pl: Do³±cz serwer do dynamicznego szukania

source: Check this option to include this server for dynamic searches when using address completion.
pl: Zaznacz t± opcjê aby zawrzeæ ten serwer w dynamicznym wyszukiwaniu podczas u¿ywania uzupe³niania adresu.

source: Match names 'containing' search term
pl: Zaznacz nazwy 'zawieraj±ce' szukane pojêcie

source: Searches for names and addresses can be performed either using "begins-with" or "contains" search term. Check this option to perform a "contains" search; this type of search usually takes longer to complete. Note that for performance reasons, address completion uses "begins-with" for all searches against other address interfaces.
pl: Poszukiwania nazw lub adresów mog± byæ wykonywane przy u¿yciu terminów wyszukiwania "begins-with" i "contains". Zaznacz t± opcjê aby wykonaæ poszukiwanie "contains", ten typ poszukiwania zazwyczaj zajmuje wiêcej czasu. Ze wzglêdu na wydajno¶æ dope³nianie adresów wykorzystuje "begins-with" do wszystkich poszukiwañ.

source: Bind DN
pl: £±cz DN

source: The LDAP user account name to be used to connect to the server. This is usually only used for protected servers. This name is typically formatted as: "cn=user,dc=claws-mail,dc=org". This is usually left empty when performing a search.
pl: Nazwa konta u¿ytkownika LDAP u¿yta do ³±czenia z serwerem. Jest zwykle u¿ywana do zabezpieczonych serwerów. Ta nazwa jest zwykle formatowana jako: "cn=user,dc=claws,dc=com". Zwykle zostaje puste podczas wyszukiwania.

source: Bind Password
pl: £±cz has³o

source: The password to be used when connecting as the "Bind DN" user.
pl: Has³o, które zostanie u¿yte podczas ³±czenia jako u¿ytkownik "BindDN"

source: Timeout (secs)
pl: Limit czasu (sekundy)

source: The timeout period in seconds.
pl: Czas oczekiwania w sekundach

source: Maximum Entries
pl: Maksymalna ilo¶æ wpisów

source: The maximum number of entries that should be returned in the search result.
pl: Maksymalna liczba wyników zwrócona podczas wyszukiwania.

source: Basic
pl: Podstawowe

source: Search
pl: Szukaj

source: Extended
pl: Rozszerzone

source: Add New LDAP Server
pl: Dodaj nowy serwer LDAP

source: Tag
pl: Etykieta

source: Delete tag
pl: Kasuj etykietê

source: Do you really want to delete this tag?
pl: Czy naprawdê chcesz usun±æ t± etykietê?

source: Delete all tags
pl: Usuñ wszystkie etykiety

source: Do you really want to delete all tags?
pl: Czy naprawdê chcesz usun±æ wszystkie etykiety?

source: Tag is not set.
pl: Nie podano nazwy etykiety.

source: Dialog title|Apply tags
pl: Przypisywanie etykiet

source: New tag:
pl: Nowa etykieta:

source: Please select tags to apply/remove. Changes are immediate.
pl: Wybierz etykiety, które chcesz przypisaæ/usun±æ. Zmiany zachodz± natychmiastowo.

source: File does not appear to be vCard format.
pl: Plik nie wydaje siê byæ w formacie vCard

source: Select vCard File
pl: Wybierz plik vCard

source: Edit vCard Entry
pl: Edytuj wpis vCard

source: Add New vCard Entry
pl: Dodaj nowy wpis vCard

source: Please specify output directory and file to create.
pl: Proszê sprecyzuj katalog wyj¶ciowy i plik do stworzenia.

source: Select stylesheet and formatting.
pl: Wybierz wzór stylów i formatowanie.

source: File exported successfully.
pl: Plik zosta³ wyeksportowany prawid³owo.

source: HTML Output Directory '%s' does not exist. OK to create new directory?
pl: Katalog wyj¶ciowy HTML '%s' nie istnieje. Czy stworzyæ nowy katalog?

source: Create Directory
pl: Stwórz katalog

source: Could not create output directory for HTML file: %s
pl: Nie mo¿na by³o stworzyæ katalogu wyj¶ciowego dla pliku HTML: %s

source: Failed to Create Directory
pl: Nie powiod³o siê tworzenie katalogu

source: Error creating HTML file
pl: B³±d podczas tworzenia pliku HTML

source: Select HTML output file
pl: Wybierz plik wyj¶ciowy HTML

source: HTML Output File
pl: Plik wyj¶ciowy HTML

source: B_rowse
pl: P_rzegl±daj

source: Stylesheet
pl: Wzór stylów

source: None
pl: Brak

source: Default
pl: Domy¶lne

source: Full
pl: Pe³ny

source: Custom
pl: W³asne

source: Custom-2
pl: W³asne-2

source: Custom-3
pl: W³asne-3

source: Custom-4
pl: W³asne-4

source: Full Name Format
pl: Pe³na nazwa formatu

source: First Name, Last Name
pl: Nazwisko, Imiê

source: Last Name, First Name
pl: Imiê, Nazwisko

source: Color Banding
pl: Pasek koloru

source: Format Email Links
pl: Formatowanie odno¶ników e-mailowych

source: Format User Attributes
pl: Cechy formatowania u¿ytkownika

source: Address Book :
pl: Ksi±¿ka adresowa :

source: File Name :
pl: Nazwa pliku :

source: Open with Web Browser
pl: Otwórz Przegl±dark±

source: Export Address Book to HTML File
pl: Eksportowanie ksi±¿ki adresowej do pliku HTML...

source: File Info
pl: Informacje o pliku

source: Please specify output directory and LDIF filename to create.
pl: Wybierz katalog wyj¶ciowy oraz nazwê pliku LDIF, który zostanie utworzony.

source: Specify parameters to format distinguished name.
pl: Ustaw parametry do formatowania wyró¿nionej nazwy.

source: LDIF Output Directory '%s' does not exist. OK to create new directory?
pl: Katalog wyj¶ciowy LDIF '%s' nie istnieje. Czy stworzyæ nowy katalog?

source: Could not create output directory for LDIF file: %s
pl: Nie mo¿na by³o stworzyæ katalogu wyj¶ciowego dla pliku LDIF: %s

source: Suffix was not supplied
pl: Nie podano przedrostka

source: A suffix is required if data is to be used for an LDAP server. Are you sure you wish to proceed without a suffix?
pl: Przedrostek jest niezbêdny aby dane by³y poprawnie przetwarzane przez serwer LDAP. Kontynuowaæ bez przedrostka?

source: Error creating LDIF file
pl: B³±d podczas tworzenia pliku LDIF

source: Select LDIF output file
pl: Wybierz plik wyj¶ciowy LDIF

source: LDIF Output File
pl: Plik wyj¶ciowy LDIF

source: The address book Unique ID is used to create a DN that is formatted similar to: uid=102376,ou=people,dc=claws-mail,dc=org
pl: Unikalne ID ksi±¿ki adresowej jest u¿yte do stworzenia WN formatowanej podobnie do: uid=102376,ou=ludzie,dc=claws,dc=org

source: The address book Display Name is used to create a DN that is formatted similar to: cn=John Doe,ou=people,dc=claws-mail,dc=org
pl: Wy¶wietlana Nazwa ksi±¿ki adresowej jest u¿ywana do stworzenia WN formatowanej podobnie do: cn=Jan Nowak,ou=ludzie,dc=claws,dc=org

source: The first Email Address belonging to a person is used to create a DN that is formatted similar to: mail=john.doe@domain.com,ou=people,dc=claws-mail,dc=org
pl: Pierwszy adres Email nale¿±cy do osoby jest u¿yty do tworzenia WN który jest formatowany podobnie do: mail=jan.nowak@domena.com,ou=ludzie,dc=claws-mail,dc=org

source: Suffix
pl: Przedrostek

source: The suffix is used to create a "Distinguished Name" (or DN) for an LDAP entry. Examples include: dc=claws-mail,dc=org ou=people,dc=domainname,dc=com o=Organization Name,c=Country
pl: Przyrostek jest u¿yty do stworzenia "Wyró¿nionej Nazwy" (lub WN) dla wpisu LDAP. Przyk³ad zawiera: dc=claws,dc=org ou=ludzie,dc=nazwadomeny,dc=com o=Nazwa organizacji,c=Pañstwo

source: Relative DN
pl: Relatywne WN

source: Unique ID
pl: Unikatowy identyfikator
