Repository: chriskmanx/qmole
Catalog: QMOLEDEV/claws-mail-3.9.0/po/*.po
Languages: pl

source: Authenticate on connect
pl: Autoryzacja przy po³±czeniu

source: News server
pl: Serwer news

source: Server for receiving
pl: Serwer do odbierania

source: Local mailbox
pl: Lokalny mailbox

source: SMTP server (send)
pl: Serwer SMTP (do wysy³ania)

source: Use mail command rather than SMTP server
pl: U¿ywaj polecenia lokalnego ni¿ serwer SMTP

source: command to send mails
pl: polecenia do wysy³ania poczty

source: User ID
pl: Identyfikator u¿ytkownika

source: Password
pl: Has³o

source: Account%d
pl: Konto%d

source: Local
pl: Lokalny

source: Default Inbox
pl: Domy¶lna skrzynka poczty przychodz±cej

source: Unfiltered messages will be stored in this folder
pl: Niefiltrowane wiadomo¶ci bêd± przetrzymywane w tym katalogu

source: Bro_wse
pl: Prze_gl±daj

source: Use secure authentication (APOP)
pl: U¿ywanie bezpiecznego mechanizmu autoryzacji (APOP)

source: Remove messages on server when received
pl: Po odebraniu skasuj wiadomo¶ci z serwera

source: Remove after
pl: Usuñ po

source: 0 days and 0 hours : remove immediately
pl: (ustawienie warto¶ci 0 dni: kasuje zaraz po odebraniu)

source: days
pl: dni

source: hours
pl: godzin

source: Receive size limit
pl: Limit ilo¶ci pobieranych danych

source: Messages over this limit will be partially retrieved. When selecting them you will be able to download them fully or delete them.
pl: Wiadomo¶ci powy¿ej tego limitu bêd± pobrane czê¶ciowo. Kiedy je zaznaczysz bêdzie mo¿liwe pobranie ich w ca³o¶ci lub skasowanie.

source: Maximum number of articles to download
pl: Maksymalna liczba artyku³ów do pobrania

source: unlimited if 0 is specified
pl: nieskoñczona je¶li podano 0

source: Authentication method
pl: Metoda uwierzytelnienia

source: Automatic
pl: Automatycznie

source: IMAP server directory
pl: Katalog serwera IMAP4.

source: (usually empty)
pl: (zazwyczaj puste)

source: Show subscribed folders only
pl: Poka¿ tylko zasubskrybowane foldery

source: Bandwidth-efficient mode (prevents retrieving remote tags)
pl: Tryb oszczêdzania ³±cza (zapobiega pobieraniu zdalnych znaczników)

source: This mode uses less bandwidth, but can be slower with some servers.
pl: Ten tryb w mniejszym stopniu obci±¿a ³±cze, ale mo¿e powodowaæ wolniejsze dzia³anie przy niektórych serwerach.

source: Filter messages on receiving
pl: Filtruj wiadomo¶ci podczas odbierania

source: Allow filtering using plugins on receiving
pl: U¿ycie filtrów z wtyczek podczas odbierania wiadomo¶ci

source: 'Get Mail' checks for new messages on this account
pl: "Pobierz wszystkie" sprawdza czy jest nowa poczta na tym koncie.

source: Header
pl: Nag³ówek

source: Generate Message-ID
pl: Generowanie identyfikatora wiadomo¶ci (Message-ID)

source: Add user-defined header
pl: Dodaj nag³ówek zdefiniowany przez u¿ytkownika

source: Authentication
pl: Uwierzytelnienie

source: SMTP Authentication (SMTP AUTH)
pl: Autoryzacja SMTP (SMTP AUTH)

source: If you leave these entries empty, the same user ID and password as receiving will be used.
pl: Je¶li pozostawisz te pola puste, to zostanie u¿yty ten sam login i has³o co przy odbieraniu.

source: Authenticate with POP3 before sending
pl: Przed wys³aniem autoryzacja POP3

source: POP authentication timeout:
pl: Limit czasu dla uwierzytelniania POP:

source: minutes
pl: minut

source: Signature
pl: Podpis

source: Signature separator
pl: Oddzielenie podpisu

source: Command output
pl: Wyj¶cie komendy

source: Automatically set the following addresses
pl: Automatycznie wstaw nastêpuj±ce adresy

source: Spell check dictionaries
pl: S³owniki do sprawdzania pisowni

source: Default dictionary
pl: Domy¶lny S³ownik

source: Default alternate dictionary
pl: Domy¶lny alternatywny s³ownik

source: Compose
pl: Tworzenie wiadomo¶ci

source: Reply
pl: Odpowied¼

source: Forward
pl: Przeka¿

source: Default privacy system
pl: Domy¶lny system ochrony prywatno¶ci

source: Always sign messages
pl: Podpisywanie ka¿dej wiadomo¶ci

source: Always encrypt messages
pl: Szyfrowanie ka¿dej wiadomo¶ci

source: Always sign messages when replying to a signed message
pl: Szyfrowanie wiadomo¶ci przy odpowiadaniu na zaszyfrowany email

source: Always encrypt messages when replying to an encrypted message
pl: Szyfrowanie wiadomo¶ci przy odpowiadaniu na zaszyfrowany email.

source: Encrypt sent messages with your own key in addition to recipient's
pl: Zaszyfruj wysy³ane wiadomo¶ci przy u¿yciu klucza w³asnego i odbiorcy

source: Save sent encrypted messages as clear text
pl: Zapisywanie wys³anych, zaszyfrowanych wiadomo¶ci w czystym tek¶cie

source: Don't use SSL
pl: Nie u¿ywaj SSL

source: Use SSL for POP3 connection
pl: U¿ywaj SSL dla po³±czeñ POP3

source: Use STARTTLS command to start SSL session
pl: U¿yj komendy STARTTLS by nawi±zaæ sesjê SSL

source: Use SSL for IMAP4 connection
pl: U¿ywaj SSL dla po³±czeñ IMAP4

source: Use SSL for NNTP connection
pl: U¿ywaj SSL dla po³±czeñ NNTP

source: Send (SMTP)
pl: Wysy³aj (SMTP)

source: Don't use SSL (but, if necessary, use STARTTLS)
pl: Nie u¿ywaj SSL (ale w razie potrzeby u¿ywaj STARTTLS)

source: Use SSL for SMTP connection
pl: U¿ywaj SSL dla po³±czeñ SMTP

source: Client certificates
pl: Certyfikaty klienta

source: Certificate for receiving
pl: Certyfikaty do odbierania

source: Browse
pl: Przegl±daj

source: Client certificate file as a PKCS12 or PEM file
pl: Plik certyfikatów klienta file jako plik PKCS12 lub PEM

source: Certificate for sending
pl: Certyfikat do wysy³ania

source: Use non-blocking SSL
pl: U¿ycie nie-blokuj±cego SSL

source: Turn this off if you have SSL connection problems
pl: Wy³±cz tê opcjê je¿eli masz problemy przy nawi±zywaniu po³±czeñ SSL

source: SMTP port
pl: Port serwera SMTP

source: POP3 port
pl: Port serwera POP3

source: IMAP4 port
pl: Port serwera IMAP4

source: NNTP port
pl: Port serwera NNTP

source: Domain name
pl: Nazwa domeny

source: Use command to communicate with server
pl: U¿yj komendy do komunikacji z serwerem

source: Move deleted mails to trash and expunge immediately
pl: Przesuñ usuniête wiadomo¶ci do kosza i opró¿nij go natychmiast

source: Mark cross-posted messages as read and color:
pl: Zaznacz cross-posty jako przeczytane i zakoloruj:

source: Put sent messages in
pl: Zapisz wys³ane wiadomo¶ci w

source: Put queued messages in
pl: Zapisywanie wiadomo¶ci do wys³ania w

source: Put draft messages in
pl: Zapisywanie kopii roboczych wiadomo¶ci w

source: Put deleted messages in
pl: Zapisywanie skasowane wiadomo¶ci w

source: Account name is not entered.
pl: Nie okre¶lono nazwy konta.

source: Mail address is not entered.
pl: Nie okre¶lono adresu e-mail.

source: SMTP server is not entered.
pl: Nie okre¶lono serwera SMTP.

source: User ID is not entered.
pl: Nie okre¶lono ID u¿ytkownika.

source: POP3 server is not entered.
pl: Nie okre¶lono serwera POP3.

source: The default Inbox folder doesn't exist.
pl: Brak domy¶lny katalogu dla poczty przychodz±cej.

source: IMAP4 server is not entered.
pl: Nie okre¶lono serwera IMAP4.

source: NNTP server is not entered.
pl: Nie okre¶lono serwera NNTP.

source: local mailbox filename is not entered.
pl: nazwa lokalnej skrzynki mailbox nie zosta³a podana.

source: mail command is not entered.
pl: nie okre¶lono komendy do lokalnego wys³ania poczty.

source: Receive
pl: Odbieranie

source: Templates
pl: Wzorce

source: Privacy
pl: Prywatno¶æ

source: Advanced
pl: Zaawansowane

source: Preferences for new account
pl: Ustawienia nowego konta

source: %s - Account preferences
pl: %s - Ustawienia konta

source: Select signature file
pl: Wybierz plik z podpisem

source: Select certificate file
pl: Wybierz plik certyfikatów

source: Protocol:
pl: Protokó³:

source: %s (plugin not loaded)
pl: %s (wtyczka nieza³adowana)

source: Actions configuration
pl: Konfiguracja Akcji

source: Menu name
pl: Nazwa menu:

source: Command
pl: Polecenie

source: Shell command
pl: Uruchom polecenie

source: Filter action
pl: Akcje filtrowania

source: Edit filter action
pl: Edytuj akcje filtrowania

source: Append the new action above to the list
pl: Dopisz now± akcjê nad list±

source: Replace
pl: Zamieñ

source: Replace the selected action in list with the action above
pl: Nadpisz wybran± akcjê wpisem z góry

source: Delete the selected action from the list
pl: Skasuj wybran± akcjê z listy

source: Clear all the input fields in the dialog
pl: Wyczy¶æ wszystkie pola do wpisywania w tym oknie

source: Show information on configuring actions
pl: Poka¿ informacje o konfigurowaniu akcji

source: Move the selected action up
pl: Przesuñ wybran± akcjê do góry

source: Move selected action down
pl: Przesuñ wybran± akcjê w dó³

source: (New)
pl: (Nowy)

source: Menu name is not set.
pl: Nie okre¶lono nazwy menu.

source: A leading '/' is not allowed in the menu name.
pl: Uko¶nik '/' nie mo¿e wystêpowaæ na pocz±tku nazwy menu.

source: Colon ':' is not allowed in the menu name.
pl: Dwukropek ':' nie mo¿e wystêpowaæ w nazwie menu.

source: Menu name is too long.
pl: Nazwa menu jest za d³uga

source: Command-line not set.
pl: Nie okre¶lono linii komend.

source: Menu name and command are too long.
pl: Nazwa menu i komenda s± za d³ugie.

source: The command %s has a syntax error.
pl: Ta komenda %s ma b³±d sk³adni.

source: Delete action
pl: Usuñ konto

source: Do you really want to delete this action?
pl: Czy naprawdê usun±æ t± akcjê?

source: Delete all actions
pl: Kasuje wszystkie akcje

source: Do you really want to delete all the actions?
pl: Czy naprawdê chcesz usun±æ wszystkie akcje?

source: Entry not saved
pl: Wpis niezapisany

source: The entry was not saved. Close anyway?
pl: Wpis nie zapisany. Naprawdê zamkn±æ?

source: +_Continue editing
pl: +Kon_tynuuj edycjê

source: Actions list not saved
pl: Lista akcji nie jest zapisana

source: The actions list has been modified. Close anyway?
pl: Lista akcji zosta³a zmodyfikowana. Naprawdê zamkn±æ?

source: <span weight="bold" underline="single">Menu name:</span>
pl: <span weight="bold" underline="single">Nazwa menu:</span>

source: Use / in menu name to make submenus.
pl: U¿ywaj / w nazwie menu by zrobiæ podmenu

source: <span weight="bold" underline="single">Command-line:</span>
pl: <span weight="bold" underline="single">Polecenie:</span>

source: <span weight="bold">Begin with:</span>
pl: <span weight="bold">Rozpoczyna siê od:</span>

source: to send message body or selection to command's standard input
pl: aby wys³aæ tre¶æ wiadomo¶ci lub wybrany jej kawa³ek do stdin

source: to send user provided text to command's standard input
pl: aby wys³aæ tekst u¿ytkownika do stdin komendy

source: to send user provided hidden text to command's standard input
pl: aby wys³aæ ukryty tekst u¿ytkownika do stdin komendy

source: <span weight="bold">End with:</span>
pl: <span weight="bold">Koñczy siê:</span>

source: to replace message body or selection with command's standard output
pl: aby zamieniæ tre¶æ wiadomo¶ci lub wybrany jej kawa³ek na stdout komendy

source: to insert command's standard output without replacing old text
pl: aby wstawiæ stdout komendy bez zamieniania starego tekstu

source: to run command asynchronously
pl: aby uruchomiæ komendê asynchronicznie

source: <span weight="bold">Use:</span>
pl: <span weight="bold">U¿yj:</span>

source: for the file of the selected message in RFC822/2822 format
pl: dla pliku lub wybranej wiadomo¶ci w formacie RFC822/2822

source: for the list of the files of the selected messages in RFC822/2822 format
pl: dla listy plików wybranych wiadomo¶ci w formacie RFC822/2822

source: for the file of the selected decoded message MIME part
pl: dla pliku wybranej zdekodowanej czê¶ci MIME danej wiadomo¶ci

source: for a user provided argument
pl: dla argumentu wprowadzonego przez u¿ytkownika

source: for a user provided hidden argument (e.g. password)
pl: dla ukrytego argumentu (np. has³o) wprowadzonego przez u¿ytkownika

source: for the text selection
pl: dla wybrania tekstu

source: apply filtering actions between {} to selected messages
pl: zastosuj filtrowanie zdefiniowane pomiêdzy {} do wybranych wiadomo¶ci

source: for a literal %
pl: Znak %

source: Actions
pl: Akcje

source: The Actions feature is a way for the user to launch external commands to process a complete message file or just one of its parts.
pl: Mechanizm Akcji jest rozwi±zaniem, które umo¿liwia u¿ytkownikowi uruchamianie zewnêtrznych komend do przetwarzania ca³ych plików wiadomo¶ci lub tylko niektórych czê¶ci wiadomo¶ci.

source: D_uplicate
pl: D_uplikaty

source: Current actions
pl: Obecne akcje

source: Action string is not valid.
pl: Podane wyra¿enie dla akcji jest nieprawid³owe

source: Hello,\n
pl: Witam,\n

source: On %d\n%f wrote:\n\n%q\n%X
pl: Dnia %D{%F}, o godz. %D{%T}\n%f napisa³(a):\n\n%q\n%X

source: \n\nBegin forwarded message:\n\n?d{Date: %d\n}?f{From: %f\n}?t{To: %t\n}?c{Cc: %c\n}?n{Newsgroups: %n\n}?s{Subject: %s\n}\n\n%M
pl: \n\nPocz±tek przekazywanej wiadomo¶ci:\n\n?d{Data: %d\n}?f{Od: %f\n}?t{Do: %t\n}?c{Kopia: %c\n}?n{Lista news: %n\n}?s{Temat: %s\n}\n\n%M

source: Automatic account selection
pl: Automatyczny wybór konta

source: when replying
pl: przy odpowiedzi

source: when forwarding
pl: przy przekazywaniu

source: when re-editing
pl: przy redagowaniu

source: Editing
pl: Edycja

source: Automatically launch the external editor
pl: Automatyczne uruchamianie zewnêtrznego edytora

source: characters
pl: znakach

source: Undo level
pl: Maksymalna ilo¶æ poziomów cofniêæ

source: Replying
pl: Odpowiadanie

source: Reply will quote by default
pl: Domy¶lnie odpowiadanie z cytatem

source: Reply button invokes mailing list reply
pl: Przycisk odpowiedzi powoduje odpowied¼ do listy dyskusyjnej

source: Forwarding
pl: Przekazywanie

source: Forward as attachment
pl: Przekazywanie (Fwd:) wiadomo¶ci jako za³±cznik

source: Keep the original 'From' header when redirecting
pl: Pozostawianie oryginalnego nag³ówka 'Od' ('From') przy przekazywaniu

source: When dropping files into the Compose window
pl: Przeci±gniêcie plików na okno wiadomo¶ci

source: Ask
pl: Zapytaj

source: Insert
pl: Wstaw

source: Attach
pl: Za³±cz

source: Writing
pl: Zapisywanie

source: Custom header configuration
pl: Ustawienia nag³ówków u¿ytkownika

source: Header name is not set.
pl: Brak nazwy nag³ówka.

source: This Header name is not allowed as a custom header.
pl: Ta nazwa nag³ówka nie jest dozwolona jako konfigurowalny nag³ówek.

source: Choose a PNG file
pl: Wybierz plik PNG

source: Choose an XBM file
pl: Wybierz plik XBN

source: Choose a text file
pl: Wybierz plik tekstowy

source: This file isn't an image.
pl: Ten plik nie jest obrazkiem.

source: The chosen image isn't the correct size (48x48).
pl: Wybrany obrazek ma niew³a¶ciwe wymiary. Prawid³owy powinien mieæ (48x48).

source: The image is too big; it must be maximum 725 bytes.
pl: Wybrany obrazek jest zbyt du¿y - powinien mieæ maksymalnie 752 bajty

source: The image isn't in the correct format (PNG).
pl: Obrazek nie jest we w³a¶ciwym formacie (PNG).

source: The image isn't in the correct format (XBM).
pl: Obrazek nie jest we w³a¶ciwym formacie (XBM).

source: Couldn't call `compface`. Make sure it's in your $PATH.
pl: Nie mo¿na uruchomiæ `compface`. Sprawd¼ czy ten plik jest w Twojej zmiennej $PATH.

source: Compface error: %s
pl: b³±d Compface: %s

source: This file contains newlines.
pl: Ten plik zawiera znaki nowych linii

source: Delete header
pl: Usuñ nag³ówek

source: Do you really want to delete this header?
pl: Czy naprawdê chcesz usun±æ ten nag³ówek?

source: Current custom headers
pl: Obecne nag³ówki u¿ytkownika

source: Displayed header configuration
pl: Ustawienia wy¶wietlania nag³ówka

source: Header name
pl: Nazwa nag³ówka

source: Displayed Headers
pl: Wy¶wietlone nag³ówki

source: Hidden headers
pl: Ukryte nag³ówki

source: Show all unspecified headers
pl: Poka¿ wszystkie nieokre¶lone nag³ówki

source: This header is already in the list.
pl: Taki nag³ówek ju¿ wystêpuje.

source: %s will be replaced with file name / URI
pl: %s zostanie zast±pione nazw± pliku / URI

source: Use system defaults when possible
pl: U¿yj domy¶lnych ustawieñ systemu je¿eli to mo¿liwe

source: Web browser
pl: Przegl±darka internetowa

source: Text editor
pl: Edytor tekstu

source: Command for 'Display as text'
pl: Komenda dla 'Wy¶wietl jako tekst'

source: This option enables MIME parts to be displayed in the message view via a script when using the 'Display as text' contextual menu item
pl: Ta opcja w³±cza wy¶wietlanie czê¶ci MIME w widoku wiadomo¶ci przy u¿yciu skryptu gdy u¿ywasz opcji z menu kontekstowego 'Wy¶wiel jako tekst'

source: Message View
pl: Widok wiadomo¶ci

source: External Programs
pl: Programy zewnêtrzne

source: Move
pl: Przenie¶

source: Copy
pl: Kopiuj

source: Hide
pl: Ukryj

source: Message flags
pl: Flagi wiadomo¶ci

source: Mark
pl: Zaznacz

source: Mark as read
pl: Zaznacz jako przeczytane

source: Mark as unread
pl: Zaznacz jako nieprzeczytane

source: Mark as spam
pl: Zaznacz jako spam

source: Mark as ham
pl: Zaznacz jako wolne od spamu

source: Execute
pl: Wykonaj

source: Color label
pl: Kolor tabelki

source: Resend
pl: Wy¶lij ponownie

source: Redirect
pl: Przeka¿

source: Score
pl: Punktowanie

source: Change score
pl: Zmieñ punktacjê

source: Set score
pl: Ustaw punktacjê

source: Tags
pl: Etykiety

source: Apply tag
pl: Zastosuj etykietê

source: Unset tag
pl: Usuñ etykietê

source: Clear tags
pl: Wyczy¶æ etykiety

source: Threads
pl: W±tki

source: Stop filter
pl: Zatrzymaj filtrowanie

source: Action configuration
pl: Konfiguracja Akcji

source: Rule
pl: Regu³a

source: Action
pl: Akcja

source: Command-line not set
pl: Nie okre¶lono linii komend

source: Destination is not set.
pl: Nie okre¶lono przeznaczenia.

source: Recipient is not set.
pl: Nie podano adresata.

source: Score is not set
pl: Punktacja nie jest ustawiona

source: Header is not set.
pl: Nag³ówek nie jest ustawiony.

source: Target addressbook/folder is not set.
pl: Nie wybrano docelowej ksi±¿ki adresowej/katalogu.

source: Tag name is empty.
pl: Nie podano nazwy etykiety.

source: No action was defined.
pl: Nie zdefiniowano ¿adnej akcji.

source: literal %
pl: Znak %

source: filename (should not be modified)
pl: Nazwa pliku (nie powinna byæ modyfikowana)

source: new line
pl: nowa linia

source: escape character for quotes
pl: znak 'escape' dla cytatu

source: quote character
pl: znak cytowania

source: Filtering Action: 'Execute'
pl: Konfiguracja akcji filtrowania

source: 'Execute' allows you to send a message or message element to an external program or script. The following symbols can be used:
pl: 'Wykonaj' pozwoli na wys³anie wiadomo¶ci lub czê¶ci wiadomo¶ci do zewnêtrznego programu lub skryptu. Nastêpuj±ce symbole mog± zostaæ u¿yte:

source: Recipient
pl: Adresat

source: Book/Folder
pl: Ksi±¿ka/Katalog

source: Destination
pl: Przeznaczenie

source: Color
pl: Kolor

source: Current action list
pl: Lista dostêpnych akcji

source: Filtering/Processing configuration
pl: Filtrowanie/Konfiguracja przetwarzania

source: Filtering Account Menu|All
pl: Wszystkie

source: Condition
pl: Warunek

source: Define...
pl: Zdefiniuj ...

source: Append the new rule above to the list
pl: Dopisz now± regu³ê na pocz±tek listy

source: Replace the selected rule in list with the rule above
pl: Nadpisz wybran± regu³ê z listy powy¿sz± regu³±

source: Delete the selected rule from the list
pl: Skasuj wybran± regu³ê z listy

source: Move the selected rule to the top
pl: Przesuñ wybran± regu³ê z listy na górê

source: Page up
pl: Strona w górê

source: Move the selected rule one page up
pl: Przesuwa wybran± regu³ê o jedn± stronê do góry

source: Move the selected rule up
pl: Przesuwa wybran± regu³ê w górê

source: Move the selected rule down
pl: Przesuwa wybran± regu³ê w dó³

source: Page down
pl: Strona w dó³

source: Move the selected rule one page down
pl: Przesuwa wybran± regu³ê o stronê w dó³

source: Move the selected rule to the bottom
pl: Przesuwa wybran± regu³ê na sam dó³

source: Condition string is not valid.
pl: Ci±g jest nieprawid³owy

source: Condition string is empty.
pl: Ustawienia warunków s± puste

source: Action string is empty.
pl: Ustawienia akcji s± puste

source: Delete rule
pl: Usuñ regu³ê

source: Do you really want to delete this rule?
pl: Naprawdê chcesz usun±æ tê regu³ê?

source: Delete all rules
pl: Usuñ wszystkie regu³y

source: Do you really want to delete all the rules?
pl: Naprawdê chcesz usun±æ wszystkie regu³y?

source: Filtering rules not saved
pl: Regu³y filtrowania nie zosta³y zapisane

source: The list of filtering rules have been modified. Close anyway?
pl: Lista regu³ filtrowania nie zosta³a zapisana. Czy mimo to chcesz zamkn±æ to okno?

source: Move one page up
pl: Id¼ o stronê w górê

source: Move one page down
pl: Id¼ o stronê w dó³

source: Enable
pl: W³±czone

source: Folder list columns configuration
pl: Konfiguracja kolumn w li¶cie katalogów

source: Select columns to be displayed in the folder list. You can modify the order by using the Up / Down buttons or by dragging the items.
pl: Wybierz kolumny, które maj± byæ wy¶wietlone w widoku katalogów. Mo¿esz modyfikowaæ kolejno¶æ za pomoc± przycisków "Do góry" "Na Dó³", lub przesuwaj±c elementy mysz±.

source: Hidden columns
pl: Ukryte kolumny

source: Displayed columns
pl: Wy¶wietlane kolumny

source: Use default
pl: U¿yj domy¶lnego

source: <i>These preferences will not be saved as this folder is a top-level folder. However, you can set them for the whole mailbox tree by using "Apply to subfolders".</i>
pl: <i>Te preferencje nie zostan± zapisane, poniewa¿ to jest katalog nadrzêdny. Jednak¿e mo¿esz ich u¿yæ aby ustawiæ je w ca³ej skrzynce za pomoc± "Zastosuj do podkatalogów".<i>

source: Apply to subfolders
pl: Zastosuj do podkatalogów

source: Normal
pl: Zwyk³y

source: Outbox
pl: Wys³ane

source: Folder type
pl: Rodzaj katalogu

source: Simplify Subject RegExp
pl: Uproszczenie wyra¿enia regularnego tematu

source: Folder chmod
pl: Zmiana uprawnieñ do katalogu

source: Folder color
pl: Kolor katalogu

source: Pick color for folder
pl: Wybierz kolor dla docelowego katalogu

source: Run Processing rules at start-up
pl: Uruchom regu³y przetwarzania przy starcie

source: Run Processing rules when opening
pl: Uruchom regu³y przetwarzania podczas otwierania

source: Scan for new mail
pl: Przeskanuj w poszukiwaniu nowej poczty

source: Turn this option on if mail is delivered directly to this folder by server side filtering on IMAP or by an external application
pl: W³±cz tê opcjê je¿eli poczta jest dostarczana do tego katalogu bezpo¶rednio przez system filtruj±cy na serwerze (np. poprzez IMAP lub zewnêtrzny program).

source: No
pl: Brak

source: Synchronise for offline use
pl: Synchronizuj do u¿ytku offline

source: Fetch message bodies from the last
pl: Pobierz ca³e wiadomo¶ci z ostatnich

source: 0: all bodies
pl: 0: wszystkie wiadomo¶ci

source: Remove older messages bodies
pl: Usuñ tre¶æ starszych wiadomo¶ci

source: Discard folder cache
pl: Porzuæ pamiêæ podrêczn± katalogu

source: Request Return Receipt
pl: ¯±daj potwierdzenia dostarczenia

source: Save copy of outgoing messages to this folder instead of Sent
pl: Zapisz kopiê poczty wychodz±cej do tego folderu a nie do Wys³anych

source: Default account
pl: Domy¶lne konto:

source: Discard cache
pl: Opró¿nij dane z pamiêci podrêcznej

source: Do you really want to discard the local cached data for this folder?
pl: Czy na pewno chcesz wyczy¶ciæ przechowywan± lokalnie pamiêæ podrêczn± dla tego folderu?

source: +Discard
pl: +Porzuæ

source: General
pl: Ogólne

source: Properties for folder %s
pl: Ustawienia dla katalogu %s

source: Folder and Message Lists
pl: Katalog i lista wiadomo¶ci

source: Message
pl: Wiadomo¶æ

source: Derive small and bold fonts from Folder and Message Lists font
pl: Jako ma³ych i pogrubionych czcionek u¿ywaj czcionki katalogów i listy wiadomo¶ci.

source: Small
pl: Ma³e
