Repository: chriskmanx/qmole
Catalog: QMOLEDEV/GConf-3.2.3/po/*.po
Languages: en@shaw

source: Expected pair of type (%s,%s) got type (%s,%s)
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘ğ‘º ğ‘ ğ‘‘ğ‘²ğ‘ (%s,%s) ğ‘œğ‘ªğ‘‘ ğ‘‘ğ‘²ğ‘ (%s,%s)

source: Quoted string doesn't begin with a quotation mark
en@shaw: ğ‘’ğ‘¢ğ‘´ğ‘‘ğ‘©ğ‘› ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘›ğ‘³ğ‘Ÿğ‘¯ğ‘‘ ğ‘šğ‘©ğ‘œğ‘¦ğ‘¯ ğ‘¢ğ‘¦ğ‘ ğ‘© ğ‘’ğ‘¢ğ‘´ğ‘‘ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘¥ğ‘¸ğ‘’

source: Quoted string doesn't end with a quotation mark
en@shaw: ğ‘’ğ‘¢ğ‘´ğ‘‘ğ‘©ğ‘› ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘›ğ‘³ğ‘Ÿğ‘¯ğ‘‘ ğ‘§ğ‘¯ğ‘› ğ‘¢ğ‘¦ğ‘ ğ‘© ğ‘’ğ‘¢ğ‘´ğ‘‘ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘¥ğ‘¸ğ‘’

source: Encoded value is not valid UTF-8
en@shaw: ğ‘§ğ‘¯ğ‘’ğ‘´ğ‘›ğ‘©ğ‘› ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› UTF-8

source: Could not lock temporary file '%s': %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘¤ğ‘ªğ‘’ ğ‘‘ğ‘§ğ‘¥ğ‘ğ‘¼ğ‘¼ğ‘¦ ğ‘“ğ‘²ğ‘¤ '%s': %s

source: Could not create file '%s', probably because it already exists
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘’ğ‘®ğ‘¦ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ '%s', ğ‘ğ‘®ğ‘ªğ‘šğ‘©ğ‘šğ‘¤ğ‘¦ ğ‘šğ‘¦ğ‘’ğ‘ªğ‘Ÿ ğ‘¦ğ‘‘ ğ‘·ğ‘¤ğ‘®ğ‘§ğ‘›ğ‘¦ ğ‘§ğ‘’ğ‘Ÿğ‘¦ğ‘•ğ‘‘ğ‘•

source: Failed to create or open '%s'
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘®ğ‘¦ğ‘±ğ‘‘ ğ‘¹ ğ‘´ğ‘ğ‘©ğ‘¯ '%s'

source: Failed to lock '%s': probably another process has the lock, or your operating system has NFS file locking misconfigured (%s)
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¤ğ‘ªğ‘’ '%s': ğ‘ğ‘®ğ‘ªğ‘šğ‘©ğ‘šğ‘¤ğ‘¦ ğ‘©ğ‘¯ğ‘³ğ‘ğ‘¼ ğ‘ğ‘®ğ‘´ğ‘•ğ‘§ğ‘• ğ‘£ğ‘¨ğ‘Ÿ ğ‘ ğ‘¤ğ‘ªğ‘’, ğ‘¹ ğ‘¿ğ‘¼ ğ‘ªğ‘ğ‘¼ğ‘±ğ‘‘ğ‘¦ğ‘™ ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘£ğ‘¨ğ‘Ÿ NFS ğ‘“ğ‘²ğ‘¤ ğ‘¤ğ‘ªğ‘’ğ‘¦ğ‘™ ğ‘¥ğ‘¦ğ‘•ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘©ğ‘› (%s)

source: Failed to remove '%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ '%s': %s

source: Not running within active session
en@shaw: ğ‘¯ğ‘ªğ‘‘ ğ‘®ğ‘³ğ‘¯ğ‘¦ğ‘™ ğ‘¢ğ‘¦ğ‘ğ‘¦ğ‘¯ ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘ ğ‘•ğ‘§ğ‘–ğ‘©ğ‘¯

source: Failed to get connection to session: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘§ğ‘’ğ‘–ğ‘©ğ‘¯ ğ‘‘ ğ‘•ğ‘§ğ‘–ğ‘©ğ‘¯: %s

source: Could not send message to GConf daemon: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘•ğ‘§ğ‘¯ğ‘› ğ‘¥ğ‘§ğ‘•ğ‘¦ğ‘¡ ğ‘‘ GConf ğ‘›ğ‘°ğ‘¥ğ‘©ğ‘¯: %s

source: daemon gave erroneous reply: %s
en@shaw: ğ‘›ğ‘°ğ‘¥ğ‘©ğ‘¯ ğ‘œğ‘±ğ‘ ğ‘§ğ‘®ğ‘´ğ‘¯ğ‘°ğ‘©ğ‘• ğ‘®ğ‘¦ğ‘ğ‘¤ğ‘²: %s

source: couldn't contact ORB to resolve existing gconfd object reference
en@shaw: ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ ORB ğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘§ğ‘’ğ‘Ÿğ‘¦ğ‘•ğ‘‘ğ‘¦ğ‘™ gconfd ğ‘©ğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘•

source: Failed to convert IOR '%s' to an object reference
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘ğ‘»ğ‘‘ IOR '%s' ğ‘‘ ğ‘©ğ‘¯ ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘•

source: couldn't create directory `%s': %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘¥ğ‘±ğ‘’ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ `%s': %s

source: Can't write to file `%s': %s
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘®ğ‘²ğ‘‘ ğ‘‘ ğ‘“ğ‘²ğ‘¤ `%s': %s

source: We didn't have the lock on file `%s', but we should have
en@shaw: ğ‘¢ğ‘° ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘£ğ‘¨ğ‘ ğ‘ ğ‘¤ğ‘ªğ‘’ ğ‘ªğ‘¯ ğ‘“ğ‘²ğ‘¤ `%s', ğ‘šğ‘³ğ‘‘ ğ‘¢ğ‘° ğ‘–ğ‘«ğ‘› ğ‘£ğ‘¨ğ‘

source: Failed to link '%s' to '%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¤ğ‘¦ğ‘™ğ‘’ '%s' ğ‘‘ '%s': %s

source: Failed to remove lock file `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘¤ğ‘ªğ‘’ ğ‘“ğ‘²ğ‘¤ `%s': %s

source: Failed to clean up file '%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘¤ğ‘°ğ‘¯ ğ‘³ğ‘ ğ‘“ğ‘²ğ‘¤ '%s': %s

source: Failed to remove lock directory `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘¤ğ‘ªğ‘’ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ `%s': %s

source: Server ping error: %s
en@shaw: ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘ğ‘¦ğ‘™ ğ‘»ğ‘¼: %s

source: Failed to contact configuration server; some possible causes are that you need to enable TCP/IP networking for ORBit, or you have stale NFS locks due to a system crash. See http://projects.gnome.org/gconf/ for information. (Details - %s)
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘»ğ‘ğ‘¼; ğ‘•ğ‘³ğ‘¥ ğ‘ğ‘ªğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘·ğ‘Ÿğ‘©ğ‘Ÿ ğ‘¸ ğ‘ğ‘¨ğ‘‘ ğ‘¿ ğ‘¯ğ‘°ğ‘› ğ‘‘ ğ‘¦ğ‘¯ğ‘±ğ‘šğ‘©ğ‘¤ TCP/IP ğ‘¯ğ‘§ğ‘‘ğ‘¢ğ‘»ğ‘’ğ‘¦ğ‘™ ğ‘“ğ‘¹ ORBit, ğ‘¹ ğ‘¿ ğ‘£ğ‘¨ğ‘ ğ‘•ğ‘‘ğ‘±ğ‘¤ NFS ğ‘¤ğ‘ªğ‘’ğ‘• ğ‘›ğ‘¿ ğ‘‘ ğ‘© ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘’ğ‘®ğ‘¨ğ‘–. ğ‘•ğ‘° http://projects.gnome.org/gconf/ ğ‘“ğ‘¹ ğ‘¦ğ‘¯ğ‘“ğ‘¼ğ‘¥ğ‘±ğ‘–ğ‘©ğ‘¯. (ğ‘›ğ‘°ğ‘‘ğ‘±ğ‘¤ğ‘Ÿ - %s)

source: none
en@shaw: ğ‘¯ğ‘³ğ‘¯

source: - Sanity checks for GConf
en@shaw: - ğ‘•ğ‘¨ğ‘¯ğ‘©ğ‘‘ğ‘° ğ‘—ğ‘§ğ‘’ğ‘• ğ‘“ğ‘¹ GConf

source: Error while parsing options: %s. Run '%s --help' to see a full list of available command line options.
en@shaw: ğ‘»ğ‘¼ ğ‘¢ğ‘²ğ‘¤ ğ‘ğ‘¸ğ‘•ğ‘¦ğ‘™ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ: %s. ğ‘®ğ‘³ğ‘¯ '%s --help' ğ‘‘ ğ‘•ğ‘° ğ‘© ğ‘“ğ‘«ğ‘¤ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘ ğ‘©ğ‘ğ‘±ğ‘¤ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ.

source: Please contact your system administrator to resolve the following problem: Could not open or create the file "%s"; this indicates that there may be a problem with your configuration, as many programs will need to create files in your home directory. The error was "%s" (errno = %d).
en@shaw: ğ‘ğ‘¤ğ‘°ğ‘Ÿ ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ ğ‘¿ğ‘¼ ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘©ğ‘›ğ‘¥ğ‘¦ğ‘¯ğ‘¦ğ‘•ğ‘‘ğ‘®ğ‘±ğ‘‘ğ‘¼ ğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘ ğ‘“ğ‘ªğ‘¤ğ‘´ğ‘¦ğ‘™ ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘´ğ‘ğ‘©ğ‘¯ ğ‘¹ ğ‘’ğ‘®ğ‘¦ğ‘±ğ‘‘ ğ‘ ğ‘“ğ‘²ğ‘¤ "%s"; ğ‘ğ‘¦ğ‘• ğ‘¦ğ‘¯ğ‘›ğ‘¦ğ‘’ğ‘±ğ‘‘ğ‘• ğ‘ğ‘¨ğ‘‘ ğ‘ğ‘º ğ‘¥ğ‘± ğ‘šğ‘° ğ‘© ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥ ğ‘¢ğ‘¦ğ‘ ğ‘¿ğ‘¼ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯, ğ‘¨ğ‘Ÿ ğ‘¥ğ‘§ğ‘¯ğ‘¦ ğ‘ğ‘®ğ‘´ğ‘œğ‘®ğ‘¨ğ‘¥ğ‘Ÿ ğ‘¢ğ‘¦ğ‘¤ ğ‘¯ğ‘°ğ‘› ğ‘‘ ğ‘’ğ‘®ğ‘¦ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ğ‘Ÿ ğ‘¦ğ‘¯ ğ‘¿ğ‘¼ ğ‘£ğ‘´ğ‘¥ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦. ğ‘ ğ‘»ğ‘¼ ğ‘¢ğ‘ªğ‘Ÿ "%s" (errno = %d).

source: Please contact your system administrator to resolve the following problem: Could not lock the file "%s"; this indicates that there may be a problem with your operating system configuration. If you have an NFS-mounted home directory, either the client or the server may be set up incorrectly. See the rpc.statd and rpc.lockd documentation. A common cause of this error is that the "nfslock" service has been disabled.The error was "%s" (errno = %d).
en@shaw: ğ‘ğ‘¤ğ‘°ğ‘Ÿ ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ ğ‘¿ğ‘¼ ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘©ğ‘›ğ‘¥ğ‘¦ğ‘¯ğ‘¦ğ‘•ğ‘‘ğ‘®ğ‘±ğ‘‘ğ‘¼ ğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘ ğ‘“ğ‘ªğ‘¤ğ‘´ğ‘¦ğ‘™ ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘¤ğ‘ªğ‘’ ğ‘ ğ‘“ğ‘²ğ‘¤ "%s"; ğ‘ğ‘¦ğ‘• ğ‘¦ğ‘¯ğ‘›ğ‘¦ğ‘’ğ‘±ğ‘‘ğ‘• ğ‘ğ‘¨ğ‘‘ ğ‘ğ‘º ğ‘¥ğ‘± ğ‘šğ‘° ğ‘© ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥ ğ‘¢ğ‘¦ğ‘ ğ‘¿ğ‘¼ ğ‘ªğ‘ğ‘¼ğ‘±ğ‘‘ğ‘¦ğ‘™ ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯. ğ‘¦ğ‘“ ğ‘¿ ğ‘£ğ‘¨ğ‘ ğ‘©ğ‘¯ NFS-ğ‘¥ğ‘¬ğ‘¯ğ‘‘ğ‘©ğ‘› ğ‘£ğ‘´ğ‘¥ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦, ğ‘²ğ‘ğ‘¼ ğ‘ ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘¹ ğ‘ ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘¥ğ‘± ğ‘šğ‘° ğ‘•ğ‘§ğ‘‘ ğ‘³ğ‘ ğ‘¦ğ‘¯ğ‘’ğ‘»ğ‘§ğ‘’ğ‘‘ğ‘¤ğ‘°. ğ‘•ğ‘° ğ‘ rpc.statd ğ‘¯ rpc.lockd ğ‘›ğ‘ªğ‘’ğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘–ğ‘©ğ‘¯. ğ‘© ğ‘’ğ‘ªğ‘¥ğ‘©ğ‘¯ ğ‘’ğ‘·ğ‘Ÿ ğ‘ ğ‘ğ‘¦ğ‘• ğ‘»ğ‘¼ ğ‘¦ğ‘Ÿ ğ‘ğ‘¨ğ‘‘ ğ‘ "nfslock" ğ‘•ğ‘»ğ‘ğ‘¦ğ‘• ğ‘£ğ‘¨ğ‘Ÿ ğ‘šğ‘°ğ‘¯ ğ‘›ğ‘¦ğ‘•ğ‘±ğ‘šğ‘©ğ‘¤ğ‘›. ğ‘ ğ‘»ğ‘¼ ğ‘¢ğ‘ªğ‘Ÿ "%s" (errno = %d).

source: Can't remove file %s: %s
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘“ğ‘²ğ‘¤ %s: %s

source: Please contact your system administrator to resolve the following problem: No configuration sources in the configuration file "%s"; this means that preferences and other settings can't be saved. %s%s
en@shaw: ğ‘ğ‘¤ğ‘°ğ‘Ÿ ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ ğ‘¿ğ‘¼ ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘©ğ‘›ğ‘¥ğ‘¦ğ‘¯ğ‘¦ğ‘•ğ‘‘ğ‘®ğ‘±ğ‘‘ğ‘¼ ğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘ ğ‘“ğ‘ªğ‘¤ğ‘´ğ‘¦ğ‘™ ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥: ğ‘¯ğ‘´ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘•ğ‘©ğ‘Ÿ ğ‘¦ğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘²ğ‘¤ "%s"; ğ‘ğ‘¦ğ‘• ğ‘¥ğ‘°ğ‘¯ğ‘Ÿ ğ‘ğ‘¨ğ‘‘ ğ‘ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘•ğ‘©ğ‘Ÿ ğ‘¯ ğ‘³ğ‘ğ‘¼ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ğ‘Ÿ ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘šğ‘° ğ‘•ğ‘±ğ‘ğ‘›. %s%s

source: Error reading the file:
en@shaw: ğ‘»ğ‘¼ ğ‘®ğ‘°ğ‘›ğ‘¦ğ‘™ ğ‘ ğ‘“ğ‘²ğ‘¤:

source: Please contact your system administrator to resolve the following problem: Could not resolve the address "%s" in the configuration file "%s": %s
en@shaw: ğ‘ğ‘¤ğ‘°ğ‘Ÿ ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ ğ‘¿ğ‘¼ ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘©ğ‘›ğ‘¥ğ‘¦ğ‘¯ğ‘¦ğ‘•ğ‘‘ğ‘®ğ‘±ğ‘‘ğ‘¼ ğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘ ğ‘“ğ‘ªğ‘¤ğ‘´ğ‘¦ğ‘™ ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘ ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• "%s" ğ‘¦ğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘²ğ‘¤ "%s": %s

source: The files that contain your preference settings are currently in use. You might be logged in to a session from another computer, and the other login session is using your preference settings files. You can continue to use the current session, but this might cause temporary problems with the preference settings in the other session. Do you want to continue?
en@shaw: ğ‘ ğ‘“ğ‘²ğ‘¤ğ‘Ÿ ğ‘ğ‘¨ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘¯ ğ‘¿ğ‘¼ ğ‘ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘• ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ğ‘Ÿ ğ‘¸ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ğ‘¤ğ‘¦ ğ‘¦ğ‘¯ ğ‘¿ğ‘•. ğ‘¿ ğ‘¥ğ‘²ğ‘‘ ğ‘šğ‘° ğ‘¤ğ‘ªğ‘œğ‘› ğ‘¦ğ‘¯ ğ‘‘ ğ‘© ğ‘•ğ‘§ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘©ğ‘¯ğ‘³ğ‘ğ‘¼ ğ‘’ğ‘©ğ‘¥ğ‘ğ‘¿ğ‘‘ğ‘¼, ğ‘¯ ğ‘ ğ‘³ğ‘ğ‘¼ ğ‘¤ğ‘ªğ‘œğ‘¦ğ‘¯ ğ‘•ğ‘§ğ‘–ğ‘©ğ‘¯ ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘¦ğ‘™ ğ‘¿ğ‘¼ ğ‘ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘• ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ğ‘Ÿ ğ‘“ğ‘²ğ‘¤ğ‘Ÿ. ğ‘¿ ğ‘’ğ‘¨ğ‘¯ ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘¦ğ‘¯ğ‘¿ ğ‘‘ ğ‘¿ğ‘• ğ‘ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘•ğ‘§ğ‘–ğ‘©ğ‘¯, ğ‘šğ‘³ğ‘‘ ğ‘ğ‘¦ğ‘• ğ‘¥ğ‘²ğ‘‘ ğ‘’ğ‘·ğ‘Ÿ ğ‘‘ğ‘§ğ‘¥ğ‘ğ‘¼ğ‘¼ğ‘¦ ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥ğ‘Ÿ ğ‘¢ğ‘¦ğ‘ ğ‘ ğ‘ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘• ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ğ‘Ÿ ğ‘¦ğ‘¯ ğ‘ ğ‘³ğ‘ğ‘¼ ğ‘•ğ‘§ğ‘–ğ‘©ğ‘¯. ğ‘›ğ‘µ ğ‘¿ ğ‘¢ğ‘ªğ‘¯ğ‘‘ ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘¦ğ‘¯ğ‘¿?

source: _Log Out
en@shaw: _ğ‘¤ğ‘ªğ‘œ ğ‘¬ğ‘‘

source: _Continue
en@shaw: _ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘¦ğ‘¯ğ‘¿

source: %s Continue (y/n)?
en@shaw: %s ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘¦ğ‘¯ğ‘¿ (y/n)?

source: Schema contains invalid UTF-8
en@shaw: ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘¯ğ‘Ÿ ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› UTF-8

source: Schema specifies type list but doesn't specify the type of the list elements
en@shaw: ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘Ÿ ğ‘‘ğ‘²ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘šğ‘³ğ‘‘ ğ‘›ğ‘³ğ‘Ÿğ‘¯ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘•

source: Schema specifies type pair but doesn't specify the type of the car/cdr elements
en@shaw: ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘Ÿ ğ‘‘ğ‘²ğ‘ ğ‘ğ‘º ğ‘šğ‘³ğ‘‘ ğ‘›ğ‘³ğ‘Ÿğ‘¯ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ car/cdr ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘•

source: Failed to load source "%s": %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¤ğ‘´ğ‘› ğ‘•ğ‘¹ğ‘• "%s": %s

source: Resolved address "%s" to a writable configuration source at position %d
en@shaw: ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ğ‘› ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• "%s" ğ‘‘ ğ‘© ğ‘®ğ‘²ğ‘‘ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘¨ğ‘‘ ğ‘ğ‘©ğ‘Ÿğ‘¦ğ‘–ğ‘©ğ‘¯ %d

source: Resolved address "%s" to a read-only configuration source at position %d
en@shaw: ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ğ‘› ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• "%s" ğ‘‘ ğ‘© ğ‘®ğ‘§ğ‘›-ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘¨ğ‘‘ ğ‘ğ‘©ğ‘Ÿğ‘¦ğ‘–ğ‘©ğ‘¯ %d

source: Resolved address "%s" to a partially writable configuration source at position %d
en@shaw: ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ğ‘› ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• "%s" ğ‘‘ ğ‘© ğ‘ğ‘¸ğ‘‘ğ‘¦ğ‘¨ğ‘¤ğ‘¦ ğ‘®ğ‘²ğ‘‘ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘¨ğ‘‘ ğ‘ğ‘©ğ‘Ÿğ‘¦ğ‘–ğ‘©ğ‘¯ %d

source: None of the resolved addresses are writable; saving configuration settings will not be possible
en@shaw: ğ‘¯ğ‘³ğ‘¯ ğ‘ ğ‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ğ‘› ğ‘©ğ‘›ğ‘®ğ‘§ğ‘•ğ‘©ğ‘Ÿ ğ‘¸ ğ‘®ğ‘²ğ‘‘ğ‘©ğ‘šğ‘©ğ‘¤; ğ‘•ğ‘±ğ‘ğ‘¦ğ‘™ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ğ‘Ÿ ğ‘¢ğ‘¦ğ‘¤ ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘ğ‘ªğ‘•ğ‘©ğ‘šğ‘©ğ‘¤

source: Schema `%s' specified for `%s' stores a non-schema value
en@shaw: ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© `%s' ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘“ğ‘¹ `%s' ğ‘•ğ‘‘ğ‘¹ğ‘Ÿ ğ‘© ğ‘¯ğ‘ªğ‘¯-ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘ğ‘¨ğ‘¤ğ‘¿

source: The '/' name can only be a directory, not a key
en@shaw: ğ‘ '/' ğ‘¯ğ‘±ğ‘¥ ğ‘’ğ‘¨ğ‘¯ ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘šğ‘° ğ‘© ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦, ğ‘¯ğ‘ªğ‘‘ ğ‘© ğ‘’ğ‘°

source: Value for `%s' set in a read-only source at the front of your configuration path
en@shaw: ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ `%s' ğ‘•ğ‘§ğ‘‘ ğ‘¦ğ‘¯ ğ‘© ğ‘®ğ‘§ğ‘›-ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘•ğ‘¹ğ‘• ğ‘¨ğ‘‘ ğ‘ ğ‘“ğ‘®ğ‘³ğ‘¯ğ‘‘ ğ‘ ğ‘¿ğ‘¼ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ğ‘­ğ‘”

source: Unable to store a value at key '%s', as the configuration server has no writable databases. There are some common causes of this problem: 1) your configuration path file %s/path doesn't contain any databases or wasn't found 2) somehow we mistakenly created two gconfd processes 3) your operating system is misconfigured so NFS file locking doesn't work in your home directory or 4) your NFS client machine crashed and didn't properly notify the server on reboot that file locks should be dropped. If you have two gconfd processes (or had two at the time the second was launched), logging out, killing all copies of gconfd, and logging back in may help. If you have stale locks, remove ~/.gconf*/*lock. Perhaps the problem is that you attempted to use GConf from two machines at once, and ORBit still has its default configuration that prevents remote CORBA connections - put "ORBIIOPIPv4=1" in /etc/orbitrc. As always, check the user.* syslog for details on problems gconfd encountered. There can only be one gconfd per home directory, and it must own a lockfile in ~/.gconfd and also lockfiles in individual storage locations such as ~/.gconf
en@shaw: ğ‘³ğ‘¯ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘•ğ‘‘ğ‘¹ ğ‘© ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘¨ğ‘‘ ğ‘’ğ‘° '%s', ğ‘¨ğ‘Ÿ ğ‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘£ğ‘¨ğ‘Ÿ ğ‘¯ğ‘´ ğ‘®ğ‘²ğ‘‘ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘•ğ‘©ğ‘Ÿ. ğ‘ğ‘º ğ‘¸ ğ‘•ğ‘³ğ‘¥ ğ‘’ğ‘ªğ‘¥ğ‘©ğ‘¯ ğ‘’ğ‘·ğ‘Ÿğ‘©ğ‘Ÿ ğ‘ ğ‘ğ‘¦ğ‘• ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥: 1) ğ‘¿ğ‘¼ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ğ‘­ğ‘” ğ‘“ğ‘²ğ‘¤ %s/path ğ‘›ğ‘³ğ‘Ÿğ‘¯ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘¯ ğ‘§ğ‘¯ğ‘¦ ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘•ğ‘©ğ‘Ÿ ğ‘¹ ğ‘¢ğ‘ªğ‘Ÿğ‘¯ğ‘‘ ğ‘“ğ‘¬ğ‘¯ğ‘› 2) ğ‘•ğ‘³ğ‘¥ğ‘£ğ‘¬ ğ‘¢ğ‘° ğ‘¥ğ‘¦ğ‘•ğ‘‘ğ‘±ğ‘’ğ‘©ğ‘¯ğ‘¤ğ‘° ğ‘’ğ‘®ğ‘¦ğ‘±ğ‘‘ğ‘©ğ‘› ğ‘‘ğ‘µ gconfd ğ‘ğ‘®ğ‘´ğ‘•ğ‘§ğ‘•ğ‘©ğ‘Ÿ 3) ğ‘¿ğ‘¼ ğ‘ªğ‘ğ‘¼ğ‘±ğ‘‘ğ‘¦ğ‘™ ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘¦ğ‘Ÿ ğ‘¥ğ‘¦ğ‘•ğ‘’ğ‘ªğ‘¯ğ‘“ğ‘¦ğ‘œğ‘¼ğ‘› ğ‘•ğ‘´ NFS ğ‘“ğ‘²ğ‘¤ ğ‘¤ğ‘ªğ‘’ğ‘¦ğ‘™ ğ‘›ğ‘³ğ‘Ÿğ‘¯ğ‘‘ ğ‘¢ğ‘»ğ‘’ ğ‘¦ğ‘¯ ğ‘¿ğ‘¼ ğ‘£ğ‘´ğ‘¥ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘¹ 4) ğ‘¿ğ‘¼ NFS ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘¥ğ‘©ğ‘–ğ‘°ğ‘¯ ğ‘’ğ‘®ğ‘¨ğ‘–ğ‘‘ ğ‘¯ ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘¤ğ‘¦ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘ªğ‘¯ ğ‘®ğ‘°ğ‘šğ‘µğ‘‘ ğ‘ğ‘¨ğ‘‘ ğ‘“ğ‘²ğ‘¤ ğ‘¤ğ‘ªğ‘’ğ‘• ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘›ğ‘®ğ‘ªğ‘ğ‘‘. ğ‘¦ğ‘“ ğ‘¿ ğ‘£ğ‘¨ğ‘ ğ‘‘ğ‘µ gconfd ğ‘ğ‘®ğ‘´ğ‘•ğ‘§ğ‘•ğ‘©ğ‘Ÿ (ğ‘¹ ğ‘£ğ‘¨ğ‘› ğ‘‘ğ‘µ ğ‘¨ğ‘‘ ğ‘ ğ‘‘ğ‘²ğ‘¥ ğ‘ ğ‘•ğ‘§ğ‘’ğ‘©ğ‘¯ğ‘› ğ‘¢ğ‘ªğ‘Ÿ ğ‘¤ğ‘ªğ‘¯ğ‘—ğ‘‘), ğ‘¤ğ‘ªğ‘œğ‘¦ğ‘™ ğ‘¬ğ‘‘, ğ‘’ğ‘¦ğ‘¤ğ‘¦ğ‘™ ğ‘·ğ‘¤ ğ‘’ğ‘ªğ‘ğ‘¦ğ‘Ÿ ğ‘ gconfd, ğ‘¯ ğ‘¤ğ‘ªğ‘œğ‘¦ğ‘™ ğ‘šğ‘¨ğ‘’ ğ‘¦ğ‘¯ ğ‘¥ğ‘± ğ‘£ğ‘§ğ‘¤ğ‘. ğ‘¦ğ‘“ ğ‘¿ ğ‘£ğ‘¨ğ‘ ğ‘•ğ‘‘ğ‘±ğ‘¤ ğ‘¤ğ‘ªğ‘’ğ‘•, ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ~/.gconf*/*lock. ğ‘ğ‘¼ğ‘£ğ‘¨ğ‘ğ‘• ğ‘ ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥ ğ‘¦ğ‘Ÿ ğ‘ğ‘¨ğ‘‘ ğ‘¿ ğ‘©ğ‘‘ğ‘§ğ‘¥ğ‘ğ‘‘ğ‘©ğ‘› ğ‘‘ ğ‘¿ğ‘• GConf ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘‘ğ‘µ ğ‘¥ğ‘©ğ‘–ğ‘°ğ‘¯ğ‘Ÿ ğ‘¨ğ‘‘ ğ‘¢ğ‘³ğ‘¯ğ‘•, ğ‘¯ ORBit ğ‘•ğ‘‘ğ‘¦ğ‘¤ ğ‘£ğ‘¨ğ‘Ÿ ğ‘¦ğ‘‘ğ‘• ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ğ‘¨ğ‘‘ ğ‘ğ‘®ğ‘¦ğ‘ğ‘§ğ‘¯ğ‘‘ğ‘• ğ‘®ğ‘¦ğ‘¥ğ‘´ğ‘‘ CORBA ğ‘’ğ‘©ğ‘¯ğ‘§ğ‘’ğ‘–ğ‘©ğ‘¯ğ‘Ÿ - ğ‘ğ‘«ğ‘‘ "ORBIIOPIPv4=1" ğ‘¦ğ‘¯ /etc/orbitrc. ğ‘¨ğ‘Ÿ ğ‘·ğ‘¤ğ‘¢ğ‘±ğ‘Ÿ, ğ‘—ğ‘§ğ‘’ ğ‘ user.* syslog ğ‘“ğ‘¹ ğ‘›ğ‘°ğ‘‘ğ‘±ğ‘¤ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ğ‘®ğ‘ªğ‘šğ‘¤ğ‘©ğ‘¥ğ‘Ÿ gconfd ğ‘¦ğ‘¯ğ‘’ğ‘¶ğ‘¯ğ‘‘ğ‘»ğ‘›. ğ‘ğ‘º ğ‘’ğ‘¨ğ‘¯ ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘šğ‘° ğ‘¢ğ‘³ğ‘¯ gconfd ğ‘ğ‘» ğ‘£ğ‘´ğ‘¥ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦, ğ‘¯ ğ‘¦ğ‘‘ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘´ğ‘¯ ğ‘© ğ‘¤ğ‘ªğ‘’ğ‘“ğ‘²ğ‘¤ ğ‘¦ğ‘¯ ~/.gconfd ğ‘¯ ğ‘·ğ‘¤ğ‘•ğ‘´ ğ‘¤ğ‘ªğ‘’ğ‘“ğ‘²ğ‘¤ğ‘Ÿ ğ‘¦ğ‘¯ ğ‘¦ğ‘¯ğ‘›ğ‘¦ğ‘ğ‘¦ğ‘›ğ‘¿ğ‘©ğ‘¤ ğ‘•ğ‘‘ğ‘¹ğ‘¦ğ‘¡ ğ‘¤ğ‘´ğ‘’ğ‘±ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘•ğ‘³ğ‘— ğ‘¨ğ‘Ÿ ~/.gconf

source: Error finding metainfo: %s
en@shaw: ğ‘»ğ‘¼ ğ‘“ğ‘²ğ‘¯ğ‘›ğ‘¦ğ‘™ ğ‘¥ğ‘§ğ‘‘ğ‘©ğ‘¦ğ‘¯ğ‘“ğ‘´: %s

source: Error getting metainfo: %s
en@shaw: ğ‘»ğ‘¼ ğ‘œğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘¥ğ‘§ğ‘‘ğ‘©ğ‘¦ğ‘¯ğ‘“ğ‘´: %s

source: Key `%s' listed as schema for key `%s' actually stores type `%s'
en@shaw: ğ‘’ğ‘° `%s' ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘› ğ‘¨ğ‘Ÿ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘“ğ‘¹ ğ‘’ğ‘° `%s' ğ‘¨ğ‘’ğ‘—ğ‘«ğ‘©ğ‘¤ğ‘¦ ğ‘•ğ‘‘ğ‘¹ğ‘Ÿ ğ‘‘ğ‘²ğ‘ `%s'

source: Didn't understand `%s' (list must start with a '[')
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘‘ğ‘¸ğ‘‘ ğ‘¢ğ‘¦ğ‘ ğ‘© '[')

source: Didn't understand `%s' (list must end with a ']')
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘§ğ‘¯ğ‘› ğ‘¢ğ‘¦ğ‘ ğ‘© ']')

source: Didn't understand `%s' (extra unescaped ']' found inside list)
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘§ğ‘’ğ‘•ğ‘‘ğ‘®ğ‘© ğ‘³ğ‘¯ğ‘§ğ‘•ğ‘’ğ‘±ğ‘ğ‘‘ ']' ğ‘“ğ‘¬ğ‘¯ğ‘› ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘¤ğ‘¦ğ‘•ğ‘‘)

source: Didn't understand `%s' (extra trailing characters)
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘§ğ‘’ğ‘•ğ‘‘ğ‘®ğ‘© ğ‘‘ğ‘®ğ‘±ğ‘¤ğ‘¦ğ‘™ ğ‘’ğ‘¨ğ‘®ğ‘©ğ‘’ğ‘‘ğ‘¼ğ‘Ÿ)

source: Didn't understand `%s' (pair must start with a '(')
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘ğ‘º ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘‘ğ‘¸ğ‘‘ ğ‘¢ğ‘¦ğ‘ ğ‘© '(')

source: Didn't understand `%s' (pair must end with a ')')
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘ğ‘º ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘§ğ‘¯ğ‘› ğ‘¢ğ‘¦ğ‘ ğ‘© ')')

source: Didn't understand `%s' (wrong number of elements)
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘®ğ‘ªğ‘™ ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘•)

source: Didn't understand `%s' (extra unescaped ')' found inside pair)
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘§ğ‘’ğ‘•ğ‘‘ğ‘®ğ‘© ğ‘³ğ‘¯ğ‘§ğ‘•ğ‘’ğ‘±ğ‘ğ‘‘ ')' ğ‘“ğ‘¬ğ‘¯ğ‘› ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘ğ‘º)

source: Key is NULL
en@shaw: ğ‘’ğ‘° ğ‘¦ğ‘Ÿ ğ‘¯ğ‘³ğ‘¤

source: Server couldn't resolve the address `%s'
en@shaw: ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘ ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• `%s'

source: Can't add notifications to a local configuration source
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘¨ğ‘› ğ‘¯ğ‘´ğ‘‘ğ‘©ğ‘“ğ‘©ğ‘’ğ‘±ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘‘ ğ‘© ğ‘¤ğ‘´ğ‘’ğ‘©ğ‘¤ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘•

source: Adding client to server's list failed, CORBA error: %s
en@shaw: ğ‘¨ğ‘›ğ‘¦ğ‘™ ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘‘ ğ‘•ğ‘»ğ‘’ğ‘¼ğ‘Ÿ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘“ğ‘±ğ‘¤ğ‘›, CORBA ğ‘»ğ‘¼: %s

source: Must begin with a slash '/'
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘©ğ‘œğ‘¦ğ‘¯ ğ‘¢ğ‘¦ğ‘ ğ‘© ğ‘•ğ‘¤ğ‘¨ğ‘– '/'

source: Can't have two slashes '/' in a row
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘£ğ‘¨ğ‘ ğ‘‘ğ‘µ ğ‘•ğ‘¤ğ‘¨ğ‘–ğ‘¦ğ‘Ÿ '/' ğ‘¦ğ‘¯ ğ‘© ğ‘®ğ‘´

source: Can't have a period '.' right after a slash '/'
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘£ğ‘¨ğ‘ ğ‘© ğ‘ğ‘½ğ‘¦ğ‘©ğ‘› '.' ğ‘®ğ‘²ğ‘‘ ğ‘­ğ‘“ğ‘‘ğ‘¼ ğ‘© ğ‘•ğ‘¤ğ‘¨ğ‘– '/'

source: '\%o' is not an ASCII character and thus isn't allowed in key names
en@shaw: '\%o' ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘©ğ‘¯ ASCII ğ‘’ğ‘¨ğ‘®ğ‘©ğ‘’ğ‘‘ğ‘¼ ğ‘¯ ğ‘ğ‘³ğ‘• ğ‘¦ğ‘Ÿğ‘¯ğ‘‘ ğ‘©ğ‘¤ğ‘¬ğ‘› ğ‘¦ğ‘¯ ğ‘’ğ‘° ğ‘¯ğ‘±ğ‘¥ğ‘Ÿ

source: `%c' is an invalid character in key/directory names
en@shaw: `%c' ğ‘¦ğ‘Ÿ ğ‘©ğ‘¯ ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘’ğ‘¨ğ‘®ğ‘©ğ‘’ğ‘‘ğ‘¼ ğ‘¦ğ‘¯ ğ‘’ğ‘°/ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘¯ğ‘±ğ‘¥ğ‘Ÿ

source: Key/directory may not end with a slash '/'
en@shaw: ğ‘’ğ‘°/ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘¥ğ‘± ğ‘¯ğ‘ªğ‘‘ ğ‘§ğ‘¯ğ‘› ğ‘¢ğ‘¦ğ‘ ğ‘© ğ‘•ğ‘¤ğ‘¨ğ‘– '/'

source: Failure shutting down configuration server: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘˜ğ‘¼ ğ‘–ğ‘³ğ‘‘ğ‘¦ğ‘™ ğ‘›ğ‘¬ğ‘¯ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘»ğ‘ğ‘¼: %s

source: Expected float, got %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘“ğ‘¤ğ‘´ğ‘‘, ğ‘œğ‘ªğ‘‘ %s

source: Expected int, got %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¦ğ‘¯ğ‘‘, ğ‘œğ‘ªğ‘‘ %s

source: Expected string, got %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™, ğ‘œğ‘ªğ‘‘ %s

source: Expected bool, got %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘šğ‘µğ‘¤, ğ‘œğ‘ªğ‘‘ %s

source: Expected schema, got %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©, ğ‘œğ‘ªğ‘‘ %s

source: CORBA error: %s
en@shaw: CORBA ğ‘»ğ‘¼: %s

source: Shutdown request received
en@shaw: ğ‘–ğ‘©ğ‘‘ğ‘›ğ‘¶ğ‘¯ ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘§ğ‘•ğ‘‘ ğ‘®ğ‘¦ğ‘•ğ‘°ğ‘ğ‘›

source: gconfd compiled with debugging; trying to load gconf.path from the source directory
en@shaw: gconfd ğ‘’ğ‘©ğ‘¥ğ‘ğ‘²ğ‘¤ğ‘› ğ‘¢ğ‘¦ğ‘ ğ‘›ğ‘°ğ‘šğ‘³ğ‘œğ‘¦ğ‘™; ğ‘‘ğ‘®ğ‘²ğ‘¦ğ‘™ ğ‘‘ ğ‘¤ğ‘´ğ‘› gconf.path ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘ ğ‘•ğ‘¹ğ‘• ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦

source: No configuration files found. Trying to use the default configuration source `%s'
en@shaw: ğ‘¯ğ‘´ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘²ğ‘¤ğ‘Ÿ ğ‘“ğ‘¬ğ‘¯ğ‘›. ğ‘‘ğ‘®ğ‘²ğ‘¦ğ‘™ ğ‘‘ ğ‘¿ğ‘• ğ‘ ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• `%s'

source: No configuration sources in the source path. Configuration won't be saved; edit %s%s
en@shaw: ğ‘¯ğ‘´ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘•ğ‘©ğ‘Ÿ ğ‘¦ğ‘¯ ğ‘ ğ‘•ğ‘¹ğ‘• ğ‘ğ‘­ğ‘”. ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘¢ğ‘³ğ‘¯'ğ‘‘ğ‘° ğ‘šğ‘° ğ‘•ğ‘±ğ‘ğ‘›; ğ‘§ğ‘›ğ‘¦ğ‘‘ %s%s

source: Error loading some configuration sources: %s
en@shaw: ğ‘»ğ‘¼ ğ‘¤ğ‘´ğ‘›ğ‘¦ğ‘™ ğ‘•ğ‘³ğ‘¥ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘•ğ‘©ğ‘Ÿ: %s

source: No configuration source addresses successfully resolved. Can't load or store configuration data
en@shaw: ğ‘¯ğ‘´ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘©ğ‘›ğ‘®ğ‘§ğ‘•ğ‘©ğ‘Ÿ ğ‘•ğ‘©ğ‘’ğ‘•ğ‘§ğ‘•ğ‘“ğ‘©ğ‘¤ğ‘¦ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ğ‘›. ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘¤ğ‘´ğ‘› ğ‘¹ ğ‘•ğ‘‘ğ‘¹ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘›ğ‘±ğ‘‘ğ‘©

source: No writable configuration sources successfully resolved. May be unable to save some configuration changes
en@shaw: ğ‘¯ğ‘´ ğ‘®ğ‘²ğ‘‘ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘•ğ‘©ğ‘Ÿ ğ‘•ğ‘©ğ‘’ğ‘•ğ‘§ğ‘•ğ‘“ğ‘©ğ‘¤ğ‘¦ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ğ‘›. ğ‘¥ğ‘± ğ‘šğ‘° ğ‘³ğ‘¯ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘•ğ‘±ğ‘ ğ‘•ğ‘³ğ‘¥ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘©ğ‘Ÿ

source: Could not connect to session bus: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘§ğ‘’ğ‘‘ ğ‘‘ ğ‘•ğ‘§ğ‘–ğ‘©ğ‘¯ ğ‘šğ‘³ğ‘•: %s

source: Failed to get bus name for daemon, exiting: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘šğ‘³ğ‘• ğ‘¯ğ‘±ğ‘¥ ğ‘“ğ‘¹ ğ‘›ğ‘°ğ‘¥ğ‘©ğ‘¯, ğ‘§ğ‘œğ‘Ÿğ‘¦ğ‘‘ğ‘¦ğ‘™: %s

source: Could not connect to system bus: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘§ğ‘’ğ‘‘ ğ‘‘ ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘šğ‘³ğ‘•: %s

source: starting (version %s), pid %u user '%s'
en@shaw: ğ‘•ğ‘‘ğ‘¸ğ‘‘ğ‘¦ğ‘™ (ğ‘ğ‘»ğ‘ ğ‘©ğ‘¯ %s), pid %u ğ‘¿ğ‘Ÿğ‘¼ '%s'

source: Failed to get object reference for ConfigServer
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘©ğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘• ğ‘“ğ‘¹ ConfigServer

source: Failed to write byte to pipe file descriptor %d so client program may hang: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘²ğ‘‘ ğ‘šğ‘²ğ‘‘ ğ‘‘ ğ‘ğ‘²ğ‘ ğ‘“ğ‘²ğ‘¤ ğ‘›ğ‘§ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘‘ğ‘¼ %d ğ‘•ğ‘´ ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘ğ‘®ğ‘´ğ‘œğ‘®ğ‘¨ğ‘¥ ğ‘¥ğ‘± ğ‘£ğ‘¨ğ‘™: %s

source: Error releasing lockfile: %s
en@shaw: ğ‘»ğ‘¼ ğ‘®ğ‘§ğ‘¤ğ‘°ğ‘•ğ‘¦ğ‘™ ğ‘¤ğ‘ªğ‘’ğ‘“ğ‘²ğ‘¤: %s

source: Exiting
en@shaw: ğ‘§ğ‘œğ‘Ÿğ‘¦ğ‘‘ğ‘¦ğ‘™

source: SIGHUP received, reloading all databases
en@shaw: SIGHUP ğ‘®ğ‘¦ğ‘•ğ‘°ğ‘ğ‘›, ğ‘®ğ‘°ğ‘¤ğ‘´ğ‘›ğ‘¦ğ‘™ ğ‘·ğ‘¤ ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘•ğ‘©ğ‘Ÿ

source: GConf server is not in use, shutting down.
en@shaw: GConf ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘¦ğ‘¯ ğ‘¿ğ‘•, ğ‘–ğ‘³ğ‘‘ğ‘¦ğ‘™ ğ‘›ğ‘¬ğ‘¯.

source: Error obtaining new value for `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘ªğ‘šğ‘‘ğ‘±ğ‘¯ğ‘¦ğ‘™ ğ‘¯ğ‘¿ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ `%s': %s

source: Returning exception: %s
en@shaw: ğ‘®ğ‘¦ğ‘‘ğ‘»ğ‘¯ğ‘¦ğ‘™ ğ‘¦ğ‘’ğ‘•ğ‘§ğ‘ğ‘–ğ‘©ğ‘¯: %s

source: Failed to open gconfd logfile; won't be able to restore listeners after gconfd shutdown (%s)
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘´ğ‘ğ‘©ğ‘¯ gconfd ğ‘¤ğ‘ªğ‘œğ‘“ğ‘²ğ‘¤; ğ‘¢ğ‘´ğ‘¯ğ‘‘ ğ‘šğ‘° ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘®ğ‘©ğ‘•ğ‘‘ğ‘¹ ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘¼ğ‘Ÿ ğ‘­ğ‘“ğ‘‘ğ‘¼ gconfd ğ‘–ğ‘©ğ‘‘ğ‘›ğ‘¶ğ‘¯ (%s)

source: Failed to close gconfd logfile; data may not have been properly saved (%s)
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘¤ğ‘´ğ‘• gconfd ğ‘¤ğ‘ªğ‘œğ‘“ğ‘²ğ‘¤; ğ‘›ğ‘±ğ‘‘ğ‘© ğ‘¥ğ‘± ğ‘¯ğ‘ªğ‘‘ ğ‘£ğ‘¨ğ‘ ğ‘šğ‘°ğ‘¯ ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘¤ğ‘¦ ğ‘•ğ‘±ğ‘ğ‘› (%s)

source: Could not open saved state file '%s' for writing: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘´ğ‘ğ‘©ğ‘¯ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ '%s' ğ‘“ğ‘¹ ğ‘®ğ‘²ğ‘‘ğ‘¦ğ‘™: %s

source: Could not write saved state file '%s' fd: %d: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘®ğ‘²ğ‘‘ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ '%s' fd: %d: %s

source: Could not flush saved state file '%s' to disk: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘“ğ‘¤ğ‘³ğ‘– ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ '%s' ğ‘‘ ğ‘›ğ‘¦ğ‘•ğ‘’: %s

source: Failed to close new saved state file '%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘¤ğ‘´ğ‘• ğ‘¯ğ‘¿ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ '%s': %s

source: Could not move aside old saved state file '%s': %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘¥ğ‘µğ‘ ğ‘©ğ‘•ğ‘²ğ‘› ğ‘´ğ‘¤ğ‘› ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ '%s': %s

source: Failed to move new saved state file into place: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¥ğ‘µğ‘ ğ‘¯ğ‘¿ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ ğ‘¦ğ‘¯ğ‘‘ğ‘« ğ‘ğ‘¤ğ‘±ğ‘•: %s
