Repository: chriskmanx/qmole
Catalog: QMOLEDEV/GConf-3.2.3/po/*.po
Languages: en@shaw

source: Failed to get configuration file path from '%s'
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘²ğ‘¤ ğ‘ğ‘­ğ‘” ğ‘“ğ‘®ğ‘ªğ‘¥ '%s'

source: Created Evolution/LDAP source using configuration file '%s'
en@shaw: ğ‘’ğ‘®ğ‘¦ğ‘±ğ‘‘ğ‘©ğ‘› Â·ğ‘§ğ‘ğ‘©ğ‘¤ğ‘µğ‘–ğ‘©ğ‘¯/LDAP ğ‘•ğ‘¹ğ‘• ğ‘¿ğ‘Ÿğ‘¦ğ‘™ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘²ğ‘¤ '%s'

source: Unable to parse XML file '%s'
en@shaw: ğ‘³ğ‘¯ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘ğ‘¸ğ‘• XML ğ‘“ğ‘²ğ‘¤ '%s'

source: Config file '%s' is empty
en@shaw: ğ‘’ğ‘ªğ‘¯ğ‘“ğ‘¦ğ‘œ ğ‘“ğ‘²ğ‘¤ '%s' ğ‘¦ğ‘Ÿ ğ‘§ğ‘¥ğ‘ğ‘‘ğ‘¦

source: Root node of '%s' must be <evoldap>, not <%s>
en@shaw: ğ‘®ğ‘µğ‘‘ ğ‘¯ğ‘´ğ‘› ğ‘ '%s' ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° <evoldap>, ğ‘¯ğ‘ªğ‘‘ <%s>

source: No <template> specified in '%s'
en@shaw: ğ‘¯ğ‘´ <ğ‘‘ğ‘§ğ‘¥ğ‘ğ‘¤ğ‘±ğ‘‘> ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘¦ğ‘¯ '%s'

source: No "filter" attribute specified on <template> in '%s'
en@shaw: ğ‘¯ğ‘´ "ğ‘“ğ‘¦ğ‘¤ğ‘‘ğ‘¼" ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘ªğ‘¯ <ğ‘‘ğ‘§ğ‘¥ğ‘ğ‘¤ğ‘±ğ‘‘> ğ‘¦ğ‘¯ '%s'

source: No LDAP server or base DN specified in '%s'
en@shaw: ğ‘¯ğ‘´ LDAP ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘¹ ğ‘šğ‘±ğ‘• DN ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘¦ğ‘¯ '%s'

source: Contacting LDAP server: host '%s', port '%d', base DN '%s'
en@shaw: ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ğ‘¦ğ‘™ LDAP ğ‘•ğ‘»ğ‘ğ‘¼: ğ‘£ğ‘´ğ‘•ğ‘‘ '%s', ğ‘ğ‘¹ğ‘‘ '%d', ğ‘šğ‘±ğ‘• DN '%s'

source: Failed to contact LDAP server: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ LDAP ğ‘•ğ‘»ğ‘ğ‘¼: %s

source: Searching for entries using filter: %s
en@shaw: ğ‘•ğ‘»ğ‘—ğ‘¦ğ‘™ ğ‘“ğ‘¹ ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘¦ğ‘™ ğ‘“ğ‘¦ğ‘¤ğ‘‘ğ‘¼: %s

source: Error querying LDAP server: %s
en@shaw: ğ‘»ğ‘¼ ğ‘’ğ‘¢ğ‘½ğ‘¦ğ‘¦ğ‘™ LDAP ğ‘•ğ‘»ğ‘ğ‘¼: %s

source: Got %d entries using filter: %s
en@shaw: ğ‘œğ‘ªğ‘‘ %d ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘¦ğ‘™ ğ‘“ğ‘¦ğ‘¤ğ‘‘ğ‘¼: %s

source: Cannot find directory %s
en@shaw: ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘“ğ‘²ğ‘¯ğ‘› ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ %s

source: Error saving GConf tree to '%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘±ğ‘ğ‘¦ğ‘™ GConf ğ‘‘ğ‘®ğ‘° ğ‘‘ `%s': %s

source: Usage: %s <dir>
en@shaw: ğ‘¿ğ‘•ğ‘¦ğ‘¡: %s <dir>

source: Usage: %s <dir> Merges a markup backend filesystem hierarchy like: dir/%%gconf.xml subdir1/%%gconf.xml subdir2/%%gconf.xml to: dir/%%gconf-tree.xml
en@shaw: ğ‘¿ğ‘•ğ‘¦ğ‘¡: %s <dir> ğ‘¥ğ‘»ğ‘¡ğ‘©ğ‘Ÿ ğ‘© ğ‘¥ğ‘­ğ‘®ğ‘’ğ‘©ğ‘ ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› ğ‘“ğ‘²ğ‘¤ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘£ğ‘²ğ‘»ğ‘­ğ‘®ğ‘’ğ‘° ğ‘¤ğ‘²ğ‘’: dir/%%gconf.xml subdir1/%%gconf.xml subdir2/%%gconf.xml ğ‘‘: dir/%%gconf-tree.xml

source: Unloading text markup backend module.
en@shaw: ğ‘©ğ‘¯ğ‘¤ğ‘´ğ‘›ğ‘¦ğ‘™ ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘ ğ‘¥ğ‘­ğ‘®ğ‘’ğ‘©ğ‘ ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› ğ‘¥ğ‘ªğ‘›ğ‘¿ğ‘¤.

source: Couldn't find the XML root directory in the address `%s'
en@shaw: ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘“ğ‘²ğ‘¯ğ‘› ğ‘ XML ğ‘®ğ‘µğ‘‘ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘¦ğ‘¯ ğ‘ ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• "%s"

source: Could not make directory `%s': %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘¥ğ‘±ğ‘’ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ `%s': %s

source: Can't read from or write to the XML root directory in the address "%s"
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘®ğ‘§ğ‘› ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘¹ ğ‘®ğ‘²ğ‘‘ ğ‘‘ ğ‘ XML ğ‘®ğ‘µğ‘‘ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘¦ğ‘¯ ğ‘ ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• "%s"

source: Directory/file permissions for XML source at root %s are: %o/%o
en@shaw: ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦/ğ‘“ğ‘²ğ‘¤ ğ‘ğ‘»ğ‘¥ğ‘¦ğ‘–ğ‘ªğ‘¯ğ‘Ÿ ğ‘“ğ‘¹ XML ğ‘•ğ‘¹ğ‘• ğ‘¨ğ‘‘ ğ‘®ğ‘µğ‘‘ %s ğ‘¸: %o/%o

source: Remove directory operation is no longer supported, just remove all the values in the directory
en@shaw: ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘ªğ‘ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘¦ğ‘Ÿ ğ‘¯ğ‘´ ğ‘¤ğ‘ªğ‘™ğ‘œğ‘¼ ğ‘•ğ‘©ğ‘ğ‘¹ğ‘‘ğ‘©ğ‘›, ğ‘¡ğ‘³ğ‘•ğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘·ğ‘¤ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘¦ğ‘¯ ğ‘ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦

source: Could not open lock directory for %s to remove locks: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘´ğ‘ğ‘©ğ‘¯ ğ‘¤ğ‘ªğ‘’ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘“ğ‘¹ %s ğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘¤ğ‘ªğ‘’ğ‘•: %s

source: Could not remove file %s: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘“ğ‘²ğ‘¤ %s: %s

source: Initializing Markup backend module
en@shaw: ğ‘¦ğ‘¯ğ‘¦ğ‘–ğ‘©ğ‘¤ğ‘²ğ‘Ÿğ‘¦ğ‘™ ğ‘¥ğ‘­ğ‘®ğ‘’ğ‘©ğ‘ ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› ğ‘¥ğ‘ªğ‘›ğ‘¿ğ‘¤

source: Failed to give up lock on XML directory "%s": %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘¦ğ‘ ğ‘³ğ‘ ğ‘¤ğ‘ªğ‘’ ğ‘ªğ‘¯ XML ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ "%s": %s

source: Failed to write some configuration data to disk
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘²ğ‘‘ ğ‘•ğ‘³ğ‘¥ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘›ğ‘±ğ‘‘ğ‘© ğ‘‘ ğ‘›ğ‘¦ğ‘•ğ‘’

source: Could not make directory "%s": %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘¥ğ‘±ğ‘’ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ "%s": %s

source: Could not remove "%s": %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ "%s": %s

source: Failed to write "%s": %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘²ğ‘‘ "%s": %s

source: Failed to load file "%s": %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¤ğ‘´ğ‘› ğ‘“ğ‘²ğ‘¤ "%s": %s

source: Line %d character %d: %s
en@shaw: ğ‘¤ğ‘²ğ‘¯ %d ğ‘’ğ‘¨ğ‘®ğ‘©ğ‘’ğ‘‘ğ‘¼ %d: %s

source: Attribute "%s" is invalid on <%s> element in this context
en@shaw: ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ "%s" ğ‘¦ğ‘Ÿ ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘ªğ‘¯ <%s> ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘¦ğ‘¯ ğ‘ğ‘¦ğ‘• ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘

source: Didn't understand `%s' (expected integer)
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¦ğ‘¯ğ‘‘ğ‘©ğ‘¡ğ‘¼)

source: Integer `%s' is too large or small
en@shaw: ğ‘¦ğ‘¯ğ‘‘ğ‘©ğ‘¡ğ‘¼ `%s' ğ‘¦ğ‘Ÿ ğ‘‘ğ‘µ ğ‘¤ğ‘¸ğ‘¡ ğ‘¹ ğ‘•ğ‘¥ğ‘·ğ‘¤

source: Didn't understand `%s' (expected true or false)
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘‘ğ‘®ğ‘µ ğ‘¹ ğ‘“ğ‘·ğ‘¤ğ‘•)

source: Didn't understand `%s' (expected real number)
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› `%s' (ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘®ğ‘¾ğ‘¤ ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼)

source: Unknown value "%s" for "%s" attribute on element <%s>
en@shaw: ğ‘³ğ‘¯ğ‘´ğ‘¯ ğ‘ğ‘¨ğ‘¤ğ‘¿ "%s" ğ‘“ğ‘¹ "%s" ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ ğ‘ªğ‘¯ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ <%s>

source: No "%s" attribute on element <%s>
en@shaw: ğ‘¯ğ‘´ "%s" ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ ğ‘ªğ‘¯ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ <%s>

source: Invalid ltype "%s" on <%s>
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ltype "%s" ğ‘ªğ‘¯ <%s>

source: Invalid first-element type "%s" on <%s>
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘“ğ‘»ğ‘•ğ‘‘-ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘‘ğ‘²ğ‘ "%s" ğ‘ªğ‘¯ <%s>

source: Invalid cdr_type "%s" on <%s>
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› cdr_type "%s" ğ‘ªğ‘¯ <%s>

source: Invalid list_type "%s" on <%s>
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› list_type "%s" ğ‘ªğ‘¯ <%s>

source: Two <default> elements below a <local_schema>
en@shaw: ğ‘‘ğ‘µ <ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘> ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘• ğ‘šğ‘©ğ‘¤ğ‘´ ğ‘© <local_schema>

source: Two <longdesc> elements below a <local_schema>
en@shaw: ğ‘‘ğ‘µ <longdesc> ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘• ğ‘šğ‘©ğ‘¤ğ‘´ ğ‘© <local_schema>

source: Element <%s> is not allowed below <%s>
en@shaw: ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ <%s> ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘©ğ‘¤ğ‘¬ğ‘› ğ‘šğ‘©ğ‘¤ğ‘´ <%s>

source: <%s> provided but current element does not have type %s
en@shaw: <%s> ğ‘ğ‘®ğ‘©ğ‘ğ‘²ğ‘›ğ‘©ğ‘› ğ‘šğ‘³ğ‘‘ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘›ğ‘³ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘£ğ‘¨ğ‘ ğ‘‘ğ‘²ğ‘ %s

source: Two <car> elements given for same pair
en@shaw: ğ‘‘ğ‘µ <car> ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘• ğ‘œğ‘¦ğ‘ğ‘©ğ‘¯ ğ‘“ğ‘¹ ğ‘•ğ‘±ğ‘¥ ğ‘ğ‘º

source: Two <cdr> elements given for same pair
en@shaw: ğ‘‘ğ‘µ <cdr> ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘• ğ‘œğ‘¦ğ‘ğ‘©ğ‘¯ ğ‘“ğ‘¹ ğ‘•ğ‘±ğ‘¥ ğ‘ğ‘º

source: <li> has wrong type %s
en@shaw: <li> ğ‘£ğ‘¨ğ‘Ÿ ğ‘®ğ‘ªğ‘™ ğ‘‘ğ‘²ğ‘ %s

source: <%s> provided but parent <entry> does not have a value
en@shaw: <%s> ğ‘ğ‘®ğ‘©ğ‘ğ‘²ğ‘›ğ‘©ğ‘› ğ‘šğ‘³ğ‘‘ ğ‘ğ‘ºğ‘©ğ‘¯ğ‘‘ <ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦> ğ‘›ğ‘³ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘£ğ‘¨ğ‘ ğ‘© ğ‘ğ‘¨ğ‘¤ğ‘¿

source: Element <%s> is not allowed inside current element
en@shaw: ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ <%s> ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘©ğ‘¤ğ‘¬ğ‘› ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘

source: Outermost element in menu file must be <gconf> not <%s>
en@shaw: ğ‘¶ğ‘‘ğ‘»ğ‘¥ğ‘´ğ‘•ğ‘‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘¦ğ‘¯ ğ‘¥ğ‘§ğ‘¯ğ‘¿ ğ‘“ğ‘²ğ‘¤ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° <gconf> ğ‘¯ğ‘ªğ‘‘ <%s>

source: Element <%s> is not allowed inside a <%s> element
en@shaw: ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ <%s> ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘©ğ‘¤ğ‘¬ğ‘› ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘© <%s> ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘

source: No text is allowed inside element <%s>
en@shaw: ğ‘¯ğ‘´ ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘ ğ‘¦ğ‘Ÿ ğ‘©ğ‘¤ğ‘¬ğ‘› ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ <%s>

source: Failed to open "%s": %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘´ğ‘ğ‘©ğ‘¯ "%s": %s

source: Error reading "%s": %s
en@shaw: ğ‘»ğ‘¼ ğ‘®ğ‘°ğ‘›ğ‘¦ğ‘™ "%s": %s

source: Could not flush file '%s' to disk: %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘“ğ‘¤ğ‘©ğ‘– ğ‘“ğ‘²ğ‘¤ '%s' ğ‘‘ ğ‘›ğ‘¦ğ‘•ğ‘’: %s

source: Error writing file "%s": %s
en@shaw: ğ‘»ğ‘¼ ğ‘®ğ‘²ğ‘‘ğ‘¦ğ‘™ ğ‘“ğ‘²ğ‘¤ "%s": %s

source: Failed to move temporary file "%s" to final location "%s": %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¥ğ‘µğ‘ ğ‘‘ğ‘§ğ‘¥ğ‘ğ‘¼ğ‘¼ğ‘¦ ğ‘“ğ‘²ğ‘¤ "%s" ğ‘‘ ğ‘“ğ‘²ğ‘¯ğ‘©ğ‘¤ ğ‘¤ğ‘´ğ‘’ğ‘±ğ‘–ğ‘©ğ‘¯ "%s": %s

source: Unloading XML backend module.
en@shaw: ğ‘©ğ‘¯ğ‘¤ğ‘´ğ‘›ğ‘¦ğ‘™ XML ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› ğ‘¥ğ‘ªğ‘›ğ‘¿ğ‘¤.

source: Error syncing the XML backend directory cache: %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘¦ğ‘™ğ‘’ğ‘¦ğ‘™ ğ‘ XML ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘’ğ‘¨ğ‘–: %s

source: Initializing XML backend module
en@shaw: Initializing XML ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› ğ‘¥ğ‘ªğ‘›ğ‘¿ğ‘¤

source: Failed to sync XML cache contents to disk
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘•ğ‘¦ğ‘™ğ‘’ XML ğ‘’ğ‘¨ğ‘– ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘©ğ‘¯ğ‘‘ğ‘• ğ‘‘ ğ‘›ğ‘¦ğ‘•ğ‘’

source: Unable to remove directory `%s' from the XML backend cache, because it has not been successfully synced to disk
en@shaw: ğ‘³ğ‘¯ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ `%s' ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘ XML ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› ğ‘’ğ‘¨ğ‘–, ğ‘šğ‘¦ğ‘’ğ‘ªğ‘Ÿ ğ‘¦ğ‘‘ ğ‘£ğ‘¨ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘°ğ‘¯ ğ‘•ğ‘©ğ‘’ğ‘•ğ‘§ğ‘•ğ‘“ğ‘©ğ‘¤ğ‘¦ ğ‘•ğ‘¦ğ‘™ğ‘’ğ‘‘ ğ‘‘ ğ‘›ğ‘¦ğ‘•ğ‘’

source: Could not stat `%s': %s
en@shaw: ğ‘’ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘•ğ‘‘ğ‘¨ğ‘‘ `%s': %s

source: XML filename `%s' is a directory
en@shaw: XML ğ‘“ğ‘²ğ‘¤ğ‘¯ğ‘±ğ‘¥ `%s' ğ‘¦ğ‘Ÿ ğ‘© ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦

source: Failed to delete "%s": %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘›ğ‘¦ğ‘¤ğ‘°ğ‘‘ "%s": %s

source: Failed to write file `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘²ğ‘‘ ğ‘“ğ‘²ğ‘¤ `%s': %s

source: Failed to set mode on `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘•ğ‘§ğ‘‘ ğ‘¥ğ‘´ğ‘› ğ‘ªğ‘¯ `%s': %s

source: Failed to write XML data to `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘²ğ‘‘ XML ğ‘›ğ‘±ğ‘‘ğ‘© ğ‘‘ `%s': %s

source: Failed to close file `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘¤ğ‘´ğ‘• ğ‘“ğ‘²ğ‘¤ `%s': %s

source: Failed to rename `%s' to `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘°ğ‘¯ğ‘±ğ‘¥ `%s' ğ‘‘ `%s': %s

source: Failed to restore `%s' from `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘©ğ‘•ğ‘‘ğ‘¹ `%s' ğ‘“ğ‘®ğ‘ªğ‘¥ `%s': %s

source: Failed to delete old file `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘›ğ‘¦ğ‘¤ğ‘°ğ‘‘ ğ‘´ğ‘¤ğ‘› ğ‘“ğ‘²ğ‘¤ `%s': %s

source: Failed to stat `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘•ğ‘‘ğ‘¨ğ‘‘ `%s': %s

source: Duplicate entry `%s' in `%s', ignoring
en@shaw: ğ‘›ğ‘¿ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘‘ ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ `%s' ğ‘¦ğ‘¯ `%s', ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™

source: Entry with no name in XML file `%s', ignoring
en@shaw: ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ ğ‘¢ğ‘¦ğ‘ ğ‘¯ğ‘´ ğ‘¯ğ‘±ğ‘¥ ğ‘¦ğ‘¯ XML ğ‘“ğ‘²ğ‘¤ `%s', ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™

source: A toplevel node in XML file `%s' is <%s> rather than <entry>, ignoring
en@shaw: ğ‘© toplevel ğ‘¯ğ‘´ğ‘› ğ‘¦ğ‘¯ XML ğ‘“ğ‘²ğ‘¤ `%s' ğ‘¦ğ‘Ÿ <%s> ğ‘®ğ‘­ğ‘ğ‘¼ ğ‘ğ‘¨ğ‘¯ <entry>, ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™

source: Failed to create file `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘®ğ‘¦ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ `%s': %s

source: Failed to parse XML file "%s"
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘ğ‘¸ğ‘• XML ğ‘“ğ‘²ğ‘¤ "%s"

source: Ignoring XML node with name `%s': %s
en@shaw: ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™ XML ğ‘¯ğ‘´ğ‘› ğ‘¢ğ‘¦ğ‘ ğ‘¯ğ‘±ğ‘¥ `%s': %s

source: Ignoring schema name `%s', invalid: %s
en@shaw: ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘±ğ‘¥ `%s', ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘›: %s

source: Ignoring XML node `%s': %s
en@shaw: ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™ XML ğ‘¯ğ‘´ğ‘› `%s': %s

source: Failed reading default value for schema: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘®ğ‘°ğ‘›ğ‘¦ğ‘™ ğ‘›ğ‘§ğ‘“ğ‘ªğ‘¤ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©: %s

source: No "type" attribute for <%s> node
en@shaw: ğ‘¯ğ‘´ "ğ‘‘ğ‘²ğ‘" ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ ğ‘“ğ‘¹ <%s> ğ‘¯ğ‘´ğ‘›

source: A node has unknown "type" attribute `%s', ignoring
en@shaw: ğ‘© ğ‘¯ğ‘´ğ‘› ğ‘£ğ‘¨ğ‘Ÿ ğ‘³ğ‘¯ğ‘´ğ‘¯ "ğ‘‘ğ‘²ğ‘" ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ `%s', ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™

source: No "value" attribute for node
en@shaw: ğ‘¯ğ‘´ "ğ‘ğ‘¨ğ‘¤ğ‘¿" ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘ ğ‘“ğ‘¹ ğ‘¯ğ‘´ğ‘›

source: Didn't understand XML node <%s> inside an XML list node
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› XML ğ‘¯ğ‘´ğ‘› <%s> ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘©ğ‘¯ xml ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¯ğ‘´ğ‘›

source: Invalid type (list, pair, or unknown) in a list node
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘‘ğ‘²ğ‘ (ğ‘¤ğ‘¦ğ‘•ğ‘‘, ğ‘ğ‘º, ğ‘¹ ğ‘³ğ‘¯ğ‘´ğ‘¯) ğ‘¦ğ‘¯ ğ‘© ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¯ğ‘´ğ‘›

source: Bad XML node: %s
en@shaw: ğ‘šğ‘¨ğ‘› XML ğ‘¯ğ‘´ğ‘›: %s

source: List contains a badly-typed node (%s, should be %s)
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘¯ğ‘Ÿ ğ‘© ğ‘šğ‘¨ğ‘›ğ‘¤ğ‘°-ğ‘‘ğ‘²ğ‘ğ‘‘ ğ‘¯ğ‘´ğ‘› (%s, ğ‘–ğ‘«ğ‘› ğ‘šğ‘° %s)

source: Ignoring bad car from XML pair: %s
en@shaw: ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™ ğ‘šğ‘¨ğ‘› car ğ‘“ğ‘®ğ‘ªğ‘¥ XML ğ‘ğ‘º: %s

source: parsing XML file: lists and pairs may not be placed inside a pair
en@shaw: ğ‘ğ‘¸ğ‘•ğ‘¦ğ‘™ XML ğ‘“ğ‘²ğ‘¤: ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘• ğ‘¯ ğ‘ğ‘ºğ‘Ÿ ğ‘¥ğ‘± ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘ğ‘¤ğ‘±ğ‘•ğ‘‘ ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘© ğ‘ğ‘º

source: Ignoring bad cdr from XML pair: %s
en@shaw: ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™ ğ‘šğ‘¨ğ‘› cdr ğ‘“ğ‘®ğ‘ªğ‘¥ XML ğ‘ğ‘º: %s

source: Didn't understand XML node <%s> inside an XML pair node
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› xml ğ‘¯ğ‘´ğ‘› <%s> ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘©ğ‘¯ xml ğ‘ğ‘º ğ‘¯ğ‘´ğ‘›

source: Didn't find car and cdr for XML pair node
en@shaw: ğ‘›ğ‘¦ğ‘›ğ‘¯ğ‘‘ ğ‘“ğ‘²ğ‘¯ğ‘› car ğ‘¯ cdr ğ‘“ğ‘¹ XML ğ‘ğ‘º ğ‘¯ğ‘´ğ‘›

source: Missing cdr from pair of values in XML file
en@shaw: ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ cdr ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘ğ‘º ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘¦ğ‘¯ XML ğ‘“ğ‘²ğ‘¤

source: Missing car from pair of values in XML file
en@shaw: ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ car ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘ğ‘º ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘¦ğ‘¯ XML ğ‘“ğ‘²ğ‘¤

source: Missing both car and cdr values from pair in XML file
en@shaw: ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ ğ‘šğ‘´ğ‘” car ğ‘¯ cdr ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘ğ‘º ğ‘¦ğ‘¯ XML ğ‘“ğ‘²ğ‘¤

source: Change GConf mandatory values
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ GConf ğ‘¥ğ‘¨ğ‘¯ğ‘›ğ‘©ğ‘‘ğ‘ªğ‘®ğ‘° ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ

source: Change GConf system values
en@shaw: ğ‘—ğ‘±ğ‘¯ğ‘¡ GConf ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ

source: Privileges are required to change GConf mandatory values
en@shaw: ğ‘ğ‘®ğ‘¦ğ‘ğ‘¤ğ‘©ğ‘¡ğ‘©ğ‘Ÿ ğ‘¸ ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘²ğ‘¼ğ‘› ğ‘‘ ğ‘—ğ‘±ğ‘¯ğ‘¡ GConf ğ‘¥ğ‘¨ğ‘¯ğ‘›ğ‘©ğ‘‘ğ‘ªğ‘®ğ‘° ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ

source: Privileges are required to change GConf system values
en@shaw: ğ‘ğ‘®ğ‘¦ğ‘ğ‘¤ğ‘©ğ‘¡ğ‘©ğ‘Ÿ ğ‘¸ ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘²ğ‘¼ğ‘› ğ‘‘ ğ‘—ğ‘±ğ‘¯ğ‘¡ GConf ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ

source: `%c' is an invalid character in a configuration storage address
en@shaw: `%c' ğ‘¦ğ‘Ÿ ğ‘©ğ‘¯ ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘’ğ‘¨ğ‘®ğ‘©ğ‘’ğ‘‘ğ‘¼ ğ‘¦ğ‘¯ ğ‘© ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘‘ğ‘¹ğ‘¦ğ‘¡ ğ‘©ğ‘›ğ‘®ğ‘§ğ‘•

source: No such file `%s'
en@shaw: ğ‘¯ğ‘´ ğ‘•ğ‘³ğ‘— ğ‘“ğ‘²ğ‘¤ `%s'

source: Backend `%s' failed to return a vtable
en@shaw: ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› `%s' ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘¦ğ‘‘ğ‘»ğ‘¯ ğ‘© vtable

source: Backend `%s' missing required vtable member `%s'
en@shaw: ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› `%s' ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘²ğ‘¼ğ‘› vtable ğ‘¥ğ‘§ğ‘¥ğ‘šğ‘¼ `%s'

source: Bad address `%s': %s
en@shaw: ğ‘šğ‘¨ğ‘› ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• `%s': %s

source: Bad address `%s'
en@shaw: ğ‘šğ‘¨ğ‘› ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• `%s'

source: GConf won't work without dynamic module support (gmodule)
en@shaw: GConf ğ‘¢ğ‘´ğ‘¯ğ‘‘ ğ‘¢ğ‘»ğ‘’ ğ‘¢ğ‘¦ğ‘ğ‘¬ğ‘‘ ğ‘›ğ‘²ğ‘¯ğ‘¨ğ‘¥ğ‘¦ğ‘’ ğ‘¥ğ‘ªğ‘›ğ‘¿ğ‘¤ ğ‘•ğ‘©ğ‘ğ‘¹ğ‘‘ (gmodule)

source: Error opening module `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘´ğ‘ğ‘©ğ‘¯ğ‘¦ğ‘™ ğ‘¥ğ‘ªğ‘›ğ‘¿ğ‘¤ `%s': %s

source: Error initializing module `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘¦ğ‘¯ğ‘¦ğ‘–ğ‘©ğ‘¤ğ‘²ğ‘Ÿğ‘¦ğ‘™ ğ‘¥ğ‘ªğ‘›ğ‘¿ğ‘¤ `%s': %s

source: Couldn't locate backend module for `%s'
en@shaw: ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘¤ğ‘´ğ‘’ğ‘±ğ‘‘ ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› ğ‘¥ğ‘ªğ‘›ğ‘¿ğ‘¤ ğ‘“ğ‘¹ %s

source: Failed to shut down backend
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘–ğ‘³ğ‘‘ ğ‘›ğ‘¬ğ‘¯ ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘›

source: GConf Error: %s
en@shaw: GConf ğ‘»ğ‘¼: %s

source: GConf warning: failure listing pairs in `%s': %s
en@shaw: GConf ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘˜ğ‘¼ ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘¦ğ‘™ ğ‘ğ‘ºğ‘Ÿ ğ‘¦ğ‘¯ `%s': %s

source: Expected `%s' got `%s' for key %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› `%s' ğ‘œğ‘ªğ‘‘ `%s' ğ‘“ğ‘¹ ğ‘’ğ‘° %s

source: Received invalid value in set request
en@shaw: ğ‘®ğ‘¦ğ‘•ğ‘°ğ‘ğ‘› ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘¦ğ‘¯ ğ‘•ğ‘§ğ‘‘ ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘§ğ‘•ğ‘‘

source: Couldn't make sense of CORBA value received in set request for key `%s'
en@shaw: ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘¥ğ‘±ğ‘’ ğ‘•ğ‘§ğ‘¯ğ‘• ğ‘ CORBA ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘®ğ‘¦ğ‘•ğ‘°ğ‘ğ‘› ğ‘¦ğ‘¯ ğ‘•ğ‘§ğ‘‘ ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘§ğ‘•ğ‘‘ ğ‘“ğ‘¹ ğ‘’ğ‘° `%s'

source: Received request to drop all cached data
en@shaw: ğ‘®ğ‘¦ğ‘•ğ‘°ğ‘ğ‘› ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘§ğ‘•ğ‘‘ ğ‘‘ ğ‘›ğ‘®ğ‘ªğ‘ ğ‘·ğ‘¤ ğ‘’ğ‘¨ğ‘–ğ‘‘ ğ‘›ğ‘±ğ‘‘ğ‘©

source: Received request to sync synchronously
en@shaw: ğ‘®ğ‘¦ğ‘•ğ‘°ğ‘ğ‘› ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘§ğ‘•ğ‘‘ ğ‘‘ ğ‘•ğ‘¦ğ‘™ğ‘’ ğ‘•ğ‘¦ğ‘™ğ‘’ğ‘®ğ‘©ğ‘¯ğ‘©ğ‘•ğ‘¤ğ‘¦

source: Fatal error: failed to get object reference for ConfigDatabase
en@shaw: ğ‘“ğ‘±ğ‘‘ğ‘©ğ‘¤ ğ‘»ğ‘¼: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘©ğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘®ğ‘§ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘• ğ‘“ğ‘¹ ConfigDatabase

source: Failed to sync one or more sources: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘•ğ‘¦ğ‘™ğ‘’ ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘¥ğ‘¹ ğ‘•ğ‘¹ğ‘•ğ‘©ğ‘Ÿ: %s

source: Error obtaining new value for `%s' after change notification from backend `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘ªğ‘šğ‘‘ğ‘±ğ‘¯ğ‘¦ğ‘™ ğ‘¯ğ‘¿ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ `%s' ğ‘­ğ‘“ğ‘‘ğ‘¼ ğ‘—ğ‘±ğ‘¯ğ‘¡ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘¦ğ‘’ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘šğ‘¨ğ‘’ğ‘§ğ‘¯ğ‘› `%s': %s

source: Failed to log addition of listener %s (%s); will not be able to restore this listener on gconfd restart, resulting in unreliable notification of configuration changes.
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¤ğ‘ªğ‘œ ğ‘©ğ‘›ğ‘¦ğ‘–ğ‘©ğ‘¯ ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘» %s (%s); ğ‘¢ğ‘¦ğ‘¤ ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘®ğ‘©ğ‘•ğ‘‘ğ‘¹ ğ‘ğ‘¦ğ‘• ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘» ğ‘ªğ‘¯ gconfd ğ‘®ğ‘°ğ‘•ğ‘‘ğ‘¸ğ‘‘, ğ‘®ğ‘¦ğ‘Ÿğ‘³ğ‘¤ğ‘‘ğ‘¦ğ‘™ ğ‘¦ğ‘¯ ğ‘©ğ‘¯ğ‘®ğ‘¦ğ‘¤ğ‘²ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘¦ğ‘’ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘©ğ‘Ÿ.

source: Listener ID %lu doesn't exist
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘» ID %lu ğ‘›ğ‘³ğ‘Ÿğ‘¯ğ‘‘ ğ‘§ğ‘’ğ‘Ÿğ‘¦ğ‘•ğ‘‘

source: Failed to log removal of listener to logfile (most likely harmless, may result in a notification weirdly reappearing): %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¤ğ‘ªğ‘œ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ğ‘©ğ‘¤ ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘» ğ‘‘ ğ‘¤ğ‘ªğ‘œğ‘“ğ‘²ğ‘¤ (ğ‘¥ğ‘´ğ‘•ğ‘‘ ğ‘¤ğ‘²ğ‘’ğ‘¤ğ‘¦ ğ‘£ğ‘¸ğ‘¥ğ‘¤ğ‘©ğ‘•, ğ‘¥ğ‘± ğ‘®ğ‘¦ğ‘Ÿğ‘³ğ‘¤ğ‘‘ ğ‘¦ğ‘¯ ğ‘© ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘¦ğ‘’ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘¢ğ‘¦ğ‘®ğ‘›ğ‘¤ğ‘° ğ‘®ğ‘°ğ‘©ğ‘ğ‘½ğ‘¦ğ‘™): %s

source: Error getting value for `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘œğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ `%s': %s

source: Error setting value for `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ `%s': %s

source: Error unsetting `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘³ğ‘¯ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ `%s': %s

source: Error getting default value for `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘œğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ `%s': %s

source: Error unsetting "%s": %s
en@shaw: ğ‘»ğ‘¼ ğ‘³ğ‘¯ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ "%s": %s

source: Error getting new value for "%s": %s
en@shaw: ğ‘»ğ‘¼ ğ‘œğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘¯ğ‘¿ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ "%s": %s

source: Error checking existence of `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘—ğ‘§ğ‘’ğ‘¦ğ‘™ ğ‘§ğ‘’ğ‘Ÿğ‘¦ğ‘•ğ‘‘ğ‘©ğ‘¯ğ‘• ğ‘ `%s': %s

source: Error removing directory "%s": %s
en@shaw: ğ‘»ğ‘¼ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ğ‘¦ğ‘™ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ "%s": %s

source: Failed to get all entries in `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘·ğ‘¤ ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ğ‘Ÿ ğ‘¦ğ‘¯ `%s': %s

source: Error listing dirs in `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘¦ğ‘™ ğ‘›ğ‘½ğ‘Ÿ ğ‘¦ğ‘¯ `%s': %s

source: Error setting schema for `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘“ğ‘¹ `%s': %s

source: Success
en@shaw: ğ‘•ğ‘©ğ‘’ğ‘•ğ‘§ğ‘•

source: Failed
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘›

source: Configuration server couldn't be contacted
en@shaw: ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘šğ‘° ğ‘’ğ‘ªğ‘¯ğ‘‘ğ‘¨ğ‘’ğ‘‘ğ‘©ğ‘›

source: Permission denied
en@shaw: ğ‘ğ‘»ğ‘¥ğ‘¦ğ‘–ğ‘ªğ‘¯ ğ‘›ğ‘¦ğ‘¯ğ‘²ğ‘›

source: Couldn't resolve address for configuration source
en@shaw: ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• ğ‘“ğ‘¹ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘•

source: Bad key or directory name
en@shaw: ğ‘šğ‘¨ğ‘› ğ‘’ğ‘° ğ‘¹ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘¯ğ‘±ğ‘¥

source: Parse error
en@shaw: ğ‘ğ‘¸ğ‘• ğ‘»ğ‘¼

source: Corrupt data in configuration source database
en@shaw: ğ‘’ğ‘¼ğ‘³ğ‘ğ‘‘ ğ‘›ğ‘±ğ‘‘ğ‘© ğ‘¦ğ‘¯ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘•

source: Type mismatch
en@shaw: ğ‘‘ğ‘²ğ‘ ğ‘¥ğ‘¦ğ‘•ğ‘¥ğ‘¨ğ‘—

source: Key operation on directory
en@shaw: ğ‘’ğ‘° ğ‘ªğ‘ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ªğ‘¯ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦

source: Directory operation on key
en@shaw: ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘ªğ‘ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ªğ‘¯ ğ‘’ğ‘°

source: Can't overwrite existing read-only value
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘´ğ‘ğ‘¼ğ‘®ğ‘²ğ‘‘ ğ‘§ğ‘’ğ‘Ÿğ‘¦ğ‘•ğ‘‘ğ‘¦ğ‘™ ğ‘®ğ‘§ğ‘›-ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘ğ‘¨ğ‘¤ğ‘¿

source: Object Activation Framework error
en@shaw: ğ‘©ğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘¨ğ‘’ğ‘‘ğ‘©ğ‘ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘®ğ‘±ğ‘¥ğ‘¢ğ‘»ğ‘’ ğ‘»ğ‘¼

source: Operation not allowed without configuration server
en@shaw: ğ‘ªğ‘ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘¯ğ‘ªğ‘‘ ğ‘©ğ‘¤ğ‘¬ğ‘› ğ‘¢ğ‘¦ğ‘ğ‘¬ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘»ğ‘ğ‘¼

source: Failed to get a lock
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘© ğ‘¤ğ‘ªğ‘’

source: No database available to save your configuration
en@shaw: ğ‘¯ğ‘´ ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘• ğ‘©ğ‘ğ‘±ğ‘¤ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘•ğ‘±ğ‘ ğ‘¿ğ‘¼ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯

source: No '/' in key "%s"
en@shaw: ğ‘¯ğ‘´ '/' ğ‘¦ğ‘¯ ğ‘’ğ‘° "%s"

source: Invalid UTF-8 in string value in '%s'
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› UTF-8 ğ‘¦ğ‘¯ ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘¦ğ‘¯ '%s'

source: Couldn't interpret CORBA value for list element
en@shaw: ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘ğ‘®ğ‘©ğ‘‘ CORBA ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘

source: Incorrect type for list element in %s
en@shaw: ğ‘¦ğ‘¯ğ‘’ğ‘©ğ‘®ğ‘§ğ‘’ğ‘‘ ğ‘‘ğ‘²ğ‘ ğ‘“ğ‘¹ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘¦ğ‘¯ %s

source: Received list from gconfd with a bad list type
en@shaw: ğ‘®ğ‘¦ğ‘•ğ‘°ğ‘ğ‘› ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘“ğ‘®ğ‘ªğ‘¥ gconfd ğ‘¢ğ‘¦ğ‘ ğ‘© ğ‘šğ‘¨ğ‘› ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘‘ğ‘²ğ‘

source: Failed to convert object to IOR
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘ğ‘»ğ‘‘ ğ‘©ğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘‘ IOR

source: Invalid UTF-8 in locale for schema
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› UTF-8 ğ‘¦ğ‘¯ ğ‘¤ğ‘´ğ‘’ğ‘­ğ‘¤ ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©

source: Invalid UTF-8 in short description for schema
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› UTF-8 ğ‘¦ğ‘¯ ğ‘–ğ‘¹ğ‘‘ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©

source: Invalid UTF-8 in long description for schema
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› UTF-8 ğ‘¦ğ‘¯ ğ‘¤ğ‘ªğ‘™ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©

source: Invalid UTF-8 in owner for schema
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› UTF-8 ğ‘¦ğ‘¯ ğ‘´ğ‘¯ğ‘¼ ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©

source: Couldn't open path file `%s': %s
en@shaw: ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘ªğ‘ğ‘§ğ‘¯ ğ‘ğ‘­ğ‘” ğ‘“ğ‘²ğ‘¤ %s: %s

source: Adding source `%s'
en@shaw: ğ‘¨ğ‘›ğ‘¦ğ‘™ ğ‘•ğ‘¹ğ‘• `%s'

source: Read error on file `%s': %s
en@shaw: ğ‘®ğ‘§ğ‘› ğ‘»ğ‘¼ ğ‘ªğ‘¯ ğ‘“ğ‘²ğ‘¤ `%s': %s

source: Text contains invalid UTF-8
en@shaw: ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘¯ğ‘Ÿ ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› UTF-8

source: Expected list, got %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¤ğ‘¦ğ‘•ğ‘‘, ğ‘œğ‘ªğ‘‘ %s

source: Expected list of %s, got list of %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘ %s, ğ‘œğ‘ªğ‘‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘ %s

source: Expected pair, got %s
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘ğ‘º, ğ‘œğ‘ªğ‘‘ %s

source: Expected (%s,%s) pair, got a pair with one or both values missing
en@shaw: ğ‘¦ğ‘’ğ‘•ğ‘ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› (%s,%s) ğ‘ğ‘º, ğ‘œğ‘ªğ‘‘ ğ‘© ğ‘ğ‘º ğ‘¢ğ‘¦ğ‘ ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘šğ‘´ğ‘” ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™
