Repository: chriskmanx/qmole
Catalog: QMOLEDEV/GConf-3.2.3/po/*.po
Languages: en@shaw

source: Must specify one or more directories to get key/value pairs from.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘¥ğ‘¹ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ğ‘Ÿ ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘’ğ‘°/ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘ğ‘ºğ‘Ÿ ğ‘“ğ‘®ğ‘ªğ‘¥.

source: Must specify one or more keys to unset.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘¥ğ‘¹ ğ‘’ğ‘°ğ‘Ÿ ğ‘‘ ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘.

source: Error unsetting `%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘³ğ‘¯ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ `%s': %s

source: Must specify one or more keys to recursively unset.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘¥ğ‘¹ ğ‘’ğ‘°ğ‘Ÿ ğ‘‘ ğ‘®ğ‘§ğ‘’ğ‘»ğ‘•ğ‘¦ğ‘ğ‘¤ğ‘¦ ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘.

source: Failure during recursive unset of "%s": %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘˜ğ‘¼ ğ‘›ğ‘˜ğ‘«ğ‘¼ğ‘¦ğ‘™ ğ‘®ğ‘§ğ‘’ğ‘»ğ‘•ğ‘¦ğ‘ ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘ ğ‘ "%s": %s

source: Must specify one or more directories to get subdirs from.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘¥ğ‘¹ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ğ‘Ÿ ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘•ğ‘³ğ‘šğ‘›ğ‘½ğ‘Ÿ ğ‘“ğ‘®ğ‘ªğ‘¥.

source: Error listing dirs: %s
en@shaw: ğ‘»ğ‘¼ ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘¦ğ‘™ ğ‘›ğ‘½ğ‘Ÿ: %s

source: WARNING: must specify both a <car> and a <cdr> in a <pair>
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘šğ‘´ğ‘” ğ‘© <car> ğ‘¯ ğ‘© <cdr> ğ‘¦ğ‘¯ ğ‘© <pair>

source: WARNING: key specified (%s) for schema under a <value> - ignoring
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘’ğ‘° ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› (%s) ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘³ğ‘¯ğ‘›ğ‘¼ ğ‘© <value> - ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™

source: WARNING: must have a child node under <value>
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘£ğ‘¨ğ‘ ğ‘© ğ‘—ğ‘²ğ‘¤ğ‘› ğ‘¯ğ‘´ğ‘› ğ‘³ğ‘¯ğ‘›ğ‘¼ <value>

source: WARNING: node <%s> not understood
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¯ğ‘´ğ‘› <%s> ğ‘¯ğ‘ªğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘«ğ‘›

source: WARNING: Failed to parse int value `%s'
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘ğ‘¸ğ‘• ğ‘¦ğ‘¯ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ `%s'

source: WARNING: Failed to parse float value `%s'
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘ğ‘¸ğ‘• ğ‘“ğ‘¤ğ‘´ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ `%s'

source: WARNING: Failed to parse string value `%s'
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘ğ‘¸ğ‘• ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘ğ‘¨ğ‘¤ğ‘¿ `%s'

source: WARNING: Failed to parse boolean value `%s'
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘ğ‘¸ğ‘• ğ‘šğ‘µğ‘¤ğ‘°ğ‘©ğ‘¯ ğ‘ğ‘¨ğ‘¤ğ‘¿ `%s'

source: WARNING: failed to associate schema `%s' with key `%s': %s
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘©ğ‘•ğ‘´ğ‘–ğ‘¦ğ‘©ğ‘‘ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© `%s' ğ‘¢ğ‘¦ğ‘ ğ‘’ğ‘° `%s': %s

source: WARNING: invalid or missing type for schema (%s)
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘¹ ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ ğ‘‘ğ‘²ğ‘ ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© (%s)

source: WARNING: invalid or missing list_type for schema (%s)
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘¹ ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ list_type ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© (%s)

source: WARNING: Failed to parse default value `%s' for schema (%s)
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘ğ‘¸ğ‘• ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ `%s' ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© (%s)

source: WARNING: invalid or missing car_type or cdr_type for schema (%s)
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘¹ ğ‘¥ğ‘¦ğ‘•ğ‘¦ğ‘™ car_type ğ‘¹ cdr_type ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© (%s)

source: WARNING: You cannot set a default value for a schema
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¿ ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘•ğ‘§ğ‘‘ ğ‘© ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©

source: WARNING: gconftool internal error, unknown GConfValueType
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: gconftool ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¯ğ‘©ğ‘¤ ğ‘»ğ‘¼, ğ‘³ğ‘¯ğ‘´ğ‘¯ GConfValueType

source: WARNING: failed to parse type name `%s'
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘ğ‘¸ğ‘• ğ‘‘ğ‘²ğ‘ ğ‘¯ğ‘±ğ‘¥ `%s'

source: WARNING: list_type can only be int, float, string or bool and not `%s'
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: list_type ğ‘’ğ‘¨ğ‘¯ ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘‘, ğ‘“ğ‘¤ğ‘´ğ‘‘, ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘¹ ğ‘šğ‘µğ‘¤ ğ‘¯ ğ‘¯ğ‘ªğ‘‘ `%s'

source: WARNING: car_type can only be int, float, string or bool and not `%s'
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: car_type ğ‘’ğ‘¨ğ‘¯ ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘‘, ğ‘“ğ‘¤ğ‘´ğ‘‘, ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘¹ ğ‘šğ‘µğ‘¤ ğ‘¯ ğ‘¯ğ‘ªğ‘‘ `%s'

source: WARNING: cdr_type can only be int, float, string or bool and not `%s'
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: cdr_type ğ‘’ğ‘¨ğ‘¯ ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘‘, ğ‘“ğ‘¤ğ‘´ğ‘‘, ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘¹ ğ‘šğ‘µğ‘¤ ğ‘¯ ğ‘¯ğ‘ªğ‘‘ `%s'

source: WARNING: empty <applyto> node
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘§ğ‘¥ğ‘ğ‘‘ğ‘¦ <applyto> ğ‘¯ğ‘´ğ‘›

source: WARNING: node <%s> not understood below <schema>
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¯ğ‘´ğ‘› <%s> ğ‘¯ğ‘ªğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘«ğ‘› ğ‘šğ‘©ğ‘¤ğ‘´ <schema>

source: WARNING: no <list_type> specified for schema of type list
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¯ğ‘´ <list_type> ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘

source: WARNING: no <car_type> specified for schema of type pair
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¯ğ‘´ <car_type> ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ğ‘º

source: WARNING: no <cdr_type> specified for schema of type pair
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¯ğ‘´ <cdr_type> ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ğ‘º

source: WARNING: <locale> node has no `name="locale"' attribute, ignoring
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: <locale> ğ‘¯ğ‘´ğ‘› ğ‘£ğ‘¨ğ‘Ÿ ğ‘¯ğ‘´ `name="ğ‘¤ğ‘´ğ‘’ğ‘­ğ‘¤"' ğ‘©ğ‘‘ğ‘®ğ‘¦ğ‘šğ‘¿ğ‘‘, ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™

source: WARNING: multiple <locale> nodes for locale `%s', ignoring all past first
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¥ğ‘³ğ‘¤ğ‘‘ğ‘¦ğ‘ğ‘©ğ‘¤ <locale> ğ‘¯ğ‘´ğ‘›ğ‘Ÿ ğ‘“ğ‘¹ ğ‘¤ğ‘´ğ‘’ğ‘­ğ‘¤ `%s', ğ‘¦ğ‘œğ‘¯ğ‘¹ğ‘¦ğ‘™ ğ‘·ğ‘¤ ğ‘ğ‘­ğ‘•ğ‘‘ ğ‘“ğ‘»ğ‘•ğ‘‘

source: WARNING: Invalid node <%s> in a <locale> node
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘› ğ‘¯ğ‘´ğ‘› <%s> ğ‘¦ğ‘¯ ğ‘© <locale> ğ‘¯ğ‘´ğ‘›

source: Attached schema `%s' to key `%s'
en@shaw: ğ‘©ğ‘‘ğ‘¨ğ‘—ğ‘‘ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© `%s' ğ‘‘ ğ‘’ğ‘° `%s'

source: You must have at least one <locale> entry in a <schema>
en@shaw: ğ‘¿ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘£ğ‘¨ğ‘ ğ‘¨ğ‘‘ ğ‘¤ğ‘°ğ‘•ğ‘‘ ğ‘¢ğ‘³ğ‘¯ <locale> ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ ğ‘¦ğ‘¯ ğ‘© <schema>

source: WARNING: failed to install schema `%s', locale `%s': %s
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© `%s', ğ‘¤ğ‘´ğ‘’ğ‘­ğ‘¤ `%s': %s

source: Installed schema `%s' for locale `%s'
en@shaw: ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤ğ‘› ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© `%s' ğ‘“ğ‘¹ ğ‘¤ğ‘´ğ‘’ğ‘­ğ‘¤ `%s'

source: WARNING: failed to uninstall schema `%s', locale `%s': %s
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘³ğ‘¯ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© `%s', ğ‘¤ğ‘´ğ‘’ğ‘­ğ‘¤ `%s': %s

source: Uninstalled schema `%s' from locale `%s'
en@shaw: ğ‘³ğ‘¯ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤ğ‘› ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© `%s' ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘¤ğ‘´ğ‘’ğ‘­ğ‘¤ `%s'

source: WARNING: no key specified for schema
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¯ğ‘´ ğ‘’ğ‘° ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘“ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©

source: WARNING: node <%s> not understood below <%s>
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¯ğ‘´ğ‘› <%s> ğ‘¯ğ‘ªğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘«ğ‘› ğ‘šğ‘©ğ‘¤ğ‘´ <%s>

source: Failed to open `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘´ğ‘ğ‘©ğ‘¯ `%s': %s

source: Document `%s' is empty?
en@shaw: ğ‘›ğ‘ªğ‘’ğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ `%s' ğ‘¦ğ‘Ÿ ğ‘§ğ‘¥ğ‘ğ‘‘ğ‘¦?

source: Document `%s' has the wrong type of root node (<%s>, should be <%s>)
en@shaw: ğ‘›ğ‘ªğ‘’ğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ `%s' ğ‘£ğ‘¨ğ‘Ÿ ğ‘ ğ‘®ğ‘ªğ‘™ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘®ğ‘µğ‘‘ ğ‘¯ğ‘´ğ‘› (<%s>, ğ‘–ğ‘«ğ‘› ğ‘šğ‘° <%s>)

source: Document `%s' has no top level <%s> node
en@shaw: ğ‘›ğ‘ªğ‘’ğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ `%s' ğ‘£ğ‘¨ğ‘Ÿ ğ‘¯ğ‘´ ğ‘‘ğ‘ªğ‘ ğ‘¤ğ‘§ğ‘ğ‘©ğ‘¤ <%s> ğ‘¯ğ‘´ğ‘›

source: WARNING: node <%s> below <%s> not understood
en@shaw: ğ‘¢ğ‘¹ğ‘¯ğ‘¦ğ‘™: ğ‘¯ğ‘´ğ‘› <%s> ğ‘šğ‘©ğ‘¤ğ‘´ <%s> ğ‘¯ğ‘ªğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘«ğ‘›

source: Error syncing configuration data: %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘¦ğ‘™ğ‘’ğ‘¦ğ‘™ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘›ğ‘±ğ‘‘ğ‘©: %s

source: Must specify some schema files to install
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘•ğ‘³ğ‘¥ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘“ğ‘²ğ‘¤ğ‘Ÿ ğ‘‘ ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤

source: Failed to unset breakage key %s: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘ ğ‘šğ‘®ğ‘±ğ‘’ğ‘¦ğ‘¡ ğ‘’ğ‘° %s: %s

source: Must specify some keys to break
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘•ğ‘³ğ‘¥ ğ‘’ğ‘°ğ‘Ÿ ğ‘‘ ğ‘šğ‘®ğ‘±ğ‘’

source: Trying to break your application by setting bad values for key: %s
en@shaw: ğ‘‘ğ‘®ğ‘²ğ‘¦ğ‘™ ğ‘‘ ğ‘šğ‘®ğ‘±ğ‘’ ğ‘¿ğ‘¼ ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘šğ‘² ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘šğ‘¨ğ‘› ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘“ğ‘¹ ğ‘’ğ‘°: %s

source: Must specify some directories to break
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘•ğ‘³ğ‘¥ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ğ‘Ÿ ğ‘‘ ğ‘šğ‘®ğ‘±ğ‘’

source: Trying to break your application by setting bad values for keys in directory: %s
en@shaw: ğ‘‘ğ‘®ğ‘²ğ‘¦ğ‘™ ğ‘‘ ğ‘šğ‘®ğ‘±ğ‘’ ğ‘¿ğ‘¼ ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘šğ‘² ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘šğ‘¨ğ‘› ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘“ğ‘¹ ğ‘’ğ‘°ğ‘Ÿ ğ‘¦ğ‘¯ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦: %s
