Repository: chriskmanx/qmole
Catalog: QMOLEDEV/GConf-3.2.3/po/*.po
Languages: en@shaw

source: Failed to restore original saved state file that had been moved to '%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘©ğ‘•ğ‘‘ğ‘¹ ğ‘©ğ‘®ğ‘¦ğ‘¡ğ‘©ğ‘¯ğ‘©ğ‘¤ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ ğ‘ğ‘¨ğ‘‘ ğ‘£ğ‘¨ğ‘› ğ‘šğ‘°ğ‘¯ ğ‘¥ğ‘µğ‘ğ‘› ğ‘‘ '%s': %s

source: Unable to restore a listener on address '%s', couldn't resolve the database
en@shaw: ğ‘³ğ‘¯ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘®ğ‘©ğ‘•ğ‘‘ğ‘¹ ğ‘© ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘¼ ğ‘ªğ‘¯ ğ‘©ğ‘›ğ‘®ğ‘§ğ‘• '%s', ğ‘’ğ‘«ğ‘›ğ‘¯ğ‘‘ ğ‘®ğ‘¦ğ‘Ÿğ‘ªğ‘¤ğ‘ ğ‘ ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘•

source: Error reading saved state file: %s
en@shaw: ğ‘»ğ‘¼ ğ‘®ğ‘°ğ‘›ğ‘¦ğ‘™ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤: %s

source: Unable to open saved state file '%s': %s
en@shaw: ğ‘³ğ‘¯ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘´ğ‘ğ‘©ğ‘¯ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤ '%s': %s

source: Failed to log addition of listener to gconfd logfile; won't be able to re-add the listener if gconfd exits or shuts down (%s)
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¤ğ‘ªğ‘œ ğ‘©ğ‘›ğ‘¦ğ‘–ğ‘©ğ‘¯ ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘» ğ‘‘ gconfd ğ‘¤ğ‘ªğ‘œğ‘“ğ‘²ğ‘¤; ğ‘¢ğ‘´ğ‘¯ğ‘‘ ğ‘šğ‘° ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘®ğ‘°-ğ‘¨ğ‘› ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘» ğ‘¦ğ‘“ gconfd ğ‘§ğ‘œğ‘Ÿğ‘¦ğ‘‘ğ‘• ğ‘¹ ğ‘–ğ‘³ğ‘‘ğ‘• ğ‘›ğ‘¬ğ‘¯ (%s)

source: Failed to log removal of listener to gconfd logfile; might erroneously re-add the listener if gconfd exits or shuts down (%s)
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¤ğ‘ªğ‘œ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ğ‘©ğ‘¤ ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘» ğ‘‘ gconfd ğ‘¤ğ‘ªğ‘œğ‘“ğ‘²ğ‘¤; ğ‘¥ğ‘²ğ‘‘ ğ‘§ğ‘®ğ‘´ğ‘¯ğ‘°ğ‘©ğ‘•ğ‘¤ğ‘° ğ‘®ğ‘°-ğ‘¨ğ‘› ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘©ğ‘¯ğ‘» ğ‘¦ğ‘“ gconfd ğ‘§ğ‘œğ‘Ÿğ‘¦ğ‘‘ğ‘• ğ‘¹ ğ‘–ğ‘³ğ‘‘ğ‘• ğ‘›ğ‘¬ğ‘¯ (%s)

source: Failed to get IOR for client: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ IOR ğ‘“ğ‘¹ ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘: %s

source: Failed to open saved state file: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘´ğ‘ğ‘©ğ‘¯ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤: %s

source: Failed to write client add to saved state file: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘®ğ‘²ğ‘‘ ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘¨ğ‘› ğ‘‘ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤: %s

source: Failed to flush client add to saved state file: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘“ğ‘¤ğ‘©ğ‘– ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘¨ğ‘› ğ‘‘ ğ‘•ğ‘±ğ‘ğ‘› ğ‘•ğ‘‘ğ‘±ğ‘‘ ğ‘“ğ‘²ğ‘¤: %s

source: Some client removed itself from the GConf server when it hadn't been added.
en@shaw: ğ‘•ğ‘³ğ‘¥ ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ğ‘› ğ‘¦ğ‘‘ğ‘•ğ‘§ğ‘¤ğ‘“ ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘ GConf ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘¢ğ‘§ğ‘¯ ğ‘¦ğ‘‘ ğ‘£ğ‘¨ğ‘›ğ‘¯ğ‘‘ ğ‘šğ‘°ğ‘¯ ğ‘¨ğ‘›ğ‘©ğ‘›.

source: Set a key to a value and sync. Use with --type.
en@shaw: ğ‘•ğ‘§ğ‘‘ ğ‘© ğ‘’ğ‘° ğ‘‘ ğ‘© ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘¯ ğ‘•ğ‘¦ğ‘™ğ‘’. ğ‘¿ğ‘Ÿ ğ‘¢ğ‘¦ğ‘ --type.

source: Print the value of a key to standard output.
en@shaw: ğ‘ğ‘®ğ‘¦ğ‘¯ğ‘‘ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘ ğ‘© ğ‘’ğ‘° ğ‘‘ ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘›ğ‘¼ğ‘› ğ‘¬ğ‘‘ğ‘ğ‘«ğ‘‘.

source: Unset the keys on the command line
en@shaw: ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘ ğ‘ ğ‘’ğ‘°ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯

source: Recursively unset all keys at or below the key/directory names on the command line
en@shaw: ğ‘®ğ‘§ğ‘’ğ‘»ğ‘•ğ‘¦ğ‘ğ‘¤ğ‘¦ ğ‘³ğ‘¯ğ‘•ğ‘§ğ‘‘ ğ‘·ğ‘¤ ğ‘’ğ‘°ğ‘Ÿ ğ‘¨ğ‘‘ ğ‘¹ ğ‘šğ‘©ğ‘¤ğ‘´ ğ‘ ğ‘’ğ‘°/ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘¯ğ‘±ğ‘¥ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯

source: Toggles a boolean key.
en@shaw: ğ‘‘ğ‘ªğ‘œğ‘©ğ‘¤ğ‘Ÿ ğ‘© ğ‘šğ‘µğ‘¤ğ‘°ğ‘©ğ‘¯ ğ‘’ğ‘°.

source: Print all key/value pairs in a directory.
en@shaw: ğ‘ğ‘®ğ‘¦ğ‘¯ğ‘‘ ğ‘·ğ‘¤ ğ‘’ğ‘°/ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘ğ‘ºğ‘Ÿ ğ‘¦ğ‘¯ ğ‘© ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦.

source: Print all subdirectories in a directory.
en@shaw: ğ‘ğ‘®ğ‘¦ğ‘¯ğ‘‘ ğ‘·ğ‘¤ ğ‘•ğ‘³ğ‘šğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ğ‘Ÿ ğ‘¦ğ‘¯ ğ‘© ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦.

source: Print all subdirectories and entries under a directory, recursively.
en@shaw: ğ‘ğ‘®ğ‘¦ğ‘¯ğ‘‘ ğ‘·ğ‘¤ ğ‘•ğ‘³ğ‘šğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ğ‘Ÿ ğ‘¯ ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ğ‘Ÿ ğ‘³ğ‘¯ğ‘›ğ‘¼ ğ‘© ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦, ğ‘®ğ‘§ğ‘’ğ‘»ğ‘•ğ‘¦ğ‘ğ‘¤ğ‘¦.

source: Search for a key, recursively.
en@shaw: ğ‘•ğ‘»ğ‘— ğ‘“ğ‘¹ ğ‘© ğ‘’ğ‘°, ğ‘®ğ‘§ğ‘’ğ‘»ğ‘•ğ‘¦ğ‘ğ‘¤ğ‘¦.

source: Get the short doc string for a key
en@shaw: ğ‘œğ‘§ğ‘‘ ğ‘ ğ‘–ğ‘¹ğ‘‘ ğ‘›ğ‘ªğ‘’ ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘“ğ‘¹ ğ‘© ğ‘’ğ‘°

source: Get the long doc string for a key
en@shaw: ğ‘œğ‘§ğ‘‘ ğ‘ ğ‘¤ğ‘ªğ‘™ ğ‘›ğ‘ªğ‘’ ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘“ğ‘¹ ğ‘© ğ‘’ğ‘°

source: Return 0 if the directory exists, 2 if it does not.
en@shaw: ğ‘®ğ‘¦ğ‘‘ğ‘»ğ‘¯ 0 ğ‘¦ğ‘“ ğ‘ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘§ğ‘’ğ‘Ÿğ‘¦ğ‘•ğ‘‘ğ‘•, 2 ğ‘¦ğ‘“ ğ‘¦ğ‘‘ ğ‘›ğ‘³ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘.

source: Ignore schema defaults when reading values.
en@shaw: ğ‘¦ğ‘œğ‘¯ğ‘¹ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ğ‘• ğ‘¢ğ‘§ğ‘¯ ğ‘®ğ‘°ğ‘›ğ‘¦ğ‘™ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ.

source: Dump to standard output an XML description of all entries under a directory, recursively.
en@shaw: ğ‘›ğ‘³ğ‘¥ğ‘ ğ‘‘ ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘›ğ‘¼ğ‘› ğ‘¬ğ‘‘ğ‘ğ‘«ğ‘‘ ğ‘©ğ‘¯ ğ‘ºğ‘µâ€ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘ ğ‘·ğ‘¤ ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ğ‘Ÿ ğ‘³ğ‘¯ğ‘›ğ‘¼ ğ‘© ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦, ğ‘®ğ‘§ğ‘’ğ‘»ğ‘•ğ‘¦ğ‘ğ‘¤ğ‘¦.

source: Load from the specified file an XML description of values and set them relative to a directory.
en@shaw: ğ‘¤ğ‘´ğ‘› ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘› ğ‘“ğ‘²ğ‘¤ ğ‘©ğ‘¯ XML ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘¯ ğ‘•ğ‘§ğ‘‘ ğ‘ğ‘§ğ‘¥ ğ‘®ğ‘§ğ‘¤ğ‘©ğ‘‘ğ‘¦ğ‘ ğ‘‘ ğ‘© ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦.

source: Unload a set of values described in an XML file.
en@shaw: ğ‘©ğ‘¯ğ‘¤ğ‘´ğ‘› ğ‘© ğ‘•ğ‘§ğ‘‘ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘²ğ‘šğ‘› ğ‘¦ğ‘¯ ğ‘©ğ‘¯ XML ğ‘“ğ‘²ğ‘¤.

source: Get the name of the default source
en@shaw: ğ‘œğ‘§ğ‘‘ ğ‘ ğ‘¯ğ‘±ğ‘¥ ğ‘ ğ‘ ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘•ğ‘¹ğ‘•

source: Shut down gconfd. DON'T USE THIS OPTION WITHOUT GOOD REASON.
en@shaw: ğ‘–ğ‘³ğ‘‘ ğ‘›ğ‘¬ğ‘¯ gconfd. ğ‘›ğ‘´ğ‘¯ğ‘‘ ğ‘¿ğ‘Ÿ ğ‘ğ‘¦ğ‘• ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ ğ‘¢ğ‘¦ğ‘ğ‘¬ğ‘‘ ğ‘œğ‘«ğ‘› ğ‘®ğ‘°ğ‘Ÿğ‘©ğ‘¯.

source: Return 0 if gconfd is running, 2 if not.
en@shaw: ğ‘®ğ‘¦ğ‘‘ğ‘»ğ‘¯ 0 ğ‘¦ğ‘“ gconfd ğ‘¦ğ‘Ÿ ğ‘®ğ‘³ğ‘¯ğ‘¦ğ‘™, 2 ğ‘¦ğ‘“ ğ‘¯ğ‘ªğ‘‘.

source: Launch the configuration server (gconfd). (Normally happens automatically when needed.)
en@shaw: ğ‘¤ğ‘·ğ‘¯ğ‘— ğ‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘»ğ‘ğ‘¼ (gconfd). (ğ‘¯ğ‘¹ğ‘¥ğ‘©ğ‘¤ğ‘¦ ğ‘£ğ‘¨ğ‘ğ‘©ğ‘¯ğ‘Ÿ ğ‘·ğ‘‘ğ‘©ğ‘¥ğ‘¨ğ‘‘ğ‘¦ğ‘’ğ‘¤ğ‘¦ ğ‘¢ğ‘§ğ‘¯ ğ‘¯ğ‘°ğ‘›ğ‘©ğ‘›.)

source: Specify the type of the value being set, or the type of the value a schema describes. Unique abbreviations OK.
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘šğ‘°ğ‘¦ğ‘™ ğ‘•ğ‘§ğ‘‘, ğ‘¹ ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘²ğ‘šğ‘Ÿ. ğ‘¿ğ‘¯ğ‘°ğ‘’ ğ‘©ğ‘šğ‘®ğ‘°ğ‘ğ‘°ğ‘±ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘´ğ‘’ğ‘±.

source: int|bool|float|string|list|pair
en@shaw: ğ‘¦ğ‘¯ğ‘‘|ğ‘šğ‘µğ‘¤|ğ‘“ğ‘¤ğ‘´ğ‘‘|ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™|ğ‘¤ğ‘¦ğ‘•ğ‘‘|ğ‘ğ‘º

source: Print the data type of a key to standard output.
en@shaw: ğ‘ğ‘®ğ‘¦ğ‘¯ğ‘‘ ğ‘ ğ‘›ğ‘±ğ‘‘ğ‘© ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘© ğ‘’ğ‘° ğ‘‘ ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘›ğ‘¼ğ‘› ğ‘¬ğ‘‘ğ‘ğ‘«ğ‘‘.

source: Get the number of elements in a list key.
en@shaw: ğ‘œğ‘§ğ‘‘ ğ‘ ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘• ğ‘¦ğ‘¯ ğ‘© ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘’ğ‘°.

source: Get a specific element from a list key, numerically indexed.
en@shaw: ğ‘œğ‘§ğ‘‘ ğ‘© ğ‘•ğ‘ğ‘©ğ‘•ğ‘¦ğ‘“ğ‘¦ğ‘’ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘© ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘’ğ‘°, ğ‘¯ğ‘¿ğ‘¥ğ‘§ğ‘®ğ‘¦ğ‘’ğ‘©ğ‘¤ğ‘¦ ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘•ğ‘‘.

source: Specify the type of the list value being set, or the type of the value a schema describes. Unique abbreviations OK.
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘šğ‘°ğ‘¦ğ‘™ ğ‘•ğ‘§ğ‘‘, ğ‘¹ ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘²ğ‘šğ‘Ÿ. ğ‘¿ğ‘¯ğ‘°ğ‘’ ğ‘©ğ‘šğ‘®ğ‘°ğ‘ğ‘°ğ‘±ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘´ğ‘’ğ‘±.

source: int|bool|float|string
en@shaw: ğ‘¦ğ‘¯ğ‘‘|ğ‘šğ‘µğ‘¤|ğ‘“ğ‘¤ğ‘´ğ‘‘|ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™

source: Specify the type of the car pair value being set, or the type of the value a schema describes. Unique abbreviations OK.
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ car ğ‘ğ‘º ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘šğ‘°ğ‘¦ğ‘™ ğ‘•ğ‘§ğ‘‘, ğ‘¹ ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘²ğ‘šğ‘Ÿ. ğ‘¿ğ‘¯ğ‘°ğ‘’ ğ‘©ğ‘šğ‘®ğ‘°ğ‘ğ‘°ğ‘±ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘´ğ‘’ğ‘±.

source: Specify the type of the cdr pair value being set, or the type of the value a schema describes. Unique abbreviations OK.
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ cdr ğ‘ğ‘º ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘šğ‘°ğ‘¦ğ‘™ ğ‘•ğ‘§ğ‘‘, ğ‘¹ ğ‘ ğ‘‘ğ‘²ğ‘ ğ‘ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘²ğ‘šğ‘Ÿ. ğ‘¿ğ‘¯ğ‘°ğ‘’ ğ‘©ğ‘šğ‘®ğ‘°ğ‘ğ‘°ğ‘±ğ‘–ğ‘©ğ‘¯ğ‘Ÿ ğ‘´ğ‘’ğ‘±.

source: Specify a schema file to be installed
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘“ğ‘²ğ‘¤ ğ‘‘ ğ‘šğ‘° ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤ğ‘›

source: FILENAME
en@shaw: ğ‘“ğ‘²ğ‘¤ğ‘¯ğ‘±ğ‘¥

source: Specify a configuration source to use rather than the default path
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘‘ ğ‘¿ğ‘• ğ‘®ğ‘­ğ‘ğ‘¼ ğ‘ğ‘¨ğ‘¯ ğ‘ ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘ğ‘­ğ‘”

source: SOURCE
en@shaw: ğ‘•ğ‘¹ğ‘•

source: Bypass server, and access the configuration database directly. Requires that gconfd is not running.
en@shaw: ğ‘šğ‘²ğ‘ğ‘¨ğ‘• ğ‘•ğ‘»ğ‘ğ‘¼, ğ‘¯ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘• ğ‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘• ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¤ğ‘¦. ğ‘®ğ‘¦ğ‘’ğ‘¢ğ‘²ğ‘¼ğ‘Ÿ ğ‘ğ‘¨ğ‘‘ gconfd ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘®ğ‘³ğ‘¯ğ‘¦ğ‘™.

source: Properly installs schema files on the command line into the database. Specify a custom configuration source in the GCONF_CONFIG_SOURCE environment variable, or set set the variable to an empty string to use the default configuration source.
en@shaw: ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘¤ğ‘¦ ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤ğ‘Ÿ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘“ğ‘²ğ‘¤ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯ ğ‘¦ğ‘¯ğ‘‘ğ‘« ğ‘ ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘•. ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘³ğ‘•ğ‘‘ğ‘©ğ‘¥ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘¦ğ‘¯ ğ‘ GCONF_CONFIG_SOURCE ğ‘§ğ‘¯ğ‘ğ‘²ğ‘¼ğ‘¯ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘ğ‘ºğ‘¦ğ‘©ğ‘šğ‘©ğ‘¤, ğ‘¹ ğ‘•ğ‘§ğ‘‘ ğ‘•ğ‘§ğ‘‘ ğ‘ ğ‘ğ‘ºğ‘¦ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ ğ‘©ğ‘¯ ğ‘§ğ‘¥ğ‘ğ‘‘ğ‘¦ ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘‘ ğ‘¿ğ‘• ğ‘ ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘•.

source: Properly uninstalls schema files on the command line from the database. GCONF_CONFIG_SOURCE environment variable should be set to a non-default configuration source or set to the empty string to use the default.
en@shaw: ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘¤ğ‘¦ ğ‘³ğ‘¯ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤ğ‘Ÿ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘“ğ‘²ğ‘¤ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯ ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘ ğ‘›ğ‘±ğ‘‘ğ‘©ğ‘šğ‘±ğ‘•. GCONF_CONFIG_SOURCE ğ‘§ğ‘¯ğ‘ğ‘²ğ‘¼ğ‘¯ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘ğ‘ºğ‘¦ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘•ğ‘§ğ‘‘ ğ‘‘ ğ‘© ğ‘¯ğ‘ªğ‘¯-ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘¹ ğ‘•ğ‘§ğ‘‘ ğ‘‘ ğ‘ ğ‘§ğ‘¥ğ‘ğ‘‘ğ‘¦ ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘‘ ğ‘¿ğ‘• ğ‘ ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘.

source: Torture-test an application by setting and unsetting a bunch of values of different types for keys on the command line.
en@shaw: ğ‘‘ğ‘ªğ‘®ğ‘—ğ‘¼-ğ‘‘ğ‘§ğ‘•ğ‘‘ ğ‘©ğ‘¯ ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘šğ‘² ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘¯ ğ‘³ğ‘¯ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘© ğ‘šğ‘³ğ‘¯ğ‘— ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘ ğ‘›ğ‘¦ğ‘“ğ‘¼ğ‘©ğ‘¯ğ‘‘ ğ‘‘ğ‘²ğ‘ğ‘• ğ‘“ğ‘¹ ğ‘’ğ‘°ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯.

source: Torture-test an application by setting and unsetting a bunch of keys inside the directories on the command line.
en@shaw: ğ‘‘ğ‘ªğ‘®ğ‘—ğ‘¼-ğ‘‘ğ‘§ğ‘•ğ‘‘ ğ‘©ğ‘¯ ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯ ğ‘šğ‘² ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘¯ ğ‘³ğ‘¯ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘© ğ‘šğ‘³ğ‘¯ğ‘— ğ‘ ğ‘’ğ‘°ğ‘Ÿ ğ‘¦ğ‘¯ğ‘•ğ‘²ğ‘› ğ‘ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯.

source: Set a schema and sync. Use with --short-desc, --long-desc, --owner, and --type.
en@shaw: ğ‘•ğ‘§ğ‘‘ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ ğ‘•ğ‘¦ğ‘™ğ‘’. ğ‘¿ğ‘Ÿ ğ‘¢ğ‘¦ğ‘ --short-desc, --long-desc, --owner, ğ‘¯ --type.

source: Specify a short half-line description to go in a schema.
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘–ğ‘¹ğ‘‘ ğ‘£ğ‘­ğ‘“-ğ‘¤ğ‘²ğ‘¯ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘‘ ğ‘œğ‘´ ğ‘¦ğ‘¯ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©.

source: DESCRIPTION
en@shaw: ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯

source: Specify a several-line description to go in a schema.
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘•ğ‘§ğ‘ğ‘¼ğ‘©ğ‘¤-ğ‘¤ğ‘²ğ‘¯ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘‘ ğ‘œğ‘´ ğ‘¦ğ‘¯ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©.

source: Specify the owner of a schema
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘´ğ‘¯ğ‘¼ ğ‘ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©

source: OWNER
en@shaw: ğ‘´ğ‘¯ğ‘¼

source: Get the name of the schema applied to this key
en@shaw: ğ‘œğ‘§ğ‘‘ ğ‘ ğ‘¯ğ‘±ğ‘¥ ğ‘ ğ‘ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘©ğ‘ğ‘¤ğ‘²ğ‘› ğ‘‘ ğ‘ğ‘¦ğ‘• ğ‘’ğ‘°

source: Specify the schema name followed by the key to apply the schema name to
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘±ğ‘¥ ğ‘“ğ‘ªğ‘¤ğ‘´ğ‘› ğ‘šğ‘² ğ‘ ğ‘’ğ‘° ğ‘‘ ğ‘©ğ‘ğ‘¤ğ‘² ğ‘ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘±ğ‘¥ ğ‘‘

source: Remove any schema name applied to the given keys
en@shaw: ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ ğ‘§ğ‘¯ğ‘¦ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘±ğ‘¥ ğ‘©ğ‘ğ‘¤ğ‘²ğ‘› ğ‘‘ ğ‘ ğ‘œğ‘¦ğ‘ğ‘©ğ‘¯ ğ‘’ğ‘°ğ‘Ÿ

source: Print version
en@shaw: ğ‘ğ‘®ğ‘¦ğ‘¯ğ‘‘ ğ‘ğ‘»ğ‘ ğ‘©ğ‘¯

source: [FILE...]|[KEY...]|[DIR...]
en@shaw: [ğ‘“ğ‘²ğ‘¤...]|[ğ‘’ğ‘°...]|[ğ‘›ğ‘½...]

source: - Tool to manipulate a GConf configuration
en@shaw: - ğ‘‘ğ‘µğ‘¤ ğ‘‘ ğ‘¥ğ‘©ğ‘¯ğ‘¦ğ‘ğ‘˜ğ‘©ğ‘¤ğ‘±ğ‘‘ ğ‘© GConf ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯

source: Client options:
en@shaw: ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ:

source: Show client options
en@shaw: ğ‘–ğ‘´ ğ‘’ğ‘¤ğ‘²ğ‘©ğ‘¯ğ‘‘ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ

source: Key type options:
en@shaw: ğ‘’ğ‘° ğ‘‘ğ‘²ğ‘ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ:

source: Show key type options
en@shaw: ğ‘–ğ‘´ ğ‘’ğ‘° ğ‘‘ğ‘²ğ‘ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ

source: Load/Save options:
en@shaw: ğ‘¤ğ‘´ğ‘›/ğ‘•ğ‘±ğ‘ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ:

source: Show load/save options
en@shaw: ğ‘–ğ‘´ ğ‘¤ğ‘´ğ‘›/ğ‘•ğ‘±ğ‘ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ

source: Server options:
en@shaw: ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ:

source: Show server options
en@shaw: ğ‘–ğ‘´ ğ‘•ğ‘»ğ‘ğ‘¼ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ

source: Installation options:
en@shaw: ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘©ğ‘¤ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ:

source: Show installation options
en@shaw: ğ‘–ğ‘´ ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘©ğ‘¤ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ

source: Test options:
en@shaw: ğ‘‘ğ‘§ğ‘•ğ‘‘ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ:

source: Show test options
en@shaw: ğ‘–ğ‘´ ğ‘‘ğ‘§ğ‘•ğ‘‘ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ

source: Schema options:
en@shaw: ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ:

source: Show schema options
en@shaw: ğ‘–ğ‘´ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ

source: Run '%s --help' to see a full list of available command line options.
en@shaw: ğ‘®ğ‘³ğ‘¯ '%s --help' ğ‘‘ ğ‘•ğ‘° ğ‘© ğ‘“ğ‘«ğ‘¤ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘ ğ‘©ğ‘ğ‘±ğ‘¤ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯ ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ğ‘Ÿ.

source: Can't get and set/unset simultaneously
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘¯ ğ‘•ğ‘§ğ‘‘/ğ‘³ğ‘¯ğ‘•ğ‘§ğ‘‘ ğ‘•ğ‘²ğ‘¥ğ‘©ğ‘¤ğ‘‘ğ‘±ğ‘¯ğ‘°ğ‘©ğ‘•ğ‘¤ğ‘¦

source: Can't set and get/unset simultaneously
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘•ğ‘§ğ‘‘ ğ‘¯ ğ‘œğ‘§ğ‘‘/ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘ ğ‘•ğ‘²ğ‘¥ğ‘©ğ‘¤ğ‘‘ğ‘±ğ‘¯ğ‘°ğ‘©ğ‘•ğ‘¤ğ‘¦

source: Can't get type and set/unset simultaneously
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘‘ğ‘²ğ‘ ğ‘¯ ğ‘•ğ‘§ğ‘‘/ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘ ğ‘•ğ‘²ğ‘¥ğ‘©ğ‘¤ğ‘‘ğ‘±ğ‘¯ğ‘°ğ‘©ğ‘•ğ‘¤ğ‘¦

source: Can't toggle and get/set/unset simultaneously
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘‘ğ‘ªğ‘œğ‘©ğ‘¤ ğ‘¯ ğ‘œğ‘§ğ‘‘/ğ‘•ğ‘§ğ‘‘/ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘ ğ‘•ğ‘²ğ‘¥ğ‘©ğ‘¤ğ‘‘ğ‘±ğ‘¯ğ‘°ğ‘©ğ‘•ğ‘¤ğ‘¦

source: Can't use --all-entries with --get or --set
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘¿ğ‘Ÿ --all-entries ğ‘¢ğ‘¦ğ‘ --get ğ‘¹ --set

source: Can't use --all-dirs with --get or --set
en@shaw: ğ‘’ğ‘­ğ‘¯ğ‘‘ ğ‘¿ğ‘Ÿ --all-entries ğ‘¢ğ‘¦ğ‘ --get ğ‘¹ --set

source: --recursive-list should not be used with --get, --set, --unset, --all-entries, --all-dirs, or --search-key
en@shaw: --recursive-ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘–ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘¿ğ‘Ÿğ‘› ğ‘¢ğ‘¦ğ‘ --get, --set, --unset, --all-entries, --all-dirs, ğ‘¹ --search-key

source: --set_schema should not be used with --get, --set, --unset, --all-entries, --all-dirs, or --search-key
en@shaw: --set_schema ğ‘–ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘¿ğ‘Ÿğ‘› ğ‘¢ğ‘¦ğ‘ --get, --set, --unset, --all-entries, --all-dirs, ğ‘¹ --search-key

source: Value type is only relevant when setting a value
en@shaw: ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘‘ğ‘²ğ‘ ğ‘¦ğ‘Ÿ ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘®ğ‘§ğ‘¤ğ‘©ğ‘ğ‘©ğ‘¯ğ‘‘ ğ‘¢ğ‘§ğ‘¯ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘© ğ‘ğ‘¨ğ‘¤ğ‘¿

source: Must specify a type when setting a value
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘‘ğ‘²ğ‘ ğ‘¢ğ‘§ğ‘¯ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘© ğ‘ğ‘¨ğ‘¤ğ‘¿

source: --ignore-schema-defaults is only relevant with --get, --all-entries, --dump, --recursive-list, --get-list-size or --get-list-element
en@shaw: --ignore-schema-defaults ğ‘¦ğ‘Ÿ ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘®ğ‘§ğ‘¤ğ‘©ğ‘ğ‘©ğ‘¯ğ‘‘ ğ‘¢ğ‘¦ğ‘ --get, --all-entries, --dump, --recursive-list, --get-list-size ğ‘¹ --get-list-element

source: %s option must be used by itself.
en@shaw: %s ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° ğ‘¿ğ‘Ÿğ‘› ğ‘šğ‘² ğ‘¦ğ‘‘ğ‘•ğ‘§ğ‘¤ğ‘“.

source: You must specify a configuration source with --config-source when using --direct
en@shaw: ğ‘¿ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘• ğ‘¢ğ‘¦ğ‘ --config-source ğ‘¢ğ‘§ğ‘¯ ğ‘¿ğ‘Ÿğ‘¦ğ‘™ --direct

source: Failed to init GConf: %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¦ğ‘¯ğ‘¦ğ‘‘ GConf: %s

source: GCONF_DISABLE_MAKEFILE_SCHEMA_INSTALL is set, not installing schemas
en@shaw: GCONF_DISABLE_MAKEFILE_SCHEMA_INSTALL ğ‘¦ğ‘Ÿ ğ‘•ğ‘§ğ‘‘, ğ‘¯ğ‘ªğ‘‘ ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘·ğ‘¤ğ‘¦ğ‘™ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©ğ‘Ÿ

source: GCONF_DISABLE_MAKEFILE_SCHEMA_UNINSTALL is set, not uninstalling schemas
en@shaw: GCONF_DISABLE_MAKEFILE_SCHEMA_UNINSTALL ğ‘¦ğ‘Ÿ ğ‘•ğ‘§ğ‘‘, ğ‘¯ğ‘ªğ‘‘ ğ‘³ğ‘¯ğ‘¦ğ‘¯ğ‘•ğ‘·ğ‘¤ğ‘¦ğ‘™ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©ğ‘Ÿ

source: Must set the GCONF_CONFIG_SOURCE environment variable
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘§ğ‘‘ ğ‘ GCONF_CONFIG_SOURCE ğ‘§ğ‘¯ğ‘ğ‘²ğ‘¼ğ‘¯ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘ğ‘ºğ‘¦ğ‘©ğ‘šğ‘©ğ‘¤

source: Failed to access configuration source(s): %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘• ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘¹ğ‘•(ğ‘§ğ‘Ÿ): %s

source: Shutdown error: %s
en@shaw: ğ‘–ğ‘³ğ‘‘ğ‘›ğ‘¶ğ‘¯ ğ‘»ğ‘¼: %s

source: Must specify one or more directories to recursively list.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘¥ğ‘¹ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ğ‘Ÿ ğ‘‘ ğ‘®ğ‘§ğ‘’ğ‘»ğ‘•ğ‘¦ğ‘ğ‘¤ğ‘¦ ğ‘¤ğ‘¦ğ‘•ğ‘‘.

source: Failure listing entries in `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘˜ğ‘¼ ğ‘¤ğ‘¦ğ‘•ğ‘‘ğ‘¦ğ‘™ ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦ğ‘Ÿ ğ‘¦ğ‘¯ `%s': %s

source: (no value set)
en@shaw: (ğ‘¯ğ‘´ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘•ğ‘§ğ‘‘)

source: Must specify a key pattern to search for.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘° ğ‘ğ‘¨ğ‘‘ğ‘¼ğ‘¯ ğ‘‘ ğ‘•ğ‘»ğ‘— ğ‘“ğ‘¹.

source: Must specify a PCRE regex to search for.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© PCRE ğ‘®ğ‘§ğ‘¡ğ‘§ğ‘’ğ‘• ğ‘‘ ğ‘•ğ‘»ğ‘— ğ‘“ğ‘¹.

source: Error compiling regex: %s
en@shaw: ğ‘»ğ‘¼ ğ‘’ğ‘©ğ‘¥ğ‘ğ‘²ğ‘¤ğ‘¦ğ‘™ ğ‘®ğ‘§ğ‘¡ğ‘§ğ‘’ğ‘•: %s

source: Must specify one or more directories to dump.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘¥ğ‘¹ ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ğ‘Ÿ ğ‘‘ ğ‘›ğ‘³ğ‘¥ğ‘.

source: Failed to spawn the configuration server (gconfd): %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘•ğ‘ğ‘­ğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¯ğ‘“ğ‘¦ğ‘œğ‘˜ğ‘¼ğ‘±ğ‘–ğ‘©ğ‘¯ ğ‘•ğ‘»ğ‘ğ‘¼ (gconfd): %s

source: Must specify a key or keys to get
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘° ğ‘¹ ğ‘’ğ‘°ğ‘Ÿ ğ‘‘ ğ‘œğ‘§ğ‘‘

source: Type: %s
en@shaw: ğ‘‘ğ‘²ğ‘: %s

source: List Type: %s
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘‘ğ‘²ğ‘: %s

source: Car Type: %s
en@shaw: Car ğ‘‘ğ‘²ğ‘: %s

source: Cdr Type: %s
en@shaw: Cdr ğ‘‘ğ‘²ğ‘: %s

source: Default Value: %s
en@shaw: ğ‘›ğ‘¦ğ‘“ğ‘·ğ‘¤ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿: %s

source: Unset
en@shaw: ğ‘©ğ‘¯ğ‘•ğ‘§ğ‘‘

source: Owner: %s
en@shaw: ğ‘´ğ‘¯ğ‘¼: %s

source: Short Desc: %s
en@shaw: ğ‘–ğ‘¹ğ‘‘ ğ‘›ğ‘§ğ‘•ğ‘’: %s

source: Long Desc: %s
en@shaw: ğ‘¤ğ‘ªğ‘™ ğ‘›ğ‘§ğ‘•ğ‘’: %s

source: No value set for `%s'
en@shaw: ğ‘¯ğ‘´ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘•ğ‘§ğ‘‘ ğ‘“ğ‘¹ `%s'

source: Failed to get value for `%s': %s
en@shaw: ğ‘“ğ‘±ğ‘¤ğ‘› ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¹ `%s': %s

source: Don't understand type `%s'
en@shaw: ğ‘›ğ‘´ğ‘¯ğ‘‘ ğ‘³ğ‘¯ğ‘›ğ‘¼ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘› ğ‘‘ğ‘²ğ‘ `%s'

source: Must specify alternating keys/values as arguments
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘ªğ‘¤ğ‘‘ğ‘»ğ‘¯ğ‘±ğ‘‘ğ‘¦ğ‘™ ğ‘’ğ‘°ğ‘Ÿ/ğ‘ğ‘¨ğ‘¤ğ‘¿ğ‘Ÿ ğ‘¨ğ‘Ÿ ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘•

source: No value to set for key: `%s'
en@shaw: ğ‘¯ğ‘´ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘‘ ğ‘•ğ‘§ğ‘‘ ğ‘“ğ‘¹ ğ‘’ğ‘°: `%s'

source: Cannot set schema as value
en@shaw: ğ‘’ğ‘¨ğ‘¯ğ‘ªğ‘‘ ğ‘•ğ‘§ğ‘‘ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¨ğ‘Ÿ ğ‘ğ‘¨ğ‘¤ğ‘¿

source: When setting a list you must specify a primitive list-type
en@shaw: ğ‘¢ğ‘§ğ‘¯ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘© ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¿ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘ğ‘®ğ‘¦ğ‘¥ğ‘¦ğ‘‘ğ‘¦ğ‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘-ğ‘‘ğ‘²ğ‘

source: When setting a pair you must specify a primitive car-type and cdr-type
en@shaw: ğ‘¢ğ‘§ğ‘¯ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘© ğ‘ğ‘º ğ‘¿ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘ğ‘®ğ‘¦ğ‘¥ğ‘¦ğ‘‘ğ‘¦ğ‘ car-ğ‘‘ğ‘²ğ‘ ğ‘¯ cdr-ğ‘‘ğ‘²ğ‘

source: Error: %s
en@shaw: ğ‘»ğ‘¼: %s

source: Error setting value: %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘ğ‘¨ğ‘¤ğ‘¿: %s

source: Error syncing: %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘¦ğ‘™ğ‘’ğ‘¦ğ‘™: %s

source: Must specify one or more keys as arguments
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘¢ğ‘³ğ‘¯ ğ‘¹ ğ‘¥ğ‘¹ ğ‘’ğ‘°ğ‘Ÿ ğ‘¨ğ‘Ÿ ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ğ‘•

source: No value found for key %s
en@shaw: ğ‘¯ğ‘´ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘“ğ‘¬ğ‘¯ğ‘› ğ‘“ğ‘¹ ğ‘’ğ‘° %s

source: Not a boolean value: %s
en@shaw: ğ‘¯ğ‘ªğ‘‘ ğ‘© ğ‘šğ‘µğ‘¤ğ‘°ğ‘©ğ‘¯ ğ‘ğ‘¨ğ‘¤ğ‘¿: %s

source: Must specify a key or keys to get type
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘° ğ‘¹ ğ‘’ğ‘°ğ‘Ÿ ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘‘ğ‘²ğ‘

source: Must specify a key to lookup size of.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘° ğ‘‘ ğ‘¤ğ‘«ğ‘’ğ‘©ğ‘ ğ‘•ğ‘²ğ‘Ÿ ğ‘.

source: Key %s is not a list.
en@shaw: ğ‘’ğ‘° %s ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘© ğ‘¤ğ‘¦ğ‘•ğ‘‘.

source: Must specify a key from which to get list element.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘° ğ‘“ğ‘®ğ‘ªğ‘¥ ğ‘¢ğ‘¦ğ‘— ğ‘‘ ğ‘œğ‘§ğ‘‘ ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘§ğ‘¤ğ‘©ğ‘¥ğ‘©ğ‘¯ğ‘‘.

source: Must specify list index.
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘•.

source: List index must be non-negative.
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘• ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° ğ‘¯ğ‘ªğ‘¯-ğ‘¯ğ‘§ğ‘œğ‘©ğ‘‘ğ‘¦ğ‘.

source: List index is out of bounds.
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘• ğ‘¦ğ‘Ÿ ğ‘¬ğ‘‘ ğ‘ ğ‘šğ‘¬ğ‘¯ğ‘›ğ‘Ÿ.

source: Must specify a key or keys on the command line
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘’ğ‘° ğ‘¹ ğ‘’ğ‘°ğ‘Ÿ ğ‘ªğ‘¯ ğ‘ ğ‘’ğ‘©ğ‘¥ğ‘­ğ‘¯ğ‘› ğ‘¤ğ‘²ğ‘¯

source: No schema known for `%s'
en@shaw: ğ‘¯ğ‘´ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘´ğ‘¯ ğ‘“ğ‘¹ `%s'

source: No doc string stored in schema at '%s'
en@shaw: ğ‘¯ğ‘´ ğ‘›ğ‘ªğ‘’ ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™ ğ‘•ğ‘‘ğ‘¹ğ‘› ğ‘¦ğ‘¯ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¨ğ‘‘ '%s'

source: Error getting schema at '%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘œğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¨ğ‘‘ '%s': %s

source: No schema stored at '%s'
en@shaw: ğ‘¯ğ‘´ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘•ğ‘‘ğ‘¹ğ‘› ğ‘¨ğ‘‘ '%s'

source: Value at '%s' is not a schema
en@shaw: ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘¨ğ‘‘ '%s' ğ‘¦ğ‘Ÿ ğ‘¯ğ‘ªğ‘‘ ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘©

source: Must specify a schema name followed by the key name to apply it to
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘© ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘±ğ‘¥ ğ‘“ğ‘ªğ‘¤ğ‘´ğ‘› ğ‘šğ‘² ğ‘ ğ‘’ğ‘° ğ‘¯ğ‘±ğ‘¥ ğ‘‘ ğ‘©ğ‘ğ‘¤ğ‘² ğ‘¦ğ‘‘ ğ‘‘

source: Error associating schema name '%s' with key name '%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘©ğ‘•ğ‘´ğ‘–ğ‘¦ğ‘±ğ‘‘ğ‘¦ğ‘™ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘±ğ‘¥ '%s' ğ‘¢ğ‘¦ğ‘ ğ‘’ğ‘° ğ‘¯ğ‘±ğ‘¥ '%s': %s

source: Must specify keys to unapply schema from
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘’ğ‘°ğ‘Ÿ ğ‘‘ ğ‘³ğ‘¯ğ‘©ğ‘ğ‘¤ğ‘¦ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘“ğ‘®ğ‘ªğ‘¥

source: Error removing schema name from '%s': %s
en@shaw: ğ‘»ğ‘¼ ğ‘®ğ‘¦ğ‘¥ğ‘µğ‘ğ‘¦ğ‘™ ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘±ğ‘¥ ğ‘“ğ‘®ğ‘ªğ‘¥ '%s': %s

source: Must specify key (schema name) as the only argument
en@shaw: ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘² ğ‘’ğ‘° (ğ‘•ğ‘’ğ‘°ğ‘¥ğ‘© ğ‘¯ğ‘±ğ‘¥) ğ‘¨ğ‘Ÿ ğ‘ ğ‘´ğ‘¯ğ‘¤ğ‘¦ ğ‘¸ğ‘œğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘

source: List type must be a primitive type: string, int, float or bool
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘‘ğ‘²ğ‘ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° ğ‘© ğ‘ğ‘®ğ‘¦ğ‘¥ğ‘¦ğ‘‘ğ‘¦ğ‘ ğ‘‘ğ‘²ğ‘: ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™, ğ‘¦ğ‘¯ğ‘‘, ğ‘“ğ‘¤ğ‘´ğ‘‘ ğ‘¹ ğ‘šğ‘µğ‘¤

source: Pair car type must be a primitive type: string, int, float or bool
en@shaw: ğ‘ğ‘º car ğ‘‘ğ‘²ğ‘ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° ğ‘© ğ‘ğ‘®ğ‘¦ğ‘¥ğ‘¦ğ‘‘ğ‘¦ğ‘ ğ‘‘ğ‘²ğ‘: ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™, ğ‘¦ğ‘¯ğ‘‘, ğ‘“ğ‘¤ğ‘´ğ‘‘ ğ‘¹ ğ‘šğ‘µğ‘¤

source: Pair cdr type must be a primitive type: string, int, float or bool
en@shaw: ğ‘ğ‘º cdr ğ‘‘ğ‘²ğ‘ ğ‘¥ğ‘³ğ‘•ğ‘‘ ğ‘šğ‘° ğ‘© ğ‘ğ‘®ğ‘¦ğ‘¥ğ‘¦ğ‘‘ğ‘¦ğ‘ ğ‘‘ğ‘²ğ‘: ğ‘•ğ‘‘ğ‘®ğ‘¦ğ‘™, ğ‘¦ğ‘¯ğ‘‘, ğ‘“ğ‘¤ğ‘´ğ‘‘ ğ‘¹ ğ‘šğ‘µğ‘¤

source: Error setting value: %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘§ğ‘‘ğ‘¦ğ‘™ ğ‘ğ‘¨ğ‘¤ğ‘¿: %s

source: Error syncing: %s
en@shaw: ğ‘»ğ‘¼ ğ‘•ğ‘¦ğ‘™ğ‘’ğ‘¦ğ‘™: %s
