<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on June, 20 2016 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima 5.29.1 Manual: 6. Expressions</title>

<meta name="description" content="Maxima 5.29.1 Manual: 6. Expressions">
<meta name="keywords" content="Maxima 5.29.1 Manual: 6. Expressions">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="en" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Expressions"></a>
<a name="SEC29"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_5.html#SEC28" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC30" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_5.html#SEC11" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC35" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 6. Expressions </h1>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC30">6.1 Introduction to Expressions</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC31">6.2 Nouns and Verbs</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC32">6.3 Identifiers</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC33">6.4 Inequality</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC34">6.5 Functions and Variables for Expressions</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<p><a name="Item_003a-Introduction-to-Expressions"></a>
</p><hr size="6">
<a name="Introduction-to-Expressions"></a>
<a name="SEC30"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC29" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC31" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC29" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC29" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC35" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.1 Introduction to Expressions </h2>

<p>There are a number of reserved words which should not be used as variable names.
Their use would cause a possibly cryptic syntax error.
</p>
<pre class="example">integrate            next           from                 diff            
in                   at             limit                sum             
for                  and            elseif               then            
else                 do             or                   if              
unless               product        while                thru            
step                                                                     
</pre>
<p>Most things in Maxima are expressions.  A sequence of expressions
can be made into an expression by separating them by commas and
putting parentheses around them.  This is similar to the <b>C</b>
<i>comma expression</i>.
</p>
<pre class="example">(%i1) x: 3$
(%i2) (x: x+1, x: x^2);
(%o2)                          16
(%i3) (if (x &gt; 17) then 2 else 4);
(%o3)                           4
(%i4) (if (x &gt; 17) then x: 2 else y: 4, y+x);
(%o4)                          20
</pre>
<p>Even loops in Maxima are expressions, although the value they
return is the not too useful <code>done</code>.
</p>
<pre class="example">(%i1) y: (x: 1, for i from 1 thru 10 do (x: x*i))$
(%i2) y;
(%o2)                         done
</pre>
<p>Whereas what you really want is probably to include a third
term in the <i>comma expression</i> which actually gives back the value.
</p>
<pre class="example">(%i3) y: (x: 1, for i from 1 thru 10 do (x: x*i), x)$
(%i4) y;
(%o4)                        3628800
</pre>
<p><a name="Item_003a-Nouns-and-Verbs"></a>
</p><hr size="6">
<a name="Nouns-and-Verbs"></a>
<a name="SEC31"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC30" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC32" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC29" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC29" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC35" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.2 Nouns and Verbs </h2>

<p>Maxima distinguishes between operators which are &quot;nouns&quot; and operators which are
&quot;verbs&quot;.  A verb is an operator which can be executed.  A noun is an operator
which appears as a symbol in an expression, without being executed.  By default,
function names are verbs.  A verb can be changed into a noun by quoting the
function name or applying the <code><a href="#nounify">nounify</a></code>
 function.  A noun can be changed
into a verb by applying the <code><a href="#verbify">verbify</a></code>
 function.  The evaluation flag
<code><a href="maxima_8.html#nouns">nouns</a></code>
 causes <code><a href="maxima_8.html#ev">ev</a></code>
 to evaluate nouns in an expression.
</p>
<p>The verb form is distinguished by a leading dollar sign <code>$</code> on the
corresponding Lisp symbol.  In contrast, the noun form is distinguished by a
leading percent sign <code>%</code> on the corresponding Lisp symbol.  Some nouns have
special display properties, such as <code>'integrate</code> and <code>'derivative</code>
(returned by <code><a href="maxima_18.html#diff">diff</a></code>
), but most do not.  By default, the noun and verb forms
of a function are identical when displayed.  The global flag <code><a href="#noundisp">noundisp</a></code>

causes Maxima to display nouns with a leading quote mark <code>'</code>.
</p>
<p>See also <code><a href="#noun">noun</a></code>,
 <code><a href="maxima_8.html#nouns">nouns</a></code>,
 <code><a href="#nounify">nounify</a></code>,
 and
<code><a href="#verbify">verbify</a></code>.
</p>

<p>Examples:
</p>
<pre class="example">(%i1) foo (x) := x^2;
                                     2
(%o1)                     foo(x) := x
(%i2) foo (42);
(%o2)                         1764
(%i3) 'foo (42);
(%o3)                        foo(42)
(%i4) 'foo (42), nouns;
(%o4)                         1764
(%i5) declare (bar, noun);
(%o5)                         done
(%i6) bar (x) := x/17;
                                     x
(%o6)                    ''bar(x) := --
                                     17
(%i7) bar (52);
(%o7)                        bar(52)
(%i8) bar (52), nouns;
                               52
(%o8)                          --
                               17
(%i9) integrate (1/x, x, 1, 42);
(%o9)                        log(42)
(%i10) 'integrate (1/x, x, 1, 42);
                             42
                            /
                            [   1
(%o10)                      I   - dx
                            ]   x
                            /
                             1
(%i11) ev (%, nouns);
(%o11)                       log(42)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Evaluation">Evaluation</a>
 &middot;
<a href="maxima_99.html#Category_003a-Nouns-and-verbs">Nouns and verbs</a>
</p>
</div>


<p><a name="Item_003a-Identifiers"></a>
</p><hr size="6">
<a name="Identifiers"></a>
<a name="SEC32"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC31" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC33" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC29" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC29" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC35" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.3 Identifiers </h2>

<p>Maxima identifiers may comprise alphabetic characters, plus the numerals 0
through 9, plus any special character preceded by the backslash <code>\</code>
character.
</p>
<p>A numeral may be the first character of an identifier if it is preceded by a
backslash.  Numerals which are the second or later characters need not be
preceded by a backslash.
</p>
<p>Characters may be declared alphabetic by the <code>declare</code> function.
If so declared, they need not be preceded by a backslash in an identifier.
The alphabetic characters are initially <code>A</code> through <code>Z</code>, <code>a</code>
through <code>z</code>, <code>%</code>, and <code>_</code>.
</p>
<p>Maxima is case-sensitive.  The identifiers <code>foo</code>, <code>FOO</code>, and
<code>Foo</code> are distinct.  See <a href="maxima_37.html#SEC198">Lisp and Maxima</a> for more on this point.
</p>
<p>A Maxima identifier is a Lisp symbol which begins with a dollar sign <code>$</code>.
Any other Lisp symbol is preceded by a question mark <code>?</code> when it appears
in Maxima.  See <a href="maxima_37.html#SEC198">Lisp and Maxima</a> for more on this point.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) %an_ordinary_identifier42;
(%o1)               %an_ordinary_identifier42
(%i2) embedded\ spaces\ in\ an\ identifier;
(%o2)           embedded spaces in an identifier
(%i3) symbolp (%);
(%o3)                         true
(%i4) [foo+bar, foo\+bar];
(%o4)                 [foo + bar, foo+bar]
(%i5) [1729, \1729];
(%o5)                     [1729, 1729]
(%i6) [symbolp (foo\+bar), symbolp (\1729)];
(%o6)                     [true, true]
(%i7) [is (foo\+bar = foo+bar), is (\1729 = 1729)];
(%o7)                    [false, false]
(%i8) baz\~quux;
(%o8)                       baz~quux
(%i9) declare (&quot;~&quot;, alphabetic);
(%o9)                         done
(%i10) baz~quux;
(%o10)                      baz~quux
(%i11) [is (foo = FOO), is (FOO = Foo), is (Foo = foo)];
(%o11)                [false, false, false]
(%i12) :lisp (defvar *my-lisp-variable* '$foo)
*MY-LISP-VARIABLE*
(%i12) ?\*my\-lisp\-variable\*;
(%o12)                         foo
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Syntax">Syntax</a>
</p>
</div>


<p><a name="Item_003a-Inequality"></a>
</p><hr size="6">
<a name="Inequality"></a>
<a name="SEC33"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC32" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC34" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC29" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC29" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC35" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.4 Inequality </h2>

<p>Maxima has the inequality operators <code>&lt;</code>, <code>&lt;=</code>, <code>&gt;=</code>, <code>&gt;</code>,
<code>#</code>, and <code>notequal</code>.  See <code>if</code> for a description of conditional
expressions.
</p>
<p><a name="Item_003a-Functions-and-Variables-for-Expressions"></a>
</p><hr size="6">
<a name="Functions-and-Variables-for-Expressions"></a>
<a name="SEC34"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC33" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC35" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC29" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC29" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC35" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 6.5 Functions and Variables for Expressions </h2>


<p><a name="alias"></a>
<a name="Item_003a-alias"></a>
</p><dl>
<dt><u>Function:</u> <b>alias</b><i> (<var>new_name_1</var>, <var>old_name_1</var>, &hellip;, <var>new_name_n</var>, <var>old_name_n</var>)</i>
<a name="IDX185"></a>
</dt>
<dd><p>provides an alternate name for a (user or system) function, variable, array,
etc.  Any even number of arguments may be used.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
</p>
</div>

</dd></dl>

<p><a name="aliases"></a>
<a name="Item_003a-aliases"></a>
</p><dl>
<dt><u>System variable:</u> <b>aliases</b>
<a name="IDX186"></a>
</dt>
<dd><p>Default value: <code>[]</code>
</p>
<p><code>aliases</code> is the list of atoms which have a user defined alias (set up by
the <code><a href="#alias">alias</a></code>,
 <code><a href="#ordergreat">ordergreat</a></code>,
 <code><a href="#orderless">orderless</a></code>
 functions or by
declaring the atom a <code><a href="#noun">noun</a></code>
 with <code><a href="maxima_11.html#declare">declare</a></code>.
)
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
 &middot;
<a href="maxima_99.html#Category_003a-Global-variables">Global variables</a>
</p>
</div>

</dd></dl>


<p><a name="allbut"></a>
<a name="Item_003a-allbut"></a>
</p><dl>
<dt><u>Keyword:</u> <b>allbut</b>
<a name="IDX187"></a>
</dt>
<dd><p>works with the <code>part</code> commands (i.e.  <code><a href="#part">part</a></code>,

<code><a href="#inpart">inpart</a></code>,
 <code><a href="#substpart">substpart</a></code>,
 <code><a href="#substinpart">substinpart</a></code>,

<code><a href="#dpart">dpart</a></code>,
 and <code><a href="#lpart">lpart</a></code>
).
For example,
</p>
<pre class="example">(%i1) expr : e + d + c + b + a;
(%o1)                   e + d + c + b + a
(%i2) part (expr, [2, 5]);
(%o2)                         d + a
</pre>
<p>while
</p>
<pre class="example">(%i1) expr : e + d + c + b + a;
(%o1)                   e + d + c + b + a
(%i2) part (expr, allbut (2, 5));
(%o2)                       e + c + b
</pre>
<p><code>allbut</code> is also recognized by <code><a href="maxima_4.html#kill">kill</a></code>.
</p>

<pre class="example">(%i1) [aa : 11, bb : 22, cc : 33, dd : 44, ee : 55];
(%o1)                 [11, 22, 33, 44, 55]
(%i2) kill (allbut (cc, dd));
(%o0)                         done
(%i1) [aa, bb, cc, dd];
(%o1)                   [aa, bb, 33, 44]
</pre>
<p><code>kill(allbut(<var>a_1</var>, <var>a_2</var>, ...))</code> has the effect of
<code>kill(all)</code> except that it does not kill the symbols <var>a_1</var>, <var>a_2</var>,
&hellip;
</p></dd></dl>

<p><a name="args"></a>
<a name="Item_003a-args"></a>
</p><dl>
<dt><u>Function:</u> <b>args</b><i> (<var>expr</var>)</i>
<a name="IDX188"></a>
</dt>
<dd><p>Returns the list of arguments of <code>expr</code>, which may be any kind of
expression other than an atom.  Only the arguments of the top-level operator
are extracted; subexpressions of <code>expr</code> appear as elements or
subexpressions of elements of the list of arguments.
</p>
<p>The order of the items in the list may depend on the global flag
<code><a href="#inflag">inflag</a></code>.
</p>

<p><code>args (<var>expr</var>)</code> is equivalent to <code>substpart (&quot;[&quot;, <var>expr</var>, 0)</code>.
See also <code><a href="#substpart">substpart</a></code>,
 and <code><a href="#op">op</a></code>.
</p>

<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="atom"></a>
<a name="Item_003a-atom"></a>
</p><dl>
<dt><u>Function:</u> <b>atom</b><i> (<var>expr</var>)</i>
<a name="IDX189"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>expr</var> is atomic (i.e. a number, name or string) else
<code>false</code>.  Thus <code>atom(5)</code> is <code>true</code> while <code>atom(a[1])</code> and
<code>atom(sin(x))</code> are <code>false</code> (assuming <code>a[1]</code> and <code>x</code> are
unbound).
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
 &middot;
<a href="maxima_99.html#Category_003a-Predicate-functions">Predicate functions</a>
</p>
</div>

</dd></dl>

<p><a name="box"></a>
<a name="Item_003a-box"></a>
</p><dl>
<dt><u>Function:</u> <b>box</b><i> (<var>expr</var>)</i>
<a name="IDX190"></a>
</dt>
<dt><u>Function:</u> <b>box</b><i> (<var>expr</var>, <var>a</var>)</i>
<a name="IDX191"></a>
</dt>
<dd><p>Returns <var>expr</var> enclosed in a box.  The return value is an expression with
<code>box</code> as the operator and <var>expr</var> as the argument.  A box is drawn on
the display when <code>display2d</code> is <code>true</code>.
</p>
<p><code>box (<var>expr</var>, <var>a</var>)</code> encloses <var>expr</var> in a box labelled by the
symbol <var>a</var>.  The label is truncated if it is longer than the width of the
box.
</p>
<p><code>box</code> evaluates its argument.  However, a boxed expression does not
evaluate to its content, so boxed expressions are effectively excluded from
computations.
</p>
<p><code><a href="#boxchar">boxchar</a></code>
 is the character used to draw the box in <code>box</code> and in the
<code><a href="#dpart">dpart</a></code>
 and <code><a href="#lpart">lpart</a></code>
 functions.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) box (a^2 + b^2);
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                            &quot; 2    2&quot;
(%o1)                       &quot;b  + a &quot;
                            &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i2) a : 1234;
(%o2)                         1234
(%i3) b : c - d;
(%o3)                         c - d
(%i4) box (a^2 + b^2);
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o4)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) box (a^2 + b^2, term_1);
                      term_1&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                      &quot;       2          &quot;
(%o5)                 &quot;(c - d)  + 1522756&quot;
                      &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) 1729 - box (1729);
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%o6)                     1729 - &quot;1729&quot;
                                 &quot;&quot;&quot;&quot;&quot;&quot;
(%i7) boxchar: &quot;-&quot;;
(%o7)                           -
(%i8) box (sin(x) + cos(y));
                        -----------------
(%o8)                   -cos(y) + sin(x)-
                        -----------------
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="boxchar"></a>
<a name="Item_003a-boxchar"></a>
</p><dl>
<dt><u>Option variable:</u> <b>boxchar</b>
<a name="IDX192"></a>
</dt>
<dd><p>Default value: <code>&quot;</code>
</p>
<p><code>boxchar</code> is the character used to draw the box in the <code><a href="#box">box</a></code>

and in the <code><a href="#dpart">dpart</a></code>
 and <code><a href="#lpart">lpart</a></code>
 functions.
</p>
<p>All boxes in an expression are drawn with the current value of <code>boxchar</code>;
the drawing character is not stored with the box expression.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="collapse"></a>
<a name="Item_003a-collapse"></a>
</p><dl>
<dt><u>Function:</u> <b>collapse</b><i> (<var>expr</var>)</i>
<a name="IDX193"></a>
</dt>
<dd><p>Collapses <var>expr</var> by causing all of its common (i.e., equal) subexpressions
to share (i.e., use the same cells), thereby saving space.  (<code>collapse</code> is
a subroutine used by the <code><a href="#optimize">optimize</a></code>
 command.)  Thus, calling
<code>collapse</code> may be useful after loading in a <code><a href="maxima_13.html#save">save</a></code>
 file.  You can
collapse several expressions together by using
<code>collapse ([<var>expr_1</var>, ..., <var>expr_n</var>])</code>.  Similarly, you can
collapse the elements of the array <code>A</code> by doing
<code>collapse (listarray ('A))</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="disolate"></a>
<a name="Item_003a-disolate"></a>
</p><dl>
<dt><u>Function:</u> <b>disolate</b><i> (<var>expr</var>, <var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX194"></a>
</dt>
<dd><p>is similar to <code>isolate (<var>expr</var>, <var>x</var>)</code> except that it enables the
user to isolate more than one variable simultaneously.  This might be useful,
for example, if one were attempting to change variables in a multiple
integration, and that variable change involved two or more of the integration
variables.  This function is autoloaded from <tt>`simplification/disol.mac'</tt>.
A demo is available by <code>demo(&quot;disol&quot;)$</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="dispform"></a>
<a name="Item_003a-dispform"></a>
</p><dl>
<dt><u>Function:</u> <b>dispform</b><i> (<var>expr</var>)</i>
<a name="IDX195"></a>
</dt>
<dt><u>Function:</u> <b>dispform</b><i> (<var>expr</var>, all)</i>
<a name="IDX196"></a>
</dt>
<dd><p>Returns the external representation of <var>expr</var>.
</p>
<p><code>dispform(<var>expr</var>)</code> returns the external representation with respect to
the main (top-level) operator.  <code>dispform(<var>expr</var>, all)</code> returns the
external representation with respect to all operators in <var>expr</var>.
</p>
<p>See also <code><a href="#part">part</a></code>,
 <code><a href="#inpart">inpart</a></code>,
 and <code><a href="#inflag">inflag</a></code>.
</p>

<p>Examples:
</p>
<p>The internal representation of <code>- x</code> is &quot;negative one times <code>x</code>&quot;
while the external representation is &quot;minus <code>x</code>&quot;.
</p>
<pre class="example">(%i1) - x;
(%o1)                          - x
(%i2) ?format (true, &quot;~S~%&quot;, %);
((MTIMES SIMP) -1 $X)
(%o2)                         false
(%i3) dispform (- x);
(%o3)                          - x
(%i4) ?format (true, &quot;~S~%&quot;, %);
((MMINUS SIMP) $X)
(%o4)                         false
</pre>
<p>The internal representation of <code>sqrt(x)</code> is &quot;<code>x</code> to the power 1/2&quot;
while the external representation is &quot;square root of <code>x</code>&quot;.
</p>
<pre class="example">(%i1) sqrt (x);
(%o1)                        sqrt(x)
(%i2) ?format (true, &quot;~S~%&quot;, %);
((MEXPT SIMP) $X ((RAT SIMP) 1 2))
(%o2)                         false
(%i3) dispform (sqrt (x));
(%o3)                        sqrt(x)
(%i4) ?format (true, &quot;~S~%&quot;, %);
((%SQRT SIMP) $X)
(%o4)                         false
</pre>
<p>Use of the optional argument <code>all</code>.
</p>
<pre class="example">(%i1) expr : sin (sqrt (x));
(%o1)                     sin(sqrt(x))
(%i2) freeof (sqrt, expr);
(%o2)                         true
(%i3) freeof (sqrt, dispform (expr));
(%o3)                         true
(%i4) freeof (sqrt, dispform (expr, all));
(%o4)                         false
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="dpart"></a>
<a name="Item_003a-dpart"></a>
</p><dl>
<dt><u>Function:</u> <b>dpart</b><i> (<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX197"></a>
</dt>
<dd><p>Selects the same subexpression as <code><a href="#part">part</a></code>,
 but instead of just returning
that subexpression as its value, it returns the whole expression with the
selected subexpression displayed inside a box.  The box is actually part of the
expression.
</p>
<pre class="example">(%i1) dpart (x+y/z^2, 1, 2, 1);
                             y
(%o1)                       ---- + x
                               2
                            &quot;&quot;&quot;
                            &quot;z&quot;
                            &quot;&quot;&quot;
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="exptisolate"></a>
<a name="Item_003a-exptisolate"></a>
</p><dl>
<dt><u>Option variable:</u> <b>exptisolate</b>
<a name="IDX198"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p><code>exptisolate</code>, when <code>true</code>, causes <code>isolate (expr, var)</code> to
examine exponents of atoms (such as <code>%e</code>) which contain <code>var</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="exptsubst"></a>
<a name="Item_003a-exptsubst"></a>
</p><dl>
<dt><u>Option variable:</u> <b>exptsubst</b>
<a name="IDX199"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p><code>exptsubst</code>, when <code>true</code>, permits substitutions such as <code>y</code>
for <code>%e^x</code> in <code>%e^(a x)</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Exponential-and-logarithm-functions">Exponential and logarithm functions</a>
 &middot;
<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="freeof"></a>
<a name="Item_003a-freeof"></a>
</p><dl>
<dt><u>Function:</u> <b>freeof</b><i> (<var>x_1</var>, &hellip;, <var>x_n</var>, <var>expr</var>)</i>
<a name="IDX200"></a>
</dt>
<dd><p><code>freeof (<var>x_1</var>, <var>expr</var>)</code> returns <code>true</code> if no subexpression of
<var>expr</var> is equal to <var>x_1</var> or if <var>x_1</var> occurs only as a dummy variable
in <var>expr</var>, or if <var>x_1</var> is neither the noun nor verb form of any operator
in <var>expr</var>, and returns <code>false</code> otherwise.
</p>
<p><code>freeof (<var>x_1</var>, ..., <var>x_n</var>, <var>expr</var>)</code> is equivalent to 
<code>freeof (<var>x_1</var>, <var>expr</var>) and ... and freeof (<var>x_n</var>,
<var>expr</var>)</code>.
</p>
<p>The arguments <var>x_1</var>, &hellip;, <var>x_n</var> may be names of functions and
variables, subscripted names, operators (enclosed in double quotes), or general
expressions.  <code>freeof</code> evaluates its arguments.
</p>
<p><code>freeof</code> operates only on <var>expr</var> as it stands (after simplification and
evaluation) and does not attempt to determine if some equivalent expression 
would give a different result.  In particular, simplification may yield an
equivalent but different expression which comprises some different elements than
the original form of <var>expr</var>.
</p>
<p>A variable is a dummy variable in an expression if it has no binding outside of 
the expression.  Dummy variables recognized by <code>freeof</code> are the index of a 
sum or product, the limit variable in <code><a href="maxima_17.html#limit">limit</a></code>,
 the integration variable
in the definite integral form of <code><a href="maxima_19.html#integrate">integrate</a></code>
, the original variable in
<code><a href="maxima_18.html#laplace">laplace</a></code>,
 formal variables in <code><a href="maxima_18.html#at">at</a></code>
 expressions, and arguments in
<code><a href="maxima_36.html#lambda">lambda</a></code>
 expressions.
</p>
<p>The indefinite form of <code>integrate</code> is <i>not</i> free of its variable of 
integration.
</p>
<p>Examples:
</p>
<p>Arguments are names of functions, variables, subscripted names, operators, and 
expressions.  <code>freeof (a, b, expr)</code> is equivalent to 
<code>freeof (a, expr) and freeof (b, expr)</code>.
</p>
<pre class="example">(%i1) expr: z^3 * cos (a[1]) * b^(c+d);
                                 d + c  3
(%o1)                   cos(a ) b      z
                             1
(%i2) freeof (z, expr);
(%o2)                         false
(%i3) freeof (cos, expr);
(%o3)                         false
(%i4) freeof (a[1], expr);
(%o4)                         false
(%i5) freeof (cos (a[1]), expr);
(%o5)                         false
(%i6) freeof (b^(c+d), expr);
(%o6)                         false
(%i7) freeof (&quot;^&quot;, expr);
(%o7)                         false
(%i8) freeof (w, sin, a[2], sin (a[2]), b*(c+d), expr);
(%o8)                         true
</pre>
<p><code>freeof</code> evaluates its arguments.
</p>
<pre class="example">(%i1) expr: (a+b)^5$
(%i2) c: a$
(%i3) freeof (c, expr);
(%o3)                         false
</pre>
<p><code>freeof</code> does not consider equivalent expressions.
Simplification may yield an equivalent but different expression.
</p>
<pre class="example">(%i1) expr: (a+b)^5$
(%i2) expand (expr);
          5        4       2  3       3  2      4      5
(%o2)    b  + 5 a b  + 10 a  b  + 10 a  b  + 5 a  b + a
(%i3) freeof (a+b, %);
(%o3)                         true
(%i4) freeof (a+b, expr);
(%o4)                         false
(%i5) exp (x);
                                 x
(%o5)                          %e
(%i6) freeof (exp, exp (x));
(%o6)                         true
</pre>
<p>A summation or definite integral is free of its dummy variable.
An indefinite integral is not free of its variable of integration.
</p>
<pre class="example">(%i1) freeof (i, 'sum (f(i), i, 0, n));
(%o1)                         true
(%i2) freeof (x, 'integrate (x^2, x, 0, 1));
(%o2)                         true
(%i3) freeof (x, 'integrate (x^2, x));
(%o3)                         false
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="inflag"></a>
<a name="Item_003a-inflag"></a>
</p><dl>
<dt><u>Option variable:</u> <b>inflag</b>
<a name="IDX201"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>inflag</code> is <code>true</code>, functions for part extraction inspect the
internal form of <code>expr</code>.
</p>
<p>Note that the simplifier re-orders expressions.  Thus <code>first (x + y)</code>
returns <code>x</code> if <code>inflag</code> is <code>true</code> and <code>y</code> if <code>inflag</code>
is <code>false</code>.  (<code>first (y + x)</code> gives the same results.)
</p>
<p>Also, setting <code>inflag</code> to <code>true</code> and calling <code><a href="#part">part</a></code>
 or
<code><a href="#substpart">substpart</a></code>
 is the same as calling <code><a href="#inpart">inpart</a></code>
 or <code><a href="#substinpart">substinpart</a></code>.
</p>

<p>Functions affected by the setting of <code>inflag</code> are: <code><a href="#part">part</a></code>,

<code><a href="#substpart">substpart</a></code>,
 <code><a href="maxima_5.html#first">first</a></code>,
 <code><a href="maxima_5.html#rest">rest</a></code>,
 <code><a href="maxima_5.html#last">last</a></code>,

<code><a href="maxima_5.html#length">length</a></code>,
 the <code><a href="maxima_37.html#for">for</a></code>
 &hellip; <code>in</code> construct,
<code><a href="maxima_37.html#map">map</a></code>,
 <code><a href="maxima_36.html#fullmap">fullmap</a></code>,
 <code><a href="maxima_37.html#maplist">maplist</a></code>,
 <code><a href="#reveal">reveal</a></code>
 and
<code><a href="#pickapart">pickapart</a></code>.
</p>

<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="inpart"></a>
<a name="Item_003a-inpart"></a>
</p><dl>
<dt><u>Function:</u> <b>inpart</b><i> (<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX202"></a>
</dt>
<dd><p>is similar to <code><a href="#part">part</a></code>
 but works on the internal representation of the
expression rather than the displayed form and thus may be faster since no
formatting is done.  Care should be taken with respect to the order of
subexpressions in sums and products (since the order of variables in the
internal form is often different from that in the displayed form) and in dealing
with unary minus, subtraction, and division (since these operators are removed
from the expression).  <code>part (x+y, 0)</code> or <code>inpart (x+y, 0)</code> yield
<code>+</code>, though in order to refer to the operator it must be enclosed in &quot;s.
For example <code>... if inpart (%o9,0) = &quot;+&quot; then ...</code>.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) x + y + w*z;
(%o1)                      w z + y + x
(%i2) inpart (%, 3, 2);
(%o2)                           z
(%i3) part (%th (2), 1, 2);
(%o3)                           z
(%i4) 'limit (f(x)^g(x+1), x, 0, minus);
                                  g(x + 1)
(%o4)                 limit   f(x)
                      x -&gt; 0-
(%i5) inpart (%, 1, 2);
(%o5)                       g(x + 1)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="isolate"></a>
<a name="Item_003a-isolate"></a>
</p><dl>
<dt><u>Function:</u> <b>isolate</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX203"></a>
</dt>
<dd><p>Returns <var>expr</var> with subexpressions which are sums and which do not contain
<var>var</var> replaced by intermediate expression labels (these being atomic symbols
like <code>%t1</code>, <code>%t2</code>, &hellip;).  This is often useful to avoid
unnecessary expansion of subexpressions which don't contain the variable of
interest.  Since the intermediate labels are bound to the subexpressions they
can all be substituted back by evaluating the expression in which they occur.
</p>
<p><code><a href="#exptisolate">exptisolate</a></code>
 (default value: <code>false</code>) if <code>true</code> will cause
<code>isolate</code> to examine exponents of atoms (like <code>%e</code>) which contain
<var>var</var>.
</p>
<p><code>isolate_wrt_times</code> if <code>true</code>, then <code>isolate</code> will also isolate
with respect to products.  See <code><a href="#isolate_005fwrt_005ftimes">isolate_wrt_times</a></code>.
</p>

<p>Do <code>example (isolate)</code> for examples.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="isolate_005fwrt_005ftimes"></a>
<a name="Item_003a-isolate_005fwrt_005ftimes"></a>
</p><dl>
<dt><u>Option variable:</u> <b>isolate_wrt_times</b>
<a name="IDX204"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>isolate_wrt_times</code> is <code>true</code>, <code>isolate</code> will also isolate
with respect to products.  E.g. compare both settings of the switch on
</p>
<pre class="example">(%i1) isolate_wrt_times: true$
(%i2) isolate (expand ((a+b+c)^2), c);

(%t2)                          2 a


(%t3)                          2 b


                          2            2
(%t4)                    b  + 2 a b + a

                     2
(%o4)               c  + %t3 c + %t2 c + %t4
(%i4) isolate_wrt_times: false$
(%i5) isolate (expand ((a+b+c)^2), c);
                     2
(%o5)               c  + 2 b c + 2 a c + %t4
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="listconstvars"></a>
<a name="Item_003a-listconstvars"></a>
</p><dl>
<dt><u>Option variable:</u> <b>listconstvars</b>
<a name="IDX205"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>listconstvars</code> is <code>true</code>, it will cause <code><a href="#listofvars">listofvars</a></code>
 to
include <code>%e</code>, <code>%pi</code>, <code>%i</code>, and any variables declared constant in
the list it returns if they appear in the expression <code>listofvars</code> is called
on.  The default is to omit these.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="listdummyvars"></a>
<a name="Item_003a-listdummyvars"></a>
</p><dl>
<dt><u>Option variable:</u> <b>listdummyvars</b>
<a name="IDX206"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>When <code>listdummyvars</code> is <code>false</code>, &quot;dummy variables&quot; in the expression
will not be included in the list returned by <code><a href="#listofvars">listofvars</a></code>.
  (The meaning
of &quot;dummy variables&quot; is as given in <code><a href="#freeof">freeof</a></code>.
  &quot;Dummy variables&quot; are
mathematical things like the index of a sum or product, the limit variable,
and the definite integration variable.)
</p>
<p>Example:
</p>
<pre class="example">(%i1) listdummyvars: true$
(%i2) listofvars ('sum(f(i), i, 0, n));
(%o2)                        [i, n]
(%i3) listdummyvars: false$
(%i4) listofvars ('sum(f(i), i, 0, n));
(%o4)                          [n]
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="listofvars"></a>
<a name="Item_003a-listofvars"></a>
</p><dl>
<dt><u>Function:</u> <b>listofvars</b><i> (<var>expr</var>)</i>
<a name="IDX207"></a>
</dt>
<dd><p>Returns a list of the variables in <var>expr</var>.
</p>
<p><code><a href="#listconstvars">listconstvars</a></code>
 if <code>true</code> causes <code>listofvars</code> to include 
<code>%e</code>, <code>%pi</code>, <code>%i</code>, and any variables declared constant in the 
list it returns if they appear in <var>expr</var>.  The default is to omit these.
</p>
<p>See also the option variable <code><a href="#listdummyvars">listdummyvars</a></code>
 to exclude or include
&quot;dummy variables&quot; in the list of variables.
</p>
<pre class="example">(%i1) listofvars (f (x[1]+y) / g^(2+a));
(%o1)                     [g, a, x , y]
                                  1
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="lfreeof"></a>
<a name="Item_003a-lfreeof"></a>
</p><dl>
<dt><u>Function:</u> <b>lfreeof</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX208"></a>
</dt>
<dd><p>For each member <var>m</var> of <var>list</var>, calls
<code>freeof (<var>m</var>, <var>expr</var>)</code>.  It returns <code>false</code> if any call to
<code><a href="#freeof">freeof</a></code>
 does and <code>true</code> otherwise.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="lpart"></a>
<a name="Item_003a-lpart"></a>
</p><dl>
<dt><u>Function:</u> <b>lpart</b><i> (<var>label</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX209"></a>
</dt>
<dd><p>is similar to <code><a href="#dpart">dpart</a></code>
 but uses a labelled box.  A labelled box is similar
to the one produced by <code>dpart</code> but it has a name in the top line.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="mainvar"></a>
<a name="Item_003a-mainvar"></a>
</p><dl>
<dt><u>Property:</u> <b>mainvar</b>
<a name="IDX210"></a>
</dt>
<dd><p>You may declare variables to be <code>mainvar</code>.  The ordering scale for atoms is
essentially: numbers &lt; constants (e.g., <code>%e</code>, <code>%pi</code>) &lt; scalars &lt; other
variables &lt; mainvars.  E.g., compare <code>expand ((X+Y)^4)</code> with
<code>(declare (x, mainvar), expand ((x+y)^4))</code>.  (Note: Care should be taken if
you elect to use the above feature.  E.g., if you subtract an expression in
which <code>x</code> is a <code>mainvar</code> from one in which <code>x</code> isn't a
<code>mainvar</code>, resimplification e.g. with <code>ev (expr, simp)</code> may be
necessary if cancellation is to occur.  Also, if you save an expression in which
<code>x</code> is a <code>mainvar</code>, you probably should also save <code>x</code>.)
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Declarations-and-inferences">Declarations and inferences</a>
 &middot;
<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="noun"></a>
<a name="Item_003a-noun"></a>
</p><dl>
<dt><u>Property:</u> <b>noun</b>
<a name="IDX211"></a>
</dt>
<dd><p><code>noun</code> is one of the options of the <code><a href="maxima_11.html#declare">declare</a></code>
 command.  It makes a
function so declared a &quot;noun&quot;, meaning that it won't be evaluated
automatically.
</p>
<p>Example:
</p>
<pre class="example">(%i1) factor (12345678);
                             2
(%o1)                     2 3  47 14593
(%i2) declare (factor, noun);
(%o2)                         done
(%i3) factor (12345678);
(%o3)                   factor(12345678)
(%i4) ''%, nouns;
                             2
(%o4)                     2 3  47 14593
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Nouns-and-verbs">Nouns and verbs</a>
</p>
</div>

</dd></dl>


<p><a name="noundisp"></a>
<a name="Item_003a-noundisp"></a>
</p><dl>
<dt><u>Option variable:</u> <b>noundisp</b>
<a name="IDX212"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>noundisp</code> is <code>true</code>, nouns display with
a single quote.  This switch is always <code>true</code> when displaying function
definitions.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Display-flags-and-variables">Display flags and variables</a>
 &middot;
<a href="maxima_99.html#Category_003a-Nouns-and-verbs">Nouns and verbs</a>
</p>
</div>

</dd></dl>


<p><a name="nounify"></a>
<a name="Item_003a-nounify"></a>
</p><dl>
<dt><u>Function:</u> <b>nounify</b><i> (<var>f</var>)</i>
<a name="IDX213"></a>
</dt>
<dd><p>Returns the noun form of the function name <var>f</var>.  This is
needed if one wishes to refer to the name of a verb function as if it
were a noun.  Note that some verb functions will return their noun
forms if they can't be evaluated for certain arguments.  This is also
the form returned if a function call is preceded by a quote.
</p>
<p>See also <code><a href="#verbify">verbify</a></code>.
</p>

<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Nouns-and-verbs">Nouns and verbs</a>
</p>
</div>

</dd></dl>


<p><a name="nterms"></a>
<a name="Item_003a-nterms"></a>
</p><dl>
<dt><u>Function:</u> <b>nterms</b><i> (<var>expr</var>)</i>
<a name="IDX214"></a>
</dt>
<dd><p>Returns the number of terms that <var>expr</var> would have if it were fully
expanded out and no cancellations or combination of terms occurred.
Note that expressions like <code>sin (<var>expr</var>)</code>, <code>sqrt (<var>expr</var>)</code>,
<code>exp (<var>expr</var>)</code>, etc. count as just one term regardless of how many
terms <var>expr</var> has (if it is a sum).
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="op"></a>
<a name="Item_003a-op"></a>
</p><dl>
<dt><u>Function:</u> <b>op</b><i> (<var>expr</var>)</i>
<a name="IDX215"></a>
</dt>
<dd><p>Returns the main operator of the expression <var>expr</var>.
<code>op (<var>expr</var>)</code> is equivalent to <code>part (<var>expr</var>, 0)</code>.
</p>
<p><code>op</code> returns a string if the main operator is a built-in or user-defined
prefix, binary or n-ary infix, postfix, matchfix, or nofix operator.
Otherwise, if <var>expr</var> is a subscripted function expression, <code>op</code>
returns the subscripted function; in this case the return value is not an atom.
Otherwise, <var>expr</var> is an array function or ordinary function expression,
and <code>op</code> returns a symbol.
</p>
<p><code>op</code> observes the value of the global flag <code><a href="#inflag">inflag</a></code>.
</p>

<p><code>op</code> evaluates it argument.
</p>
<p>See also <code><a href="#args">args</a></code>.
</p>

<p>Examples:
</p>
<pre class="example">(%i1) stringdisp: true$
(%i2) op (a * b * c);
(%o2)                          &quot;*&quot;
(%i3) op (a * b + c);
(%o3)                          &quot;+&quot;
(%i4) op ('sin (a + b));
(%o4)                          sin
(%i5) op (a!);
(%o5)                          &quot;!&quot;
(%i6) op (-a);
(%o6)                          &quot;-&quot;
(%i7) op ([a, b, c]);
(%o7)                          &quot;[&quot;
(%i8) op ('(if a &gt; b then c else d));
(%o8)                         &quot;if&quot;
(%i9) op ('foo (a));
(%o9)                          foo
(%i10) prefix (foo);
(%o10)                        &quot;foo&quot;
(%i11) op (foo a);
(%o11)                        &quot;foo&quot;
(%i12) op (F [x, y] (a, b, c));
(%o12)                        F
                               x, y
(%i13) op (G [u, v, w]);
(%o13)                          G
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
 &middot;
<a href="maxima_99.html#Category_003a-Operators">Operators</a>
</p>
</div>

</dd></dl>


<p><a name="operatorp"></a>
<a name="Item_003a-operatorp"></a>
</p><dl>
<dt><u>Function:</u> <b>operatorp</b><i> (<var>expr</var>, <var>op</var>)</i>
<a name="IDX216"></a>
</dt>
<dt><u>Function:</u> <b>operatorp</b><i> (<var>expr</var>, [<var>op_1</var>, &hellip;, <var>op_n</var>])</i>
<a name="IDX217"></a>
</dt>
<dd><p><code>operatorp (<var>expr</var>, <var>op</var>)</code> returns <code>true</code>
if <var>op</var> is equal to the operator of <var>expr</var>.
</p>
<p><code>operatorp (<var>expr</var>, [<var>op_1</var>, ..., <var>op_n</var>])</code> returns
<code>true</code> if some element <var>op_1</var>, &hellip;, <var>op_n</var> is equal to the
operator of <var>expr</var>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Operators">Operators</a>
 &middot;
<a href="maxima_99.html#Category_003a-Predicate-functions">Predicate functions</a>
</p>
</div>

</dd></dl>


<p><a name="option_005fopsubst"></a>
<a name="Item_003a-opsubst"></a>
</p><dl>
<dt><u>Option variable:</u> <b>opsubst</b>
<a name="IDX218"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>When <code>opsubst</code> is <code>false</code>, <code><a href="#subst">subst</a></code>
 does not attempt to
substitute into the operator of an expression.  E.g., 
<code>(opsubst: false, subst (x^2, r, r+r[0]))</code> will work.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="optimize"></a>
<a name="Item_003a-optimize"></a>
</p><dl>
<dt><u>Function:</u> <b>optimize</b><i> (<var>expr</var>)</i>
<a name="IDX219"></a>
</dt>
<dd><p>Returns an expression that produces the same value and
side effects as <var>expr</var> but does so more efficiently by avoiding the
recomputation of common subexpressions.  <code>optimize</code> also has the side
effect of &quot;collapsing&quot; its argument so that all common subexpressions
are shared.  Do <code>example (optimize)</code> for examples.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="optimprefix"></a>
<a name="Item_003a-optimprefix"></a>
</p><dl>
<dt><u>Option variable:</u> <b>optimprefix</b>
<a name="IDX220"></a>
</dt>
<dd><p>Default value: <code>%</code>
</p>
<p><code>optimprefix</code> is the prefix used for generated symbols by
the <code><a href="#optimize">optimize</a></code>
 command.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="ordergreat"></a>
<a name="orderless"></a>
<a name="Item_003a-ordergreat"></a>
</p><dl>
<dt><u>Function:</u> <b>ordergreat</b><i> (<var>v_1</var>, &hellip;, <var>v_n</var>)</i>
<a name="IDX221"></a>
</dt>
<dt><u>Function:</u> <b>orderless</b><i> (<var>v_1</var>, &hellip;, <var>v_n</var>)</i>
<a name="IDX222"></a>
</dt>
<dd><p><code>ordergreat</code> changes the canonical ordering of Maxima expressions
such that <var>v_1</var> succeeds <var>v_2</var> succeeds &hellip;  succeeds <var>v_n</var>,
and <var>v_n</var> succeeds any other symbol not mentioned as an argument.
</p>
<p><code>orderless</code> changes the canonical ordering of Maxima expressions
such that <var>v_1</var> precedes <var>v_2</var> precedes &hellip; precedes <var>v_n</var>,
and <var>v_n</var> precedes any other variable not mentioned as an argument.
</p>
<p>The order established by <code>ordergreat</code> and <code>orderless</code> is dissolved
by <code><a href="#unorder">unorder</a></code>.
  <code>ordergreat</code> and <code>orderless</code> can be called only
once each, unless <code>unorder</code> is called; only the last call to
<code>ordergreat</code> and <code>orderless</code> has any effect.
</p>
<p>See also <code><a href="#ordergreatp">ordergreatp</a></code>.
</p>

<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="ordergreatp"></a>
<a name="orderlessp"></a>
<a name="Item_003a-ordergreatp"></a>
</p><dl>
<dt><u>Function:</u> <b>ordergreatp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX223"></a>
</dt>
<dt><u>Function:</u> <b>orderlessp</b><i> (<var>expr_1</var>, <var>expr_2</var>)</i>
<a name="IDX224"></a>
</dt>
<dd><p><code>ordergreatp</code> returns <code>true</code> if <var>expr_1</var> succeeds <var>expr_2</var> in
the canonical ordering of Maxima expressions, and <code>false</code> otherwise.
</p>
<p><code>orderlessp</code> returns <code>true</code> if <var>expr_1</var> precedes <var>expr_2</var> in
the canonical ordering of Maxima expressions, and <code>false</code> otherwise.
</p>
<p>All Maxima atoms and expressions are comparable under <code>ordergreatp</code> and
<code>orderlessp</code>, although there are isolated examples of expressions for which
these predicates are not transitive; that is a bug.
</p>
<p>The canonical ordering of atoms (symbols, literal numbers, and strings) is the
following.
</p>
<p>(integers and floats) precede (bigfloats) precede
(declared constants) precede (strings) precede (declared scalars)
precede (first argument to <code><a href="#orderless">orderless</a></code>
) precedes &hellip; precedes
(last argument to <code>orderless</code>) precedes (other symbols) precede
(last argument to <code><a href="#ordergreat">ordergreat</a></code>
) precedes &hellip; precedes
(first argument to <code>ordergreat</code>) precedes (declared main variables)
</p>
<p>For non-atomic expressions, the canonical ordering is derived from the ordering
for atoms.  For the built-in <code>+</code> <code>*</code> and <code>^</code> operators,
the ordering is not easily summarized.  For other built-in operators and all
other functions and operators, expressions are ordered by their arguments
(beginning with the first argument), then by the name of the operator or
function.  In the case of subscripted expressions, the subscripted symbol is
considered the operator and the subscript is considered an argument.
</p>
<p>The canonical ordering of expressions is modified by the functions
<code><a href="#ordergreat">ordergreat</a></code>
 and <code><a href="#orderless">orderless</a></code>,
 and the <code><a href="#mainvar">mainvar</a></code>,

<code><a href="maxima_11.html#constant">constant</a></code>,
 and <code>scalar</code> declarations.
</p>
<p>See also <code><a href="maxima_5.html#sort">sort</a></code>.
</p>

<p>Examples:
</p>
<p>Ordering ordinary symbols and constants.
Note that <code>%pi</code> is not ordered according to its numerical value.
</p>
<pre class="example">(%i1) stringdisp : true;
(%o1)                         true
(%i2) sort([%pi, 3b0, 3.0, x, X, &quot;foo&quot;, 3, a, 4, &quot;bar&quot;, 4.0, 4b0]);
(%o2) [3, 3.0, 4, 4.0, 3.0b0, 4.0b0, %pi, &quot;bar&quot;, &quot;foo&quot;, a, x, X]
</pre>
<p>Effect of <code>ordergreat</code> and <code>orderless</code> functions.
</p>
<pre class="example">(%i1) sort ([M, H, K, T, E, W, G, A, P, J, S]);
(%o1)           [A, E, G, H, J, K, M, P, S, T, W]
(%i2) ordergreat (S, J);
(%o2)                         done
(%i3) orderless (M, H);
(%o3)                         done
(%i4) sort ([M, H, K, T, E, W, G, A, P, J, S]);
(%o4)           [M, H, A, E, G, K, P, T, W, J, S]
</pre>
<p>Effect of <code>mainvar</code>, <code>constant</code>, and <code>scalar</code> declarations.
</p>
<pre class="example">(%i1) sort ([aa, foo, bar, bb, baz, quux, cc, dd, A1, B1, C1]);
(%o1)   [aa, bar, baz, bb, cc, dd, foo, quux, A1, B1, C1]
(%i2) declare (aa, mainvar);
(%o2)                         done
(%i3) declare ([baz, quux], constant);
(%o3)                         done
(%i4) declare ([A1, B1], scalar);
(%o4)                         done
(%i5) sort ([aa, foo, bar, bb, baz, quux, cc, dd, A1, B1, C1]);
(%o5)   [baz, quux, A1, B1, bar, bb, cc, dd, foo, C1, aa]
</pre>
<p>Ordering non-atomic expressions.
</p>
<pre class="example">(%i1) sort([1, 2, n, f(1), f(2), f(2, 1), g(1), g(1, 2), g(n),
            f(n, 1)]);
(%o1) [1, 2, f(1), g(1), g(1, 2), f(2), f(2, 1), n, g(n), 
                                                         f(n, 1)]
(%i2) sort ([foo(1), X[1], X[k], foo(k), 1, k]);
(%o2)            [1, foo(1), X , k, foo(k), X ]
                              1              k
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
 &middot;
<a href="maxima_99.html#Category_003a-Predicate-functions">Predicate functions</a>
</p>
</div>

</dd></dl>


<p><a name="part"></a>
<a name="Item_003a-part"></a>
</p><dl>
<dt><u>Function:</u> <b>part</b><i> (<var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX225"></a>
</dt>
<dd><p>Returns parts of the displayed form of <code>expr</code>.  It obtains the part of
<code>expr</code> as specified by the indices <var>n_1</var>, &hellip;, <var>n_k</var>.  First
part <var>n_1</var> of <code>expr</code> is obtained, then part <var>n_2</var> of that, etc.
The result is part <var>n_k</var> of &hellip; part <var>n_2</var> of part <var>n_1</var> of
<code>expr</code>.  If no indices are specified <code>expr</code> is returned.
</p>
<p><code>part</code> can be used to obtain an element of a list, a row of a matrix, etc.
</p>
<p>If the last argument to a <code>part</code> function is a list of indices then
several subexpressions are picked out, each one corresponding to an
index of the list.  Thus <code>part (x + y + z, [1, 3])</code> is <code>z+x</code>.
</p>
<p><code><a href="#piece">piece</a></code>
 holds the last expression selected when using the <code>part</code>
functions.  It is set during the execution of the function and thus
may be referred to in the function itself as shown below.
</p>
<p>If <code><a href="#partswitch">partswitch</a></code>
 is set to <code>true</code> then <code>end</code> is returned when a
selected part of an expression doesn't exist, otherwise an error message is
given.
</p>
<p>See also <code><a href="#inpart">inpart</a></code>,
 <code><a href="#substpart">substpart</a></code>,
 <code><a href="#substinpart">substinpart</a></code>,

<code><a href="#dpart">dpart</a></code>,
 and <code><a href="#lpart">lpart</a></code>.
</p>

<p>Examples:
</p>
<pre class="example">(%i1) part(z+2*y+a,2);
(%o1)                                 2 y
(%i2) part(z+2*y+a,[1,3]);
(%o2)                                z + a
(%i3) part(z+2*y+a,2,1);
(%o3)                                  2
</pre>
<p><code>example (part)</code> displays additional examples.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="partition"></a>
<a name="Item_003a-partition"></a>
</p><dl>
<dt><u>Function:</u> <b>partition</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX226"></a>
</dt>
<dd><p>Returns a list of two expressions.  They are (1) the factors of <var>expr</var>
(if it is a product), the terms of <var>expr</var> (if it is a sum), or the list
(if it is a list) which don't contain <var>x</var> and, (2) the factors, terms,
or list which do.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) partition (2*a*x*f(x), x);
(%o1)                     [2 a, x f(x)]
(%i2) partition (a+b, x);
(%o2)                      [b + a, 0]
(%i3) partition ([a, b, f(a), c], a); 
(%o3)                  [[b, c], [a, f(a)]]
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="partswitch"></a>
<a name="Item_003a-partswitch"></a>
</p><dl>
<dt><u>Option variable:</u> <b>partswitch</b>
<a name="IDX227"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>When <code>partswitch</code> is <code>true</code>, <code>end</code> is returned
when a selected part of an expression doesn't exist, otherwise an
error message is given.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="pickapart"></a>
<a name="Item_003a-pickapart"></a>
</p><dl>
<dt><u>Function:</u> <b>pickapart</b><i> (<var>expr</var>, <var>n</var>)</i>
<a name="IDX228"></a>
</dt>
<dd><p>Assigns intermediate expression labels to subexpressions of <var>expr</var> at depth
<var>n</var>, an integer.  Subexpressions at greater or lesser depths are not
assigned labels.  <code>pickapart</code> returns an expression in terms of
intermediate expressions equivalent to the original expression <var>expr</var>.
</p>
<p>See also <code><a href="#part">part</a></code>,
 <code><a href="#dpart">dpart</a></code>,
 <code><a href="#lpart">lpart</a></code>,

<code><a href="#inpart">inpart</a></code>,
 and <code><a href="#reveal">reveal</a></code>.
</p>

<p>Examples:
</p>
<pre class="example">(%i1) expr: (a+b)/2 + sin (x^2)/3 - log (1 + sqrt(x+1));
                                          2
                                     sin(x )   b + a
(%o1)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2
(%i2) pickapart (expr, 0);
                                          2
                                     sin(x )   b + a
(%t2)       - log(sqrt(x + 1) + 1) + ------- + -----
                                        3        2
(%o2)                          %t2
(%i3) pickapart (expr, 1);

(%t3)                - log(sqrt(x + 1) + 1)


                                  2
                             sin(x )
(%t4)                        -------
                                3


                              b + a
(%t5)                         -----
                                2

(%o5)                    %t5 + %t4 + %t3
(%i5) pickapart (expr, 2);

(%t6)                 log(sqrt(x + 1) + 1)


                                  2
(%t7)                        sin(x )


(%t8)                         b + a

                         %t8   %t7
(%o8)                    --- + --- - %t6
                          2     3
(%i8) pickapart (expr, 3);

(%t9)                    sqrt(x + 1) + 1


                                2
(%t10)                         x

                  b + a              sin(%t10)
(%o10)            ----- - log(%t9) + ---------
                    2                    3
(%i10) pickapart (expr, 4);

(%t11)                     sqrt(x + 1)
                      2
                 sin(x )   b + a
(%o11)           ------- + ----- - log(%t11 + 1)
                    3        2
(%i11) pickapart (expr, 5);

(%t12)                        x + 1

                   2
              sin(x )   b + a
(%o12)        ------- + ----- - log(sqrt(%t12) + 1)
                 3        2
(%i12) pickapart (expr, 6);
                  2
             sin(x )   b + a
(%o12)       ------- + ----- - log(sqrt(x + 1) + 1)
                3        2
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="piece"></a>
<a name="Item_003a-piece"></a>
</p><dl>
<dt><u>System variable:</u> <b>piece</b>
<a name="IDX229"></a>
</dt>
<dd><p>Holds the last expression selected when using the <code><a href="#part">part</a></code>
 functions.
It is set during the execution of the function and thus may be referred to in
the function itself.
</p>

<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="psubst"></a>
<a name="Item_003a-psubst"></a>
</p><dl>
<dt><u>Function:</u> <b>psubst</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX230"></a>
</dt>
<dt><u>Function:</u> <b>psubst</b><i> (<var>a</var>, <var>b</var>, <var>expr</var>)</i>
<a name="IDX231"></a>
</dt>
<dd><p><code>psubst(<var>a</var>, <var>b</var>, <var>expr</var>)</code> is simliar to <code>subst</code>.  See 
<code><a href="#subst">subst</a></code>.
</p>

<p>In distinction from <code>subst</code> the function <code>psubst</code> makes parallel 
substitutions, if the first argument <var>list</var> is a list of equations.
</p>
<p>See also <code><a href="#sublis">sublis</a></code>
 for making parallel substitutions.
</p>
<p>Example:
</p>
<p>The first example shows parallel substitution with <code>psubst</code>.  The second
example shows the result for the function <code>subst</code>, which does a serial
substitution.
</p>
<pre class="example">(%i4) psubst ([a^2=b, b=a], sin(a^2) + sin(b));
(%o4)                           sin(b) + sin(a)
(%i5) subst ([a^2=b, b=a], sin(a^2) + sin(b));
(%o5)                              2 sin(a)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="rembox"></a>
<a name="Item_003a-rembox"></a>
</p><dl>
<dt><u>Function:</u> <b>rembox</b><i> (<var>expr</var>, unlabelled)</i>
<a name="IDX232"></a>
</dt>
<dt><u>Function:</u> <b>rembox</b><i> (<var>expr</var>, <var>label</var>)</i>
<a name="IDX233"></a>
</dt>
<dt><u>Function:</u> <b>rembox</b><i> (<var>expr</var>)</i>
<a name="IDX234"></a>
</dt>
<dd><p>Removes boxes from <var>expr</var>.
</p>
<p><code>rembox (<var>expr</var>, unlabelled)</code> removes all unlabelled boxes from
<var>expr</var>.
</p>
<p><code>rembox (<var>expr</var>, <var>label</var>)</code> removes only boxes bearing <var>label</var>.
</p>
<p><code>rembox (<var>expr</var>)</code> removes all boxes, labelled and unlabelled.
</p>
<p>Boxes are drawn by the <code><a href="#box">box</a></code>,
 <code><a href="#dpart">dpart</a></code>,
 and <code><a href="#lpart">lpart</a></code>

functions.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) expr: (a*d - b*c)/h^2 + sin(%pi*x);
                                  a d - b c
(%o1)                sin(%pi x) + ---------
                                      2
                                     h
(%i2) dpart (dpart (expr, 1, 1), 2, 2);
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;    a d - b c
(%o2)               sin(&quot;%pi x&quot;) + ---------
                        &quot;&quot;&quot;&quot;&quot;&quot;&quot;      &quot;&quot;&quot;&quot;
                                     &quot; 2&quot;
                                     &quot;h &quot;
                                     &quot;&quot;&quot;&quot;
(%i3) expr2: lpart (BAR, lpart (FOO, %, 1), 2);
                  FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;a d - b c&quot;
(%o3)             &quot;sin(&quot;%pi x&quot;)&quot; + &quot;---------&quot;
                  &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   &quot;  &quot;&quot;&quot;&quot;   &quot;
                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;  &quot; 2&quot;   &quot;
                                   &quot;  &quot;h &quot;   &quot;
                                   &quot;  &quot;&quot;&quot;&quot;   &quot;
                                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i4) rembox (expr2, unlabelled);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;a d - b c&quot;
(%o4)              &quot;sin(%pi x)&quot; + &quot;---------&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;   &quot;    2    &quot;
                                  &quot;   h     &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i5) rembox (expr2, FOO);
                                  BAR&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;a d - b c&quot;
(%o5)              sin(&quot;%pi x&quot;) + &quot;---------&quot;
                       &quot;&quot;&quot;&quot;&quot;&quot;&quot;    &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;  &quot; 2&quot;   &quot;
                                  &quot;  &quot;h &quot;   &quot;
                                  &quot;  &quot;&quot;&quot;&quot;   &quot;
                                  &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
(%i6) rembox (expr2, BAR);
                   FOO&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;   a d - b c
(%o6)              &quot;sin(&quot;%pi x&quot;)&quot; + ---------
                   &quot;    &quot;&quot;&quot;&quot;&quot;&quot;&quot; &quot;     &quot;&quot;&quot;&quot;
                   &quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;     &quot; 2&quot;
                                      &quot;h &quot;
                                      &quot;&quot;&quot;&quot;
(%i7) rembox (expr2);
                                  a d - b c
(%o7)                sin(%pi x) + ---------
                                      2
                                     h
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="reveal"></a>
<a name="Item_003a-reveal"></a>
</p><dl>
<dt><u>Function:</u> <b>reveal</b><i> (<var>expr</var>, <var>depth</var>)</i>
<a name="IDX235"></a>
</dt>
<dd><p>Replaces parts of <var>expr</var> at the specified integer <var>depth</var>
with descriptive summaries.
</p>
<ul>
<li>
Sums and differences are replaced by <code>Sum(<var>n</var>)</code>
where <var>n</var> is the number of operands of the sum.
</li><li>
Products are replaced by <code>Product(<var>n</var>)</code>
where <var>n</var> is the number of operands of the product.
</li><li>
Exponentials are replaced by <code>Expt</code>.
</li><li>
Quotients are replaced by <code>Quotient</code>.
</li><li>
Unary negation is replaced by <code>Negterm</code>.
</li><li>
Lists are replaced by <code>List(<var>n</var>)</code> where <var>n</var> ist the number of
elements of the list.
</li></ul>

<p>When <var>depth</var> is greater than or equal to the maximum depth of <var>expr</var>,
<code>reveal (<var>expr</var>, <var>depth</var>)</code> returns <var>expr</var> unmodified.
</p>
<p><code>reveal</code> evaluates its arguments.
<code>reveal</code> returns the summarized expression.
</p>
<p>Example:
</p>
<pre class="example">(%i1) e: expand ((a - b)^2)/expand ((exp(a) + exp(b))^2);
                          2            2
                         b  - 2 a b + a
(%o1)               -------------------------
                        b + a     2 b     2 a
                    2 %e      + %e    + %e
(%i2) reveal (e, 1);
(%o2)                       Quotient
(%i3) reveal (e, 2);
                             Sum(3)
(%o3)                        ------
                             Sum(3)
(%i4) reveal (e, 3);
                     Expt + Negterm + Expt
(%o4)               ------------------------
                    Product(2) + Expt + Expt
(%i5) reveal (e, 4);
                       2                 2
                      b  - Product(3) + a
(%o5)         ------------------------------------
                         Product(2)     Product(2)
              2 Expt + %e           + %e
(%i6) reveal (e, 5);
                         2            2
                        b  - 2 a b + a
(%o6)              --------------------------
                       Sum(2)     2 b     2 a
                   2 %e       + %e    + %e
(%i7) reveal (e, 6);
                          2            2
                         b  - 2 a b + a
(%o7)               -------------------------
                        b + a     2 b     2 a
                    2 %e      + %e    + %e
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
 &middot;
<a href="maxima_99.html#Category_003a-Display-functions">Display functions</a>
</p>
</div>

</dd></dl>


<p><a name="sublis"></a>
<a name="Item_003a-sublis"></a>
</p><dl>
<dt><u>Function:</u> <b>sublis</b><i> (<var>list</var>, <var>expr</var>)</i>
<a name="IDX236"></a>
</dt>
<dd><p>Makes multiple parallel substitutions into an expression.  <var>list</var> is a list
of equations.  The left hand side of the equations must be an atom.
</p>
<p>The variable <code><a href="#sublis_005fapply_005flambda">sublis_apply_lambda</a></code>
 controls simplification after
<code>sublis</code>.
</p>
<p>See also <code><a href="#psubst">psubst</a></code>
 for making parallel substitutions.
</p>
<p>Example:
</p>
<pre class="example">(%i1) sublis ([a=b, b=a], sin(a) + cos(b));
(%o1)                    sin(b) + cos(a)
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="sublis_005fapply_005flambda"></a>
<a name="Item_003a-sublis_005fapply_005flambda"></a>
</p><dl>
<dt><u>Option variable:</u> <b>sublis_apply_lambda</b>
<a name="IDX237"></a>
</dt>
<dd><p>Default value: <code>true</code>
</p>
<p>Controls whether <code>lambda</code>'s substituted are applied in simplification after
<code>sublis</code> is used or whether you have to do an <code><a href="maxima_8.html#ev">ev</a></code>
 to get things to
apply.  <code>true</code> means do the application.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="subnumsimp"></a>
<a name="Item_003a-subnumsimp"></a>
</p><dl>
<dt><u>Option variable:</u> <b>subnumsimp</b>
<a name="IDX238"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>
<p>If <code>true</code> then the functions <code><a href="#subst">subst</a></code>
 and <code><a href="#psubst">psubst</a></code>
 can substitute
a subscripted variable <code>f[x]</code> with a number, when only the symbol <code>f</code>
is given.
</p>
<p>See also <code><a href="#subst">subst</a></code>.
</p>

<pre class="example">(%i1) subst(100,g,g[x]+2);

subst: cannot substitute 100 for operator g in expression g
                                                           x
 -- an error. To debug this try: debugmode(true);

(%i2) subst(100,g,g[x]+2),subnumsimp:true;
(%o2)                          102
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="subst"></a>
<a name="Item_003a-subst"></a>
</p><dl>
<dt><u>Function:</u> <b>subst</b><i> (<var>a</var>, <var>b</var>, <var>c</var>)</i>
<a name="IDX239"></a>
</dt>
<dd><p>Substitutes <var>a</var> for <var>b</var> in <var>c</var>.  <var>b</var> must be an atom or a
complete subexpression of <var>c</var>.  For example, <code>x+y+z</code> is a complete
subexpression of <code>2*(x+y+z)/w</code> while <code>x+y</code> is not.  When <var>b</var> does
not have these characteristics, one may sometimes use <code><a href="#substpart">substpart</a></code>
 or
<code><a href="maxima_14.html#ratsubst">ratsubst</a></code>
 (see below).  Alternatively, if <var>b</var> is of the form
<code>e/f</code> then one could use <code>subst (a*f, e, c)</code> while if <var>b</var> is of
the form <code>e^(1/f)</code> then one could use <code>subst (a^f, e, c)</code>.  The
<code>subst</code> command also discerns the <code>x^y</code> in <code>x^-y</code> so that
<code>subst (a, sqrt(x), 1/sqrt(x))</code> yields <code>1/a</code>.  <var>a</var> and <var>b</var>
may also be operators of an expression enclosed in double-quotes <code>&quot;</code> or
they may be function names.  If one wishes to substitute for the independent
variable in derivative forms then the <code>at</code> function (see below) should be
used.
</p>
<p><code>subst</code> is an alias for <code>substitute</code>.
</p>
<p>The commands <code>subst (<var>eq_1</var>, <var>expr</var>)</code> or
<code>subst ([<var>eq_1</var>, ..., <var>eq_k</var>], <var>expr</var>)</code> are other permissible
forms.  The <var>eq_i</var> are equations indicating substitutions to be made.
For each equation, the right side will be substituted for the left in the 
expression <var>expr</var>.  The equations are substituted in serial from left to
right in <var>expr</var>.  See the functions <code>sublis</code> and <code>psubst</code> for 
making parallel substitutions.
</p>
<p><code><a href="#exptsubst">exptsubst</a></code>
 if <code>true</code> permits substitutions
like <code>y</code> for <code>%e^x</code> in <code>%e^(a*x)</code> to take place.
</p>
<p>When <code>opsubst</code> is <code>false</code>,
<code>subst</code> will not attempt to substitute into the operator of an expression.
E.g. <code>(opsubst: false, subst (x^2, r, r+r[0]))</code> will work.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) subst (a, x+y, x + (x+y)^2 + y);
                                    2
(%o1)                      y + x + a
(%i2) subst (-%i, %i, a + b*%i);
(%o2)                       a - %i b
</pre>
<p>The substitution is done in serial for a list of equations.  Compare this with
a parallel substitution:
</p>
<pre class="example">(%i3) subst([a=b, b=c], a+b);
(%o3)                                 2 c
(%i4) sublis([a=b, b=c], a+b);
(%o4)                                c + b
</pre>

<p>For further examples, do <code>example (subst)</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="substinpart"></a>
<a name="Item_003a-substinpart"></a>
</p><dl>
<dt><u>Function:</u> <b>substinpart</b><i> (<var>x</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX240"></a>
</dt>
<dd><p>Similar to <code><a href="#substpart">substpart</a></code>,
 but <code>substinpart</code> works on the
internal representation of <var>expr</var>.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) x . 'diff (f(x), x, 2);
                              2
                             d
(%o1)                   x . (--- (f(x)))
                               2
                             dx
(%i2) substinpart (d^2, %, 2);
                                  2
(%o2)                        x . d
(%i3) substinpart (f1, f[1](x + 1), 0);
(%o3)                       f1(x + 1)
</pre>
<p>If the last argument to a <code>part</code> function is a list of indices then
several subexpressions are picked out, each one corresponding to an
index of the list.  Thus
</p>
<pre class="example">(%i1) part (x + y + z, [1, 3]);
(%o1)                         z + x
</pre>
<p><code><a href="#piece">piece</a></code>
 holds the value of the last expression selected when using the
<code>part</code> functions.  It is set during the execution of the function and
thus may be referred to in the function itself as shown below.
If <code><a href="#partswitch">partswitch</a></code>
 is set to <code>true</code> then <code>end</code> is returned when a
selected part of an expression doesn't exist, otherwise an error
message is given.
</p>
<pre class="example">(%i1) expr: 27*y^3 + 54*x*y^2 + 36*x^2*y + y + 8*x^3 + x + 1;
              3         2       2            3
(%o1)     27 y  + 54 x y  + 36 x  y + y + 8 x  + x + 1
(%i2) part (expr, 2, [1, 3]);
                                  2
(%o2)                         54 y
(%i3) sqrt (piece/54);
(%o3)                        abs(y)
(%i4) substpart (factor (piece), expr, [1, 2, 3, 5]);
                               3
(%o4)               (3 y + 2 x)  + y + x + 1
(%i5) expr: 1/x + y/x - 1/z;
                             1   y   1
(%o5)                      - - + - + -
                             z   x   x
(%i6) substpart (xthru (piece), expr, [2, 3]);
                            y + 1   1
(%o6)                       ----- - -
                              x     z
</pre>
<p>Also, setting the option <code><a href="#inflag">inflag</a></code>
 to <code>true</code> and calling <code><a href="#part">part</a></code>
</p>
<p>or <code><a href="#substpart">substpart</a></code>
 is the same as calling <code><a href="#inpart">inpart</a></code>
 or <code>substinpart</code>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>


<p><a name="substpart"></a>
<a name="Item_003a-substpart"></a>
</p><dl>
<dt><u>Function:</u> <b>substpart</b><i> (<var>x</var>, <var>expr</var>, <var>n_1</var>, &hellip;, <var>n_k</var>)</i>
<a name="IDX241"></a>
</dt>
<dd><p>Substitutes <var>x</var> for the subexpression picked out by the rest of the
arguments as in <code><a href="#part">part</a></code>.
  It returns the new value of <var>expr</var>.  <var>x</var>
may be some operator to be substituted for an operator of <var>expr</var>.  In some
cases <var>x</var> needs to be enclosed in double-quotes <code>&quot;</code> (e.g.
<code>substpart (&quot;+&quot;, a*b, 0)</code> yields <code>b + a</code>).
</p>
<p>Example:
</p>
<pre class="example">(%i1) 1/(x^2 + 2);
                               1
(%o1)                        ------
                              2
                             x  + 2
(%i2) substpart (3/2, %, 2, 1, 2);
                               1
(%o2)                       --------
                             3/2
                            x    + 2
(%i3) a*x + f(b, y);
(%o3)                     a x + f(b, y)
(%i4) substpart (&quot;+&quot;, %, 1, 0);
(%o4)                    x + f(b, y) + a
</pre>
<p>Also, setting the option <code><a href="#inflag">inflag</a></code>
 to <code>true</code> and calling <code><a href="#part">part</a></code>
</p>
<p>or <code>substpart</code> is the same as calling <code>inpart</code> or
<code><a href="#substinpart">substinpart</a></code>.
</p>

<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="symbolp"></a>
<a name="Item_003a-symbolp"></a>
</p><dl>
<dt><u>Function:</u> <b>symbolp</b><i> (<var>expr</var>)</i>
<a name="IDX242"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>expr</var> is a symbol, else <code>false</code>.  In effect,
<code>symbolp(x)</code> is equivalent to the predicate
<code>atom(x) and not numberp(x)</code>.
</p>
<p>See also <a href="#SEC32">Identifiers</a>.
</p>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Predicate-functions">Predicate functions</a>
</p>
</div>

</dd></dl>

<p><a name="unorder"></a>
<a name="Item_003a-unorder"></a>
</p><dl>
<dt><u>Function:</u> <b>unorder</b><i> ()</i>
<a name="IDX243"></a>
</dt>
<dd><p>Disables the aliasing created by the last use of the ordering commands 
<code>ordergreat</code> and <code>orderless</code>.  <code>ordergreat</code> and <code>orderless</code> 
may not be used more than one time each without calling <code>unorder</code>.
<code>unorder</code> does not substitute back in expressions the original symbols for
the aliases introduced by <code>ordergreat</code> and <code>orderless</code>.  Therefore,
after execution of <code>unorder</code> the aliases appear in previous expressions.
</p> 
<p>See also <code>ordergreat</code> and <code>orderless</code>.
</p>
<p>Examples:
</p>
<p><code>ordergreat(a)</code> introduces an alias for the symbol <code>a</code>.  Therefore,
the difference of <code>%o2</code> and <code>%o4</code> does not vanish.  <code>unorder</code>
does not substitute back the symbol <code>a</code> and the alias appears in the
output <code>%o7</code>.
</p>
<pre class="example">(%i1) unorder();
(%o1)                          []
(%i2) b*x+a^2;
                                   2
(%o2)                       b x + a
(%i3) ordergreat(a);
(%o3)                         done
(%i4) b*x+a^2;
                             2
(%o4)                       a  + b x
(%i5) %th(1)-%th(3);
                              2    2
(%o5)                        a  - a
(%i6) unorder();
(%o6)                          [a]
(%i7) %th(2);
                                2    2
(%o7)                      _101a  - a
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Expressions">Expressions</a>
</p>
</div>

</dd></dl>

<p><a name="verbify"></a>
<a name="Item_003a-verbify"></a>
</p><dl>
<dt><u>Function:</u> <b>verbify</b><i> (<var>f</var>)</i>
<a name="IDX244"></a>
</dt>
<dd><p>Returns the verb form of the function name <var>f</var>.
See also <code>verb</code>, <code>noun</code>, and <code>nounify</code>.
</p>
<p>Examples:
</p>
<pre class="example">(%i1) verbify ('foo);
(%o1)                          foo
(%i2) :lisp $%
$FOO
(%i2) nounify (foo);
(%o2)                          foo
(%i3) :lisp $%
%FOO
</pre>
<div class=categorybox>


<p>Categories:&nbsp;&nbsp;<a href="maxima_99.html#Category_003a-Nouns-and-verbs">Nouns and verbs</a>
</p>
</div>

</dd></dl>


<p><a name="Item_003a-Operators"></a>
</p><hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC29" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_7.html#SEC35" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_83.html#SEC380" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Chris User</em> on <em>June, 20 2016</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
