<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Dezember, 10 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 50. graphs</title>

<meta name="description" content="Maxima Manual: 50. graphs">
<meta name="keywords" content="Maxima Manual: 50. graphs">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="graphs"></a>
<a name="SEC288"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_49.html#SEC287" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC289" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_49.html#SEC286" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 50. graphs </h1>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC289">50.1 Introduction to graphs</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC290">50.2 Functions and Variables for graphs</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Introduction-to-graphs"></a>
<a name="SEC289"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC288" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC290" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC288" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC288" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 50.1 Introduction to graphs </h2>

<p>The <code>graphs</code> package provides graph and digraph data structure for
Maxima. Graphs and digraphs are simple (have no multiple edges nor
loops), although digraphs can have a directed edge from <var>u</var> to
<var>v</var> and a directed edge from <var>v</var> to <var>u</var>.
</p>
<p>Internally graphs are represented by adjacency lists and implemented as
a lisp structures. Vertices are identified by their ids (an id is an
integer). Edges/arcs are represented by lists of length 2. Labels can be
assigned to vertices of graphs/digraphs and weights can be assigned to
edges/arcs of graphs/digraphs.
</p>
<p>There is a <code>draw_graph</code> function for drawing graphs. Graphs are
drawn using a force based vertex positioning
algorithm. <code>draw_graph</code> can also use graphviz programs available
from <a href="http://www.graphviz.org">http://www.graphviz.org</a>. <code>draw_graph</code> is based on the maxima
<code>draw</code> package.
</p>
<p>To use the <code>graphs</code> package, first load it with <code>load(graphs)</code>.
</p>

<hr size="6">
<a name="Functions-and-Variables-for-graphs"></a>
<a name="SEC290"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC289" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC291" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC288" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC288" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 50.2 Functions and Variables for graphs </h2>

<hr size="6">
<a name="SEC291"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC290" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC292" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC288" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC290" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 50.2.1 Building graphs </h3>

<dl>
<dt><u>Function:</u> <b>create_graph</b><i> (<var>v_list</var>, <var>e_list</var>)</i>
<a name="IDX2167"></a>
</dt>
<dt><u>Function:</u> <b>create_graph</b><i> (<var>n</var>, <var>e_list</var>)</i>
<a name="IDX2168"></a>
</dt>
<dt><u>Function:</u> <b>create_graph</b><i> (<var>v_list</var>, <var>e_list</var>, <var>directed</var>)</i>
<a name="IDX2169"></a>
</dt>
<dd><p>Creates a new graph on the set of vertices <var>v_list</var> and with edges <var>e_list</var>.
</p>
<p><var>v_list</var> is a list of vertices (<code>[v1, v2,..., vn]</code>) or a
list of vertices together with vertex labels (<code>[[v1,l1], [v2,l2],..., [vn,ln]]</code>).
</p>
<p><var>n</var> is the number of vertices. Vertices will be identified by integers from 0 to n-1.
</p>
<p><var>e_list</var> is a list of edges (<code>[e1, e2,..., em]</code>) or a list of
edges together with edge-weights (<code>[[e1, w1], ..., [em, wm]]</code>).
</p>
<p>If <var>directed</var> is not <code>false</code>, a directed graph will be returned.
</p>
<p>Example 1: create a cycle on 3 vertices:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1,2,3], [[1,2], [2,3], [1,3]])$
(%i3) print_graph(g)$
Graph on 3 vertices with 3 edges.
Adjacencies:
  3 :  1  2
  2 :  3  1
  1 :  3  2
</pre>
<p>Example 2: create a cycle on 3 vertices with edge weights:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1,2,3], [[[1,2], 1.0], [[2,3], 2.0],
                          [[1,3], 3.0]])$
(%i3) print_graph(g)$
Graph on 3 vertices with 3 edges.
Adjacencies:
  3 :  1  2
  2 :  3  1
  1 :  3  2
</pre>
<p>Example 3: create a directed graph:
</p><pre class="example">(%i1) load (graphs)$
(%i2) d : create_graph(
        [1,2,3,4],
        [
         [1,3], [1,4],
         [2,3], [2,4]
        ],
        'directed = true)$
(%i3) print_graph(d)$
Digraph on 4 vertices with 4 arcs.
Adjacencies:
  4 :
  3 :
  2 :  4  3
  1 :  4  3
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>copy_graph</b><i> (<var>g</var>)</i>
<a name="IDX2170"></a>
</dt>
<dd><p>Returns a copy of the graph <var>g</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>circulant_graph</b><i> (<var>n</var>, <var>d</var>)</i>
<a name="IDX2171"></a>
</dt>
<dd><p>Returns the circulant graph with parameters <var>n</var> and <var>d</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : circulant_graph(10, [1,3])$
(%i3) print_graph(g)$
Graph on 10 vertices with 20 edges.
Adjacencies:
  9 :  2  6  0  8
  8 :  1  5  9  7
  7 :  0  4  8  6
  6 :  9  3  7  5
  5 :  8  2  6  4
  4 :  7  1  5  3
  3 :  6  0  4  2
  2 :  9  5  3  1
  1 :  8  4  2  0
  0 :  7  3  9  1
</pre> 
</dd></dl>

<dl>
<dt><u>Function:</u> <b>clebsch_graph</b><i> ()</i>
<a name="IDX2172"></a>
</dt>
<dd><p>Returns the Clebsch graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>complement_graph</b><i> (<var>g</var>)</i>
<a name="IDX2173"></a>
</dt>
<dd><p>Returns the complement of the graph <var>g</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>complete_bipartite_graph</b><i> (<var>n</var>, <var>m</var>)</i>
<a name="IDX2174"></a>
</dt>
<dd><p>Returns the complete bipartite graph on <var>n+m</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>complete_graph</b><i> (<var>n</var>)</i>
<a name="IDX2175"></a>
</dt>
<dd><p>Returns the complete graph on <var>n</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>cycle_digraph</b><i> (<var>n</var>)</i>
<a name="IDX2176"></a>
</dt>
<dd><p>Returns the directed cycle on <var>n</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>cycle_graph</b><i> (<var>n</var>)</i>
<a name="IDX2177"></a>
</dt>
<dd><p>Returns the cycle on <var>n</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>cuboctahedron_graph</b><i> (<var>n</var>)</i>
<a name="IDX2178"></a>
</dt>
<dd><p>Returns the cuboctahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>cube_graph</b><i> (<var>n</var>)</i>
<a name="IDX2179"></a>
</dt>
<dd><p>Returns the <var>n</var>-dimensional cube.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>dodecahedron_graph</b><i> ()</i>
<a name="IDX2180"></a>
</dt>
<dd><p>Returns the dodecahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>empty_graph</b><i> (<var>n</var>)</i>
<a name="IDX2181"></a>
</dt>
<dd><p>Returns the empty graph on <var>n</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>flower_snark</b><i> (<var>n</var>)</i>
<a name="IDX2182"></a>
</dt>
<dd><p>Returns the flower graph on <var>4n</var> vertices.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) f5 : flower_snark(5)$
(%i3) chromatic_index(f5);
(%o3)                           4
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>from_adjacency_matrix</b><i> (<var>A</var>)</i>
<a name="IDX2183"></a>
</dt>
<dd><p>Returns the graph represented by its adjacency matrix <var>A</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>frucht_graph</b><i> ()</i>
<a name="IDX2184"></a>
</dt>
<dd><p>Returns the Frucht graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph_product</b><i> (<var>g1</var>, <var>g1</var>)</i>
<a name="IDX2185"></a>
</dt>
<dd><p>Returns the direct product of graphs <var>g1</var> and <var>g2</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) grid : graph_product(path_graph(3), path_graph(4))$
(%i3) draw_graph(grid)$
</pre>
</dd></dl>

<p><div class="image"><img src="./../figures/graphs01.gif" alt="../figures/graphs01"></div>
</p>
<dl>
<dt><u>Function:</u> <b>graph_union</b><i> (<var>g1</var>, <var>g1</var>)</i>
<a name="IDX2186"></a>
</dt>
<dd><p>Returns the union (sum) of graphs <var>g1</var> and <var>g2</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>grid_graph</b><i> (<var>n</var>, <var>m</var>)</i>
<a name="IDX2187"></a>
</dt>
<dd><p>Returns the <var>n x m</var> grid.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>great_rhombicosidodecahedron_graph</b><i> ()</i>
<a name="IDX2188"></a>
</dt>
<dd><p>Returns the great rhombicosidodecahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>great_rhombicuboctahedron_graph</b><i> ()</i>
<a name="IDX2189"></a>
</dt>
<dd><p>Returns the great rhombicuboctahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>grotzch_graph</b><i> ()</i>
<a name="IDX2190"></a>
</dt>
<dd><p>Returns the Grotzch graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>heawood_graph</b><i> ()</i>
<a name="IDX2191"></a>
</dt>
<dd><p>Returns the Heawood graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>icosahedron_graph</b><i> ()</i>
<a name="IDX2192"></a>
</dt>
<dd><p>Returns the icosahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>icosidodecahedron_graph</b><i> ()</i>
<a name="IDX2193"></a>
</dt>
<dd><p>Returns the icosidodecahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>induced_subgraph</b><i> (<var>V</var>, <var>g</var>)</i>
<a name="IDX2194"></a>
</dt>
<dd><p>Returns the graph induced on the subset <var>V</var> of vertices of the graph
<var>g</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) V : [0,1,2,3,4]$
(%i4) g : induced_subgraph(V, p)$
(%i5) print_graph(g)$
Graph on 5 vertices with 5 edges.
Adjacencies:
  4 :  3  0
  3 :  2  4
  2 :  1  3
  1 :  0  2
  0 :  1  4
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>line_graph</b><i> (<var>g</var>)</i>
<a name="IDX2195"></a>
</dt>
<dd><p>Returns the line graph of the graph <var>g</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>make_graph</b><i> (<var>vrt</var>, <var>f</var>)</i>
<a name="IDX2196"></a>
</dt>
<dt><u>Function:</u> <b>make_graph</b><i> (<var>vrt</var>, <var>f</var>, <var>oriented</var>)</i>
<a name="IDX2197"></a>
</dt>
<dd><p>Creates a graph using a predicate function <var>f</var>.
</p>
<p><var>vrt</var> is a list/set of vertices or an integer. If <var>vrt</var> is an
integer, then vertices of the graph will be integers from 1 to
<var>vrt</var>.
</p>
<p><var>f</var> is a predicate function. Two vertices <var>a</var> and <var>b</var> will
be connected if <code>f(a,b)=true</code>.
</p>
<p>If <var>directed</var> is not <var>false</var>, then the graph will be directed.
</p>
<p>Example 1:
</p><pre class="example">(%i1) load(graphs)$
(%i2) g : make_graph(powerset({1,2,3,4,5}, 2), disjointp)$
(%i3) is_isomorphic(g, petersen_graph());
(%o3)                         true
(%i4) get_vertex_label(1, g);
(%o4)                        {1, 2}
</pre>
<p>Example 2:
</p><pre class="example">(%i1) load(graphs)$
(%i2) f(i, j) := is (mod(j, i)=0)$
(%i3) g : make_graph(20, f, directed=true)$
(%i4) out_neighbors(4, g);
(%o4)                    [8, 12, 16, 20]
(%i5) in_neighbors(18, g);
(%o5)                    [1, 2, 3, 6, 9]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>mycielski_graph</b><i> (<var>g</var>)</i>
<a name="IDX2198"></a>
</dt>
<dd><p>Returns the mycielskian graph of the graph <var>g</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>new_graph</b><i> ()</i>
<a name="IDX2199"></a>
</dt>
<dd><p>Returns the graph with no vertices and no edges.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>path_digraph</b><i> (<var>n</var>)</i>
<a name="IDX2200"></a>
</dt>
<dd><p>Returns the directed path on <var>n</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>path_graph</b><i> (<var>n</var>)</i>
<a name="IDX2201"></a>
</dt>
<dd><p>Returns the path on <var>n</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>petersen_graph</b><i> ()</i>
<a name="IDX2202"></a>
</dt>
<dt><u>Function:</u> <b>petersen_graph</b><i> (<var>n</var>, <var>d</var>)</i>
<a name="IDX2203"></a>
</dt>
<dd><p>Returns the petersen graph <var>P_{n,d}</var>. The default values for
<var>n</var> and <var>d</var> are <code>n=5</code> and <code>d=2</code>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>random_bipartite_graph</b><i> (<var>a</var>, <var>b</var>, <var>p</var>)</i>
<a name="IDX2204"></a>
</dt>
<dd><p>Returns a random bipartite graph on <code>a+b</code> vertices. Each edge is
present with probability <var>p</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>random_digraph</b><i> (<var>n</var>, <var>p</var>)</i>
<a name="IDX2205"></a>
</dt>
<dd><p>Returns a random directed graph on <var>n</var> vertices. Each arc is present
with probability <var>p</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>random_regular_graph</b><i> (<var>n</var>)</i>
<a name="IDX2206"></a>
</dt>
<dt><u>Function:</u> <b>random_regular_graph</b><i> (<var>n</var>, <var>d</var>)</i>
<a name="IDX2207"></a>
</dt>
<dd><p>Returns a random <var>d</var>-regular graph on <var>n</var> vertices. The default
value for <var>d</var> is <code>d=3</code>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>random_graph</b><i> (<var>n</var>, <var>p</var>)</i>
<a name="IDX2208"></a>
</dt>
<dd><p>Returns a random graph on <var>n</var> vertices. Each edge is present with
probability <var>p</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>random_graph1</b><i> (<var>n</var>, <var>m</var>)</i>
<a name="IDX2209"></a>
</dt>
<dd><p>Returns a random graph on <var>n</var> vertices and random <var>m</var> edges.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>random_network</b><i> (<var>n</var>, <var>p</var>, <var>w</var>)</i>
<a name="IDX2210"></a>
</dt>
<dd><p>Returns a random network on <var>n</var> vertices. Each arc is present with
probability <var>p</var> and has a weight in the range <code>[0,w]</code>. The
function returns a list <code>[network, source, sink]</code>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) [net, s, t] : random_network(50, 0.2, 10.0);
(%o2)                   [DIGRAPH, 50, 51]
(%i3) max_flow(net, s, t)$
(%i4) first(%);
(%o4)                   27.65981397932507
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>random_tournament</b><i> (<var>n</var>)</i>
<a name="IDX2211"></a>
</dt>
<dd><p>Returns a random tournament on <var>n</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>random_tree</b><i> (<var>n</var>)</i>
<a name="IDX2212"></a>
</dt>
<dd><p>Returns a random tree on <var>n</var> vertices.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>small_rhombicosidodecahedron_graph</b><i> ()</i>
<a name="IDX2213"></a>
</dt>
<dd><p>Returns the small rhombicosidodecahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>small_rhombicuboctahedron_graph</b><i> ()</i>
<a name="IDX2214"></a>
</dt>
<dd><p>Returns the small rhombicuboctahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>snub_cube_graph</b><i> ()</i>
<a name="IDX2215"></a>
</dt>
<dd><p>Returns the snub cube graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>snub_dodecahedron_graph</b><i> ()</i>
<a name="IDX2216"></a>
</dt>
<dd><p>Returns the snub dodecahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>truncated_cube_graph</b><i> ()</i>
<a name="IDX2217"></a>
</dt>
<dd><p>Returns the truncated cube graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>truncated_dodecahedron_graph</b><i> ()</i>
<a name="IDX2218"></a>
</dt>
<dd><p>Returns the truncated dodecahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>truncated_icosahedron_graph</b><i> ()</i>
<a name="IDX2219"></a>
</dt>
<dd><p>Returns the truncated icosahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>truncated_tetrahedron_graph</b><i> ()</i>
<a name="IDX2220"></a>
</dt>
<dd><p>Returns the truncated tetrahedron graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>tutte_graph</b><i> ()</i>
<a name="IDX2221"></a>
</dt>
<dd><p>Returns the Tutte graph.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>underlying_graph</b><i> (<var>g</var>)</i>
<a name="IDX2222"></a>
</dt>
<dd><p>Returns the underlying graph of the directed graph <var>g</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>wheel_graph</b><i> (<var>n</var>)</i>
<a name="IDX2223"></a>
</dt>
<dd><p>Returns the wheel graph on <var>n+1</var> vertices.
</p>
</dd></dl>

<hr size="6">
<a name="SEC292"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC291" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC293" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC288" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC290" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 50.2.2 Graph properties </h3>

<dl>
<dt><u>Function:</u> <b>adjacency_matrix</b><i> (<var>gr</var>)</i>
<a name="IDX2224"></a>
</dt>
<dd><p>Returns the adjacency matrix of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(4)$
(%i3) adjacency_matrix(c5);
                         [ 0  1  0  1 ]
                         [            ]
                         [ 1  0  1  0 ]
(%o3)                    [            ]
                         [ 0  1  0  1 ]
                         [            ]
                         [ 1  0  1  0 ]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>average_degree</b><i> (<var>gr</var>)</i>
<a name="IDX2225"></a>
</dt>
<dd><p>Returns the average degree of vertices in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) average_degree(grotzch_graph());
                               40
(%o2)                          --
                               11
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>biconected_components</b><i> (<var>gr</var>)</i>
<a name="IDX2226"></a>
</dt>
<dd><p>Returns the (vertex sets of) 2-connected components of the graph
<var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph(
            [1,2,3,4,5,6,7],
            [
             [1,2],[2,3],[2,4],[3,4],
             [4,5],[5,6],[4,6],[6,7]
            ])$
(%i3) biconnected_components(g);
(%o3)        [[6, 7], [4, 5, 6], [1, 2], [2, 3, 4]]
</pre>
<p><div class="image"><img src="./../figures/graphs13.gif" alt="../figures/graphs13"></div>
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>bipartition</b><i> (<var>gr</var>)</i>
<a name="IDX2227"></a>
</dt>
<dd><p>Returns a bipartition of the vertices of the graph <var>gr</var> or an empty
list if <var>gr</var> is not bipartite.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) h : heawood_graph()$
(%i3) [A,B]:bipartition(h);
(%o3)  [[8, 12, 6, 10, 0, 2, 4], [13, 5, 11, 7, 9, 1, 3]]
(%i4) draw_graph(h, show_vertices=A, program=circular)$
</pre>
</dd></dl>

<p><div class="image"><img src="./../figures/graphs02.gif" alt="../figures/graphs02"></div>
</p>
<dl>
<dt><u>Function:</u> <b>chromatic_index</b><i> (<var>gr</var>)</i>
<a name="IDX2228"></a>
</dt>
<dd><p>Returns the chromatic index of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) chromatic_index(p);
(%o3)                           4
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>chromatic_number</b><i> (<var>gr</var>)</i>
<a name="IDX2229"></a>
</dt>
<dd><p>Returns the chromatic number of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) chromatic_number(cycle_graph(5));
(%o2)                           3
(%i3) chromatic_number(cycle_graph(6));
(%o3)                           2
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>clear_edge_weight</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2230"></a>
</dt>
<dd><p>Removes the weight of the edge  <var>e</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph(3, [[[0,1], 1.5], [[1,2], 1.3]])$
(%i3) get_edge_weight([0,1], g);
(%o3)                          1.5
(%i4) clear_edge_weight([0,1], g)$
(%i5) get_edge_weight([0,1], g);
(%o5)                           1
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>clear_vertex_label</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2231"></a>
</dt>
<dd><p>Removes the label of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[0,&quot;Zero&quot;], [1, &quot;One&quot;]], [[0,1]])$
(%i3) get_vertex_label(0, g);
(%o3)                         Zero
(%i4) clear_vertex_label(0, g);
(%o4)                         done
(%i5) get_vertex_label(0, g);
(%o5)                         false
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>connected_components</b><i> (<var>gr</var>)</i>
<a name="IDX2232"></a>
</dt>
<dd><p>Returns the (vertex sets of) connected components of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g: graph_union(cycle_graph(5), path_graph(4))$
(%i3) connected_components(g);
(%o3)            [[1, 2, 3, 4, 0], [8, 7, 6, 5]]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>diameter</b><i> (<var>gr</var>)</i>
<a name="IDX2233"></a>
</dt>
<dd><p>Returns the diameter of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) diameter(dodecahedron_graph());
(%o2)                           5
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>edge_coloring</b><i> (<var>gr</var>)</i>
<a name="IDX2234"></a>
</dt>
<dd><p>Returns an optimal coloring of the edges of the graph <var>gr</var>.
</p>
<p>The function returns the chromatic index and a list representing the
coloring of the edges of <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) [ch_index, col] : edge_coloring(p);
(%o3) [4, [[[0, 5], 3], [[5, 7], 1], [[0, 1], 1], [[1, 6], 2], 
[[6, 8], 1], [[1, 2], 3], [[2, 7], 4], [[7, 9], 2], [[2, 3], 2], 
[[3, 8], 3], [[5, 8], 2], [[3, 4], 1], [[4, 9], 4], [[6, 9], 3], 
[[0, 4], 2]]]
(%i4) assoc([0,1], col);
(%o4)                           1
(%i5) assoc([0,5], col);
(%o5)                           3
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>degree_sequence</b><i> (<var>gr</var>)</i>
<a name="IDX2235"></a>
</dt>
<dd><p>Returns the list of vertex degrees of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) degree_sequence(random_graph(10, 0.4));
(%o2)            [2, 2, 2, 2, 2, 2, 3, 3, 3, 3]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>edge_connectivity</b><i> (<var>gr</var>)</i>
<a name="IDX2236"></a>
</dt>
<dd><p>Returns the edge-connectivity of the graph <var>gr</var>.
</p>
<p>See also <code>min_edge_cut</code>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>edges</b><i> (<var>gr</var>)</i>
<a name="IDX2237"></a>
</dt>
<dd><p>Returns the list of edges (arcs) in a (directed) graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) edges(complete_graph(4));
(%o2)   [[2, 3], [1, 3], [1, 2], [0, 3], [0, 2], [0, 1]]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>get_edge_weight</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2238"></a>
</dt>
<dt><u>Function:</u> <b>get_edge_weight</b><i> (<var>e</var>, <var>gr</var>, <var>ifnot</var>)</i>
<a name="IDX2239"></a>
</dt>
<dd><p>Returns the weight of the edge <var>e</var> in the graph <var>gr</var>.
</p>
<p>If there is no weight assigned to the edge, the function returns 1. If
the edge is not present in the graph, the function signals an error or
returns the optional argument <var>ifnot</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(5)$
(%i3) get_edge_weight([1,2], c5);
(%o3)                           1
(%i4) set_edge_weight([1,2], 2.0, c5);
(%o4)                         done
(%i5) get_edge_weight([1,2], c5);
(%o5)                          2.0
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>get_vertex_label</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2240"></a>
</dt>
<dd><p>Returns the label of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[0,&quot;Zero&quot;], [1, &quot;One&quot;]], [[0,1]])$
(%i3) get_vertex_label(0, g);
(%o3)                         Zero
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph_charpoly</b><i> (<var>gr</var>, <var>x</var>)</i>
<a name="IDX2241"></a>
</dt>
<dd><p>Returns the characteristic polynomial (in variable <var>x</var>) of the graph
<var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_charpoly(p, x), factor;
                                   5        4
(%o3)               (x - 3) (x - 1)  (x + 2)
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph_center</b><i> (<var>gr</var>)</i>
<a name="IDX2242"></a>
</dt>
<dd><p>Returns the center of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : grid_graph(5,5)$
(%i3) graph_center(g);
(%o3)                         [12]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph_eigenvalues</b><i> (<var>gr</var>)</i>
<a name="IDX2243"></a>
</dt>
<dd><p>Returns the eigenvalues of the graph <var>gr</var>. The function returns
eigenvalues in the same format as maxima <code>eigenvalue</code> function.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_eigenvalues(p);
(%o3)               [[3, - 2, 1], [1, 4, 5]]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph_periphery</b><i> (<var>gr</var>)</i>
<a name="IDX2244"></a>
</dt>
<dd><p>Returns the periphery of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : grid_graph(5,5)$
(%i3) graph_periphery(g);
(%o3)                    [24, 20, 4, 0]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph_size</b><i> (<var>gr</var>)</i>
<a name="IDX2245"></a>
</dt>
<dd><p>Returns the number of edges in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_size(p);
(%o3)                          15
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph_order</b><i> (<var>gr</var>)</i>
<a name="IDX2246"></a>
</dt>
<dd><p>Returns the number of vertices in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) graph_order(p);
(%o3)                          10
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>girth</b><i> (<var>gr</var>)</i>
<a name="IDX2247"></a>
</dt>
<dd><p>Returns the length of the shortest cycle in <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : heawood_graph()$
(%i3) girth(g);
(%o3)                           6
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>hamilton_cycle</b><i> (<var>gr</var>)</i>
<a name="IDX2248"></a>
</dt>
<dd><p>Returns the Hamilton cycle of the graph <var>gr</var> or an empty list if
<var>gr</var> is not hamiltonian.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) c : cube_graph(3)$
(%i3) hc : hamilton_cycle(c);
(%o3)              [7, 3, 2, 6, 4, 0, 1, 5, 7]
(%i4) draw_graph(c, show_edges=vertices_to_cycle(hc))$
</pre>
</dd></dl>

<p><div class="image"><img src="./../figures/graphs03.gif" alt="../figures/graphs03"></div>
</p>
<dl>
<dt><u>Function:</u> <b>hamilton_path</b><i> (<var>gr</var>)</i>
<a name="IDX2249"></a>
</dt>
<dd><p>Returns the Hamilton path of the graph <var>gr</var> or an empty list if
<var>gr</var> does not have a Hamilton path.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) hp : hamilton_path(p);
(%o3)            [0, 5, 7, 2, 1, 6, 8, 3, 4, 9]
(%i4) draw_graph(p, show_edges=vertices_to_path(hp))$
</pre>
</dd></dl>

<p><div class="image"><img src="./../figures/graphs04.gif" alt="../figures/graphs04"></div>
</p>
<dl>
<dt><u>Function:</u> <b>isomorphism</b><i> (<var>gr1</var>, <var>gr2</var>)</i>
<a name="IDX2250"></a>
</dt>
<dd><p>Returns a an isomorphism between graphs/digraphs <var>gr1</var> and
<var>gr2</var>. If <var>gr1</var> and <var>gr2</var> are not isomorphic, it returns
an empty list.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) clk5:complement_graph(line_graph(complete_graph(5)))$
(%i3) isomorphism(clk5, petersen_graph());
(%o3) [9 -&gt; 0, 2 -&gt; 1, 6 -&gt; 2, 5 -&gt; 3, 0 -&gt; 4, 1 -&gt; 5, 3 -&gt; 6, 
                                          4 -&gt; 7, 7 -&gt; 8, 8 -&gt; 9]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>in_neighbors</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2251"></a>
</dt>
<dd><p>Returns the list of in-neighbors of the vertex <var>v</var> in the directed
graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : path_digraph(3)$
(%i3) in_neighbors(2, p);
(%o3)                          [1]
(%i4) out_neighbors(2, p);
(%o4)                          []
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_biconnected</b><i> (<var>gr</var>)</i>
<a name="IDX2252"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is 2-connected and <code>false</code> otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_biconnected(cycle_graph(5));
(%o2)                         true
(%i3) is_biconnected(path_graph(5));
(%o3)                         false
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_bipartite</b><i> (<var>gr</var>)</i>
<a name="IDX2253"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is bipartite (2-colorable) and <code>false</code> otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_bipartite(petersen_graph());
(%o2)                         false
(%i3) is_bipartite(heawood_graph());
(%o3)                         true
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_connected</b><i> (<var>gr</var>)</i>
<a name="IDX2254"></a>
</dt>
<dd><p>Returns <code>true</code> if the graph <var>gr</var> is connected and <code>false</code> otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_connected(graph_union(cycle_graph(4), path_graph(3)));
(%o2)                         false
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_digraph</b><i> (<var>gr</var>)</i>
<a name="IDX2255"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a directed graph and <code>false</code> otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_digraph(path_graph(5));
(%o2)                         false
(%i3) is_digraph(path_digraph(5));
(%o3)                         true
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_edge_in_graph</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2256"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>e</var> is an edge (arc) in the (directed) graph <var>g</var>
and <code>false</code> otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) c4 : cycle_graph(4)$
(%i3) is_edge_in_graph([2,3], c4);
(%o3)                         true
(%i4) is_edge_in_graph([3,2], c4);
(%o4)                         true
(%i5) is_edge_in_graph([2,4], c4);
(%o5)                         false
(%i6) is_edge_in_graph([3,2], cycle_digraph(4));
(%o6)                         false
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_graph</b><i> (<var>gr</var>)</i>
<a name="IDX2257"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a graph and <code>false</code> otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_graph(path_graph(5));
(%o2)                         true
(%i3) is_graph(path_digraph(5));
(%o3)                         false
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_graph_or_digraph</b><i> (<var>gr</var>)</i>
<a name="IDX2258"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a graph or a directed graph and <code>false</code> otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_graph_or_digraph(path_graph(5));
(%o2)                         true
(%i3) is_graph_or_digraph(path_digraph(5));
(%o3)                         true
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_isomorphic</b><i> (<var>gr1</var>, <var>gr2</var>)</i>
<a name="IDX2259"></a>
</dt>
<dd><p>Returns <code>true</code> if graphs/digraphs <var>gr1</var> and <var>gr2</var> are isomorphic
and <code>false</code> otherwise.
</p>
<p>See also <code>isomorphism</code>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) clk5:complement_graph(line_graph(complete_graph(5)))$
(%i3) is_isomorphic(clk5, petersen_graph());
(%o3)                         true
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_planar</b><i> (<var>gr</var>)</i>
<a name="IDX2260"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a planar graph and <code>false</code> otherwise.
</p>
<p>The algorithm used is the Demoucron's algorithm, which is a quadratic time
algorithm.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_planar(dodecahedron_graph());
(%o2)                         true
(%i3) is_planar(petersen_graph());
(%o3)                         false
(%i4) is_planar(petersen_graph(10,2));
(%o4)                         true
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_sconnected</b><i> (<var>gr</var>)</i>
<a name="IDX2261"></a>
</dt>
<dd><p>Returns <code>true</code> if the directed graph <var>gr</var> is strongly connected and
<code>false</code> otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_sconnected(cycle_digraph(5));
(%o2)                         true
(%i3) is_sconnected(path_digraph(5));
(%o3)                         false
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_vertex_in_graph</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2262"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>v</var> is a vertex in the graph <var>g</var> and <code>false</code>  otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) c4 : cycle_graph(4)$
(%i3) is_vertex_in_graph(0, c4);
(%o3)                         true
(%i4) is_vertex_in_graph(6, c4);
(%o4)                         false
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>is_tree</b><i> (<var>gr</var>)</i>
<a name="IDX2263"></a>
</dt>
<dd><p>Returns <code>true</code> if <var>gr</var> is a tree and <code>false</code>  otherwise.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) is_tree(random_tree(4));
(%o2)                         true
(%i3) is_tree(graph_union(random_tree(4), random_tree(5)));
(%o3)                         false
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>laplacian_matrix</b><i> (<var>gr</var>)</i>
<a name="IDX2264"></a>
</dt>
<dd><p>Returns the laplacian matrix of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) laplacian_matrix(cycle_graph(5));
                   [  2   - 1   0    0   - 1 ]
                   [                         ]
                   [ - 1   2   - 1   0    0  ]
                   [                         ]
(%o2)              [  0   - 1   2   - 1   0  ]
                   [                         ]
                   [  0    0   - 1   2   - 1 ]
                   [                         ]
                   [ - 1   0    0   - 1   2  ]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>max_clique</b><i> (<var>gr</var>)</i>
<a name="IDX2265"></a>
</dt>
<dd><p>Returns a maximum clique of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.5)$
(%i3) max_clique(g);
(%o3)          [6, 12, 31, 36, 52, 59, 62, 63, 80]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>max_degree</b><i> (<var>gr</var>)</i>
<a name="IDX2266"></a>
</dt>
<dd><p>Returns the maximal degree of vertices of the graph <var>gr</var> and a
vertex of maximal degree.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.02)$
(%i3) max_degree(g);
(%o3)                        [6, 79]
(%i4) vertex_degree(95, g);
(%o4)                           2
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>max_flow</b><i> (<var>net</var>, <var>s</var>, <var>t</var>)</i>
<a name="IDX2267"></a>
</dt>
<dd><p>Returns a maximum flow through the network <var>net</var> with the source
<var>s</var> and the sink <var>t</var>.
</p>
<p>The function returns the value of the maximal flow and a list
representing the weights of the arcs in the optimal flow.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) net : create_graph(
  [1,2,3,4,5,6],
  [[[1,2], 1.0],
   [[1,3], 0.3],
   [[2,4], 0.2],
   [[2,5], 0.3],
   [[3,4], 0.1],
   [[3,5], 0.1],
   [[4,6], 1.0],
   [[5,6], 1.0]],
  directed=true)$
(%i3) [flow_value, flow] : max_flow(net, 1, 6);
(%o3) [0.7, [[[1, 2], 0.5], [[1, 3], 0.2], [[2, 4], 0.2], 
[[2, 5], 0.3], [[3, 4], 0.1], [[3, 5], 0.1], [[4, 6], 0.3], 
[[5, 6], 0.4]]]
(%i4) fl : 0$
(%i5) for u in out_neighbors(1, net)
     do fl : fl + assoc([1, u], flow)$
(%i6) fl;
(%o6)                          0.7
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>max_independent_set</b><i> (<var>gr</var>)</i>
<a name="IDX2268"></a>
</dt>
<dd><p>Returns a maximum independent set of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) mi : max_independent_set(d);
(%o3)             [0, 3, 5, 9, 10, 11, 18, 19]
(%i4) draw_graph(d, show_vertices=mi)$
</pre>
</dd></dl>

<p><div class="image"><img src="./../figures/graphs05.gif" alt="../figures/graphs05"></div>
</p>
<dl>
<dt><u>Function:</u> <b>max_matching</b><i> (<var>gr</var>)</i>
<a name="IDX2269"></a>
</dt>
<dd><p>Returns a maximum matching of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) m : max_matching(d);
(%o3) [[5, 7], [8, 9], [6, 10], [14, 19], [13, 18], [12, 17], 
                               [11, 16], [0, 15], [3, 4], [1, 2]]
(%i4) draw_graph(d, show_edges=m)$
</pre>
</dd></dl>

<p><div class="image"><img src="./../figures/graphs06.gif" alt="../figures/graphs06"></div>
</p>
<dl>
<dt><u>Function:</u> <b>min_degree</b><i> (<var>gr</var>)</i>
<a name="IDX2270"></a>
</dt>
<dd><p>Returns the minimum degree of vertices of the graph <var>gr</var> and a
vertex of minimum degree.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : random_graph(100, 0.1)$
(%i3) min_degree(g);
(%o3)                        [3, 49]
(%i4) vertex_degree(21, g);
(%o4)                           9
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>min_edge_cut</b><i> (<var>gr</var>)</i>
<a name="IDX2271"></a>
</dt>
<dd><p>Returns the minimum edge cut in the graph <var>gr</var>.
</p>
<p>See also <code>edge_connectivity</code>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>min_vertex_cover</b><i> (<var>gr</var>)</i>
<a name="IDX2272"></a>
</dt>
<dd><p>Returns the minimum vertex cover of the graph <var>gr</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>min_vertex_cut</b><i> (<var>gr</var>)</i>
<a name="IDX2273"></a>
</dt>
<dd><p>Returns the minimum vertex cut in the graph <var>gr</var>.
</p>
<p>See also <code>vertex_connectivity</code>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>minimum_spanning_tree</b><i> (<var>gr</var>)</i>
<a name="IDX2274"></a>
</dt>
<dd><p>Returns the minimum spanning tree of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : graph_product(path_graph(10), path_graph(10))$
(%i3) t : minimum_spanning_tree(g)$
(%i4) draw_graph(g, show_edges=edges(t))$
</pre>
</dd></dl>

<p><div class="image"><img src="./../figures/graphs07.gif" alt="../figures/graphs07"></div>
</p>
<dl>
<dt><u>Function:</u> <b>neighbors</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2275"></a>
</dt>
<dd><p>Returns the list of neighbors of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : petersen_graph()$
(%i3) neighbors(3, p);
(%o3)                       [4, 8, 2]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>odd_girth</b><i> (<var>gr</var>)</i>
<a name="IDX2276"></a>
</dt>
<dd><p>Returns the length of the shortest odd cycle in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : graph_product(cycle_graph(4), cycle_graph(7))$
(%i3) girth(g);
(%o3)                           4
(%i4) odd_girth(g);
(%o4)                           7
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>out_neighbors</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2277"></a>
</dt>
<dd><p>Returns the list of out-neighbors of the vertex <var>v</var> in the directed
graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : path_digraph(3)$
(%i3) in_neighbors(2, p);
(%o3)                          [1]
(%i4) out_neighbors(2, p);
(%o4)                          []
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>planar_embedding</b><i> (<var>gr</var>)</i>
<a name="IDX2278"></a>
</dt>
<dd><p>Returns the list of facial walks in a planar embedding of <var>gr</var> and
<code>false</code> if <var>gr</var> is not a planar graph.
</p>
<p>The graph <var>gr</var> must be biconnected.
</p>
<p>The algorithm used is the Demoucron's algorithm, which is a quadratic time
algorithm.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) planar_embedding(grid_graph(3,3));
(%o2) [[3, 6, 7, 8, 5, 2, 1, 0], [4, 3, 0, 1], [3, 4, 7, 6], 
                                      [8, 7, 4, 5], [1, 2, 5, 4]]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>print_graph</b><i> (<var>gr</var>)</i>
<a name="IDX2279"></a>
</dt>
<dd><p>Prints some information about the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) c5 : cycle_graph(5)$
(%i3) print_graph(c5)$
Graph on 5 vertices with 5 edges.
Adjacencies:
  4 :  0  3
  3 :  4  2
  2 :  3  1
  1 :  2  0
  0 :  4  1
(%i4) dc5 : cycle_digraph(5)$
(%i5) print_graph(dc5)$
Digraph on 5 vertices with 5 arcs.
Adjacencies:
  4 :  0
  3 :  4
  2 :  3
  1 :  2
  0 :  1
(%i6) out_neighbors(0, dc5);
(%o6)                          [1]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>radius</b><i> (<var>gr</var>)</i>
<a name="IDX2280"></a>
</dt>
<dd><p>Returns the radius of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) radius(dodecahedron_graph());
(%o2)                           5
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>set_edge_weight</b><i> (<var>e</var>, <var>w</var>, <var>gr</var>)</i>
<a name="IDX2281"></a>
</dt>
<dd><p>Assigns the weight <var>w</var> to the edge <var>e</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([1, 2], [[[1,2], 1.2]])$
(%i3) get_edge_weight([1,2], g);
(%o3)                          1.2
(%i4) set_edge_weight([1,2], 2.1, g);
(%o4)                         done
(%i5) get_edge_weight([1,2], g);
(%o5)                          2.1
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>set_vertex_label</b><i> (<var>v</var>, <var>l</var>, <var>gr</var>)</i>
<a name="IDX2282"></a>
</dt>
<dd><p>Assigns the label <var>l</var> to the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : create_graph([[1, &quot;One&quot;], [2, &quot;Two&quot;]], [[1,2]])$
(%i3) get_vertex_label(1, g);
(%o3)                          One
(%i4) set_vertex_label(1, &quot;oNE&quot;, g);
(%o4)                         done
(%i5) get_vertex_label(1, g);
(%o5)                          oNE
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>shortest_path</b><i> (<var>u</var>, <var>v</var>, <var>gr</var>)</i>
<a name="IDX2283"></a>
</dt>
<dd><p>Returns the shortest path from <var>u</var> to <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) path : shortest_path(0, 7, d);
(%o3)                   [0, 1, 19, 13, 7]
(%i4) draw_graph(d, show_edges=vertices_to_path(path))$
</pre>
</dd></dl>

<p><div class="image"><img src="./../figures/graphs08.gif" alt="../figures/graphs08"></div>
</p>
<dl>
<dt><u>Function:</u> <b>shortest_weighted_path</b><i> (<var>u</var>, <var>v</var>, <var>gr</var>)</i>
<a name="IDX2284"></a>
</dt>
<dd><p>Returns the length of the shortest weighted path and the shortest
weighted path from <var>u</var> to <var>v</var> in the graph <var>gr</var>.
</p>
<p>The length of a weighted path is the sum of edge weights of edges in the
path. If an edge has no weight, then it has a default weight 1.
</p>
<p>Example:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g: petersen_graph(20, 2)$
(%i3) for e in edges(g) do set_edge_weight(e, random(1.0), g)$
(%i4) shortest_weighted_path(0, 10, g);
(%o4) [2.575143920268482, [0, 20, 38, 36, 34, 32, 30, 10]]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>strong_components</b><i> (<var>gr</var>)</i>
<a name="IDX2285"></a>
</dt>
<dd><p>Returns the strong components of a directed graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) t : random_tournament(4)$
(%i3) strong_components(t);
(%o3)                 [[1], [0], [2], [3]]
(%i4) vertex_out_degree(3, t);
(%o4)                           3
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>topological_sort</b><i> (<var>dag</var>)</i>
<a name="IDX2286"></a>
</dt>
<dd><p>Returns a topological sorting of the vertices of a directed graph
<var>dag</var> or an empty list if <var>dag</var> is not a directed acyclic graph.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g:create_graph(
         [1,2,3,4,5],
         [
          [1,2], [2,5], [5,3],
          [5,4], [3,4], [1,3]
         ],
         directed=true)$
(%i3) topological_sort(g);
(%o3)                    [1, 2, 5, 3, 4]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertex_connectivity</b><i> (<var>g</var>)</i>
<a name="IDX2287"></a>
</dt>
<dd><p>Returns the vertex connectivity of the graph <var>g</var>.
</p>
<p>See also <code>min_vertex_cut</code>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertex_degree</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2288"></a>
</dt>
<dd><p>Returns the degree of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertex_distance</b><i> (<var>u</var>, <var>v</var>, <var>gr</var>)</i>
<a name="IDX2289"></a>
</dt>
<dd><p>Returns the length of the shortest path between <var>u</var> and <var>v</var> in
the (directed) graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) d : dodecahedron_graph()$
(%i3) vertex_distance(0, 7, d);
(%o3)                           4
(%i4) shortest_path(0, 7, d);
(%o4)                   [0, 1, 19, 13, 7]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertex_eccentricity</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2290"></a>
</dt>
<dd><p>Returns the eccentricity of the vertex <var>v</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g:cycle_graph(7)$
(%i3) vertex_eccentricity(0, g);
(%o3)                           3
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertex_in_degree</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2291"></a>
</dt>
<dd><p>Returns the in-degree of the vertex <var>v</var> in the directed graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p5 : path_digraph(5)$
(%i3) print_graph(p5)$
Digraph on 5 vertices with 4 arcs.
Adjacencies:
  4 :
  3 :  4
  2 :  3
  1 :  2
  0 :  1
(%i4) vertex_in_degree(4, p5);
(%o4)                           1
(%i5) in_neighbors(4, p5);
(%o5)                          [3]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertex_out_degree</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2292"></a>
</dt>
<dd><p>Returns the out-degree of the vertex <var>v</var> in the directed graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) t : random_tournament(10)$
(%i3) vertex_out_degree(0, t);
(%o3)                           2
(%i4) out_neighbors(0, t);
(%o4)                        [7, 1]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertices</b><i> (<var>gr</var>)</i>
<a name="IDX2293"></a>
</dt>
<dd><p>Returns the list of vertices in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) vertices(complete_graph(4));
(%o2)                     [3, 2, 1, 0]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertex_coloring</b><i> (<var>gr</var>)</i>
<a name="IDX2294"></a>
</dt>
<dd><p>Returns an optimal coloring of the vertices of the graph <var>gr</var>.
</p>
<p>The function returns the chromatic number and a list representing the
coloring of the vertices of <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p:petersen_graph()$
(%i3) vertex_coloring(p);
(%o3) [3, [[0, 2], [1, 3], [2, 2], [3, 3], [4, 1], [5, 3], 
                                 [6, 1], [7, 1], [8, 2], [9, 2]]]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>wiener_index</b><i> (<var>gr</var>)</i>
<a name="IDX2295"></a>
</dt>
<dd><p>Returns the Wiener index of the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i2) wiener_index(dodecahedron_graph());
(%o2)                          500
</pre>
</dd></dl>

<hr size="6">
<a name="SEC293"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC292" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC294" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC288" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC290" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 50.2.3 Modifying graphs </h3>

<dl>
<dt><u>Function:</u> <b>add_edge</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2296"></a>
</dt>
<dd><p>Adds the edge <var>e</var> to the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) p : path_graph(4)$
(%i3) neighbors(0, p);
(%o3)                          [1]
(%i4) add_edge([0,3], p);
(%o4)                         done
(%i5) neighbors(0, p);
(%o5)                        [3, 1]
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>add_edges</b><i> (<var>e_list</var>, <var>gr</var>)</i>
<a name="IDX2297"></a>
</dt>
<dd><p>Adds all edges in the list <var>e_list</var> to the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : empty_graph(3)$
(%i3) add_edges([[0,1],[1,2]], g)$
(%i4) print_graph(g)$
Graph on 3 vertices with 2 edges.
Adjacencies:
  2 :  1
  1 :  2  0
  0 :  1
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>add_vertex</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2298"></a>
</dt>
<dd><p>Adds the vertex <var>v</var> to the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : path_graph(2)$
(%i3) add_vertex(2, g)$
(%i4) print_graph(g)$
Graph on 3 vertices with 1 edges.
Adjacencies:
  2 :
  1 :  0
  0 :  1
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>add_vertices</b><i> (<var>v_list</var>, <var>gr</var>)</i>
<a name="IDX2299"></a>
</dt>
<dd><p>Adds all vertices in the list <var>v_list</var> to the graph <var>gr</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>connect_vertices</b><i> (<var>v_list</var>, <var>u_list</var>, <var>gr</var>)</i>
<a name="IDX2300"></a>
</dt>
<dd><p>Connects all vertices from the list <var>v_list</var> with the vertices in
the list <var>u_list</var> in the graph <var>gr</var>.
</p>
<p><var>v_list</var> and <var>u_list</var> can be single vertices or lists of
vertices.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g : empty_graph(4)$
(%i3) connect_vertices(0, [1,2,3], g)$
(%i4) print_graph(g)$
Graph on 4 vertices with 3 edges.
Adjacencies:
  3 :  0
  2 :  0
  1 :  0
  0 :  3  2  1
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>contract_edge</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2301"></a>
</dt>
<dd><p>Contracts the edge <var>e</var> in the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) g: create_graph(
      8, [[0,3],[1,3],[2,3],[3,4],[4,5],[4,6],[4,7]])$
(%i3) print_graph(g)$
Graph on 8 vertices with 7 edges.
Adjacencies:
  7 :  4
  6 :  4
  5 :  4
  4 :  7  6  5  3
  3 :  4  2  1  0
  2 :  3
  1 :  3
  0 :  3
(%i4) contract_edge([3,4], g)$
(%i5) print_graph(g)$
Graph on 7 vertices with 6 edges.
Adjacencies:
  7 :  3
  6 :  3
  5 :  3
  3 :  5  6  7  2  1  0
  2 :  3
  1 :  3
  0 :  3
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>remove_edge</b><i> (<var>e</var>, <var>gr</var>)</i>
<a name="IDX2302"></a>
</dt>
<dd><p>Removes the edge <var>e</var> from the graph <var>gr</var>.
</p>
<p>Example:
</p><pre class="example">(%i1) load (graphs)$
(%i2) c3 : cycle_graph(3)$
(%i3) remove_edge([0,1], c3)$
(%i4) print_graph(c3)$
Graph on 3 vertices with 2 edges.
Adjacencies:
  2 :  0  1
  1 :  2
  0 :  2
</pre>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>remove_vertex</b><i> (<var>v</var>, <var>gr</var>)</i>
<a name="IDX2303"></a>
</dt>
<dd><p>Removes the vertex <var>v</var> from the graph <var>gr</var>.
</p>
</dd></dl>

<hr size="6">
<a name="SEC294"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC293" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC295" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC288" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC290" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 50.2.4 Reading and writing to files </h3>

<dl>
<dt><u>Function:</u> <b>dimacs_export</b><i> (<var>gr</var>, <var>fl</var>)</i>
<a name="IDX2304"></a>
</dt>
<dt><u>Function:</u> <b>dimacs_export</b><i> (<var>gr</var>, <var>fl</var>, <var>comment1</var>, ..., <var>commentn</var>)</i>
<a name="IDX2305"></a>
</dt>
<dd><p>Exports the graph into the file <var>fl</var> in the DIMACS format. Optional
comments will be added to the top of the file.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>dimacs_import</b><i> (<var>fl</var>)</i>
<a name="IDX2306"></a>
</dt>
<dd><p>Returns the graph from file <var>fl</var> in the DIMACS format.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph6_decode</b><i> (<var>str</var>)</i>
<a name="IDX2307"></a>
</dt>
<dd><p>Returns the graph encoded in the graph6 format in the string <var>str</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph6_encode</b><i> (<var>gr</var>)</i>
<a name="IDX2308"></a>
</dt>
<dd><p>Returns a string which encodes the graph <var>gr</var> in the graph6 format.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph6_export</b><i> (<var>gr_list</var>, <var>fl</var>)</i>
<a name="IDX2309"></a>
</dt>
<dd><p>Exports graphs in the list <var>gr_list</var> to the file <var>fl</var> in the
graph6 format.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>graph6_import</b><i> (<var>fl</var>)</i>
<a name="IDX2310"></a>
</dt>
<dd><p>Returns a list of graphs from the file <var>fl</var> in the graph6 format.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>sparse6_decode</b><i> (<var>str</var>)</i>
<a name="IDX2311"></a>
</dt>
<dd><p>Returns the graph encoded in the sparse6 format in the string <var>str</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>sparse6_encode</b><i> (<var>gr</var>)</i>
<a name="IDX2312"></a>
</dt>
<dd><p>Returns a string which encodes the graph <var>gr</var> in the sparse6 format.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>sparse6_export</b><i> (<var>gr_list</var>, <var>fl</var>)</i>
<a name="IDX2313"></a>
</dt>
<dd><p>Exports graphs in the list <var>gr_list</var> to the file <var>fl</var> in the
sparse6 format.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>sparse6_import</b><i> (<var>fl</var>)</i>
<a name="IDX2314"></a>
</dt>
<dd><p>Returns a list of graphs from the file <var>fl</var> in the sparse6 format.
</p>
</dd></dl>

<hr size="6">
<a name="SEC295"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC294" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC288" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC290" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 50.2.5 Visualization </h3>

<p><a name="draw_005fgraph"></a>
</p><dl>
<dt><u>Function:</u> <b>draw_graph</b><i> (<var>graph</var>)</i>
<a name="IDX2315"></a>
</dt>
<dt><u>Function:</u> <b>draw_graph</b><i> (<var>graph</var>, <var>option1</var>, ..., <var>optionk</var>)</i>
<a name="IDX2316"></a>
</dt>
<dd><p>Draws the graph using the <code>draw</code> package.
</p>
<p>The algorithm used to position vertices is specified by the optional
argument <var>program</var>. The default value is
<code>program=spring_embedding</code>. <var>draw_graph</var> can also use the
graphviz programs for positioning vertices, but graphviz must be
installed separately.
</p>
<p>Example 1:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g:grid_graph(10,10)$
(%i3) m:max_matching(g)$
(%i4) draw_graph(g,
   spring_embedding_depth=100,
   show_edges=m, edge_type=dots,
   vertex_size=0)$
</pre>
<p><div class="image"><img src="./../figures/graphs09.gif" alt="../figures/graphs09"></div>
</p>
<p>Example 2:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g:create_graph(16,
    [
     [0,1],[1,3],[2,3],[0,2],[3,4],[2,4],
     [5,6],[6,4],[4,7],[6,7],[7,8],[7,10],[7,11],
     [8,10],[11,10],[8,9],[11,12],[9,15],[12,13],
     [10,14],[15,14],[13,14]
    ])$
(%i3) t:minimum_spanning_tree(g)$
(%i4) draw_graph(
    g,
    show_edges=edges(t),
    show_edge_width=4,
    show_edge_color=green,
    vertex_type=filled_square,
    vertex_size=2
    )$
</pre>
<p><div class="image"><img src="./../figures/graphs10.gif" alt="../figures/graphs10"></div>
</p>
<p>Example 3:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) g:create_graph(16,
    [
     [0,1],[1,3],[2,3],[0,2],[3,4],[2,4],
     [5,6],[6,4],[4,7],[6,7],[7,8],[7,10],[7,11],
     [8,10],[11,10],[8,9],[11,12],[9,15],[12,13],
     [10,14],[15,14],[13,14]
    ])$
(%i3) mi : max_independent_set(g)$
(%i4) draw_graph(
    g,
    show_vertices=mi,
    show_vertex_type=filled_up_triangle,
    show_vertex_size=2,
    edge_color=cyan,
    edge_width=3,
    show_id=true,
    text_color=brown
    )$
</pre>
<p><div class="image"><img src="./../figures/graphs11.gif" alt="../figures/graphs11"></div>
</p>
<p>Example 4:
</p>
<pre class="example">(%i1) load (graphs)$
(%i2) net : create_graph(
    [0,1,2,3,4,5],
    [
     [[0,1], 3], [[0,2], 2],
     [[1,3], 1], [[1,4], 3],
     [[2,3], 2], [[2,4], 2],
     [[4,5], 2], [[3,5], 2]
    ],
    directed=true
    )$
(%i3) draw_graph(
    net,
    show_weight=true,
    vertex_size=0,
    show_vertices=[0,5],
    show_vertex_type=filled_square,
    head_length=0.2,
    head_angle=10,
    edge_color=&quot;dark-green&quot;,
    text_color=blue
    )$
</pre>
<p><div class="image"><img src="./../figures/graphs12.gif" alt="../figures/graphs12"></div>
</p>
<p>Example 5:
</p>
<pre class="example">(%i1) load(graphs)$
(%i2) g: petersen_graph(20, 2);
(%o2)                         GRAPH
(%i3) draw_graph(g, redraw=true, program=planar_embedding);
(%o3)                         done
</pre>
<p><div class="image"><img src="./../figures/graphs14.gif" alt="../figures/graphs14"></div>
</p>
<p>Example 6:
</p>
<pre class="example">(%i1) load(graphs)$
(%i2) t: tutte_graph();
(%o2)                         GRAPH
(%i3) draw_graph(t, redraw=true, 
                    fixed_vertices=[1,2,3,4,5,6,7,8,9]);
(%o3)                         done
</pre>
<p><div class="image"><img src="./../figures/graphs15.gif" alt="../figures/graphs15"></div>
</p>
</dd></dl>

<dl>
<dt><u>Option variable:</u> <b>draw_graph_program</b>
<a name="IDX2317"></a>
</dt>
<dd><p>Default value: <var>spring_embedding</var>
</p>
<p>The default value for the program used to position vertices in
<code>draw_graph</code> program.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_id</b>
<a name="IDX2318"></a>
</dt>
<dd><p>Default value: <var>false</var>
</p>
<p>If <var>true</var> then ids of the vertices are displayed.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_label</b>
<a name="IDX2319"></a>
</dt>
<dd><p>Default value: <var>false</var>
</p>
<p>If <var>true</var> then labels of the vertices are displayed.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>label_alignment</b>
<a name="IDX2320"></a>
</dt>
<dd><p>Default value: <var>center</var>
</p>
<p>Determines how to align the labels/ids of the vertices. Can
be <code>left</code>, <code>center</code> or <code>right</code>.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_weight</b>
<a name="IDX2321"></a>
</dt>
<dd><p>Default value: <var>false</var>
</p>
<p>If <var>true</var> then weights of the edges are displayed.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>vertex_type</b>
<a name="IDX2322"></a>
</dt>
<dd><p>Default value: <var>circle</var>
</p>
<p>Defines how vertices are displayed. See the <var>point_type</var> option for
the <code>draw</code> package for possible values.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>vertex_size</b>
<a name="IDX2323"></a>
</dt>
<dd><p>The size of vertices.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>vertex_color</b>
<a name="IDX2324"></a>
</dt>
<dd><p>The color used for displaying vertices.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_vertices</b>
<a name="IDX2325"></a>
</dt>
<dd><p>Default value: []
</p>
<p>Display selected vertices in the using a different color.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_vertex_type</b>
<a name="IDX2326"></a>
</dt>
<dd><p>Defines how vertices specified in <var>show_vertices</var> are displayed.
See the <var>point_type</var> option for the <code>draw</code> package for possible
values.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_vertex_size</b>
<a name="IDX2327"></a>
</dt>
<dd><p>The size of vertices in <var>show_vertices</var>.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_vertex_color</b>
<a name="IDX2328"></a>
</dt>
<dd><p>The color used for displaying vertices in the <var>show_vertices</var> list.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>vertex_partition</b>
<a name="IDX2329"></a>
</dt>
<dd><p>Default value: []
</p>
<p>A partition <code>[[v1,v2,...],...,[vk,...,vn]]</code> of the vertices of the
graph. The vertices of each list in the partition will be drawn in a
different color.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>vertex_coloring</b>
<a name="IDX2330"></a>
</dt>
<dd><p>Specifies coloring of the vertices. The coloring <var>col</var> must be
specified in the format as returned by <var>vertex_coloring</var>.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>edge_color</b>
<a name="IDX2331"></a>
</dt>
<dd><p>The color used for displaying edges.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>edge_width</b>
<a name="IDX2332"></a>
</dt>
<dd><p>The width of edges.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>edge_type</b>
<a name="IDX2333"></a>
</dt>
<dd><p>Defines how edges are displayed. See the <var>line_type</var> option for the
<code>draw</code> package.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_edges</b>
<a name="IDX2334"></a>
</dt>
<dd><p>Display edges specified in the list <var>e_list</var> using a different
color.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_edge_color</b>
<a name="IDX2335"></a>
</dt>
<dd><p>The color used for displaying edges in the <var>show_edges</var> list.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_edge_width</b>
<a name="IDX2336"></a>
</dt>
<dd><p>The width of edges in <var>show_edges</var>.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>show_edge_type</b>
<a name="IDX2337"></a>
</dt>
<dd><p>Defines how edges in <var>show_edges</var> are displayed. See the
<var>line_type</var> option for the <code>draw</code> package.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>edge_partition</b>
<a name="IDX2338"></a>
</dt>
<dd><p>A partition <code>[[e1,e2,...],...,[ek,...,em]]</code> of edges of the
graph. The edges of each list in the partition will be drawn using a
different color.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>edge_coloring</b>
<a name="IDX2339"></a>
</dt>
<dd><p>The coloring of edges. The coloring must be specified in the
format as returned by the function <var>edge_coloring</var>.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>redraw</b>
<a name="IDX2340"></a>
</dt>
<dd><p>Default value: <var>false</var>
</p>
<p>If <code>true</code>, vertex positions are recomputed even if the positions
have been saved from a previous drawing of the graph.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>head_angle</b>
<a name="IDX2341"></a>
</dt>
<dd><p>Default value: 15
</p>
<p>The angle for the arrows displayed on arcs (in directed graphs).
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>head_length</b>
<a name="IDX2342"></a>
</dt>
<dd><p>Default value: 0.1
</p>
<p>The length for the arrows displayed on arcs (in directed graphs).
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>spring_embedding_depth</b>
<a name="IDX2343"></a>
</dt>
<dd><p>Default value: 50
</p>
<p>The number of iterations in the spring embedding graph drawing
algorithm.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>terminal</b>
<a name="IDX2344"></a>
</dt>
<dd><p>The terminal used for drawing (see the <var>terminal</var> option in the
<code>draw</code> package).
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>file_name</b>
<a name="IDX2345"></a>
</dt>
<dd><p>The filename of the drawing if terminal is not screen.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>program</b>
<a name="IDX2346"></a>
</dt>
<dd><p>Defines the program used for positioning vertices of the graph. Can be
one of the graphviz programs (dot, neato, twopi, circ, fdp),
<var>circular</var>, <var>spring_embedding</var> or
<var>planar_embedding</var>. <var>planar_embedding</var> is only available for
2-connected planar graphs. When <code>program=spring_embedding</code>, a set
of vertices with fixed position can be specified with the
<var>fixed_vertices</var> option.
</p>
</dd></dl>

<dl>
<dt><u>draw_graph option:</u> <b>fixed_vertices</b>
<a name="IDX2347"></a>
</dt>
<dd><p>Specifies a list of vertices which will have positions fixed along a regular polygon.
Can be used when <code>program=spring_embedding</code>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertices_to_path</b><i> (<var>v_list</var>)</i>
<a name="IDX2348"></a>
</dt>
<dd><p>Converts a list <var>v_list</var> of vertices to a list of edges of the path
defined by <var>v_list</var>.
</p>
</dd></dl>

<dl>
<dt><u>Function:</u> <b>vertices_to_cycle</b><i> (<var>v_list</var>)</i>
<a name="IDX2349"></a>
</dt>
<dd><p>Converts a list <var>v_list</var> of vertices to a list of edges of the cycle
defined by <var>v_list</var>.
</p>
</dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC288" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_51.html#SEC296" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>Dezember, 10 2012</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
