<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Dezember, 10 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 15. Summen, Produkte und Reihen</title>

<meta name="description" content="Maxima Manual: 15. Summen, Produkte und Reihen">
<meta name="keywords" content="Maxima Manual: 15. Summen, Produkte und Reihen">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Summen-Produkte-und-Reihen"></a>
<a name="SEC99"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_14.html#SEC98" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC100" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_14.html#SEC92" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC105" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 15. Summen, Produkte und Reihen </h1>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC100">15.1 Summen und Produkte</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC101">15.2 Einf&uuml;hrung in Reihen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC102">15.3 Funktionen und Variablen f&uuml;r Reihen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC103">15.4 Poisson Reihen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC104">15.5 Kettenbr&uuml;che</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Summen-und-Produkte"></a>
<a name="SEC100"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC99" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC101" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC99" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC99" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC105" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 15.1 Summen und Produkte </h2>

<p><a name="bashindices"></a>
</p><dl>
<dt><u>Funktion:</u> <b>bashindices</b><i> (<var>expr</var>)</i>
<a name="IDX673"></a>
</dt>
<dd><p>Transformiert einen Ausdruck <var>expr</var>, der mehrere Summen oder Produkte
enth&auml;lt so, dass alle Summen und Produkte einen unterschiedlichen Index haben.
Dies erleichtert zum Beispiel Substitutionen mit der Funktion
<code><a href="maxima_16.html#changevar">changevar</a></code>.
  Die neuen Indizes werden mit <code>j<var>nummer</var></code>
bezeichnet, wobei die Zahl <var>nummer</var> der Wert der Optionsvariablen
<code><a href="#gensumnum">gensumnum</a></code>
 ist.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) sum(1/k^2,k,0,inf)+sum(1/k,k,0,inf);
                       inf       inf
                       ====      ====
                       \     1   \     1
(%o1)                   &gt;    - +  &gt;    --
                       /     k   /      2
                       ====      ====  k
                       k = 0     k = 0
(%i2) bashindices(%);
                     inf         inf
                     ====        ====
                     \      1    \       1
(%o2)                 &gt;     -- +  &gt;     ---
                     /      j2   /        2
                     ====        ====   j1
                     j2 = 0      j1 = 0
</pre></dd></dl>

<p><a name="cauchysum"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>cauchysum</b>
<a name="IDX674"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Werden zwei Reihen miteinander multipliziert und die Optionsvariablen
<code><a href="#sumexpand">sumexpand</a></code>
 sowie <code>cauchysum</code> haben beide den Wert <code>true</code>, dann 
wird die Cauchy-Produktformel angewendet.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) sumexpand: false$
(%i2) cauchysum: false$
(%i3) s: sum (f(i), i, 0, inf) * sum (g(j), j, 0, inf);
                      inf         inf
                      ====        ====
                      \           \
(%o3)                ( &gt;    f(i))  &gt;    g(j)
                      /           /
                      ====        ====
                      i = 0       j = 0
(%i4) sumexpand: true$
(%i5) cauchysum: true$
(%i6) ''s;
                 inf     i1
                 ====   ====
                 \      \
(%o6)             &gt;      &gt;     g(i1 - i2) f(i2)
                 /      /
                 ====   ====
                 i1 = 0 i2 = 0
</pre></dd></dl>

<p><a name="genindex"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>genindex</b>
<a name="IDX675"></a>
</dt>
<dd><p>Standardwert: <code>i</code>
</p>
<p><code>genindex</code> enth&auml;lt das Zeichen f&uuml;r den Pr&auml;fix, der verwendet wird, um
einen neuen Index f&uuml;r eine Summe oder ein Produkt zu generieren.  Siehe auch
<code><a href="#gensumnum">gensumnum</a></code>.
</p>
</dd></dl>

<p><a name="gensumnum"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>gensumnum</b>
<a name="IDX676"></a>
</dt>
<dd><p>Standardwert: 0
</p>
<p><code>gensumnum</code> enth&auml;lt die Nummer, die an den Pr&auml;fix <code>genindex</code>
angeh&auml;ngt wird, um den n&auml;chsten Index f&uuml;r eine Summe oder ein Produkt zu 
generieren.  Hat <code>gensumnum</code> den Wert <code>false</code>, wird der Index nur aus 
dem Zeichen <code>genindex</code> gebildet.  Siehe auch <code><a href="#genindex">genindex</a></code>.
</p>
</dd></dl>

<p><a name="intosum"></a>
</p><dl>
<dt><u>Funktion:</u> <b>intosum</b><i> (<var>expr</var>)</i>
<a name="IDX677"></a>
</dt>
<dd><p>Multipliziert Faktoren in eine Summe herein.  Tritt der Index der Summe als ein
Faktor au&szlig;erhalb der Summe auf, wird von der Funktion <code>intosum</code> ein 
neuer Index gebildet.  Summen haben die Eigenschaft <code><a href="maxima_9.html#outative">outative</a></code>,
 so dass 
Faktoren bei der Vereinfachung aus der Summe herausgezogen werden.  Mit der
Funktion <code>intosum</code> wird diese Vereinfachung r&uuml;ckg&auml;ngig gemacht.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) sum(2*x^2*n^k, k , 0, inf);
                               inf
                               ====
                             2 \      k
(%o1)                     2 x   &gt;    n
                               /
                               ====
                               k = 0
(%i2) intosum(%);
                          inf
                          ====
                          \        k  2
(%o2)                      &gt;    2 n  x
                          /
                          ====
                          k = 0
</pre></dd></dl>

<p><a name="lsum"></a>
</p><dl>
<dt><u>Funktion:</u> <b>lsum</b><i> (<var>expr</var>, <var>i</var>, <var>L</var>)</i>
<a name="IDX678"></a>
</dt>
<dd><p>Bildet die Summe f&uuml;r den Ausdruck <var>expr</var> zum Index <var>i</var> f&uuml;r alle 
Elemente der Liste <var>L</var>.  Kann das Argument <var>L</var> nicht zu einer Liste 
ausgewertet werden, wird eine Substantivform zur&uuml;ckgegeben.  Siehe auch
<code><a href="#sum">sum</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) lsum (x^i, i, [1, 2, 7]);
                            7    2
(%o1)                      x  + x  + x
(%i2) lsum (i^2, i, rootsof (x^3 - 1));
                     ====
                     \      2
(%o2)                 &gt;    i
                     /
                     ====
                                   3
                     i in rootsof(x  - 1)
</pre></dd></dl>

<p><a name="niceindices"></a>
</p><dl>
<dt><u>Funktion:</u> <b>niceindices</b><i> (<var>expr</var>)</i>
<a name="IDX679"></a>
</dt>
<dd><p>Gibt den Indizes von Summen und Produkten im Ausdruck <var>expr</var> einen neuen
Namen.  <code>niceindices</code> benennt die Indizes nacheinander mit den Namen, die
in der Liste der Optionsvariablen <code><a href="#niceindicespref">niceindicespref</a></code>
 enthalten sind.  Die 
Standardnamen sind <code>[i, j, k, l, m, n]</code>.  Sind nicht gen&uuml;gend Namen in 
der Liste vorhanden, werden weitere Indizes durch das Anh&auml;ngen einer Nummer
gebildet.
</p>
<p><code>niceindices</code> wertet das Argument aus.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) product (sum (f (foo + i*j*bar), foo, 1, inf), bar, 1, inf);
                 inf    inf
                /===\   ====
                 ! !    \
(%o1)            ! !     &gt;      f(bar i j + foo)
                 ! !    /
                bar = 1 ====
                        foo = 1
(%i2) niceindices (%);
                     inf  inf
                    /===\ ====
                     ! !  \
(%o2)                ! !   &gt;    f(i j l + k)
                     ! !  /
                    l = 1 ====
                          k = 1
</pre></dd></dl>

<p><a name="niceindicespref"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>niceindicespref</b>
<a name="IDX680"></a>
</dt>
<dd><p>Standardwert: <code>[i, j, k, l, m, n]</code>
</p>
<p><code>niceindicespref</code> ist die Liste mit den Namen, die die Funktion 
<code><a href="#niceindices">niceindices</a></code>
 nutzt, um die Indizes von Summen und Produkte umzubenennen.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) niceindicespref: [p, q, r, s, t, u]$
(%i2) product (sum (f (foo + i*j*bar), foo, 1, inf), bar, 1, inf);
                 inf    inf
                /===\   ====
                 ! !    \
(%o2)            ! !     &gt;      f(bar i j + foo)
                 ! !    /
                bar = 1 ====
                        foo = 1
(%i3) niceindices (%);
                     inf  inf
                    /===\ ====
                     ! !  \
(%o3)                ! !   &gt;    f(i j q + p)
                     ! !  /
                    q = 1 ====
                          p = 1
</pre></dd></dl>

<p><a name="nusum"></a>
</p><dl>
<dt><u>Funktion:</u> <b>nusum</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX681"></a>
</dt>
<dd><p>Wendet den Gosper-Algorithmus der unbestimmten Summation f&uuml;r den Ausdruck 
<var>expr</var> und dem Index <var>i</var> an.  Der Index <var>i</var> l&auml;uft von <var>i_0</var> 
bis <var>i_1</var>.  Der Ausdruck <var>expr</var> und das Ergebnis der Summation m&uuml;ssen 
als Produkte von ganzzahligen Exponentiationen, Fakult&auml;ten, Binomialen und
rationalen Funktionen darstellbar sein.
</p>
<p>Die Funktionen <code>nusum</code> und <code>unsum</code> wenden einige Regeln f&uuml;r die
Vereinfachung von Summen und Differenzen von endlichen Produkten an.  Siehe 
auch <code><a href="#unsum">unsum</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) nusum (n*n!, n, 0, n);

Dependent equations eliminated:  (1)
(%o1)                     (n + 1)! - 1
(%i2) nusum (n^4*4^n/binomial(2*n,n), n, 0, n);
                     4        3       2              n
      2 (n + 1) (63 n  + 112 n  + 18 n  - 22 n + 3) 4      2
(%o2) ------------------------------------------------ - ------
                    693 binomial(2 n, n)                 3 11 7
(%i3) unsum (%, n);
                              4  n
                             n  4
(%o3)                   ----------------
                        binomial(2 n, n)
(%i4) unsum (prod (i^2, i, 1, n), n);
                    n - 1
                    /===\
                     ! !   2
(%o4)              ( ! !  i ) (n - 1) (n + 1)
                     ! !
                    i = 1
(%i5) nusum (%, n, 1, n);

Dependent equations eliminated:  (2 3)
                            n
                          /===\
                           ! !   2
(%o5)                      ! !  i  - 1
                           ! !
                          i = 1
</pre></dd></dl>

<p><a name="product"></a>
</p><dl>
<dt><u>Funktion:</u> <b>product</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX682"></a>
</dt>
<dd><p>Bildet das Produkt des Ausdrucks <var>expr</var> zum Index <var>i</var> in den Grenzen
<var>i_0</var> bis <var>i_1</var>.  <code>product</code> wertet <var>expr</var> sowie die untere 
Grenze <var>i_0</var> und obere Grenze <var>i_1</var> aus.  Der Index <var>i</var> wird nicht 
ausgewertet.
</p>
<p>Ist die Differenz der oberen und unteren Grenze eine ganze Zahl, wird <var>expr</var>
f&uuml;r jeden Wert des Index <var>i</var> ausgewertet.  Das Ergebnis ist ein explizites
Produkt.  Andernfalls ist der Bereich des Index unbestimmt.  Maxima wendet 
einige einfache Regeln an, um das Produkt zu vereinfachen.  Hat die 
Optionsvariable <code><a href="#simpproduct">simpproduct</a></code>
 den Wert <code>true</code>, wendet Maxima weitere 
Regeln an, um Produkte zu vereinfachen.
</p>
<p>Siehe auch <code><a href="maxima_8.html#nouns">nouns</a></code>
 und <code><a href="maxima_8.html#evflag">evflag</a></code>
 f&uuml;r die Auswertung von Ausdr&uuml;cken,
die die Substantivform eines Produktes enthalten.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) product (x + i*(i+1)/2, i, 1, 4);
(%o1)           (x + 1) (x + 3) (x + 6) (x + 10)
(%i2) product (i^2, i, 1, 7);
(%o2)                       25401600
(%i3) product (a[i], i, 1, 7);
(%o3)                 a  a  a  a  a  a  a
                       1  2  3  4  5  6  7
(%i4) product (a(i), i, 1, 7);
(%o4)          a(1) a(2) a(3) a(4) a(5) a(6) a(7)
(%i5) product (a(i), i, 1, n);
                             n
                           /===\
                            ! !
(%o5)                       ! !  a(i)
                            ! !
                           i = 1
(%i6) product (k, k, 1, n);
                               n
                             /===\
                              ! !
(%o6)                         ! !  k
                              ! !
                             k = 1
(%i7) product (k, k, 1, n), simpproduct;
(%o7)                          n!
(%i8) product (integrate (x^k, x, 0, 1), k, 1, n);
                             n
                           /===\
                            ! !    1
(%o8)                       ! !  -----
                            ! !  k + 1
                           k = 1
(%i9) product (if k &lt;= 5 then a^k else b^k, k, 1, 10);
                              15  40
(%o9)                        a   b
</pre></dd></dl>

<p><a name="simpproduct"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>simpproduct</b>
<a name="IDX683"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>simpproduct</code> den Wert <code>true</code>, versucht Maxima ein Produkt weiter 
zu vereinfachen.  Die Vereinfachung kann eine geschlossene Form liefern.  Hat
<code>simpproduct</code> den Wert <code>false</code> oder wird das Produkt als
Substantivform <code>'product</code> definiert, werden nur einige einfache Regeln von
Maxima f&uuml;r die Vereinfachung angewendet.  <code>simpproduct</code> ist auch ein
Auswertungsschalter.  Siehe <code><a href="maxima_8.html#evflag">evflag</a></code>.
</p>

<p>Siehe auch <code><a href="#product">product</a></code>
 f&uuml;r ein Beispiel.
</p>
</dd></dl>

<p><a name="simpsum"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>simpsum</b>
<a name="IDX684"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>simpsum</code> den Wert <code>true</code>, versucht Maxima eine Summe oder Reihe 
weiter zu vereinfachen.  Die Vereinfachung kann eine geschlossene Form liefern.
Hat <code>simpsum</code> den Wert <code>false</code> oder die Summe oder Reihe liegt als
Substantivform <code>'sum</code> vor, werden nur einige einfache Regeln von Maxima 
f&uuml;r die Vereinfachung angewendet.  <code>simpsum</code> ist auch ein
Auswertungsschalter.  Siehe <code><a href="maxima_8.html#evflag">evflag</a></code>.
</p>

<p>Siehe auch <code><a href="#sum">sum</a></code>
 f&uuml;r ein Beispiel.
</p>
</dd></dl>

<p><a name="sum"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sum</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX685"></a>
</dt>
<dd><p>Bildet die Summe des Ausdrucks <var>expr</var> zum Index <var>i</var> in den Grenzen
<var>i_0</var> bis <var>i_1</var>.  Die Funktion <code>sum</code> wertet <var>expr</var> sowie die 
untere Grenze <var>i_0</var> und obere Grenze <var>i_1</var> aus.  Der Index <var>i</var> wird 
nicht ausgewertet.
</p>
<p>Ist die Differenz der oberen und unteren Grenze eine ganze Zahl, wird <var>expr</var>
f&uuml;r jeden Wert des Index <var>i</var> ausgewertet.  Das Ergebnis ist eine explizite
Summe.  Andernfalls ist der Bereich des Index unbestimmt.  Maxima wendet einige 
einfache Regeln an, um die Summe zu vereinfachen.  Hat die Optionsvariable 
<code><a href="#simpsum">simpsum</a></code>
 den Wert <code>true</code>, wendet Maxima weitere Regeln an, um Summen
zu vereinfachen.
</p>
<p>Werden zwei unendliche Reihen miteinander multipliziert und die Optionsvariablen
<code><a href="#sumexpand">sumexpand</a></code>
 sowie <code><a href="#cauchysum">cauchysum</a></code>
 haben beide den Wert <code>true</code>, dann 
wird die Cauchy-Produktformel angewendet.
</p>
<p>Die Optionsvariable <code><a href="#genindex">genindex</a></code>
 enth&auml;lt das Zeichen, das der Pr&auml;fix 
eines automatisch generierten Index ist.  <code><a href="#gensumnum">gensumnum</a></code>
 enth&auml;lt eine ganze 
Zahl, die an den Pr&auml;fix <code>genindex</code> angeh&auml;ngt wird, um einen 
automatischen Index zu generieren.  <code>gensumnum</code> wird von Maxima automatisch
erh&ouml;ht.  Hat <code>gensumnum</code> den Wert <code>false</code>, wird keine Zahl an den 
Pr&auml;fix angeh&auml;ngt.
</p>
<p>Das Paket <code>simplify_sum</code> enth&auml;lt die Funktion 
<code><a href="maxima_70.html#simplify_005fsum">simplify_sum</a></code>,
 mit der Summen zu einer geschlossenen Form vereinfacht
werden k&ouml;nnen.
</p>
<p>Siehe auch <code><a href="#sumcontract">sumcontract</a></code>,
  <code><a href="#sumexpand">sumexpand</a></code>,

<code><a href="#intosum">intosum</a></code>,
 <code><a href="#bashindices">bashindices</a></code>,
 <code><a href="#niceindices">niceindices</a></code>,

<code><a href="#cauchysum">cauchysum</a></code>
 und <code><a href="maxima_77.html#SEC400">zeilberger</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) sum (i^2, i, 1, 7);
(%o1)                          140
(%i2) sum (a[i], i, 1, 7);
(%o2)           a  + a  + a  + a  + a  + a  + a
                 7    6    5    4    3    2    1
(%i3) sum (a(i), i, 1, 7);
(%o3)    a(7) + a(6) + a(5) + a(4) + a(3) + a(2) + a(1)
(%i4) sum (a(i), i, 1, n);
                            n
                           ====
                           \
(%o4)                       &gt;    a(i)
                           /
                           ====
                           i = 1
(%i5) sum (2^i + i^2, i, 0, n);
                          n
                         ====
                         \       i    2
(%o5)                     &gt;    (2  + i )
                         /
                         ====
                         i = 0
(%i6) sum (2^i + i^2, i, 0, n), simpsum;
                              3      2
                   n + 1   2 n  + 3 n  + n
(%o6)             2      + --------------- - 1
                                  6
(%i7) sum (1/3^i, i, 1, inf);
                            inf
                            ====
                            \     1
(%o7)                        &gt;    --
                            /      i
                            ====  3
                            i = 1
(%i8) sum (1/3^i, i, 1, inf), simpsum;
                                1
(%o8)                           -
                                2
(%i9) sum (i^2, i, 1, 4) * sum (1/i^2, i, 1, inf);
                              inf
                              ====
                              \     1
(%o9)                      30  &gt;    --
                              /      2
                              ====  i
                              i = 1
(%i10) sum (i^2, i, 1, 4) * sum (1/i^2, i, 1, inf), simpsum;
                                  2
(%o10)                       5 %pi
(%i11) sum (integrate (x^k, x, 0, 1), k, 1, n);
                            n
                           ====
                           \       1
(%o11)                      &gt;    -----
                           /     k + 1
                           ====
                           k = 1
(%i12) sum (if k &lt;= 5 then a^k else b^k, k, 1, 10);
          10    9    8    7    6    5    4    3    2
(%o12)   b   + b  + b  + b  + b  + a  + a  + a  + a  + a
</pre></dd></dl>

<p><a name="sumcontract"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sumcontract</b><i> (<var>expr</var>)</i>
<a name="IDX686"></a>
</dt>
<dd><p>Fasst alle Summen in dem Ausdruck <var>expr</var> zusammen, die sich in ihrem oberen
und unterem Index nur um eine Konstante voneinander unterscheiden.  Das Ergebnis
ist eine Ausdruck mit einer Summe, f&uuml;r die Summen, die zusammengefasst werden 
k&ouml;nnen und weiteren Termen, die hinzu addiert werden m&uuml;ssen, um einen
&auml;quivalenten Ausdruck zu erhalten.
</p>
<p>Es kann notwendig sein zun&auml;chst das Kommando <code>intosum(<var>expr</var>)</code> 
auszuf&uuml;hren.  Siehe <code><a href="#intosum">intosum</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) 'sum(1/l,l,1,n)+'sum(k,k,1,n+2);
                         n        n + 2
                        ====      ====
                        \     1   \
(%o1)                    &gt;    - +  &gt;    k
                        /     l   /
                        ====      ====
                        l = 1     k = 1
(%i2) sumcontract(%);
                            n
                           ====
                           \          1
(%o2)                2 n +  &gt;    (l + -) + 3
                           /          l
                           ====
                           l = 1
</pre></dd></dl>

<p><a name="sumexpand"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>sumexpand</b>
<a name="IDX687"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>sumexpand</code> den Wert <code>true</code>, werden Produkte
von Summen und Potenzen von Summen zu verschachtelten Summen vereinfacht.  Siehe
auch <code><a href="#cauchysum">cauchysum</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) sumexpand: true$
(%i2) sum (f (i), i, 0, m) * sum (g (j), j, 0, n);
                     m      n
                    ====   ====
                    \      \
(%o2)                &gt;      &gt;     f(i1) g(i2)
                    /      /
                    ====   ====
                    i1 = 0 i2 = 0
(%i3) sum (f (i), i, 0, m)^2;
                     m      m
                    ====   ====
                    \      \
(%o3)                &gt;      &gt;     f(i3) f(i4)
                    /      /
                    ====   ====
                    i3 = 0 i4 = 0
</pre></dd></dl>

<p><a name="unsum"></a>
</p><dl>
<dt><u>Funktion:</u> <b>unsum</b><i> (<var>f</var>, <var>n</var>)</i>
<a name="IDX688"></a>
</dt>
<dd><p>Gibt die erste R&uuml;ckw&auml;rtsdifferenz <code><var>f</var>(<var>n</var>) - 
<var>f</var>(<var>n</var>-1)</code> zur&uuml;ck.  Siehe auch <code><a href="#nusum">nusum</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) g(p) := p*4^n/binomial(2*n,n);
                                     n
                                  p 4
(%o1)               g(p) := ----------------
                            binomial(2 n, n)
(%i2) g(n^4);
                              4  n
                             n  4
(%o2)                   ----------------
                        binomial(2 n, n)
(%i3) nusum (%, n, 0, n);
                     4        3       2              n
      2 (n + 1) (63 n  + 112 n  + 18 n  - 22 n + 3) 4      2
(%o3) ------------------------------------------------ - ------
                    693 binomial(2 n, n)                 3 11 7
(%i4) unsum (%, n);
                              4  n
                             n  4
(%o4)                   ----------------
                        binomial(2 n, n)
</pre></dd></dl>

<hr size="6">
<a name="Einf_00fchrung-in-Reihen"></a>
<a name="SEC101"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC100" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC102" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC99" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC99" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC105" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 15.2 Einf&uuml;hrung in Reihen </h2>

<p>Maxima kennt die Funktionen <code><a href="#taylor">taylor</a></code>
 und <code><a href="#powerseries">powerseries</a></code>,
 um die 
Reihenentwicklung von differenzierbaren Funktionen zu finden.  Maxima hat
weiterhin Funktionen wie <code><a href="#nusum">nusum</a></code>,
 um geschlossene Formen von Reihen zu
finden.  Operationen wie die Addition und Multiplikation arbeiten wie gewohnt
f&uuml;r Reihen.  Das folgende Kapitel beschreibt die Variablen und Funktionen
f&uuml;r eine Reihenentwicklung.
</p>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Reihen"></a>
<a name="SEC102"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC101" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC103" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC99" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC99" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC105" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 15.3 Funktionen und Variablen f&uuml;r Reihen </h2>

<p><a name="deftaylor"></a>
</p><dl>
<dt><u>Funktion:</u> <b>deftaylor</b><i> (<var>f_1</var>(<var>x_1</var>), <var>expr_1</var>, &hellip;, <var>f_n</var>(<var>x_n</var>), <var>expr_n</var>)</i>
<a name="IDX689"></a>
</dt>
<dd><p>F&uuml;r eine Funktion <var>f_i</var> einer Variablen <var>x_i</var> definiert 
<code>deftaylor</code> den Ausdruck <var>expr_i</var> als die Taylorreihe um den Nullpunkt.
<var>expr_i</var> ist typischerweise ein Polynom in der Variablen <var>x_i</var> oder eine
Summe.  <code>deftaylor</code> akzeptiert aber auch allgemeinere Ausdr&uuml;cke.
</p>
<p><code>powerseries(<var>f_i</var>(<var>x_i</var>), <var>x_i</var>, 0)</code> gibt die Reihe zur&uuml;ck, 
die mit <code>deftaylor</code> definiert wurde.
</p>
<p><code>deftaylor</code> gibt eine Liste der Funktionen <var>f_1</var>, &hellip;, <var>f_n</var> 
zur&uuml;ck.  <code>deftaylor</code> wertet die Argumente aus.
</p>
<p>Siehe auch <code><a href="#taylor">taylor</a></code>
 und <code><a href="#powerseries">powerseries</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) deftaylor (f(x), x^2 + sum(x^i/(2^i*i!^2), i, 4, inf));
(%o1)                          [f]
(%i2) powerseries (f(x), x, 0);
                      inf
                      ====      i1
                      \        x         2
(%o2)                  &gt;     -------- + x
                      /       i1    2
                      ====   2   i1!
                      i1 = 4
(%i3) taylor (exp (sqrt (f(x))), x, 0, 4);
                      2         3          4
                     x    3073 x    12817 x
(%o3)/T/     1 + x + -- + ------- + -------- + . . .
                     2     18432     307200
</pre></dd></dl>

<p><a name="maxtayorder"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>maxtayorder</b>
<a name="IDX690"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>maxtayorder</code> den Wert <code>true</code>, werden bei der algebraischen
Manipulation von Taylor-Reihen, von der Funktion <code><a href="#taylor">taylor</a></code>
 so viele
Terme wie m&ouml;glich mitgef&uuml;hrt.
</p></dd></dl>

<p><a name="pade"></a>
</p><dl>
<dt><u>Funktion:</u> <b>pade</b><i> (<var>taylor_series</var>, <var>numer_deg_bound</var>, <var>denom_deg_bound</var>)</i>
<a name="IDX691"></a>
</dt>
<dd><p>Gibt eine Liste aller rationalen Funktionen zur&uuml;ck, die die angegebene
Taylor-Reihenentwicklung haben und deren Summe des Nennergrads und des
Z&auml;hlergrads kleiner oder gleich des Grads der Reihenentwicklung ist.
</p>
<p>Das Argument <var>taylor_series</var> ist eine Taylor-Reihe in einer Variablen.
Die Argumente <var>numer_deg_bound</var> und <var>denom_deg_bound</var> sind positive
ganze Zahlen, die eine Grenze f&uuml;r den Nennergrad und den Z&auml;hlergrad der
rationalen Funktion angeben.
</p>
<p>Die Taylor-Reihe kann auch eine Laurent-Reihe sein und die Grenzen f&uuml;r den 
Grad k&ouml;nnen <code>inf</code> sein.
</p>
<p>Siehe auch <code><a href="#taylor">taylor</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) taylor (1 + x + x^2 + x^3, x, 0, 3);
                              2    3
(%o1)/T/             1 + x + x  + x  + . . .
(%i2) pade (%, 1, 1);
                                 1
(%o2)                       [- -----]
                               x - 1
(%i3) t: taylor(-(83787*x^10 - 45552*x^9 - 187296*x^8
                   + 387072*x^7 + 86016*x^6 - 1507328*x^5
                   + 1966080*x^4 + 4194304*x^3 - 25165824*x^2
                   + 67108864*x - 134217728)
         /134217728, x, 0, 10);
                    2    3       4       5       6        7
             x   3 x    x    15 x    23 x    21 x    189 x
(%o3)/T/ 1 - - + ---- - -- - ----- + ----- - ----- - ------
             2    16    32   1024    2048    32768   65536

                                  8         9          10
                            5853 x    2847 x    83787 x
                          + ------- + ------- - --------- + . . .
                            4194304   8388608   134217728
(%i4) pade (t, 4, 4);
(%o4)                          []
</pre>
<p>Es gibt keine rationale Funktion des Grads 4 im Z&auml;hler und Nenner f&uuml;r die
oben angegebene Taylor-Reihenentwicklung.  Die Summe des Z&auml;hlergrads und des 
Nennergrads m&uuml;ssen mindestens gleich dem Grad der Reihenentwicklung sein.
In diesem Fall ist der Grad der Taylor-Reihenentwicklung <code>10</code>.
</p>
<pre class="example">(%i5) pade (t, 5, 5);
                     5                4                 3
(%o5) [- (520256329 x  - 96719020632 x  - 489651410240 x

                  2
 - 1619100813312 x  - 2176885157888 x - 2386516803584)

               5                 4                  3
/(47041365435 x  + 381702613848 x  + 1360678489152 x

                  2
 + 2856700692480 x  + 3370143559680 x + 2386516803584)]
</pre></dd></dl>

<p><a name="powerseries"></a>
</p><dl>
<dt><u>Funktion:</u> <b>powerseries</b><i> (<var>expr</var>, <var>x</var>, <var>a</var>)</i>
<a name="IDX692"></a>
</dt>
<dd><p>Gibt eine geschlossene Form f&uuml;r die Reihenentwicklung des Ausdrucks <var>expr</var>
in der Variablen <var>x</var> um den Punkt <var>a</var> zur&uuml;ck.  Das Argument <var>a</var> 
kann die Werte <code>inf</code> oder <code>infinity</code> haben.  Die Reihenentwicklung 
f&uuml;r eine Funktion <code>f(x)</code> hat die allgemeine Form:
</p><pre class="example">                  inf
                  ====
                  \               n
       f(x) =      &gt;    b  (x - a)
                  /      n
                  ====
                  n = 0
</pre>
<p>Mit den Koeffzienten:
</p><pre class="example">                     !
            d        !
            -- (f(x))!
            dn       !
                     !x = a
       b  = ---------------
        n         n!
</pre>
<p>Kann die Funktion <code>powerseries</code> keine Reihenentwicklung f&uuml;r den Ausdruck
<var>expr</var> finden, k&ouml;nnen m&ouml;glicherweise mit der Funktion <code><a href="#taylor">taylor</a></code>
 die
ersten Terme der Reihenentwicklung berechnet werden.
</p>
<p>Hat die Optionsvariable <code><a href="#verbose">verbose</a></code>
 den Wert <code>true</code>, werden Meldungen
zu den verwendeten Algorithmen von der Funktion <code>powerseries</code> angezeigt.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) verbose: true$

(%i2) powerseries (log(sin(x)/x), x, 0);
trigreduce: can't expand                            
                 log(sin(x))

trigreduce: try again after applying the rule:
                                 d
                               / -- (sin(x))
                               [ dx
                 log(sin(x)) = I ----------- dx
                               ]   sin(x)
                               /


powerseries: first simplification returned
                                /
                                [
                     - log(x) + I cot(x) dx
                                ]
                                /

           inf
           ====        i1  - 1 + 2 i1             2 i1
           \      (- 1)   2           bern(2 i1) x
(%o2)       &gt;     ------------------------------------
           /                   i1 (2 i1)!
           ====
           i1 = 1
</pre></dd></dl>

<p><a name="psexpand"></a>
</p><dl>
<dt><u>Option variable:</u> <b>psexpand</b>
<a name="IDX693"></a>
</dt>
<dd><p>Default value: <code>false</code>
</p>

<p>When <code>psexpand</code> is <code>true</code>,
an extended rational function expression is displayed fully expanded.
The switch <code>ratexpand</code> has the same effect.
</p>
<p>When <code>psexpand</code> is <code>false</code>,
a multivariate expression is displayed just as in the rational function package.
</p>
<p>When <code>psexpand</code> is  <code>multi</code>,
then terms with the same total degree in the variables are grouped together.
</p></dd></dl>

<p><a name="revert"></a>
<a name="revert2"></a>
</p><dl>
<dt><u>Funktion:</u> <b>revert</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX694"></a>
</dt>
<dt><u>Funktion:</u> <b>revert2</b><i> (<var>expr</var>, <var>x</var>, <var>n</var>)</i>
<a name="IDX695"></a>
</dt>
<dd><p>Die Funktion <code>revert</code> berechnet eine Taylorreihe in der Variablen <var>x</var>
um den Entwicklungspunkt Null, die der Taylorreihe der inversen Funktion 
entspricht, die von der Taylorreihe <var>expr</var> repr&auml;sentiert wird.  Das
Ergebnis ist ein Polynom in einer CRE-Darstellung mit dem Grad der h&ouml;chsten
Potenz im Ausdruck <var>expr</var>.
</p>
<p>Die Funktion <code>revert2</code> entspricht der Funktion <code>revert</code> mit dem
Unterschied, dass mit dem dritten Argument <var>n</var> der Grad der neuen
Taylorreihe explizit angegeben werden kann.  Dieser kann kleiner oder
gr&ouml;&szlig;er als der Grad der Taylorreihe <var>expr</var> sein.
</p>
<p>Mit dem Kommando <code>load(revert)</code> werden die Funktionen geladen.
</p>
<p>Siehe auch die Funktion <code><a href="#taylor">taylor</a></code>.
</p>

<p>Beispiel:
</p>
<p>Die Inverse der Funktion <code>exp(x) - 1</code> ist die Funktion <code>log(x+1)</code>.
Mit dem Kommando <code>revert(taylor(exp(x) - 1, x, 0, 6), x)</code> wird die
Taylorreihe der Inversen <code>log(x+1)</code> berechnet.
</p>
<pre class="example">(%i1) load (revert)$
(%i2) t: taylor (exp(x) - 1, x, 0, 6);
                   2    3    4    5     6
                  x    x    x    x     x
(%o2)/T/      x + -- + -- + -- + --- + --- + . . .
                  2    6    24   120   720
(%i3) revert (t, x);
               6       5       4       3       2
           10 x  - 12 x  + 15 x  - 20 x  + 30 x  - 60 x
(%o3)/R/ - --------------------------------------------
                                60
(%i4) ratexpand (%);
                     6    5    4    3    2
                    x    x    x    x    x
(%o4)             - -- + -- - -- + -- - -- + x
                    6    5    4    3    2
(%i5) taylor (log(x+1), x, 0, 6);
                    2    3    4    5    6
                   x    x    x    x    x
(%o5)/T/       x - -- + -- - -- + -- - -- + . . .
                   2    3    4    5    6
(%i6) ratsimp (revert (t, x) - taylor (log(x+1), x, 0, 6));
(%o6)                           0
(%i7) revert2 (t, x, 4);
                          4    3    2
                         x    x    x
(%o7)                  - -- + -- - -- + x
                         4    3    2
</pre></dd></dl>

<p><a name="taylor"></a>
</p><dl>
<dt><u>Funktion:</u> <b>taylor</b><i> (<var>expr</var>, <var>x</var>, <var>a</var>, <var>n</var>)</i>
<a name="IDX696"></a>
</dt>
<dt><u>Funktion:</u> <b>taylor</b><i> (<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, &hellip;], <var>a</var>, <var>n</var>)</i>
<a name="IDX697"></a>
</dt>
<dt><u>Funktion:</u> <b>taylor</b><i> (<var>expr</var>, [<var>x</var>, <var>a</var>, <var>n</var>, 'asymp])</i>
<a name="IDX698"></a>
</dt>
<dt><u>Funktion:</u> <b>taylor</b><i> (<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, &hellip;], [<var>a_1</var>, <var>a_2</var>, &hellip;], [<var>n_1</var>, <var>n_2</var>, &hellip;])</i>
<a name="IDX699"></a>
</dt>
<dt><u>Funktion:</u> <b>taylor</b><i> (<var>expr</var>, [<var>x_1</var>, <var>a_1</var>, <var>n_1</var>], [<var>x_2</var>, <var>a_2</var>, <var>n_2</var>], &hellip;)</i>
<a name="IDX700"></a>
</dt>
<dd><p><code>taylor(<var>expr</var>, <var>x</var>, <var>a</var>, <var>n</var>)</code> entwickelt den Ausdruck
<var>expr</var> in eine Taylor- oder Laurent-Reihenwicklung in der Variablen <var>x</var>
um den Punkt <var>a</var>, die die Terme bis zur Ordnung <code>(<var>x</var> - 
<var>a</var>)^<var>n</var></code> enth&auml;lt.
</p>
<p>Hat der Ausdruck <var>expr</var> die Form <code><var>f</var>(<var>x</var>)/<var>g</var>(<var>x</var>)</code>
und hat <code><var>g</var>(<var>x</var>)</code> keine Terme bis zur Ordnung <var>n</var>, dann 
versucht <code>taylor</code> den Ausdruck <code><var>g</var>(<var>x</var>)</code> bis zur Ordnung
<code>2 <var>n</var></code> zu entwickeln.  Treten in der Entwicklung weiterhin keine
von Null verschiedenen Terme auf, verdoppelt <code>taylor</code> die Ordnung der
Entwicklung f&uuml;r <code><var>g</var>(<var>x</var>)</code> so lange, wie die Ordnung kleiner 
oder gleich <code><var>n</var> 2^taylordepth</code> ist.  Siehe auch <code><a href="#taylordepth">taylordepth</a></code>.
</p>

<p><code>taylor(<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], <var>a</var>, <var>n</var>)</code> gibt
die Reihenentwicklung der Ordnung <var>n</var> in allen Variablen <var>x_1</var>,
<var>x_2</var>, &hellip; um den Punkt <var>a</var> zur&uuml;ck.
</p>
<p>Die beiden folgenden &auml;quivalenten Kommandos <code>taylor(<var>expr</var>, 
[<var>x_1</var>, <var>a_1</var>, <var>n_1</var>], [<var>x_2</var>, <var>a_2</var>, <var>n_2</var>], ...)</code> und 
<code>taylor(<var>expr</var>, [<var>x_1</var>, <var>x_2</var>, ...], [<var>a_1</var>, 
<var>a_2</var>, ...], [<var>n_1</var>, <var>n_2</var>, ...])</code> geben eine Reihenentwicklung 
f&uuml;r die Variablen <var>x_1</var>, <var>x_2</var>, &hellip; um den Punkt <code>(<var>a_1</var>,
<var>a_2</var>, ...)</code> mit den Ordnungen <var>n_1</var>, <var>n_2</var>, &hellip; zur&uuml;ck.
</p>
<p><code>taylor(<var>expr</var>, [<var>x</var>, <var>a</var>, <var>n</var>, 'asymp])</code> entwickelt den 
Ausdruck <var>expr</var> in negativen Potenzen von <code><var>x</var> - <var>a</var></code>.  Der
Term mit der gr&ouml;&szlig;ten Ordnung ist <code>(<var>x</var> - <var>a</var>)^<var>-n</var></code>.
</p>
<p>Folgende Optionsvariablen kontrollieren die Berechnung einer Taylorreihe:
</p>
<dl compact="compact">
<dt> <code>maxtayorder</code></dt>
<dd><p>Hat <code><a href="#maxtayorder">maxtayorder</a></code>
 den Wert <code>true</code>, werden bei der algebraischen
Manipulation von Taylor-Reihen, von der Funktion <code>taylor</code> so viele
Terme wie m&ouml;glich mitgef&uuml;hrt.
</p>
</dd>
<dt> <code>taylordepth</code></dt>
<dd><p>Findet <code>taylor</code> keine von Null verschiedenen Terme in der
Reihenentwicklung, wird die Ordnung der Entwicklung solange erh&ouml;ht wie sie
kleiner oder gleich <code>2^taylordepth</code> ist.
</p>
</dd>
<dt> <code>taylor_logexpand</code></dt>
<dd><p>Die Optionsvariable <code><a href="#taylor_005flogexpand">taylor_logexpand</a></code>
 kontrolliert die Entwicklung von
Logarithmusfunktionen, die bei der Reihenentwicklung auftreten.  Der 
Standardwert ist <code>true</code> und die Logarithmusfunktionen in einer 
Reihenentwicklung werden vollst&auml;ndig entwickelt.
</p>
</dd>
<dt> <code>taylor_order_coefficients</code></dt>
<dd><p>Die Optionsvariable <code><a href="#taylor_005forder_005fcoefficients">taylor_order_coefficients</a></code>
 kontrolliert die Anordung
von Termen in einer Reihenentwicklung.  Der Standardwert ist <code>true</code> und
die Anordung entspricht der kanonischen Darstellung eines Ausdrucks.
</p>
</dd>
<dt> <code>taylor_truncate_polynomials</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#taylor_005ftruncate_005fpolynomials">taylor_truncate_polynomials</a></code>
 den Wert
<code>false</code>, wird das Ergebnis der Reihenentwicklung eines Polynoms als exakt
angenommen.
</p>
</dd>
<dt> <code>taylor_simplifier</code></dt>
<dd><p>Die Funktion zur Vereinfachung der Koeffizienten einer Entwicklung ist in der Optionsvariablen <code><a href="#taylor_005fsimplifier">taylor_simplifier</a></code>
 enthalten.  Der Standardwert ist
<code>simplify</code>.  Der Variablen kann eine nutzerdefinierte Funktion zugewiesen
werden.
</p></dd>
</dl>



<p>Mit der Funktion <code><a href="#taylorp">taylorp</a></code>
 kann getestet werden, ob ein Ausdruck eine
Taylorreihe repr&auml;sentiert.  Die Funktion <code><a href="#taylorinfo">taylorinfo</a></code>
 gibt Informationen
zu einer Taylorreihe aus.  Die spezielle CRE-Form einer Taylorreihe wird mit der
Funktion <code><a href="#taytorat">taytorat</a></code>
 in eine Standardform gebracht. 
Mit den Funktionen <code><a href="#revert">revert</a></code>
 und <code><a href="#revert2">revert2</a></code>
 kann die Taylorreihe einer
inversen Funktion berechnet werden.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) taylor (sqrt (sin(x) + a*x + 1), x, 0, 3);
                           2             2
             (a + 1) x   (a  + 2 a + 1) x
(%o1)/T/ 1 + --------- - -----------------
                 2               8

                                   3      2             3
                               (3 a  + 9 a  + 9 a - 1) x
                             + -------------------------- + . . .
                                           48
(%i2) %^2;
                                    3
                                   x
(%o2)/T/           1 + (a + 1) x - -- + . . .
                                   6
(%i3) taylor (sqrt (x + 1), x, 0, 5);
                       2    3      4      5
                  x   x    x    5 x    7 x
(%o3)/T/      1 + - - -- + -- - ---- + ---- + . . .
                  2   8    16   128    256
(%i4) %^2;
(%o4)/T/                  1 + x + . . .
(%i5) product ((1 + x^i)^2.5, i, 1, inf)/(1 + x^2);
                         inf
                        /===\
                         ! !    i     2.5
                         ! !  (x  + 1)
                         ! !
                        i = 1
(%o5)                   -----------------
                              2
                             x  + 1
(%i6) ev (taylor(%, x,  0, 3), keepfloat);
                               2           3
(%o6)/T/    1 + 2.5 x + 3.375 x  + 6.5625 x  + . . .
(%i7) taylor (1/log (x + 1), x, 0, 3);
                               2       3
                 1   1   x    x    19 x
(%o7)/T/         - + - - -- + -- - ----- + . . .
                 x   2   12   24    720
(%i8) taylor (cos(x) - sec(x), x, 0, 5);
                                4
                           2   x
(%o8)/T/                - x  - -- + . . .
                               6
(%i9) taylor ((cos(x) - sec(x))^3, x, 0, 5);
(%o9)/T/                    0 + . . .
(%i10) taylor (1/(cos(x) - sec(x))^3, x, 0, 5);
                                               2          4
            1     1       11      347    6767 x    15377 x
(%o10)/T/ - -- + ---- + ------ - ----- - ------- - --------
             6      4        2   15120   604800    7983360
            x    2 x    120 x

                                                          + . . .
(%i11) taylor (sqrt (1 - k^2*sin(x)^2), x, 0, 6);
               2  2       4      2   4
              k  x    (3 k  - 4 k ) x
(%o11)/T/ 1 - ----- - ----------------
                2            24

                                    6       4       2   6
                               (45 k  - 60 k  + 16 k ) x
                             - -------------------------- + . . .
                                          720
(%i12) taylor ((x + 1)^n, x, 0, 4);
                      2       2     3      2         3
                    (n  - n) x    (n  - 3 n  + 2 n) x
(%o12)/T/ 1 + n x + ----------- + --------------------
                         2                 6

                               4      3       2         4
                             (n  - 6 n  + 11 n  - 6 n) x
                           + ---------------------------- + . . .
                                          24
(%i13) taylor (sin (y + x), x, 0, 3, y, 0, 3);
               3                 2
              y                 y
(%o13)/T/ y - -- + . . . + (1 - -- + . . .) x
              6                 2

                    3                       2
               y   y            2      1   y            3
          + (- - + -- + . . .) x  + (- - + -- + . . .) x  + . . .
               2   12                  6   12
(%i14) taylor (sin (y + x), [x, y], 0, 3);
                     3        2      2      3
                    x  + 3 y x  + 3 y  x + y
(%o14)/T/   y + x - ------------------------- + . . .
                                6
(%i15) taylor (1/sin (y + x), x, 0, 3, y, 0, 3);
          1   y              1    1               1            2
(%o15)/T/ - + - + . . . + (- -- + - + . . .) x + (-- + . . .) x
          y   6               2   6                3
                             y                    y

                                           1            3
                                      + (- -- + . . .) x  + . . .
                                            4
                                           y
(%i16) taylor (1/sin (y + x), [x, y], 0, 3);
                             3         2       2        3
            1     x + y   7 x  + 21 y x  + 21 y  x + 7 y
(%o16)/T/ ----- + ----- + ------------------------------- + . . .
          x + y     6                   360
</pre></dd></dl>

<p><a name="taylordepth"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>taylordepth</b>
<a name="IDX701"></a>
</dt>
<dd><p>Standardwert: 3
</p>
<p>Findet die Funktion <code>taylor</code> keine von Null verschiedenen Terme in der
Reihenentwicklung, wird die Ordnung der Entwicklung solange erh&ouml;ht wie sie
kleiner oder gleich <code>2^taylordepth</code> ist.
</p>
<p>Siehe auch <code><a href="#taylor">taylor</a></code>.
</p>
</dd></dl>

<p><a name="taylorinfo"></a>
</p><dl>
<dt><u>Funktion:</u> <b>taylorinfo</b><i> (<var>expr</var>)</i>
<a name="IDX702"></a>
</dt>
<dd><p>Gibt Informationen &uuml;ber die Taylorreihe <var>expr</var> zur&uuml;ck.  Die R&uuml;ckgabe
ist eine Liste, die Listen mit den Namen der Variablen, den Entwicklungspunkten
und den Ordnungen der Entwicklung enthalten.
</p>
<p>Ist <var>expr</var> keine Taylorreihe, ist die R&uuml;ckgabe <code>false</code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) taylor ((1 - y^2)/(1 - x), x, 0, 3, [y, a, inf]);
                  2                       2
(%o1)/T/ - (y - a)  - 2 a (y - a) + (1 - a )

         2                        2
 + (1 - a  - 2 a (y - a) - (y - a) ) x

         2                        2   2
 + (1 - a  - 2 a (y - a) - (y - a) ) x

         2                        2   3
 + (1 - a  - 2 a (y - a) - (y - a) ) x  + . . .
(%i2) taylorinfo(%);
(%o2)               [[y, a, inf], [x, 0, 3]]
</pre></dd></dl>

<p><a name="taylorp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>taylorp</b><i> (<var>expr</var>)</i>
<a name="IDX703"></a>
</dt>
<dd><p>Hat den R&uuml;ckgabewert <code>true</code>, wenn das Argument <var>expr</var> eine
Taylorreihe ist.  Ansonsten ist der R&uuml;ckgabewert <code>false</code>.
</p></dd></dl>

<p><a name="taylor_005flogexpand"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>taylor_logexpand</b>
<a name="IDX704"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>


<p><code>taylor_logexpand</code> kontrolliert die Entwicklung von Logarithmen in einer
Taylorreihe.  Der Standardwert ist <code>true</code> und die Logarithmusfunktionen in
einer Reihenentwicklung werden vollst&auml;ndig entwickelt.  Ansonsten werden
Logarithmusfunktionen so weit entwickelt, wie es notwendig ist, um eine formale
Reihenentwicklung zu erhalten.
</p></dd></dl>

<p><a name="taylor_005forder_005fcoefficients"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>taylor_order_coefficients</b>
<a name="IDX705"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>


<p>Die Optionsvariable <code>taylor_order_coefficients</code> kontrolliert die Ordnung
der Koeffizienten einer Taylorreihenentwicklung.
Hat <code>taylor_order_coefficients</code> den Wert <code>true</code>, werden die
Koeffizienten kanonisch angeordnet.
</p></dd></dl>

<p><a name="taylor_005fsimplifier"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>taylor_simplifier</b>
<a name="IDX706"></a>
</dt>
<dd><p>Standardwert: <code>SIMPLIFY</code>
</p>

<p>Die Optionsvariable <code>taylor_simplifier</code> enth&auml;lt den Namen der Funktion,
die f&uuml;r die Vereinfachung der Koeffizienten einer Taylorreihenentwicklung
von <code><a href="#taylor">taylor</a></code>
 aufgerufen wird.  Der Standardwert ist die Lisp-Funktion
<code>SIMPLIFY</code>.
</p></dd></dl>

<p><a name="taylor_005ftruncate_005fpolynomials"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>taylor_truncate_polynomials</b>
<a name="IDX707"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>


<p>Hat die Optionsvariable <code>taylor_truncate_polynomials</code> den Wert
<code>false</code>, wird das Ergebnis der Reihenentwicklung eines Polynoms als exakt
angenommen.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) taylor(x^6+x^4+x^2,x,0,4),taylor_truncate_polynomials:true;
                          2    4
(%o1)/T/                 x  + x  + . . .
(%i2) taylor(x^6+x^4+x^2,x,0,4),taylor_truncate_polynomials:false;
                              2    4
(%o2)/T/                     x  + x
</pre></dd></dl>

<p><a name="taytorat"></a>
</p><dl>
<dt><u>Funktion:</u> <b>taytorat</b><i> (<var>expr</var>)</i>
<a name="IDX708"></a>
</dt>
<dd><p>Konvertiert den Ausdruck <var>expr</var> von der speziellen Darstellung einer
Taylorreihenentwicklung in eine CRE-Form.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) taylor(atan(x),x,0,5);
                            3    5
                           x    x
(%o1)/T/               x - -- + -- + . . .
                           3    5
(%i2) taytorat(%);
                          5      3
                       3 x  - 5 x  + 15 x
(%o2)/R/               ------------------
                               15
</pre></dd></dl>

<p><a name="trunc"></a>
</p><dl>
<dt><u>Funktion:</u> <b>trunc</b><i> (<var>expr</var>)</i>
<a name="IDX709"></a>
</dt>
<dd><p>Die R&uuml;ckgabe der Funktion <code>trunc</code> ist ein Ausdruck, der das Argument
<var>expr</var> in der Ausgabe wie eine Taylorreihenentwicklung anzeigt.  Der
Ausdruck <var>expr</var> wird ansonsten nicht modifiziert.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) expr: x^2 + x + 1;
                            2
(%o1)                      x  + x + 1
(%i2) trunc (expr);
                                2
(%o2)                  1 + x + x  + . . .
(%i3) is (expr = trunc (expr));
(%o3)                         true
</pre></dd></dl>

<p><a name="verbose"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>verbose</b>
<a name="IDX710"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>verbose</code> den Wert <code>true</code>, werden von der
Funktion <code><a href="#powerseries">powerseries</a></code>
 Meldungen &uuml;ber die verwendeten Algorithmen 
ausgegeben.
</p></dd></dl>

<hr size="6">
<a name="Poisson-Reihen"></a>
<a name="SEC103"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC102" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC104" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC99" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC99" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC105" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 15.4 Poisson Reihen </h2>


<p><a name="intopois"></a>
</p><dl>
<dt><u>Function:</u> <b>intopois</b><i> (<var>a</var>)</i>
<a name="IDX711"></a>
</dt>
<dd><p>Converts <var>a</var> into a Poisson encoding.
</p></dd></dl>


<p><a name="outofpois"></a>
</p><dl>
<dt><u>Function:</u> <b>outofpois</b><i> (<var>a</var>)</i>
<a name="IDX712"></a>
</dt>
<dd><p>Converts <var>a</var> from Poisson encoding to general representation.  If <var>a</var> 
is not in Poisson form, <code>outofpois</code> carries out the conversion, i.e., 
the return value is <code>outofpois (intopois (<var>a</var>))</code>. This function is 
thus a canonical simplifier for sums of powers of sine and cosine terms of a 
particular type.
</p></dd></dl>


<p><a name="poisdiff"></a>
</p><dl>
<dt><u>Function:</u> <b>poisdiff</b><i> (<var>a</var>, <var>b</var>)</i>
<a name="IDX713"></a>
</dt>
<dd><p>Differentiates <var>a</var> with respect to <var>b</var>. <var>b</var> must occur only
in the trig arguments or only in the coefficients.
</p></dd></dl>


<p><a name="poisexpt"></a>
</p><dl>
<dt><u>Function:</u> <b>poisexpt</b><i> (<var>a</var>, <var>b</var>)</i>
<a name="IDX714"></a>
</dt>
<dd><p>Functionally identical to <code>intopois (<var>a</var>^<var>b</var>)</code>. <var>b</var> must be a
positive integer.
</p></dd></dl>


<p><a name="poisint"></a>
</p><dl>
<dt><u>Function:</u> <b>poisint</b><i> (<var>a</var>, <var>b</var>)</i>
<a name="IDX715"></a>
</dt>
<dd><p>Integrates in a similarly restricted sense (to <code>poisdiff</code>).  Non-periodic 
terms in <var>b</var> are dropped if <var>b</var> is in the trig arguments.
</p></dd></dl>

<p><a name="poislim"></a>
</p><dl>
<dt><u>Option variable:</u> <b>poislim</b>
<a name="IDX716"></a>
</dt>
<dd><p>Default value: 5
</p>
<p><code>poislim</code> determines the domain of the coefficients in the arguments of 
the trig functions.  The initial value of 5 corresponds to the interval 
[-2^(5-1)+1,2^(5-1)], or [-15,16], but it can be set to [-2^(n-1)+1, 2^(n-1)].
</p></dd></dl>


<p><a name="poismap"></a>
</p><dl>
<dt><u>Function:</u> <b>poismap</b><i> (<var>series</var>, <var>sinfn</var>, <var>cosfn</var>)</i>
<a name="IDX717"></a>
</dt>
<dd><p>will map the functions <var>sinfn</var> on the sine terms and <var>cosfn</var> on the 
cosine terms of the Poisson series given. <var>sinfn</var> and <var>cosfn</var> are 
functions of two arguments which are a coefficient and a trigonometric part 
of a term in series respectively.
</p></dd></dl>


<p><a name="poisplus"></a>
</p><dl>
<dt><u>Function:</u> <b>poisplus</b><i> (<var>a</var>, <var>b</var>)</i>
<a name="IDX718"></a>
</dt>
<dd><p>Is functionally identical to <code>intopois (a + b)</code>.
</p></dd></dl>

<p><a name="poissimp"></a>
</p><dl>
<dt><u>Function:</u> <b>poissimp</b><i> (<var>a</var>)</i>
<a name="IDX719"></a>
</dt>
<dd><p>Converts <var>a</var> into a Poisson series for <var>a</var> in general representation.
</p></dd></dl>


<p><a name="poisson"></a>
</p><dl>
<dt><u>Special symbol:</u> <b>poisson</b>
<a name="IDX720"></a>
</dt>
<dd><p>The symbol <code>/P/</code> follows the line label of Poisson series expressions.
</p></dd></dl>

<p><a name="poissubst"></a>
</p><dl>
<dt><u>Function:</u> <b>poissubst</b><i> (<var>a</var>, <var>b</var>, <var>c</var>)</i>
<a name="IDX721"></a>
</dt>
<dd><p>Substitutes <var>a</var> for <var>b</var> in <var>c</var>.  <var>c</var> is a Poisson series.
</p>
<p>(1) Where <var>B</var> is a variable <var>u</var>, <var>v</var>, <var>w</var>, <var>x</var>, <var>y</var>, or 
<var>z</var>, then <var>a</var> must be an expression linear in those variables (e.g., 
<code>6*u + 4*v</code>).
</p>
<p>(2) Where <var>b</var> is other than those variables, then <var>a</var> must also be
free of those variables, and furthermore, free of sines or cosines.
</p>
<p><code>poissubst (<var>a</var>, <var>b</var>, <var>c</var>, <var>d</var>, <var>n</var>)</code> is a special 
type of substitution which operates on <var>a</var> and <var>b</var> as in type (1) above,
but where <var>d</var> is a Poisson series, expands <code>cos(<var>d</var>)</code> and 
<code>sin(<var>d</var>)</code> to order <var>n</var> so as to provide the result of substituting
<code><var>a</var> + <var>d</var></code> for <var>b</var> in <var>c</var>.  The idea is that <var>d</var> is an
expansion in terms of a small parameter.  For example,
<code>poissubst (u, v, cos(v), %e, 3)</code> yields <code>cos(u)*(1 - %e^2/2) - 
sin(u)*(%e - %e^3/6)</code>.
</p></dd></dl>


<p><a name="poistimes"></a>
</p><dl>
<dt><u>Function:</u> <b>poistimes</b><i> (<var>a</var>, <var>b</var>)</i>
<a name="IDX722"></a>
</dt>
<dd><p>Is functionally identical to <code>intopois (<var>a</var>*<var>b</var>)</code>.
</p></dd></dl>


<p><a name="poistrim"></a>
</p><dl>
<dt><u>Function:</u> <b>poistrim</b><i> ()</i>
<a name="IDX723"></a>
</dt>
<dd><p>is a reserved function name which (if the user has defined it) gets applied 
during Poisson multiplication.  It is a predicate function of 6 arguments which 
are the coefficients of the <var>u</var>, <var>v</var>, &hellip;, <var>z</var> in a term.  Terms
for which <code>poistrim</code> is <code>true</code> (for the coefficients of that term) 
are eliminated during multiplication.
</p></dd></dl>

<p><a name="printpois"></a>
</p><dl>
<dt><u>Function:</u> <b>printpois</b><i> (<var>a</var>)</i>
<a name="IDX724"></a>
</dt>
<dd><p>Prints a Poisson series in a readable format.  In common with <code>outofpois</code>, 
it will convert <var>a</var> into a Poisson encoding first, if necessary.
</p></dd></dl>

<hr size="6">
<a name="Kettenbr_00fcche"></a>
<a name="SEC104"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC103" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC105" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC99" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC99" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC105" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 15.5 Kettenbr&uuml;che </h2>

<p><a name="cf"></a>
</p><dl>
<dt><u>Function:</u> <b>cf</b><i> (<var>expr</var>)</i>
<a name="IDX725"></a>
</dt>
<dd><p>Converts <var>expr</var> into a continued fraction. <var>expr</var> is an expression
comprising continued fractions and square roots of integers. Operands in the 
expression may be combined with arithmetic operators. Aside from continued 
fractions and square roots, factors in the expression must be integer or 
rational numbers. Maxima does not know about operations on continued fractions 
outside of <code>cf</code>.
</p>
<p><code>cf</code> evaluates its arguments after binding <code>listarith</code> to 
<code>false</code>. <code>cf</code> returns a continued fraction, represented as a list.
</p>
<p>A continued fraction <code>a + 1/(b + 1/(c + ...))</code> is represented by the list 
<code>[a, b, c, ...]</code>. The list elements <code>a</code>, <code>b</code>, <code>c</code>, &hellip;
must evaluate to integers. <var>expr</var> may also contain <code>sqrt (n)</code> where
<code>n</code> is an integer. In this case <code>cf</code> will give as many terms of the
continued fraction as the value of the variable <code>cflength</code> times the
period.
</p>
<p>A continued fraction can be evaluated to a number by evaluating the arithmetic 
representation returned by <code>cfdisrep</code>. See also <code>cfexpand</code> for another 
way to evaluate a continued fraction.
</p>
<p>See also <code>cfdisrep</code>, <code>cfexpand</code>, and <code>cflength</code>.
</p>
<p>Examples:
</p>
<ul>
<li>
<var>expr</var> is an expression comprising continued fractions and square roots of integers.

<pre class="example">(%i1) cf ([5, 3, 1]*[11, 9, 7] + [3, 7]/[4, 3, 2]);
(%o1)               [59, 17, 2, 1, 1, 1, 27]
(%i2) cf ((3/17)*[1, -2, 5]/sqrt(11) + (8/13));
(%o2)        [0, 1, 1, 1, 3, 2, 1, 4, 1, 9, 1, 9, 2]
</pre>
</li><li>
<code>cflength</code> controls how many periods of the continued fraction
are computed for algebraic, irrational numbers.

<pre class="example">(%i1) cflength: 1$
(%i2) cf ((1 + sqrt(5))/2);
(%o2)                    [1, 1, 1, 1, 2]
(%i3) cflength: 2$
(%i4) cf ((1 + sqrt(5))/2);
(%o4)               [1, 1, 1, 1, 1, 1, 1, 2]
(%i5) cflength: 3$
(%i6) cf ((1 + sqrt(5))/2);
(%o6)           [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
</pre>
</li><li>
A continued fraction can be evaluated by evaluating the arithmetic representation
returned by <code>cfdisrep</code>.

<pre class="example">(%i1) cflength: 3$
(%i2) cfdisrep (cf (sqrt (3)))$
(%i3) ev (%, numer);
(%o3)                   1.731707317073171
</pre>
</li><li>
Maxima does not know about operations on continued fractions outside of <code>cf</code>.

<pre class="example">(%i1) cf ([1,1,1,1,1,2] * 3);
(%o1)                     [4, 1, 5, 2]
(%i2) cf ([1,1,1,1,1,2]) * 3;
(%o2)                  [3, 3, 3, 3, 3, 6]
</pre>
</li></ul>
</dd></dl>


<dl>
<dt><u>Function:</u> <b>cfdisrep</b><i> (<var>list</var>)</i>
<a name="IDX726"></a>
</dt>
<dd><p>Constructs and returns an ordinary arithmetic expression
of the form <code>a + 1/(b + 1/(c + ...))</code>
from the list representation of a continued fraction <code>[a, b, c, ...]</code>.
</p>
<pre class="example">(%i1) cf ([1, 2, -3] + [1, -2, 1]);
(%o1)                     [1, 1, 1, 2]
(%i2) cfdisrep (%);
                                  1
(%o2)                     1 + ---------
                                    1
                              1 + -----
                                      1
                                  1 + -
                                      2
</pre></dd></dl>

<dl>
<dt><u>Function:</u> <b>cfexpand</b><i> (<var>x</var>)</i>
<a name="IDX727"></a>
</dt>
<dd><p>Returns a matrix of the numerators and denominators of the
last (column 1) and next-to-last (column 2) convergents of the continued fraction <var>x</var>.
</p>
<pre class="example">(%i1) cf (rat (ev (%pi, numer)));

`rat' replaced 3.141592653589793 by 103993/33102 =3.141592653011902
(%o1)                  [3, 7, 15, 1, 292]
(%i2) cfexpand (%); 
                         [ 103993  355 ]
(%o2)                    [             ]
                         [ 33102   113 ]
(%i3) %[1,1]/%[2,1], numer;
(%o3)                   3.141592653011902
</pre></dd></dl>

<dl>
<dt><u>Option variable:</u> <b>cflength</b>
<a name="IDX728"></a>
</dt>
<dd><p>Default value: 1
</p>
<p><code>cflength</code> controls the number of terms of the continued
fraction the function <code>cf</code> will give, as the value <code>cflength</code> times the
period.  Thus the default is to give one period.
</p>
<pre class="example">(%i1) cflength: 1$
(%i2) cf ((1 + sqrt(5))/2);
(%o2)                    [1, 1, 1, 1, 2]
(%i3) cflength: 2$
(%i4) cf ((1 + sqrt(5))/2);
(%o4)               [1, 1, 1, 1, 1, 1, 1, 2]
(%i5) cflength: 3$
(%i6) cf ((1 + sqrt(5))/2);
(%o6)           [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2]
</pre></dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC99" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_16.html#SEC105" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>Dezember, 10 2012</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
