<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Dezember, 10 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 10. Mathematische Funktionen</title>

<meta name="description" content="Maxima Manual: 10. Mathematische Funktionen">
<meta name="keywords" content="Maxima Manual: 10. Mathematische Funktionen">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Mathematische-Funktionen"></a>
<a name="SEC60"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_9.html#SEC59" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC61" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_9.html#SEC57" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 10. Mathematische Funktionen </h1>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC61">10.1 Funktionen f&uuml;r Zahlen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC62">10.2 Funktionen f&uuml;r komplexe Zahlen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC63">10.3 Funktionen der Kombinatorik</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC64">10.4 Wurzel-, Exponential- und Logarithmusfunktion</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC65">10.5 Winkelfunktionen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC68">10.6 Hyperbelfunktionen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC71">10.7 Zufallszahlen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Funktionen-f_00fcr-Zahlen"></a>
<a name="SEC61"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC60" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC62" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.1 Funktionen f&uuml;r Zahlen </h2>

<p><a name="abs"></a>
</p><dl>
<dt><u>Funktion:</u> <b>abs</b><i> (<var>z</var>)</i>
<a name="IDX333"></a>
</dt>
<dd><p>Die Funktion <code>abs</code> ist die Betragsfunktion und f&uuml;r das numerische und
symbolische Rechnen geeignet.  Ist das Argument <var>z</var> eine reelle oder
komplexe Zahl wird der Betrag berechnet.  Wenn m&ouml;glich werden allgemeine
Ausdr&uuml;cke mit der Betragsfunktion vereinfacht.  Maxima kann Ausdr&uuml;cke mit
der Betragsfunktion integrieren und ableiten sowie Grenzwerte von Ausdr&uuml;cken
mit der Betragsfunktion ermitteln.  Das Paket <code><a href="maxima_31.html#SEC216">abs_integrate</a></code>
 erweitert
Maximas M&ouml;glichkeiten, Integrale mit der Betragsfunktion zu l&ouml;sen.
</p>
<p>Die Betragsfunktion wird automatisch auf die Elemente von Listen und Matrizen
sowie auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Siehe die Funktion <code><a href="#cabs">cabs</a></code>,
 um den Betrag eines komplexen Ausdrucks
oder einer Funktion zu berechnen.
</p>
<p>Beispiele:
</p>
<p>Berechnung des Betrages f&uuml;r reelle und komplexen Zahlen sowie numerische
Konstanten und unendliche Gr&ouml;&szlig;en.  Das erste Beispiel zeigt, wie die
Betragsfunktion von Maxima auf die Elemente einer Liste angewendet wird.
</p>
<pre class="example">(%i1) abs([-4, 0, 1, 1+%i]);
(%o1)                  [4, 0, 1, sqrt(2)]

(%i2) abs((1+%i)*(1-%i));
(%o2)                           2
(%i3) abs(%e+%i);
                                2
(%o3)                    sqrt(%e  + 1)
(%i4) abs([inf, infinity, minf]);
(%o4)                   [inf, inf, inf]
</pre>
<p>Vereinfachung von Ausdr&uuml;cken mit der Betragsfunktion.
</p>
<pre class="example">(%i5) abs(x^2);
                                2
(%o5)                          x
(%i6) abs(x^3);
                             2
(%o6)                       x  abs(x)

(%i7) abs(abs(x));
(%o7)                       abs(x)
(%i8) abs(conjugate(x));
(%o8)                       abs(x)
</pre>
<p>Ableitung und Integrale mit der Betragsfunktion.  Wird das Paket
<a href="maxima_31.html#SEC216">abs_integrate</a>
 geladen, k&ouml;nnen weitere Integrale mit der Betragsfunktion
gel&ouml;st werden.  Das letzte Beispiel zeigt die Laplacetransformation der
Betragsfunktion.  Siehe <code><a href="maxima_16.html#laplace">laplace</a></code>.
</p>

<pre class="example">(%i9) diff(x*abs(x),x),expand;
(%o9)                       2 abs(x)

(%i10) integrate(abs(x),x);
                             x abs(x)
(%o10)                       --------
                                2

(%i11) integrate(x*abs(x),x);
                           /
                           [
(%o11)                     I x abs(x) dx
                           ]
                           /

(%i12) load(abs_integrate)$
(%i13) integrate(x*abs(x),x);
                      2           3
                     x  abs(x)   x  signum(x)
(%o13)               --------- - ------------
                         2            6

(%i14) integrate(abs(x),x,-2,%pi);
                               2
                            %pi
(%o14)                      ---- + 2
                             2

(%i15) laplace(abs(x),x,s);
                               1
(%o15)                         --
                                2
                               s
</pre></dd></dl>

<p><a name="ceiling"></a>
</p><dl>
<dt><u>Funktion:</u> <b>ceiling</b><i> (<var>x</var>)</i>
<a name="IDX334"></a>
</dt>
<dd><p>Die Funktion <code>ceiling</code> ist f&uuml;r das numerische und symbolische Rechnen
geeignet.
</p>
<p>Ist das Argument <var>x</var> eine reelle Zahl, gibt <code>ceiling</code> die kleinste
ganze Zahl zur&uuml;ck, die gr&ouml;&szlig;er oder gleich <var>x</var> ist.
</p>
<p>Die Funktion <code>ceiling</code> gibt auch dann einen numerischen Wert zur&uuml;ck, wenn
das Argument ein konstanter Ausdruck ist, wie zum Beispiel <code>1+%e</code>, der zu
einer reellen Zahl ausgewertet werden kann.  In diesem Fall wird der konstante
Ausdruck in eine gro&szlig;e Gleitkommazahl umgewandelt, auf die die Funktion
<code>ceiling</code> angewendet wird.  Aufgrund von Rundungsfehlern bei der Umwandlung
in Gleitkommazahlen kann es zu Fehlern bei der Berechnung von <code>ceiling</code>
kommen.  Um diese zu minimieren, wird die Anzahl der Stellen
<code><a href="maxima_5.html#fpprec">fpprec</a></code>
 f&uuml;r die Berechnung von <code>ceiling</code> um drei Stellen erh&ouml;ht.
</p>
<p>Ist das Argument <var>expr</var> der Funktion ein komplexer Ausdruck, wird eine
Substantivform zur&uuml;ckgegeben.
</p>
<p>Wenn m&ouml;glich werden Ausdr&uuml;cke mit der Funktion <code>ceiling</code> von Maxima
vereinfacht.  Maxima kennt insbesondere Vereinfachungen f&uuml;r den Fall, dass
das Argument der Funktion <code>ceiling</code> ein Ausdruck mit den Funktionen
<code><a href="#floor">floor</a></code>
 oder <code><a href="#round">round</a></code>
 ist.  Weiterhin werden f&uuml;r die Vereinfachung
die Aussagen und Fakten der aktiven Kontexte herangezogen.  Siehe 
<a href="maxima_11.html#SEC77">Funktionen und Variablen f&uuml;r Fakten</a>.
</p>
<p><code>ceiling</code> wird automatisch auf die Elemente von Listen und Matrizen
sowie auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Siehe auch die Funktionen <code><a href="#floor">floor</a></code>
 und <code><a href="#round">round</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) ceiling(ceiling(x));
(%o1)                      ceiling(x)
(%i2) ceiling(floor(x));
(%o2)                       floor(x)
(%i3) declare (n, integer)$
(%i4) ceiling([n, abs(n), max (n, 6)]);
(%o4)               [n, abs(n), max(6, n)]
(%i5) assume (x &gt; 0, x &lt; 1)$
(%i6) ceiling (x);
(%o6)                           1
</pre>
<p>Sind die Werte einer Funktion eine Teilmenge der ganzen Zahlen, kann diese als
<code><a href="maxima_11.html#integervalued">integervalued</a></code>
 deklariert werden.  Die Funktionen <code>ceiling</code> und
<code><a href="#floor">floor</a></code>
 k&ouml;nnen diese Information nutzen, um Ausdr&uuml;cke zu vereinfachen.
</p>
<pre class="example">(%i1) declare (f, integervalued)$
(%i2) floor (f(x));
(%o2)                         f(x)
(%i3) ceiling (f(x) - 1);
(%o3)                       f(x) - 1
</pre>
<p>Maxima kennt das Integral der Funktion <code>ceiling</code>.
</p>
<pre class="example">(%i1) integrate(ceiling(x),x);
               (- ceiling(x) + 2 x + 1) ceiling(x)
(%o1)          -----------------------------------
                                2
</pre></dd></dl>

<p><a name="entier"></a>
</p><dl>
<dt><u>Funktion:</u> <b>entier</b><i> (<var>x</var>)</i>
<a name="IDX335"></a>
</dt>
<dd><p><code>entier</code> ist eine andere Bezeichnung f&uuml;r die Funktion <code>floor</code>.
Siehe <code><a href="#floor">floor</a></code>.
</p>
</dd></dl>

<p><a name="floor"></a>
</p><dl>
<dt><u>Funktion:</u> <b>floor</b><i> (<var>x</var>)</i>
<a name="IDX336"></a>
</dt>
<dd><p>Die Funktion <code>floor</code> ist f&uuml;r das numerische und symbolische Rechnen
geeignet.
</p>
<p>Ist das Argument <var>x</var> eine reelle Zahl, gibt <code>floor</code> die gr&ouml;&szlig;te
ganze Zahl zur&uuml;ck, die kleiner oder gleich <var>x</var> ist.
</p>
<p>Die Funktion <code>floor</code> gibt auch dann einen numerischen Wert zur&uuml;ck, wenn
das Argument ein konstanter Ausdruck ist, wie zum Beispiel <code>1+%e</code>, der zu
einer reellen Zahl ausgewertet werden kann.  In diesem Fall wird der konstante
Ausdruck in eine gro&szlig;e Gleitkommazahl umgewandelt, auf die die Funktion
<code>floor</code> angewendet wird.  Aufgrund von Rundungsfehlern bei der Umwandlung
in Gleitkommazahlen kann es zu Fehlern bei der Berechnung von <code>floor</code>
kommen.  Um diese zu minimieren, wird die Anzahl der Stellen
<code><a href="maxima_5.html#fpprec">fpprec</a></code>
 f&uuml;r die Berechnung von <code>floor</code> um drei Stellen erh&ouml;ht.
</p>
<p>Ist das Argument <var>x</var> der Funktion ein komplexer Ausdruck, wird eine
Substantivform zur&uuml;ckgegeben.
</p>
<p>Wenn m&ouml;glich werden Ausdr&uuml;cke mit der Funktion <code>floor</code> von Maxima
vereinfacht.  Maxima kennt insbesondere Vereinfachungen f&uuml;r den Fall, dass
das Argument der Funktion <code>floor</code> ein Ausdruck mit den Funktionen
<code><a href="#ceiling">ceiling</a></code>
 oder <code><a href="#round">round</a></code>
 ist.  Weiterhin werden f&uuml;r die Vereinfachung
die Aussagen und Fakten der aktiven Kontexte herangezogen.  Siehe
<a href="maxima_11.html#SEC77">Funktionen und Variablen f&uuml;r Fakten</a>.
</p>
<p><code>floor</code> wird automatisch auf die Elemente von Listen und Matrizen
sowie auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Siehe auch die Funktionen <code><a href="#ceiling">ceiling</a></code>
 und <code><a href="#round">round</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) floor(ceiling(x));
(%o1)                      ceiling(x)
(%i2) floor(floor(x));
(%o2)                       floor(x)
(%i3) declare(n, integer);
(%o3)                         done
(%i4) floor([n, abs(n), min (n, 6)]);
(%o4)                [n, abs(n), min(6, n)]
(%i5) assume(x&gt;0, x&lt;1)$
(%i6) floor(x);
(%o6)                           0
</pre>
<p>Sind die Werte einer Funktion eine Teilmenge der ganzen Zahlen, kann diese als
<code><a href="maxima_11.html#integervalued">integervalued</a></code>
 deklariert werden.  Die Funktionen <code><a href="#ceiling">ceiling</a></code>
 und
<code>floor</code> k&ouml;nnen diese Information nutzen, um Ausdr&uuml;cke zu vereinfachen.
</p>
<pre class="example">(%i1) declare (f, integervalued)$
(%i2) floor(f(x));
(%o2)                         f(x)
(%i3) ceiling(f(x) - 1);
(%o3)                       f(x) - 1
</pre>
<p>Maxima kennt das Integral der Funktion <code>floor</code>.
</p>
<pre class="example">(%i6) integrate(floor(x),x);
                 (- floor(x) + 2 x - 1) floor(x)
(%o6)            -------------------------------
                                2
</pre></dd></dl>

<p><a name="fix"></a>
</p><dl>
<dt><u>Funktion:</u> <b>fix</b><i> (<var>x</var>)</i>
<a name="IDX337"></a>
</dt>
<dd><p><code>fix</code> ist eine andere Bezeichnung f&uuml;r die Funktion <code>floor</code>.  Siehe
<code><a href="#floor">floor</a></code>.
</p>
</dd></dl>

<p><a name="lmax"></a>
</p><dl>
<dt><u>Funktion:</u> <b>lmax</b><i> (<var>L</var>)</i>
<a name="IDX338"></a>
</dt>
<dd><p>Ist das Argument <var>L</var> eine Liste oder Menge, wird die Funktion <code><a href="#max">max</a></code>
 auf
die Elemente der Liste oder Menge angewendet und das Ergebnis zur&uuml;ckgegeben.
Ist <var>L</var> keine Liste oder Menge, signalisiert Maxima einen Fehler.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) L:[1+%e, %pi, 3];
(%o1)                   [%e + 1, %pi, 3]
(%i1) lmax(L);
(%o1)                        %e + 1
</pre></dd></dl>

<p><a name="lmin"></a>
</p><dl>
<dt><u>Funktion:</u> <b>lmin</b><i> (<var>L</var>)</i>
<a name="IDX339"></a>
</dt>
<dd><p>Ist das Argument <var>L</var> eine Liste oder Menge, wird die Funktion <code><a href="#min">min</a></code>
 auf
die Elemente der Liste oder Menge angewendet und das Ergebnis zur&uuml;ckgegeben.
Ist <var>L</var> keine Liste oder Menge, signalisiert Maxima einen Fehler.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) L:[1+%e, %pi, 3];
(%o1)                   [%e + 1, %pi, 3]
(%i2) lmin(L);
(%o2)                           3
</pre></dd></dl>

<p><a name="max"></a>
</p><dl>
<dt><u>Funktion:</u> <b>max</b><i> (<var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX340"></a>
</dt>
<dd><p>Sind alle Argumente <var>x_1</var>, &hellip;, <var>x_n</var> Zahlen oder konstante
Ausdr&uuml;cke wie zum Beispiel <code>1+%e</code> oder <code>sin(1)</code>, dann wird der
gr&ouml;&szlig;te Zahlenwert zur&uuml;ckgegeben.  Sind symbolische Variablen oder
allgemeine Ausdr&uuml;cke unter den Argumenten, gibt Maxima einen vereinfachten
Ausdruck zur&uuml;ck.  Die unendliche Gr&ouml;&szlig;en <code><a href="maxima_5.html#inf">inf</a></code>
 und <code><a href="maxima_5.html#minf">minf</a></code>

k&ouml;nnen als Argument auftreten.
</p>
<p>Die Vereinfachung der Funktion <code>max</code> kann kontrolliert werden, in dem mit
der Funktion <code><a href="maxima_11.html#put">put</a></code>
 dem Symbol <code>trylevel</code> zu der Eigenschaft
<code>maxmin</code> ein Wert zwischen 1 bis 3 gegeben wird.  Folgende Werte k&ouml;nnen 
mit der Funktion <code>put</code> gesetzt werden:
</p>
<dl compact="compact">
<dt> <code>put(trylevel, 1, maxmin)</code></dt>
<dd><p><code>trylevel</code> hat den Wert 1.  Das ist der Standardwert.  Maxima f&uuml;hrt
keine besonderen Vereinfachungen aus.
</p></dd>
<dt> <code>put(trylevel, 2, maxmin)</code></dt>
<dd><p>Maxima wendet die Vereinfachung <code>max(e,-e) --&gt; |e|</code> an.
</p></dd>
<dt> <code>put(trylevel, 3, maxima)</code></dt>
<dd><p>Maxima wendet die Vereinfachung <code>max(e,-e) --&gt; |e|</code> an und versucht
Ausdr&uuml;cke zu eliminieren, die zwischen zwei anderen Argumenten liegen.  So
wird zum Beispiel <code>max(x, 2*x, 3*x)</code> zu <code>max(x, 3*x)</code> vereinfacht.
</p></dd>
</dl>

<p>Mit dem Kommando <code>get(trylevel, maxmin)</code> wird der aktuelle Wert f&uuml;r
das Symbol <code>trylevel</code> angezeigt.  Siehe die Funktion <code><a href="maxima_11.html#get">get</a></code>.
</p>

<p><code>max</code> ber&uuml;cksichtigt bei der Vereinfachung von Ausdr&uuml;cken die
Aussagen und Fakten der aktiven Kontexte.  Siehe das Kapitel
<a href="maxima_11.html#SEC77">Funktionen und Variablen f&uuml;r Fakten</a>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) max(1.6, 3/2, 1);
(%o1)                          1.6
(%i2) max(1.5b0,1.5,3/2);
                                3
(%o2)                           -
                                2
(%i3) max(%e,%pi,1,2,3);
(%o3)                          %pi
(%i4) max(1+%e,%pi,1,2,3);
(%o4)                        %e + 1
(%i5) max(minf,inf);
(%o5)                          inf
(%i6) assume(a&gt;b);
(%o6)                        [a &gt; b]
(%i7) max(a,b);
(%o7)                           a
</pre></dd></dl>

<p><a name="min"></a>
</p><dl>
<dt><u>Funktion:</u> <b>min</b><i> (<var>x_1</var>, &hellip;, <var>x_n</var>)</i>
<a name="IDX341"></a>
</dt>
<dd><p>Sind alle Argumente <var>x_1</var>, &hellip;, <var>x_n</var> Zahlen oder konstante
Ausdr&uuml;cke wie zum Beispiel <code>1+%e</code> oder <code>sin(1)</code>, dann wird der
kleinste Zahlenwert zur&uuml;ckgegeben.  Sind symbolische Variablen oder
allgemeine Ausdr&uuml;cke unter den Argumenten, gibt Maxima einen vereinfachten
Ausdruck zur&uuml;ck.  Die unendliche Gr&ouml;&szlig;en <code><a href="maxima_5.html#inf">inf</a></code>
 und <code><a href="maxima_5.html#minf">minf</a></code>

k&ouml;nnen als Argument auftreten.
</p>
<p>Die Vereinfachung der Funktion <code>min</code> kann kontrolliert werden, in dem mit
der Funktion <code><a href="maxima_11.html#put">put</a></code>
 dem Symbol <code>trylevel</code> zu der Eigenschaft
<code>maxmin</code> ein Wert zwischen 1 bis 3 gegeben wird.  Folgende Werte k&ouml;nnen
mit der Funktion <code>put</code> gesetzt werden:
</p>
<dl compact="compact">
<dt> <code>put(trylevel, 1, maxmin)</code></dt>
<dd><p><code>trylevel</code> hat den Wert 1.  Das ist der Standardwert.  Maxima f&uuml;hrt
keine besonderen Vereinfachungen aus.
</p></dd>
<dt> <code>put(trylevel, 2, maxmin)</code></dt>
<dd><p>Maxima wendet die Vereinfachung <code>min(e,-e) --&gt; |e|</code> an.
</p></dd>
<dt> <code>put(trylevel, 3, maxima)</code></dt>
<dd><p>Maxima wendet die Vereinfachung <code>min(e,-e) --&gt; |e|</code> an und versucht
Ausdr&uuml;cke zu eliminieren, die zwischen zwei anderen Argumenten liegen.  So
wird zum Beispiel <code>min(x, 2*x, 3*x)</code> zu <code>min(x, 3*x)</code> vereinfacht.
</p></dd>
</dl>

<p>Mit dem Kommando <code>get(trylevel, maxmin)</code> wird der aktuelle Wert f&uuml;r
das Symbol <code>trylevel</code> angezeigt.  Siehe die Funktion <code><a href="maxima_11.html#get">get</a></code>.
</p>

<p><code>min</code> ber&uuml;cksichtigt bei der Vereinfachung von Ausdr&uuml;cken die
Aussagen und Fakten der aktiven Kontexte.  Siehe das Kapitel
<a href="maxima_11.html#SEC77">Funktionen und Variablen f&uuml;r Fakten</a>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) min(1.6, 3/2, 1);
(%o1)                           1
(%i2) min(1.5b0,1.5,3/2);
                                3
(%o2)                           -
                                2
(%i3) min(%e,%pi,3);
(%o3)                          %e
(%i4) min(1+%e,%pi,3);
(%o4)                           3
(%i5) min(minf,inf);
(%o5)                         minf
(%i6) assume(a&gt;b);
(%o6)                        [a &gt; b]
(%i7) min(a,b);
(%o7)                           b
</pre></dd></dl>

<p><a name="round"></a>
</p><dl>
<dt><u>Funktion:</u> <b>round</b><i> (<var>x</var>)</i>
<a name="IDX342"></a>
</dt>
<dd><p>Die Funktion <code>round</code> ist f&uuml;r das numerische und symbolische Rechnen
geeignet.
</p>
<p>Ist das Argument <var>x</var> eine reelle Zahl, gibt <code>round</code> die am
n&auml;chsten liegende ganze Zahl zur&uuml;ck.  Vielfache von 1/2 werden auf die 
n&auml;chste gerade ganze Zahl gerundet.
</p>
<p>Die Funktion <code>round</code> gibt auch dann einen numerischen Wert zur&uuml;ck, wenn
das Argument ein konstanter Ausdruck ist, wie zum Beispiel <code>1+%e</code>, der zu
einer reellen Zahl ausgewertet werden kann.  In diesem Fall wird der konstante
Ausdruck in eine gro&szlig;e Gleitkommazahl umgewandelt, auf die die Funktion
<code>round</code> angewendet wird.  Aufgrund von Rundungsfehlern bei der Umwandlung
in Gleitkommazahlen kann es zu Fehlern bei der Berechnung von <code>round</code>
kommen.  Um diese zu minimieren, wird die Anzahl der Stellen
<code><a href="maxima_5.html#fpprec">fpprec</a></code>
 f&uuml;r die Berechnung von <code>round</code> um drei Stellen erh&ouml;ht.
</p>
<p>Ist das Argument <var>x</var> der Funktion ein komplexer Ausdruck, wird eine
Substantivform zur&uuml;ckgegeben.
</p>
<p>Wenn m&ouml;glich werden Ausdr&uuml;cke mit der Funktion <code>round</code> von Maxima
vereinfacht.  Maxima kennt insbesondere Vereinfachungen f&uuml;r den Fall, dass
das Argument der Funktion <code>round</code> ein Ausdruck mit den Funktionen
<code><a href="#ceiling">ceiling</a></code>
 oder <code><a href="#floor">floor</a></code>
 ist.  Weiterhin werden f&uuml;r die Vereinfachung
die Aussagen und Fakten der aktiven Kontexte herangezogen.  Siehe 
<a href="maxima_11.html#SEC77">Funktionen und Variablen f&uuml;r Fakten</a>.
</p>
<p><code>round</code> wird automatisch auf die Elemente von Listen und Matrizen
sowie auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Siehe auch die Funktionen <code><a href="#ceiling">ceiling</a></code>
 und <code><a href="#floor">floor</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) round(floor(x));
(%o1)                       floor(x)
(%i2) round(round(x));
(%o2)                       round(x)
(%i3) declare(n, integer);
(%o3)                         done
(%i4) round([n, abs(n), min(n,6)]);
(%o4)                [n, abs(n), min(6, n)]
</pre>
<p>Sind die Werte einer Funktion eine Teilmenge der ganzen Zahlen, kann diese als
<code><a href="maxima_11.html#integervalued">integervalued</a></code>
 deklariert werden.  Die Funktion <code>round</code> kann diese
Information nutzen, um Ausdr&uuml;cke zu vereinfachen.
</p>
<pre class="example">(%i1) declare(f, integervalued);
(%o1)                         done
(%i2) round(f(x));
(%o2)                         f(x)
(%i3) round(f(x) - 1);
(%o3)                       f(x) - 1
</pre></dd></dl>

<p><a name="signum"></a>
</p><dl>
<dt><u>Funktion:</u> <b>signum</b><i> (<var>z</var>)</i>
<a name="IDX343"></a>
</dt>
<dd><p>Die Signumfunktion <code>signum</code> ist f&uuml;r das numerische und symbolische
Rechnen geeignet.  Ist das Argument <var>z</var> eine Zahl, ist das Ergebnis 0, 1
oder -1, wenn die Zahl Null, positiv oder negativ ist.  Das Argument kann auch
ein konstanter Ausdruck wie <code>%pi</code> oder <code>1+%e</code> sein.  Ist das Argument
<var>z</var> eine komplexe Zahl, vereinfacht die der Ausdruck <code>signum(z)</code> zu
<code>z/abs(z)</code>.
</p>
<p>Ist das Argument <var>z</var> keine Zahl oder kein konstanter Ausdruck, versucht
Maxima den Ausdruck zu vereinfachen.  Maxima kann die Funktion <code>signum</code>
differenzieren.  Wird das Paket <a href="maxima_31.html#SEC216">abs_integrate</a>
 geladen, kann Maxima
Integrale mit der Funktion <code>signum</code> l&ouml;sen.
</p>
<p><code>signum</code> wird automatisch auf die Elemente von Listen und Matrizen
sowie auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Beispiele:
</p>
<p>Ergebnisse f&uuml;r verschiedene Zahlen und konstante Ausdr&uuml;cke.  Die Beispiele
zeigen, dass das Ergebnis der Signumfunktion den Typ der Zahl erh&auml;lt.  Die
unendlichen Gr&ouml;&szlig;en <code><a href="maxima_5.html#minf">minf</a></code>
 und <code><a href="maxima_5.html#inf">inf</a></code>
 k&ouml;nnen als Argument
auftreten.
</p>
<pre class="example">(%i1) signum([-1.5, 0, 0.0, 1.5, 1.5b0, %e, sin(1), cos(4)]);
(%o1)        [- 1.0, 0, 0.0, 1.0, 1.0b0, 1, 1, - 1]
(%i2) signum(1+%i);
                          %i         1
(%o2)                   ------- + -------
                        sqrt(2)   sqrt(2)
(%i3) signum([minf,inf]);
(%o3)                      [- 1, 1]
</pre>
<p>Vereinfachungen der Signumfunktion.
</p>
<pre class="example">(%i3) signum(x*y);
(%o3)                  signum(x) signum(y)
(%i4) signum(-x);
(%o4)                      - signum(x)
</pre>
<p>Wird das Paket <a href="maxima_31.html#SEC216">abs_integrate</a>
 geladen, kann Maxima Integrale mit der
Signumfunktion l&ouml;sen.  Ausdr&uuml;cke mit der Signumfunktion k&ouml;nnen
differenziert werden.
</p>
<pre class="example">(%i5) load(abs_integrate)$

(%i6) integrate(signum(x),x);
(%o6)                        abs(x)

(%i7) integrate(sin(x)*signum(x),x);
(%o7)               (1 - cos(x)) signum(x)

(%i7) diff(%,x);
(%o7)                  signum(x) sin(x)
</pre></dd></dl>

<hr size="6">
<a name="Funktionen-f_00fcr-komplexe-Zahlen"></a>
<a name="SEC62"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC61" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC63" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.2 Funktionen f&uuml;r komplexe Zahlen </h2>

<p><a name="cabs"></a>
</p><dl>
<dt><u>Funktion:</u> <b>cabs</b><i> (<var>expr</var>)</i>
<a name="IDX344"></a>
</dt>
<dd><p>Berechnet den Betrag eines komplexen Ausdrucks <var>expr</var>.  Im Unterschied
zu der Funktion <code><a href="#abs">abs</a></code>,
 zerlegt die Funktion <code>cabs</code> einen komplexen
Ausdruck immer in einen Realteil und Imagin&auml;rteil, um den komplexen Betrag zu
berechnen.  Sind <var>x</var> und <var>y</var> zwei reelle Variablen oder Ausdr&uuml;cke,
berechnet die Funktion <code>cabs</code> den Betrag des komplexen Ausdrucks
<code>x + %i*y</code> als:
</p><pre class="example">                           2    2
                     sqrt(y  + x )
</pre>
<p>Die Funktion <code>cabs</code> nutzt Symmetrieeigenschaften und implementierte
Eigenschaften komplexer Funktionen, um den Betrag eines Ausdrucks zu berechnen.
Sind solche Eigenschaften f&uuml;r eine Funktion vorhanden, k&ouml;nnen diese mit der
Funktion <code><a href="maxima_11.html#properties">properties</a></code>
 angezeigt werden.  Eigenschaften, die das Ergebnis
der Funktion <code>cabs</code> bestimmen, sind: <code>mirror symmetry</code>,
<code>conjugate function</code> und <code>complex characteristic</code>.
</p>
<p><code>cabs</code> ist eine Verbfunktion, die nicht f&uuml;r das symbolische Rechnen
geeignet ist.  F&uuml;r das symbolische Rechnen wie der Integration oder der
Ableitung von Ausdr&uuml;cken mit der Betragsfunktion muss die Funktion <code>abs</code>
verwendet werden.
</p>
<p>Das Ergebnis der Funktion <code>cabs</code> kann die Betragsfunktion <code><a href="#abs">abs</a></code>
 und
den Arkustangens <code><a href="#atan2">atan2</a></code>
 enthalten.
</p>
<p><code>cabs</code> wird automatisch auf die Elemente von Listen und Matrizen sowie auf
die beiden Seiten von Gleichungen angewendet.
</p>
<p>Siehe auch die Funktionen <code><a href="#rectform">rectform</a></code>,
 <code><a href="#realpart">realpart</a></code>,

<code><a href="#imagpart">imagpart</a></code>,
 <code><a href="#carg">carg</a></code>,
 <code><a href="#conjugate">conjugate</a></code>,
 und 
<code><a href="#polarform">polarform</a></code>
 f&uuml;r das Rechnen mit komplexen Zahlen.
</p>
<p>Beispiele:
</p>
<p>Zwei Beispiele mit der Wurzelfunktion <code><a href="#sqrt">sqrt</a></code>
 und der Sinusfunktion
<code><a href="#sin">sin</a></code>.
</p>

<pre class="example">(%i1) cabs(sqrt(1+%i*x));
                             2     1/4
(%o1)                      (x  + 1)
(%i2) cabs(sin(x+%i*y));
                    2        2         2        2
(%o2)       sqrt(cos (x) sinh (y) + sin (x) cosh (y))
</pre>
<p>Die Funktion <code><a href="maxima_22.html#erf">erf</a></code>
 hat Spiegelsymmetrie, die hier f&uuml;r die Berechnung des
komplexen Betrages angewendet wird.
</p>
<pre class="example">(%i3) cabs(erf(x+%i*y));
                                          2
           (erf(%i y + x) - erf(%i y - x))
(%o3) sqrt(--------------------------------
                          4
                                                               2
                                (erf(%i y + x) + erf(%i y - x))
                              - --------------------------------)
                                               4
</pre>
<p>Maxima kennt komplexe Eigenschaften der Besselfunktionen, um den komplexen
Betrag zu vereinfachen.  Dies ist ein Beispiel f&uuml;r die Besselfunktion
<code><a href="maxima_22.html#bessel_005fj">bessel_j</a></code>.
</p>

<pre class="example">(%i4) cabs(bessel_j(1,%i));
(%o4)                 abs(bessel_j(1, %i))
</pre></dd></dl>

<p><a name="carg"></a>
</p><dl>
<dt><u>Funktion:</u> <b>carg</b><i> (<var>expr</var>)</i>
<a name="IDX345"></a>
</dt>
<dd><p>Gibt das komplexe Argument des Ausdrucks <var>expr</var> zur&uuml;ck.  Das komplexe
Argument ist ein Winkel <code>theta</code> im Intervall <code>(-%pi, %pi)</code> derart,
dass <var>expr</var> = <code>r exp (theta %i)</code> gilt, wobei <code>r</code> den Betrag des
komplexen Ausdrucks <var>expr</var> bezeichnet.  Das ist die Polarform des Ausdrucks,
wie sie auch von der Funktion <code><a href="#polarform">polarform</a></code>
 zur&uuml;ckgegeben wird.  Der Betrag
des komplexen Ausdrucks kann mit der Funktion <code><a href="#cabs">cabs</a></code>
 berechnet werden.
</p>
<p>Das Ergebnis der Funktion <code>carg</code> kann die Funktion <code><a href="#atan2">atan2</a></code>
 enthalten.
</p>
<p><code>carg</code> wird automatisch auf die Elemente von Listen und Matrizen sowie auf
die beiden Seiten von Gleichungen angewendet.  Siehe <code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Die Funktion <code>carg</code> ist eine Verbfunktion, mit der nicht symbolisch
gerechnet werden kann.
</p>
<p>Siehe auch die Funktionen <code><a href="#rectform">rectform</a></code>,
 <code><a href="#realpart">realpart</a></code>
 und
<code><a href="#imagpart">imagpart</a></code>
 sowie die Funktionen <code><a href="#cabs">cabs</a></code>
 und <code><a href="#conjugate">conjugate</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) carg (1);
(%o1)                           0
(%i2) carg (1 + %i);
                               %pi
(%o2)                          ---
                                4
(%i3) carg (exp (%i));
(%o3)                           1

(%i4) carg (exp (3/2 * %pi * %i));
                                %pi
(%o4)                         - ---
                                 2
(%i5) carg(exp(x+%i*y));
(%o5)                atan2(sin(y), cos(y))

(%i6) carg(sqrt(x+%i*y));
                          atan2(y, x)
(%o6)                     -----------
                               2
(%i7) carg(sqrt(1+%i*y));
                            atan(y)
(%o7)                       -------
                               2
</pre></dd></dl>

<p><a name="conjugate"></a>
</p><dl>
<dt><u>Funktion:</u> <b>conjugate</b><i> (<var>expr</var>)</i>
<a name="IDX346"></a>
</dt>
<dd><p>Gibt den konjugiert komplexen Wert des Ausdrucks <var>expr</var> zur&uuml;ck.  Sind
<var>x</var> und <var>y</var> reelle Variablen oder Ausdr&uuml;cke, dann hat der Ausdruck
<code>x + %i*y</code> das Ergebnis <code>x - %i*y</code>.  Die Funktion <code>conjugate</code> ist
f&uuml;r numerische und symbolische Rechnungen geeignet.
</p>
<p>Maxima kennt Regeln, um den konjugierten Wert f&uuml;r Summen, Produkte und
Quotienten von komplexen Ausdr&uuml;cken zu vereinfachen.  Weiterhin kennt Maxima
Symmetrieeigenschaften und komplexe Eigenschaften von Funktionen, um den 
konjugierten Wert mit diesen Funktionen zu vereinfachen.  Sind solche
Eigenschaften f&uuml;r eine Funktion vorhanden, k&ouml;nnen diese mit der
Funktion <code><a href="maxima_11.html#properties">properties</a></code>
 angezeigt werden.  Eigenschaften, die das Ergebnis
der Funktion <code>conjugate</code> bestimmen, sind: <code>mirror symmetry</code>,
<code>conjugate function</code> und <code>complex characteristic</code>.
</p>
<p><code>conjugate</code> wird automatisch auf die Elemente von Listen und Matrizen sowie
auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>F&uuml;r das Rechnen mit komplexen Ausdr&uuml;cken siehe auch die Funktionen
<code><a href="#cabs">cabs</a></code>
 und <code><a href="#carg">carg</a></code>
 sowie <code><a href="#rectform">rectform</a></code>
 und <code><a href="#polarform">polarform</a></code>.
</p>

<p>Beispiele:
</p>
<p>Beispiele mit reellen, imagin&auml;ren und komplexen Variablen.
</p>
<pre class="example">(%i1) declare ([x, y], real, [z1, z2], complex, j, imaginary);
(%o1)                         done
(%i2) conjugate(x + %i*y);
(%o2)                       x - %i y
(%i3) conjugate(z1*z2);
(%o3)              conjugate(z1) conjugate(z2)
(%i4) conjugate(j/z2);
                                 j
(%o4)                    - -------------
                           conjugate(z2)
</pre>
<p>Im Folgenden nutzt Maxima Symmetrieeigenschaften, um den konjugiert komplexen
Wert der Funktionen <code><a href="maxima_22.html#gamma">gamma</a></code>
 und <code><a href="#sin">sin</a></code>
 zu berechnen.  Die
Logarithmusfunktion <code><a href="#log">log</a></code>
 hat Spiegelsymmetrie, wenn das Argument einen
positiven Realteil hat.
</p>
<pre class="example">(%i5) conjugate(gamma(x+%i*y));
(%o5)                    gamma(x - %i y)
(%i6) conjugate(sin(x+%i*y));
(%o6)                    - sin(%i y - x)
(%i7) conjugate(log(x+%i*y));
(%o7)               conjugate(log(%i y + x))
(%i8) conjugate(log(1+%i*y));
(%o8)                     log(1 - %i y)
</pre></dd></dl>

<p><a name="imagpart"></a>
</p><dl>
<dt><u>Funktion:</u> <b>imagpart</b><i> (<var>expr</var>)</i>
<a name="IDX347"></a>
</dt>
<dd><p>Gibt den Imagin&auml;rteil des Ausrucks <var>expr</var> zur&uuml;ck.  Intern berechnet
Maxima den Imagin&auml;rteil mit der Funktion <code><a href="#rectform">rectform</a></code>,
 die einen
Ausdruck in den Realteil und in den Imagin&auml;rteil zerlegt.  Daher treffen die
Ausf&uuml;hrungen zu <code>rectform</code> auch auf die Funktion <code>imagpart</code> zu.
</p>
<p>Wie die Funktion <code>rectform</code> ist auch die Funktion <code>imagpart</code> eine
Verbfunktion, mit der nicht symbolisch gerechnet werden kann.
</p>
<p><code>imagpart</code> wird automatisch auf die Elemente von Listen und Matrizen sowie
auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Mit der Funktion <code><a href="#realpart">realpart</a></code>
 wird der Realteil eines Ausdrucks berechnet.
</p>
<p>Siehe auch die Funktionen <code><a href="#cabs">cabs</a></code>,
 <code><a href="#carg">carg</a></code>
 und
<code><a href="#conjugate">conjugate</a></code>
 f&uuml;r das Rechnen mit komplexen Zahlen.  Mit der Funktion
<code><a href="#polarform">polarform</a></code>
 kann ein komplexer Ausdruck in die Polarform gebracht werden.
</p>
<p>Beispiele:
</p>
<p>F&uuml;r weitere Erl&auml;uterungen dieser Beispiele siehe auch die Funktion
<code><a href="#rectform">rectform</a></code>.
</p>

<pre class="example">(%i1) imagpart((2-%i)/(1-%i));
                                1
(%o1)                           -
                                2
(%i2) imagpart(sin(x+%i*y));
(%o2)                    cos(x) sinh(y)
(%i3) imagpart(gamma(x+%i*y));
             %i (gamma(x - %i y) - gamma(%i y + x))
(%o3)        --------------------------------------
                               2
(%i4) imagpart(bessel_j(1,%i));
(%o4)                    bessel_j(1, %i)
</pre></dd></dl>

<p><a name="polarform"></a>
</p><dl>
<dt><u>Funktion:</u> <b>polarform</b><i> (<var>expr</var>)</i>
<a name="IDX348"></a>
</dt>
<dd><p>Gibt den Ausdruck <var>expr</var> in der Polarform <code>r %e^(%i theta)</code> zur&uuml;ck.
<code>r</code> ist der Betrag des komplexen Ausdrucks, wie er auch mit der Funktion
<code><a href="#cabs">cabs</a></code>
 berechnet werden kann.  <code>theta</code> ist das Argument des komplexen
Ausdrucks, das mit der Funktion <code><a href="#carg">carg</a></code>
 berechnet werden kann.
</p>
<p>Maxima kennt komplexe Eigenschaften von Funktionen, die bei der Berechnung der
Polarform angewendet werden.  Siehe die Funktion <code><a href="#cabs">cabs</a></code>
 f&uuml;r weitere
Erl&auml;uterungen.
</p>
<p>Wenn mit komplexen Ausdr&uuml;cken in der Polarform gerechnet werden soll, ist es
hilfreich die Optionsvariable <code><a href="#g_t_0025emode">%emode</a></code>
 auf den Wert <code>false</code> zu setzen.
Damit wird verhindert, dass Maxima komplexe Ausdr&uuml;cke mit der
Exponentialfunktion <code><a href="#exp">exp</a></code>
 automatisch in die Standardform vereinfacht.
</p>
<p><code>polarform</code> wird automatisch auf die Elemente von Listen und Matrizen sowie
auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Die Funktion <code>polarform</code> ist eine Verbfunktion, mit der nicht symbolisch
gerechnet werden kann.
</p>
<p>Siehe auch die Funktionen <code><a href="#cabs">cabs</a></code>,
 <code><a href="#carg">carg</a></code>
 und
<code><a href="#conjugate">conjugate</a></code>
 f&uuml;r das Rechnen mit komplexen Zahlen.  Mit der Funktion
<code><a href="#rectform">rectform</a></code>
 kann ein komplexer Ausdruck in die Standardform gebracht werden.
</p>
<p>Beispiele:
</p>
<p>Die allgemeine Polarform eines komplexen Ausdrucks.  Die Variablen <var>x</var> und
<var>y</var> werden von Maxima als reell angenommen.
</p>
<pre class="example">(%i1) polarform(x+%i*y);
                       2    2    %i atan2(y, x)
(%o1)            sqrt(y  + x ) %e
</pre>
<p>Die Polarform einer komplexen Zahl und eines Ausdrucks mit einer reellen 
Variablen <var>x</var>.
</p>
<pre class="example">(%i2) polarform(4/5+3*%i/5);
                           %i atan(3/4)
(%o2)                    %e
(%i3) polarform(sqrt(1+%i*x));
                                  %i atan(x)
                                  ----------
                      2     1/4       2
(%o3)               (x  + 1)    %e
</pre>
<p>Wenn in der Polarform gerechnet werden soll, ist es hilfreich die
Optionsvariable <code><a href="#g_t_0025emode">%emode</a></code>
 auf den Wert <code>false</code> zu setzen.  Damit wird
verhindert, dass Maxima komplexe Ausdr&uuml;cke mit der Exponentialfunktion 
<code><a href="#exp">exp</a></code>
 automatisch in eine Standardform vereinfacht.
</p>
<pre class="example">(%i4) z:polarform(1+%i);
                                  %i %pi
                                  ------
                                    4
(%o4)                   sqrt(2) %e
(%i5) z^3;
                     3/2    %i         1
(%o5)               2    (------- - -------)
                          sqrt(2)   sqrt(2)
(%i6) %emode:false;
(%o6)                         false
(%i7) z^3;
                                3 %i %pi
                                --------
                          3/2      4
(%o7)                    2    %e
</pre></dd></dl>

<p><a name="realpart"></a>
</p><dl>
<dt><u>Funktion:</u> <b>realpart</b><i> (<var>expr</var>)</i>
<a name="IDX349"></a>
</dt>
<dd><p>Gibt den Realteil des Ausdrucks <var>expr</var> zur&uuml;ck.  Intern berechnet Maxima
den Realteil mit der Funktion <code><a href="#rectform">rectform</a></code>,
 die einen Ausdruck in den
Realteil und in den Imagin&auml;rteil zerlegt.  Daher treffen die Ausf&uuml;hrungen
zu <code>rectform</code> auch auf die Funktion <code>realpart</code> zu.
</p>
<p>Wie die Funktion <code>rectform</code> ist auch die Funktion <code>realpart</code> eine
Verbfunktion, mit der nicht symbolisch gerechnet werden kann.
</p>
<p><code>realpart</code> wird automatisch auf die Elemente von Listen und Matrizen sowie
auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Mit der Funktion <code><a href="#imagpart">imagpart</a></code>
 wird der Imagin&auml;rteil eines Ausdrucks
berechnet.
</p>
<p>Siehe auch die Funktionen <code><a href="#cabs">cabs</a></code>,
 <code><a href="#carg">carg</a></code>
 und
<code><a href="#conjugate">conjugate</a></code>
 f&uuml;r das Rechnen mit komplexen Zahlen.  Mit der Funktion
<code><a href="#polarform">polarform</a></code>
 kann ein komplexer Ausdruck in die Polarform gebracht werden.
</p>
<p>Beispiele:
</p>
<p>F&uuml;r weitere Erl&auml;uterungen dieser Beispiele siehe auch die Funktion
<code><a href="#rectform">rectform</a></code>.
</p>

<pre class="example">(%i1) realpart((2-%i)/(1-%i));
                                3
(%o1)                           -
                                2
(%i2) realpart(sin(x+%i*y));
(%o2)                    sin(x) cosh(y)
(%i3) realpart(gamma(x+%i*y));
                gamma(%i y + x) + gamma(x - %i y)
(%o3)           ---------------------------------
                                2
(%i4) realpart(bessel_j(1,%i));
(%o4)                           0
</pre></dd></dl>

<p><a name="rectform"></a>
</p><dl>
<dt><u>Funktion:</u> <b>rectform</b><i> (<var>expr</var>)</i>
<a name="IDX350"></a>
</dt>
<dd><p>Zerlegt den Ausdruck <var>expr</var> in den Realteil <code>a</code> und den Imagin&auml;rteil
<code>b</code> und gibt den komplexen Ausdruck in der Standardform <code>a + b %i</code>
zur&uuml;ck.
</p>
<p>Die Funktion <code>rectform</code> nutzt Symmetrieeigenschaften und implementierte
Eigenschaften komplexer Funktionen, um den Realteil und Imagin&auml;rteil eines
komplexen Ausdrucks zu berechnen.  Sind solche Eigenschaften f&uuml;r eine Funktion
vorhanden, k&ouml;nnen diese mit der Funktion <code><a href="maxima_11.html#properties">properties</a></code>
 angezeigt werden.
Eigenschaften, die das Ergebnis der Funktion <code>rectform</code> bestimmen, sind:
<code>mirror symmetry</code>, <code>conjugate function</code> und
<code>complex characteristic</code>.
</p>
<p><code>rectform</code> ist eine Verbfunktion, die nicht f&uuml;r das symbolische Rechnen
geeignet ist.
</p>
<p><code>rectform</code> wird automatisch auf die Elemente von Listen und Matrizen sowie
auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Die Funktionen <code><a href="#realpart">realpart</a></code>
 und <code><a href="#imagpart">imagpart</a></code>
 geben jeweils allein den
Realteil und den Imagin&auml;rteil eines Ausdrucks zur&uuml;ck.  Um einen Ausdruck in
die Polarform zu bringen, kann die Funktion <code><a href="#polarform">polarform</a></code>
 verwendet werden.
</p>
<p>Siehe auch die Funktionen <code><a href="#cabs">cabs</a></code>,
 <code><a href="#carg">carg</a></code>
 und
<code><a href="#conjugate">conjugate</a></code>
 f&uuml;r das Rechnen mit komplexen Zahlen.
</p>
<p>Beispiele:
</p>
<p>Zerlegung eines komplexen Ausdrucks und der Sinusfunktion <code><a href="#sin">sin</a></code>
 in den
Realteil und Imagin&auml;rteil.  Maxima kennt komplexe Eigenschaften der
trigonometrischen Funktionen, um den Realteil und den Imagin&auml;rteil zu
bestimmen.
</p>
<pre class="example">(%i1) rectform((2-%i)/(1-%i));
                             %i   3
(%o1)                        -- + -
                             2    2
(%i2) rectform(sin(x+%i*y));
(%o2)          %i cos(x) sinh(y) + sin(x) cosh(y)
</pre>
<p>Bei der Zerlegung in einen Realteil und einen Imagin&auml;rteil nutzt Maxima die
Spiegelsymmetrie der Gammfunktion <code><a href="maxima_22.html#gamma">gamma</a></code>.
  Die Eigenschaft der 
Spiegelsymmetrie wird mit der Funktion <code><a href="maxima_11.html#properties">properties</a></code>
 angezeigt, der Eintrag
lautet <code>mirror symmetry</code>.
</p>
<pre class="example">(%i3) properties(gamma);
(%o3)    [mirror symmetry, noun, rule, gradef, transfun]

(%i4) rectform(gamma(x+%i*y));
      gamma(%i y + x) + gamma(x - %i y)
(%o4) ---------------------------------
                      2
                                gamma(x - %i y) - gamma(%i y + x)
                              - ---------------------------------
                                                2
</pre>
<p>Maxima kennt komplexe Eigenschaften der Besselfunktionen.  Die Besselfunktion
<code><a href="maxima_22.html#bessel_005fj">bessel_j</a></code>
 ist f&uuml;r eine ganzzahlige Ordnung und einem imagin&auml;ren
Argument rein imagin&auml;r.
</p>
<pre class="example">(%i5) rectform(bessel_j(1,%i));
(%o5)                  %i bessel_j(1, %i)
</pre></dd></dl>

<hr size="6">
<a name="Funktionen-der-Kombinatorik"></a>
<a name="SEC63"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC62" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC64" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.3 Funktionen der Kombinatorik </h2>

<p><a name="g_t_0021_0021"></a>
</p><dl>
<dt><u>Operator:</u> <b>!!</b>
<a name="IDX351"></a>
</dt>
<dd><p>Ist der Operator der doppelten Fakult&auml;t.
</p>
<p>F&uuml;r eine positive ganze Zahl <code>n</code>, wird <code>n!!</code> zu dem Produkt
<code>n (n-2) (n-4) (n-6) ... (n - 2 (k-1))</code> vereinfacht, wobei <code>k</code> gleich
<code>floor(n/2)</code> ist und <code><a href="#floor">floor</a></code>
 die gr&ouml;&szlig;te ganze Zahl als Ergebnis
hat, die kleiner oder gleich <code>n/2</code> ist.
</p>
<p>F&uuml;r ein Argument <code>n</code>, das keine ganze positive Zahl ist, gibt <code>n!!</code>
die Substantivform <code>genfact(n, n/2,2)</code> zur&uuml;ck.  Siehe die Funktion
<code><a href="#genfact">genfact</a></code>.
</p>

<p>Die Verallgemeinerung der doppelten Fakult&auml;t f&uuml;r reelle und komplexe Zahlen
ist als die Funktion <code><a href="#double_005ffactorial">double_factorial</a></code>
 implementiert.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) [0!!, 1!!, 2!!, 3!!, 4!!, 5!!, 6!!, 7!!, 8!!];
(%o1)           [1, 1, 2, 3, 8, 15, 48, 105, 384]
(%i2) 1.5!!;
(%o2)                  genfact(1.5, 0, 2)
(%i3) x!!;
                                   x
(%o3)                   genfact(x, -, 2)
                                   2
</pre></dd></dl>

<p><a name="binomial"></a>
</p><dl>
<dt><u>Funktion:</u> <b>binomial</b><i> (<var>x</var>, <var>y</var>)</i>
<a name="IDX352"></a>
</dt>
<dd><p>Ist der Binominialkoeffizient, der definiert ist als
</p><pre class="example">                                  x!
             binomial(x, y) = -----------
                              (x - y)! y!
</pre>
<p>Die Funktion <code>binomial</code> ist f&uuml;r das numerische und symbolische Rechnen
geeignet.
</p>
<p>Sind die Argumente <var>x</var> oder <var>y</var> ganze Zahlen, wird der
Binominialkoeffizient zu einer ganzen Zahl vereinfacht.  Sind die Argumente
<var>x</var> und <var>y</var> reelle oder komplexe Gleitkommazahlen, wird der
Binominialkoeffizient mit der entsprechenden verallgemeinerten Fakult&auml;t
berechnet.  Siehe auch <code><a href="#factorial">factorial</a></code>
 und <code><a href="maxima_22.html#gamma">gamma</a></code>.
</p>

<p>Ist das Argument <var>y</var> oder die Differenz <var>x-y</var> eine ganz Zahl, wird
der Binominialkoeffizient zu einem Polynom vereinfacht.
</p>
<p>Mit den Funktionen <code><a href="maxima_22.html#makefact">makefact</a></code>
 oder <code><a href="maxima_22.html#makegamma">makegamma</a></code>
 werden
Binominialkoeffizienten in einem Ausdruck durch &auml;quivalente Ausdr&uuml;cke mit
der Fakult&auml;t oder der Gammafunktion ersetzt.
</p>
<p>Maxima kennt die Ableitung des Binominialkoeffizienten nach den Argumenten
<var>x</var> und <var>y</var>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) binomial(11, 7);
(%o1)                          330
(%i2) binomial(%i, 1.5);
(%o2)       .3693753994635863 %i - .7573400496142132
(%i3) binomial(x, 3);
                        (x - 2) (x - 1) x
(%o3)                   -----------------
                                6
(%i4) binomial(x+3, 3);
                     (x + 1) (x + 2) (x + 3)
(%o4)                -----------------------
                                6
(%i5) makefact(binomial(x,y));
                               x!
(%o5)                      -----------
                           (x - y)! y!

(%i6) diff(binomial(x,y), y);
(%o6)  - binomial(x, y) (psi (y + 1) - psi (- y + x + 1))
                            0             0
</pre></dd></dl>

<p><a name="double_005ffactorial"></a>
</p><dl>
<dt><u>Funktion:</u> <b>double_factorial</b><i> (z)</i>
<a name="IDX353"></a>
</dt>
<dd><p>Ist die doppelte Fakult&auml;t, die allgemein definiert ist als
</p><pre class="example">               2  1/4 (1 - cos(z %pi))  z/2       z
             (---)                     2    gamma(- + 1)
              %pi                                 2
</pre>
<p>Die Funktion <code>double_factorial</code> ist f&uuml;r das numerische und symbolische
Rechnen geeignet.  Ist das Argument <var>z</var> eine ganze Zahl, eine
Gleitkommazahl, eine gro&szlig;e Gleitkommazahl oder eine komplexe Gleitkommazahl,
dann wird ein numerisches Ergebnis berechnet.  F&uuml;r eine positive ganze Zahl
ist das Ergebnis gleich dem Ergebnis des Operators der doppelten Fakult&auml;t
<code><a href="#g_t_0021_0021">!!</a></code>
.  F&uuml;r rationale Zahlen ist das Ergebnis eine Substantivform.
</p>
<p>F&uuml;r negative gerade ganze Zahlen ist die Funktion <code>double_factorial</code>
nicht definiert.
</p>
<p>Hat die Optionsvariable <code><a href="#factorial_005fexpand">factorial_expand</a></code>
 den Wert <code>true</code>, 
vereinfacht Maxima <code>double_factorial</code> f&uuml;r das Argument <code>n-1</code> und
f&uuml;r Argumente <code>n+2*k</code>, wobei <code>k</code> eine ganze Zahl ist.
</p>
<p>Maxima kennt die Ableitung der Funktion <code>double_factorial</code>.
</p>
<p><code>double_factorial</code> wird automatisch auf die Elemente von Listen und
Matrizen sowie auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Beispiele:
</p>
<p>Numerische Ergebnisse f&uuml;r ganze Zahlen, Gleitkommazahlen und komplexen
Gleitkommazahlen.
</p>
<pre class="example">(%i1) double_factorial([-3, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o1) [- 1, 1, 1, 1, 2, 3, 8, 15, 48, 105, 384, 945, 3840]

(%i2) double_factorial([1.5, 1.5b0, 0.5+%i, 0.5b0+%i]);
(%o2) [1.380662681753386, 1.380662681753387b0,
.4186422526242637 - .7218816624466643 %i, 
4.186422526242633b-1 - 7.218816624466641b-1 %i]
</pre>
<p>Vereinfachungen, wenn die Optionsvariable <code><a href="#factorial_005fexpand">factorial_expand</a></code>
 den Wert
<code>true</code> hat.
</p>
<pre class="example">(%i3) factorial_expand:true;
(%o3)                         true
(%i4) double_factorial(n-1);
                               n!
(%o4)                  -------------------
                       double_factorial(n)
(%i5) double_factorial(n+4);
(%o5)          (n + 2) (n + 4) double_factorial(n)
(%i6) double_factorial(n-4);
                       double_factorial(n)
(%o6)                  -------------------
                            (n - 2) n
</pre>
<p>Die Ableitung der Funktion <code>double_factorial</code>.
</p>
<pre class="example">(%i7) diff(double_factorial(x), x);
                                     2
                            %pi log(---) sin(%pi x)
                                    %pi                    x
(%o7) (double_factorial(x) (----------------------- + psi (- + 1)
                                       2                 0 2
                                                     + log(2)))/2
</pre></dd></dl>

<p><a name="factcomb"></a>
</p><dl>
<dt><u>Funktion:</u> <b>factcomb</b><i> (<var>expr</var>)</i>
<a name="IDX354"></a>
</dt>
<dd><p>Fasst Faktoren mit Fakult&auml;ten im Ausdruck <var>expr</var> zusammen.  Zum Beispiel
wird <code>(n+1)*n!</code> zu <code>(n+1)!</code> zusammengefasst.
</p>
<p>Hat die Optionsvariable <code><a href="#sumsplitfact">sumsplitfact</a></code>
 den Wert <code>false</code>, wird nach
der Vereinfachung mit <code>factcomb</code> die Funktion <code><a href="#minfactorial">minfactorial</a></code>
 auf den 
Ausdruck <var>expr</var> angewendet.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) expr: ((n+1)*n!)/(n+2)!;
                           (n + 1) n!
(%o1)                      ----------
                            (n + 2)!
(%i2) factcomb(expr);
                            (n + 1)!
(%o2)                       --------
                            (n + 2)!
(%i3) factcomb(expr), sumsplitfact:false;
                                1
(%o3)                         -----
                              n + 2
</pre></dd></dl>

<p><a name="factorial"></a>
<a name="g_t_0021"></a>
</p><dl>
<dt><u>Funktion:</u> <b>factorial</b><i> (<var>z</var>)</i>
<a name="IDX355"></a>
</dt>
<dt><u>Operator:</u> <b>!</b>
<a name="IDX356"></a>
</dt>
<dd><p>Die Funktion <code>factorial</code> ist f&uuml;r das numerische und symbolische Rechnen
der Fakult&auml;t geeignet.  Der Operator der Fakult&auml;t <code>!</code>, ist identisch
mit der Funktion <code>factorial</code>.
</p>
<p>F&uuml;r eine ganze Zahl <code>n</code>, vereinfacht <code>n!</code> zum Produkt der ganzen
Zahlen von 1 bis einschlie&szlig;lich <code>n</code>.  <code>0!</code> vereinfacht zu 1.
F&uuml;r reelle und komplexe Gleitkommazahlen wird <code>z!</code> mit der
Verallgemeinerung <code>gamma(z+1)</code> berechnet.  Siehe die Funktion
<code><a href="maxima_22.html#gamma">gamma</a></code>.
  F&uuml;r eine halbzahlige rationale Zahl <code>n/2</code>, vereinfacht
<code>(n/2)!</code> zu einem rationalen Faktor multipliziert mit <code>sqrt(%pi)</code>.
</p>
<p>Die Optionsvariable <code><a href="#factlim">factlim</a></code>
 enth&auml;lt die gr&ouml;&szlig;te Zahl, f&uuml;r die
die Fakult&auml;t einer ganzen Zahl numerisch berechnet wird.  Ist das Argument
der Fakult&auml;t eine rationale Zahl, wird von Maxima die Funktion
<code><a href="maxima_22.html#gamma">gamma</a></code>
 f&uuml;r die numerische Berechnung aufgerufen.  In diesem Fall ist
<code>gammalim - 1</code> der gr&ouml;&szlig;te Nenner, f&uuml;r den die Fakult&auml;t vereinfacht
wird.  Siehe <code><a href="maxima_22.html#gammalim">gammalim</a></code>.
</p>

<p>Hat die Optionsvariable <code><a href="#factorial_005fexpand">factorial_expand</a></code>
 den Wert <code>true</code>, wird die
Fakult&auml;t von Argumenten der Form <code>(n+k)!</code> oder <code>(n-k)!</code> vereinfacht,
wobei <code>k</code> eine ganze Zahl ist.
</p>
<p>Mit den Funktionen <code><a href="#minfactorial">minfactorial</a></code>
 und <code><a href="#factcomb">factcomb</a></code>
 k&ouml;nnen Fakult&auml;ten
in Ausdr&uuml;cken vereinfacht werden.
</p>
<p>Die Funktion <code><a href="maxima_22.html#makegamma">makegamma</a></code>
 ersetzt Fakult&auml;ten in einem Ausdruck durch die
Gammafunktion <code><a href="maxima_22.html#gamma">gamma</a></code>.
  Umgekehrt ersetzt die Funktion
<code><a href="maxima_22.html#makefact">makefact</a></code>
 Binomialkoeffizienten und die Gammafunktion in einem Ausdruck
durch Fakult&auml;ten.
</p>
<p>Maxima kennt die Ableitung der Fakult&auml;t und die Grenzwerte der Fakult&auml;t
f&uuml;r spezielle Werte wie negative ganze Zahlen.
</p>
<p>Siehe auch die Gammfunktion <code><a href="maxima_22.html#gamma">gamma</a></code>
 und den Binomialkoeffizienten
<code><a href="#binomial">binomial</a></code>.
</p>

<p>Beispiele:
</p>
<p>Die Fakult&auml;t einer ganzen Zahl wird zu einer exakten Zahl vereinfacht, wenn
das Argument nicht gr&ouml;&szlig;er als <code>factlim</code> ist.  Die Fakult&auml;t f&uuml;r 
reelle und komplexe Zahlen wird als Gleitkommazahl berechnet.
</p>
<pre class="example">(%i1) factlim:10;
(%o1)                          10
(%i2) [0!, (7/2)!, 8!, 20!];
                     105 sqrt(%pi)
(%o2)            [1, -------------, 40320, 20!]
                          16
(%i3) [4.77!, (1.0+%i)!];
(%o3) [81.44668037931197, .3430658398165451 %i
                                             + .6529654964201663]
(%i4) [2.86b0!, (1.0b0+%i)!];
(%o4) [5.046635586910012b0, 3.430658398165454b-1 %i
                                          + 6.529654964201667b-1]
</pre>
<p>Die Fakult&auml;t von numerischen Konstanten oder eines konstanten Ausdrucks wird
numerisch berechnet, wenn die Konstante oder der Ausdruck zu einer Zahl
ausgewertet werden kann.
</p>
<pre class="example">(%i1) [(%i + 1)!, %pi!, %e!, (cos(1) + sin(1))!];
(%o1)      [(%i + 1)!, %pi!, %e!, (sin(1) + cos(1))!]
(%i2) ev (%, numer, %enumer);
(%o2) [.3430658398165451 %i + .6529654964201663, 
         7.188082728976031, 4.260820476357003, 1.227580202486819]
</pre>
<p>Fakult&auml;ten werden vereinfacht und nicht ausgewertet.  Daher wird die
Fakult&auml;t auch dann berechnet, wenn die Auswertung mit dem
<a href="maxima_8.html#g_t_0027">Quote-Operator</a>
 <code>'</code> unterdr&uuml;ckt ist.
</p>
<pre class="example">(%i1) '([0!, (7/2)!, 4.77!, 8!, 20!]);
            105 sqrt(%pi)
(%o1)   [1, -------------, 81.44668037931197, 40320, 20!]
                 16
</pre>
<p>Maxima kennt die Ableitung der Fakult&auml;t.
</p>
<pre class="example">(%i1) diff(x!, x);
(%o1)                    x! psi (x + 1)
                               0
</pre>
<p>Die Optionsvariable <code>factorial_expand</code> kontrolliert die Expansion und
Vereinfachung von Ausdr&uuml;cken, die die Fakult&auml;t enthalten.
</p>
<pre class="example">(%i1) (n+1)!/n!,factorial_expand:true;
(%o1)                         n + 1
</pre></dd></dl>

<p><a name="factlim"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>factlim</b>
<a name="IDX357"></a>
</dt>
<dd><p>Standardwert: 100000
</p>
<p>Die Optionsvariable <code>factlim</code> spezifiziert die gr&ouml;&szlig;te ganze Zahl, 
f&uuml;r die die Fakult&auml;t einer ganzen Zahl numerisch berechnet wird.  Hat
<code>factlim</code> den Wert -1, wird die Fakult&auml;t f&uuml;r jede ganze Zahl
berechnet.  Siehe die Funktion <code><a href="#factorial">factorial</a></code>.
</p>
</dd></dl>

<p><a name="factorial_005fexpand"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>factorial_expand</b>
<a name="IDX358"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Die Optionsvariable <code>factorial_expand</code> kontrolliert die Vereinfachung von
Ausdr&uuml;cken wie <code>(n+k)!</code> oder <code>(n-k)!</code>, wobei <code>k</code> eine
ganze Zahl ist.  Siehe <code><a href="#factorial">factorial</a></code>
 f&uuml;r ein Beispiel.
</p>
<p>Siehe auch die Funktionen <code><a href="#minfactorial">minfactorial</a></code>
 und <code><a href="#factcomb">factcomb</a></code>
 f&uuml;r die
Vereinfachung von Ausdr&uuml;cken mit der Fakult&auml;t.
</p></dd></dl>

<p><a name="genfact"></a>
</p><dl>
<dt><u>Funktion:</u> <b>genfact</b><i> (<var>x</var>, <var>y</var>, <var>z</var>)</i>
<a name="IDX359"></a>
</dt>
<dd><p>Gibt die verallgemeinerte Fakult&auml;t zur&uuml;ck, die als <code>x (x-z) (x - 2 z) 
... (x - (y - 1) z)</code> definiert ist.  Ist <var>x</var> eine ganze Zahl, dann
entspricht <code>genfact(x, x, 1)</code> der Fakult&auml;t <code>x!</code> und 
<code>genfact(x, x/2, 2)</code> der doppelten Fakult&auml;t <code>x!!</code>.  Siehe auch die 
Funktionen <code><a href="#factorial">factorial</a></code>
 und <code><a href="#double_005ffactorial">double_factorial</a></code>
 sowie die Operatoren
<code><a href="#g_t_0021">!</a></code>
 und <code><a href="#g_t_0021_0021">!!</a></code>.
</p>
</dd></dl>

<p><a name="minfactorial"></a>
</p><dl>
<dt><u>Funktion:</u> <b>minfactorial</b><i> (<var>expr</var>)</i>
<a name="IDX360"></a>
</dt>
<dd><p>Die Funktion <code>minfactorial</code> vereinfacht Fakult&auml;ten <code><a href="#factorial">factorial</a></code>
 in
dem Ausdruck <var>epxr</var>, die sich um eine ganze Zahl voneinander unterscheiden.
Siehe auch die Funktion <code><a href="#factcomb">factcomb</a></code>,
 um Fakult&auml;ten zusammenzufassen,
sowie die Optionsvariable <code><a href="#factorial_005fexpand">factorial_expand</a></code>.
</p>

<pre class="example">(%i1) n!/(n+2)!;
                               n!
(%o1)                       --------
                            (n + 2)!
(%i2) minfactorial (%);
                                1
(%o2)                    ---------------
                         (n + 1) (n + 2)
</pre></dd></dl>

<p><a name="sumsplitfact"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>sumsplitfact</b>
<a name="IDX361"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat die Optionsvariable <code>sumsplitfact</code> den Wert <code>false</code>, wird von
der Funktion <code>factcomb</code> nach der Zusammenfassung von Fakult&auml;ten die
Funktion <code><a href="#minfactorial">minfactorial</a></code>
 angewendet.  Siehe die Funktion
<code><a href="#factcomb">factcomb</a></code>
 f&uuml;r ein Beispiel.
</p></dd></dl>

<hr size="6">
<a name="Wurzel_002d_002cExponential_002d-und-Logarithmusfunktion"></a>
<a name="SEC64"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC63" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC65" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.4 Wurzel-, Exponential- und Logarithmusfunktion </h2>

<p><a name="g_t_0025e_005fto_005fnumlog"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>%e_to_numlog</b>
<a name="IDX362"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>%e_to_numlog</code> den Wert <code>true</code>, wird ein 
Ausdruck mit der Exponentialfunktion <code><a href="#exp">exp</a></code>
 der Form <code>%e^(r*log(x))</code>
zu <code>x^r</code> vereinfacht, wenn <code>r</code> eine rationale Zahl ist.  Ist <code>r</code>
eine ganze Zahl, wird die Vereinfachung von der Optionsvariablen
<code><a href="#logsimp">logsimp</a></code>
 kontrolliert.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) exp(1/2*log(x));
                              log(x)
                              ------
                                2
(%o1)                       %e
(%i2) exp(1/2*log(x)), %e_to_numlog:true;
(%o2)                        sqrt(x)
</pre></dd></dl>

<p><a name="g_t_0025emode"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>%emode</b>
<a name="IDX363"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Die Optionsvariable <code>%emode</code> kontrolliert die Vereinfachung von
Ausdr&uuml;cken mit der Exponentialfunktion <code><a href="#exp">exp</a></code>
 der Form
<code>%e^(%pi %i x)</code>.
</p>
<p>Ist das Argument <var>x</var> eine ganze Zahl oder eine rationale Zahl, die ein
Vielfaches von 1/2, 1/3, 1/4 oder 1/6 ist, dann wird der Ausdruck
<code>%e^(%pi %i x)</code> zu einer reellen oder komplexen Zahl vereinfacht.  F&uuml;r
Gleitkommazahlen wird diese Vereinfachung dann ausgef&uuml;hrt, wenn diese eine
ganze Zahl oder halbzahlige rationale Zahl repr&auml;sentieren.
</p>
<p>Eine Summe im Exponenten wie zum Beispiel <code>%e^(%pi *%i (x+n))</code>, wobei 
<var>n</var> eine der oben genannten Zahlen und <var>x</var> ein allgemeiner Ausdruck ist,
wird vereinfacht, indem der Faktor <code>%^(%pi %i n)</code> entsprechend vereinfacht
wird.
</p>
<p>Hat <code>%emode</code> den Wert <code>false</code>, werden keine speziellen Vereinfachungen
f&uuml;r den Ausdruck <code>%e^(%pi %i x)</code> vorgenommen.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) exp([2*%pi*%i, 1/2*%pi*%i, 0.5*%pi*%i, 0.5b0*%pi*%i]);
(%o1)               [1, %i, 1.0 %i, 1.0b0 %i]

(%i2) exp([1/3*%pi*%i, 1/4*%pi*%i, 1/6*%pi*%i]);
         sqrt(3) %i   1    %i         1     %i   sqrt(3)
(%o2)   [---------- + -, ------- + -------, -- + -------]
             2        2  sqrt(2)   sqrt(2)  2       2

(%i3) exp((1/3+x)*%pi*%i);
                    sqrt(3) %i   1    %i %pi x
(%o3)              (---------- + -) %e
                        2        2
</pre></dd></dl>

<p><a name="g_t_0025enumer"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>%enumer</b>
<a name="IDX364"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>%enumer</code> den Wert <code>true</code>, wird die Konstante <code>%e</code> immer dann
durch ihren nummerischen Wert ersetzt, wenn die Optionsvariable <code><a href="maxima_5.html#numer">numer</a></code>
 den
Wert <code>true</code> hat.
</p>
<p>Hat <code>%enumer</code> den Wert <code>false</code>, wird die Konstante <code>%e</code> nur dann
durch ihren nummerischen Wert ersetzt, wenn der Exponent von <code>%e^x</code> zu 
einer Gleitkommazahl ausgewertet wird.
</p>
<p>Siehe auch <code><a href="maxima_8.html#ev">ev</a></code>
 und <code><a href="maxima_5.html#numer">numer</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) %enumer:true;
(%o1)                         true
(%i2) exp(x);
                                 x
(%o2)                          %e
(%i3) exp(x),numer;
                                        x
(%o3)                  2.718281828459045
</pre></dd></dl>

<p><a name="exp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>exp</b><i> (<var>z</var>)</i>
<a name="IDX365"></a>
</dt>
<dd><p>Ist die Exponentialfunktion.  Die Exponentialfunktion <code>exp</code> wird von Maxima
sofort zu <code>%e^<var>z</var></code> vereinfacht und tritt in vereinfachten
Ausdr&uuml;cken nicht auf.  Maxima vereinfacht die Exponentialfunktion daher wie
die allgemeine Exponentiation <code><a href="maxima_7.html#g_t_005e">^</a></code>.
  Dar&uuml;berhinaus kennt Maxima
spezielle Regeln f&uuml;r die Vereinfachung der Exponentialfunktion.
</p>
<p>Ist das Argument <var>z</var> der Exponentialfunktion eine ganze oder rationale
Zahl wird ein vereinfachter Ausdruck zur&uuml;ckgegeben.  Ist das Argument
<var>z</var> eine reelle oder komplexe Gleitkommazahl wird ein numerisches
Ergebnis berechnet.
</p>
<p>Folgende Optionsvariablen kontrollieren die Vereinfachung der
Exponentialfunktion:
</p>
<dl compact="compact">
<dt> <code>%enumer</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#g_t_0025enumer">%enumer</a></code>
 den Wert <code>true</code>, vereinfacht Maxima
die Eulersche Zahl <code><a href="maxima_5.html#g_t_0025e">%e</a></code>
 immer dann zu ihrem numerischen Wert, wenn die
Optionsvariable <code><a href="maxima_5.html#numer">numer</a></code>
 auch den Wert <code>true</code> hat.
</p>
</dd>
<dt> <code>%emode</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#g_t_0025emode">%emode</a></code>
 den Wert <code>true</code>, wendet Maxima
Regeln an, um Ausdr&uuml;cke der Form <code>%e^(x*%i*%pi)</code> zu vereinfachen.
Der Standardwert von <code>%emode</code> ist <code>true</code>.  Wenn mit komplexen Zahlen
in der Polarform gerechnet wird, kann es hilfreich sein, die Optionsvariable
<code>%emode</code> auf den Wert <code>false</code> zu setzen.
</p>
</dd>
<dt> <code>%e_to_numlog</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#g_t_0025e_005fto_005fnumlog">%e_to_numlog</a></code>
 den Wert <code>true</code>, vereinfacht
Maxima einen Ausdruck <code>%e^(r*log(x)</code> zu <code>x^r</code>, wobei <var>r</var>
eine rationale Zahl ist.  Ist <var>r</var> eine ganze Zahl wird diese Vereinfachung
von der Optionsvariablen <code><a href="#logsimp">logsimp</a></code>
 kontrolliert.  F&uuml;r reelle oder
komplexe Gleitkommazahlen wird diese Vereinfachung nicht ausgef&uuml;hrt.
</p>
</dd>
<dt> <code>radexpand</code></dt>
<dd><p>Die Optionsvariable <code><a href="maxima_9.html#radexpand">radexpand</a></code>
 kontrolliert die Vereinfachung von
Ausdr&uuml;cken der Form <code>(%e^a)^b</code>.  Ist <var>a</var> ein reelles Argument
vereinfacht Maxima immer zu einem Ausdruck <code>%e^(a*b)</code>.  Ist <var>a</var> ein
komplexes Argument, wird die Vereinfachung <code>%e^(a*b)</code> dann ausgef&uuml;hrt,
wenn die Optionsvariable <code>radexpand</code> den Wert <code>all</code> hat.
</p>
</dd>
<dt> <code>logsimp</code></dt>
<dd><p>Die Optionsvariable <code><a href="#logsimp">logsimp</a></code>
 kontrolliert die Vereinfachung der 
Exponentialfunktion f&uuml;r den Fall, dass im Argument <var>expr</var> die
Logarithmusfunktion <code><a href="#log">log</a></code>
 auftritt.  Hat die <code>logsimp</code> den Wert
<code>true</code>, wird ein Ausdruck <code>%e^(n*log(x)</code> zu <code>x^n</code> vereinfacht,
wenn <var>n</var> eine ganze Zahl ist.  Mit der Optionsvariablen
<code><a href="#g_t_0025e_005fto_005fnumlog">%e_to_numlog</a></code>
 wird diese Vereinfachung f&uuml;r eine rationale Zahl <var>n</var>
kontrolliert.
</p>
</dd>
<dt> <code>demoivre</code></dt>
<dd><p>Ist eine Optionsvariable und eine Funktion, die auch als Auswertungsschalter
<code><a href="maxima_8.html#evflag">evflag</a></code>
 definiert ist.  Hat die Optionsvariable <code><a href="maxima_9.html#demoivre">demoivre</a></code>
 den Wert
<code>true</code>, wird ein Ausdruck <code>%e^(x + %i y)</code> zu
<code>%e^x (cos(y) + %i sin(y))</code> vereinfacht.  Siehe auch die Optionsvariable
<code><a href="maxima_9.html#exponentialize">exponentialize</a></code>.
</p>
</dd>
</dl>

<p>Maxima kennt viele spezielle unbestimmte und bestimmte Integrale mit der 
Exponentialfunktion.
</p></dd></dl>

<p><a name="log"></a>
</p><dl>
<dt><u>Funktion:</u> <b>log</b><i> (<var>z</var>)</i>
<a name="IDX366"></a>
</dt>
<dd><p>Ist der nat&uuml;rliche Logarithmus zur Basis <em>e</em>.  Die Logarithmusfunktion
ist f&uuml;r das numerische und symbolische Rechnen geeignet.
</p>
<p>Maxima hat keine vordefinierte Logarithmusfunktion zur Basis 10 oder anderen 
Basen.  Eine einfache Definition ist zum Beispiel 
<code>log10(x) := log(x)/log(10)</code>.  Mit dem Kommando <code>load(log10)</code> kann ein
Paket geladen werden, dass eine dekadische Logarithmusfunktion <code>log10</code>
definiert.
</p>
<p>Ist das Argument <var>z</var> der Logarithmusfunktion eine ganze oder rationale
Zahl wird ein vereinfachter Ausdruck zur&uuml;ckgegeben.  Ist das Argument
<var>z</var> eine reelle oder komplexe Gleitkommazahl wird ein numerisches
Ergebnis berechnet.
</p>
<p>Die folgenden Optionsvariablen kontrollieren die Vereinfachung und Auswertung
der Logarithmusfunktion:
</p>
<dl compact="compact">
<dt> <code>logexpand</code></dt>
<dd><p>Hat die Optionsvariable <code>logexpand</code> den Wert <code>true</code>, dann wird
<code>log(a^b)</code> zu <code>b*log(a)</code> vereinfacht.  Hat <code>logexpand</code> den
Wert <code>all</code>, wird zus&auml;tzlich <code>log(a*b)</code> zu <code>log(a)+log(b)</code>
vereinfacht.  Mit den Wert <code>super</code> vereinfacht Maxima weiterhin
<code>log(a/b)</code> zu <code>log(a)-log(b)</code>, wobei <code>a/b</code> eine rationale Zahl
ist.  <code>log(1/b</code> wird f&uuml;r eine ganze Zahl <code>b</code> immer vereinfacht.
Hat die Optionsvariable <code>logexpand</code> den Wert <code>false</code> werden alle
obigen Vereinfachungen ausgeschaltet.
</p>
</dd>
<dt> <code>logsimp</code></dt>
<dd><p>Hat die Optionsvariable <code>logsimp</code> den Wert <code>false</code>, werden 
Exponentialfunktionen <code><a href="#exp">exp</a></code>,
 die Logarithmusfunktionen im Exponenten
enthalten, nicht vereinfacht.
</p>
</dd>
<dt> <code>lognegint</code></dt>
<dd><p>Hat die Optionsvariable <code>lognegint</code> den Wert <code>true</code>, wird
<code>log(-n)</code> zu <code>log(n)+%i*%pi</code> f&uuml;r positive <code>n</code> vereinfacht.
</p>
</dd>
<dt> <code>%e_to_numlog</code></dt>
<dd><p>Hat die Optionsvariable <code>%e_to_numlog</code> den Wert <code>true</code>, wird ein 
Ausdruck <code>%e^(r*log(x))</code> zu <code>x^r</code> vereinfacht.  Dabei sind <code>r</code>  
eine rationale Zahl und <code>x</code> ein beliebiger Ausdruck.  Die Funktion 
<code>radcan</code> f&uuml;hrt diese Vereinfachung ebenfalls aus.
</p></dd>
</dl>

<p>Die Logarithmusfunktion wird automatisch auf die Elemente von Listen und
Matrizen sowie auf die beiden Seiten von Gleichungen angewendet.  Siehe
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>.
</p>

<p>Beispiele:
</p>
<p>Verschiedene Beispiele mit der Logarithmusfunktion.
</p>
<pre class="example">(%i1) log(%e);
(%o1)                           1
(%i2) log(100.0);
(%o2)                   4.605170185988092
(%i3) log(2.5+%i);
(%o3)       .3805063771123649 %i + .9905007344332917
(%i4) taylor(log(1+x),x,0,5);
                       2    3    4    5
                      x    x    x    x
(%o4)/T/          x - -- + -- - -- + -- + . . .
                      2    3    4    5
(%i5) rectform(log(x+%i*y));
                       2    2
                  log(y  + x )
(%o5)             ------------ + %i atan2(y, x)
                       2
(%i6) limit(log(x),x,0,plus);
(%o6)                         minf
(%i7) integrate(log(z)^n,z);
                                                    - n - 1
(%o7) - gamma_incomplete(n + 1, - log(z)) (- log(z))
                                                            n + 1
                                                      log(z)
(%i8) laplace(log(t),t,s);
                        - log(s) - %gamma
(%o8)                   -----------------
                                s
(%i9) depends(y,x);
(%o9)                        [y(x)]
(%i10) ode2(diff(y,x)+log(y)+1,y,x);
            - 1
(%o10)    %e    expintegral_e(1, - log(y) - 1) = x + %c
</pre></dd></dl>

<p><a name="logabs"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>logabs</b>
<a name="IDX367"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Treten bei der unbestimmten Integration Logarithmusfunktionen im Ergebnis auf,
so wird der Betrag der Argumente der Logarithmusfunktionen gebildet, wenn die
Optionsvariable <code>logabs</code> den Wert <code>true</code> hat.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) logabs:true;
(%o1)                         true
(%i2) integrate(1/x,x);
(%o2)                      log(abs(x))
(%i3) integrate(1/(1+x^3),x);
                                                   2 x - 1
            ! 2        !                      atan(-------)
        log(!x  - x + 1!)   log(abs(x + 1))        sqrt(3)
(%o3) - ----------------- + --------------- + -------------
                6                  3             sqrt(3)
</pre></dd></dl>

<p><a name="logarc"></a>
</p><dl>
<dt><u>Funktion:</u> <b>logarc</b><i> (<var>expr</var>)</i>
<a name="IDX368"></a>
</dt>
<dt><u>Optionsvariable:</u> <b>logarc</b>
<a name="IDX369"></a>
</dt>
<dd><p>Hat die Optionsvariable <code>logarc</code> den Wert <code>true</code>, werden inverse
Winkel- und Hyperbelfunktionen durch Logarithmusfunktionen ersetzt.  Der 
Standardwert von <code>logarc</code> ist <code>false</code>.
</p>
<p>Die Funktion <code>logarc(<var>expr</var>)</code> f&uuml;hrt diese Ersetzung aus, ohne dass 
die Optionsvariable <code>logarc</code> gesetzt wird.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) logarc(asin(x));
                                     2
(%o1)             - %i log(sqrt(1 - x ) + %i x)
(%i2) logarc:true;
(%o2)                         true
(%i3) asin(x);
                                     2
(%o3)             - %i log(sqrt(1 - x ) + %i x)
</pre></dd></dl>

<p><a name="logconcoeffp"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>logconcoeffp</b>
<a name="IDX370"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Der Optionsvariablen <code>logconcoeffp</code> kann eine Aussagefunktion mit einem
Argument zugewiesen werden, die kontrolliert, welche Koeffizienten von
der Funktion <code><a href="#logcontract">logcontract</a></code>
 zusammengezogen werden.  Sollen zum Beispiel
Wurzeln generiert werden, kann folgende Aussagefunktion definiert werden:
</p>
<pre class="example">logconcoeffp:'logconfun$ 
logconfun(m) := featurep(m,integer) or ratnump(m)$
</pre>
<p>Das Kommando <code>logcontract(1/2*log(x))</code> liefert nun das Ergebnis
<code>log(sqrt(x))</code>.
</p></dd></dl>

<p><a name="logcontract"></a>
</p><dl>
<dt><u>Funktion:</u> <b>logcontract</b><i> (<var>expr</var>)</i>
<a name="IDX371"></a>
</dt>
<dd><p>Der Ausdruck <var>expr</var> wird rekursiv nach Ausdr&uuml;cken der Form 
<code>a1*log(b1) + a2*log(b2) + c</code> durchsucht.  Diese werden zu
<code>log(ratsimp(b1^a1 * b2^a2)) + c</code> transformiert.
</p>
<pre class="example">(%i1) 2*(a*log(x) + 2*a*log(y))$
(%i2) logcontract(%);
                                 2  4
(%o2)                     a log(x  y )
</pre>
<p>Wird die Variable <var>n</var> mit dem Kommando <code>declare(n, integer)</code> als eine
ganze Zahl deklariert, dann wird  <code>logcontract(2*a*n*log(x))</code> zu
<code>a*log(x^(2*n))</code> vereinfacht.  Die Koeffizienten, die zusammengezogen 
werden, sind in diesem Fall die Zahl 2 und die Variable <var>n</var>, welche
die folgende Aussage erf&uuml;llen <code>featurep(coeff, integer)</code>.
Der Nutzer kann kontrollieren, welche Koeffizienten zusammengezogen werden.
Dazu wird der Optionsvariablen <code><a href="#logconcoeffp">logconcoeffp</a></code>
 eine Aussagefunktion mit 
einem Argument zugewiesen.  Sollen zum Beispiel Wurzeln generiert werden, kann 
folgende Definition verwendet: <code>logconcoeffp: 'logconfun$ logconfun(m) :=
featurep(m,integer) or ratnump(m)$</code>.  Dann hat das Kommando
<code>logcontract(1/2*log(x))</code> das Ergebnis <code>log(sqrt(x))</code>.
</p></dd></dl>

<p><a name="logexpand"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>logexpand</b>
<a name="IDX372"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Die Optionsvariable <code>logexpand</code> kontrolliert die Vereinfachung der
Logarithmusfunktion <code><a href="#log">log</a></code>.
</p>

<p>Hat <code>logexpand</code> den Wert <code>true</code>, wird <code>log(a^b)</code> zu
<code>b*log(a)</code> vereinfacht.  Hat <code>logexpand</code> den Wert <code>all</code>, wird
zus&auml;tzlich <code>log(a*b)</code> zu <code>log(a)+log(b)</code> vereinfacht.  Mit dem Wert
<code>super</code> vereinfacht Maxima weiterhin <code>log(a/b)</code> zu
<code>log(a)-log(b)</code>, wobei <code>a/b</code> eine rationale Zahl ist.  <code>log(1/b</code>
wird f&uuml;r eine ganze Zahl <code>b</code> immer vereinfacht.  Hat die Optionsvariable
<code>logexpand</code> den Wert <code>false</code> werden alle obigen Vereinfachungen
ausgeschaltet.
</p></dd></dl>

<p><a name="lognegint"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>lognegint</b>
<a name="IDX373"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>lognegint</code> den Wert <code>true</code>, wird
<code>log(-n)</code> zu <code>log(n)+%i*%pi</code> f&uuml;r positive <code>n</code> vereinfacht.
</p></dd></dl>

<p><a name="logsimp"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>logsimp</b>
<a name="IDX374"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat die Optionsvariable <code>logsimp</code> den Wert <code>false</code>, werden 
Exponentialfunktionen <code><a href="#exp">exp</a></code>,
 die Logarithmusfunktionen im Exponenten
enthalten, nicht vereinfacht.
</p></dd></dl>

<p><a name="plog"></a>
</p><dl>
<dt><u>Funktion:</u> <b>plog</b><i> (<var>x</var>)</i>
<a name="IDX375"></a>
</dt>
<dd><p>Gibt den Hauptwert des komplexen nat&uuml;rlichen Logarithmus im Intervall
<code>-%pi</code> &lt; <code>carg(<var>x</var>)</code> &lt;= <code>+%pi</code> zur&uuml;ck.
</p></dd></dl>

<p><a name="rootsconmode"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>rootsconmode</b>
<a name="IDX376"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p><code>rootsconmode</code> kontrolliert das Verhalten der Funktion 
<code>rootscontract</code>.  Siehe die Funktion <code><a href="#rootscontract">rootscontract</a></code>
 f&uuml;r Details.
</p></dd></dl>

<p><a name="rootscontract"></a>
</p><dl>
<dt><u>Funktion:</u> <b>rootscontract</b><i> (<var>expr</var>)</i>
<a name="IDX377"></a>
</dt>
<dd><p>Konvertiert Produkte von Wurzeln in Wurzeln von Produkten.  Zum Beispiel hat 
<code>rootscontract(sqrt(x)*y^(3/2))</code> das Ergebnis <code>sqrt(x*y^3)</code>.
</p>
<p>Hat die Optionsvariable <code><a href="maxima_9.html#radexpand">radexpand</a></code>
 den Wert <code>true</code> und die
Optionsvariable <code><a href="maxima_9.html#domain">domain</a></code>
 den Wert <code>real</code>, das sind die Standardwerte,
wird <code>abs(x)</code> zu <code>sqrt(x^2)</code> vereinfacht.  Zum Beispiel hat
<code>rootscontract(abs(x) * sqrt(y))</code> das Ergebnis <code>sqrt(x^2*y)</code>.
</p>
<p>Die Optionsvariable <code><a href="#rootsconmode">rootsconmode</a></code>
 kontrolliert das Ergebnis
folgenderma&szlig;en:
</p>
<pre class="example">Problem             Wert             Ergebnis 
                    rootsconmode     rootscontract
      
x^(1/2)*y^(3/2)     false            sqrt(x*y^3)
x^(1/2)*y^(1/4)     false            sqrt(x)*y^(1/4)
x^(1/2)*y^(1/4)     true             sqrt(x*sqrt(y))
x^(1/2)*y^(1/3)     true             sqrt(x)*y^(1/3)
x^(1/2)*y^(1/4)     all              (x^2*y)^(1/4)
x^(1/2)*y^(1/3)     all              (x^3*y^2)^(1/6)
</pre>
<p>Hat <code>rootsconmode</code> den Wert <code>false</code>, kontrahiert <code>rootscontract</code>
nur Faktoren mit rationalen Exponenten, die den gleichen Nenner haben.  Hat
<code>rootsconmode</code> den Wert <code>all</code>, wird das kleinste gemeinsame Vielfache
des Nenners der Faktoren verwendet, um die Faktoren zusammenzufassen.
</p>
<p>&Auml;hnlich wie bei der Funktion <code><a href="#logcontract">logcontract</a></code>
 werden von
<code>rootscontract</code> die Argumente unter der Wurzel mit der Funktion 
<code><a href="maxima_17.html#ratsimp">ratsimp</a></code>
 vereinfacht.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) rootsconmode: false$
(%i2) rootscontract (x^(1/2)*y^(3/2));
                                   3
(%o2)                      sqrt(x y )
(%i3) rootscontract (x^(1/2)*y^(1/4));
                                   1/4
(%o3)                     sqrt(x) y
(%i4) rootsconmode: true$
(%i5) rootscontract (x^(1/2)*y^(1/4));
(%o5)                    sqrt(x sqrt(y))
(%i6) rootscontract (x^(1/2)*y^(1/3));
                                   1/3
(%o6)                     sqrt(x) y
(%i7) rootsconmode: all$
(%i8) rootscontract (x^(1/2)*y^(1/4));
                              2   1/4
(%o8)                       (x  y)
(%i9) rootscontract (x^(1/2)*y^(1/3));
                             3  2 1/6
(%o9)                      (x  y )
(%i10) rootsconmode: false$
(%i11) rootscontract (sqrt(sqrt(x) + sqrt(1 + x))
                    *sqrt(sqrt(1 + x) - sqrt(x)));
(%o11)                          1
(%i12) rootsconmode: true$
(%i13) rootscontract (sqrt(5+sqrt(5)) - 5^(1/4)*sqrt(1+sqrt(5)));
(%o13)                          0
</pre></dd></dl>

<p><a name="sqrt"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sqrt</b><i> (<var>z</var>)</i>
<a name="IDX378"></a>
</dt>
<dd><p>Ist die Wurzelfunktion.  Die Wurzelfunktion wird von Maxima sofort zu
<code><var>x</var>^(1/2)</code> vereinfacht und tritt in Ausdr&uuml;cken nicht auf.
</p>
<p>Die Wurzelfunktion ist f&uuml;r das numerische und symbolische Rechnen geeignet.
Ist das Argument <var>z</var> der Wurzelfunktion eine Gleitkommazahl, wird ein
numerisches Ergebnis zur&uuml;ckgegeben.  F&uuml;r ganze und rationale Zahlen wird
die Wurzelfunktion vereinfacht.  Die numerische Berechnung kann mit den 
Optionsvariablen und Auswertungsschaltern <code><a href="maxima_5.html#numer">numer</a></code>
 und
<code><a href="maxima_5.html#float">float</a></code>
 kontrolliert werden.
</p>
<p>Hat die Optionsvariable <code><a href="maxima_9.html#radexpand">radexpand</a></code>
 den Wert <code>true</code>, werden die
n-ten Wurzeln von Faktoren unter einer Wurzel aus der Wurzel herausgezogen.
So wird zum Beispiel <code>sqrt(16*x^2)</code> nur dann zu <code>4*x</code> vereinfacht,
wenn <code>radexpand</code> den Wert <code>true</code> hat.
</p>
<p>Siehe auch die Funktionen <code><a href="#rootscontract">rootscontract</a></code>
 und <code><a href="maxima_69.html#sqrtdenest">sqrtdenest</a></code>
 f&uuml;r die
Vereinfachung von Ausdr&uuml;cken, die die Wurzelfunktion enthalten.
</p>
<p>Beispiele:
</p>
<p>Verschiedene Beispiele mit der Wurzelfunktion.
</p>
<pre class="example">(%i1) sqrt(4);
(%o1)                           2
(%i2) sqrt(24);
(%o2)                       2 sqrt(6)
(%i3) sqrt(2.0);
(%o3)                   1.414213562373095
(%i4) taylor(sqrt(1+x),x,0,5);
                       2    3      4      5
                  x   x    x    5 x    7 x
(%o4)/T/      1 + - - -- + -- - ---- + ---- + . . .
                  2   8    16   128    256
(%i5) rectform(sqrt(x+%i*y));
           2    2 1/4     atan2(y, x)
(%o5) %i (y  + x )    sin(-----------)
                               2
                                      2    2 1/4     atan2(y, x)
                                  + (y  + x )    cos(-----------)
                                                          2
(%i6) integrate(sqrt(t)*(t+1)^-2,t,0,1);
                             %pi - 2
(%o6)                        -------
                                4
</pre></dd></dl>

<hr size="6">
<a name="Winkelfunktionen"></a>
<a name="SEC65"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC64" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC66" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.5 Winkelfunktionen </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC66">10.5.1 Einf&uuml;hrung in Winkelfunktionen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC67">10.5.2 Funktionen und Variablen f&uuml;r Winkelfunktionen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-Winkelfunktionen"></a>
<a name="SEC66"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC65" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC67" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC65" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 10.5.1 Einf&uuml;hrung in Winkelfunktionen </h3>

<p>Maxima kennt viele Winkel- und Hyperbelfunktionen.  Nicht alle Identit&auml;ten 
f&uuml;r Winkel- und Hyperbelfunktionen sind programmiert, aber es ist m&ouml;glich 
weitere Identit&auml;ten mit der F&auml;higkeit der Erkennung von Mustern 
hinzuzuf&uuml;gen.
</p>
<p>Maxima kennt die folgenden Winkel- und Hyperbelfunktionen sowie deren Inverse:
</p>
<pre class="verbatim">     sin       cos       tan
     sec       csc       cot
     asin      acos      atan
     asec      acsc      acot
     sinh      cosh      tanh
     sech      csch      coth
     asinh     acosh     atanh
     asech     acsch     acoth
</pre>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Winkelfunktionen"></a>
<a name="SEC67"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC66" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC68" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC65" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 10.5.2 Funktionen und Variablen f&uuml;r Winkelfunktionen </h3>

<p><a name="asin"></a>
<a name="acos"></a>
<a name="atan"></a>
<a name="acot"></a>
<a name="acsc"></a>
<a name="asec"></a>
</p><dl>
<dt><u>Funktion:</u> <b>asin</b><i> (<var>z</var>)</i>
<a name="IDX379"></a>
</dt>
<dt><u>Funktion:</u> <b>acos</b><i> (<var>z</var>)</i>
<a name="IDX380"></a>
</dt>
<dt><u>Funktion:</u> <b>atan</b><i> (<var>z</var>)</i>
<a name="IDX381"></a>
</dt>
<dt><u>Funktion:</u> <b>acot</b><i> (<var>z</var>)</i>
<a name="IDX382"></a>
</dt>
<dt><u>Funktion:</u> <b>acsc</b><i> (<var>z</var>)</i>
<a name="IDX383"></a>
</dt>
<dt><u>Funktion:</u> <b>asec</b><i> (<var>z</var>)</i>
<a name="IDX384"></a>
</dt>
<dd><p>Die inversen Winkelfunktionen: Arkussinus, Arkuskosinus, Arkustangens,
Arkuskotangens, Arkuskosekans und Arkussekans.
</p>
<p>Die inversen Winkelfunktionen sind f&uuml;r das numerische und symbolische Rechnen
geeignet.  Die inversen Winkelfunktionen k&ouml;nnen f&uuml;r reelle und komplexe
Gleitkommazahlen in doppelter und in beliebiger Genauigkeit berechnet werden.
Ist das Argument eine ganze oder rationale Zahl, werden die inversen
Winkelfunktionen nicht numerisch berechnet, sondern vereinfacht.  Die numerische
Berechnung kann mit den Optionsvariablen und Auswertungsschaltern
<code><a href="maxima_5.html#numer">numer</a></code>
 und <code><a href="maxima_5.html#float">float</a></code>
 erzwungen werden.
</p>
<p>Die inversen Winkelfunktionen sind bis auf die Funktionen <code>acos</code> und
<code>asec</code> als ungerade definiert.  Die Funktionen <code>acos</code> und <code>asec</code>
vereinfachen f&uuml;r ein negatives Argument <code>-x</code> zu <code>%pi-acos(x)</code> und
<code>%pi-asec(x)</code>.  F&uuml;r die inversen Winkelfunktion <code>asin</code>, <code>acos</code>
und <code>atan</code> ist die Spiegelsymmetrie f&uuml;r den Fall implementiert, dass das
komplexe Argument <code>x+%i*y</code> einen Realteil <code>abs(x)&lt;1</code> hat.
</p>
<p>Ist das Argument <var>z</var> eine Matrix, eine Liste oder eine Gleichung werden die
inversen Winkelfunktionen auf die Elemente der Matrix, der Liste oder auf die
beiden Seiten der Gleichung angewendet.  Dieses Verhalten wird von der
Optionsvariablen <code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>
 kontrolliert.
</p>
<p>Inverse Winkelfunktionen k&ouml;nnen f&uuml;r das symbolische Rechnen verwendet
werden.  Maxima kann Ausdr&uuml;cke mit inversen Winkelfunktionen differenzieren
und integrieren, Grenzwerte bestimmen sowie Gleichungen mit inversen
Winkelfunktionen l&ouml;sen.
</p> 
<p>Das Argument der inversen Winkelfunktionen kann eine Taylorreihe sein.  In
diesem Fall wird die Taylorreihenentwicklung f&uuml;r die inverse Winkelfunktion
vollst&auml;ndig ausgef&uuml;hrt.
</p>
<p>Die folgenden Optionsvariablen kontrollieren die Vereinfachung der
inversen Winkelfunktionen:
</p>
<dl compact="compact">
<dt> <code>distribute_over</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>
 den Wert <code>true</code> und ist das
Argument der inversen Winkelfunktion eine Matrix, Liste oder Gleichung wird die
Funktion auf die Elemente oder beiden Seiten der Gleichung angewendet.  Der
Standardwert ist <code>true</code>.
</p>
</dd>
<dt> <code>%piargs</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#g_t_0025piargs">%piargs</a></code>
 den Wert <code>true</code>, werden die
inversen Winkelfunktionen f&uuml;r spezielle Werte als Argument vereinfacht.
Der Standardwert ist <code>true</code>.
</p>
</dd>
<dt> <code>%iargs</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#g_t_0025iargs">%iargs</a></code>
 den Wert <code>true</code> und ist das Argument
der inversen Winkelfunktion ein Vielfaches der imagin&auml;ren Einheit <code>%i</code>
werden die inversen Winkelfunktionen zu inversen Hyperbelfunktionen vereinfacht.
Der Standardwert ist <code>true</code>.
</p>
</dd>
<dt> <code>triginverses</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#triginverses">triginverses</a></code>
 den Wert <code>all</code> und ist das
Argument die entsprechende Winkelfunktion vereinfachen die inversen
Winkelfunktionen, zum Beispiel vereinfacht <code>asin(sin(x))</code> zu <code>x</code>.
Der Standardwert ist <code>true</code> und die Vereinfachung wird nicht vorgenommen.
</p>
</dd>
<dt> <code>logarc</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#logarc">logarc</a></code>
 den Wert <code>true</code>, werden inverse
Winkelfunktionen durch Logarithmusfunktionen ersetzt.  Der Standardwert von
<code>logarc</code> ist <code>false</code>.
</p></dd>
</dl>
</dd></dl>

<p><a name="atan2"></a>
</p><dl>
<dt><u>Funktion:</u> <b>atan2</b><i> (<var>y</var>, <var>x</var>)</i>
<a name="IDX385"></a>
</dt>
<dd><p>Ist der Arkustangens mit zwei Argumenten, der in Maxima wie folgt definiert ist:
</p>
<pre class="verbatim">     atan(y/x)           x&gt;0
     atan(y/x) + %pi     x&lt;0 und y&gt;=0
     atan(y/x) - %pi     x&lt;0 und y&lt;0
       %pi / 2           x=0 und y&gt;0
     - %pi / 2           x=0 und y&lt;0
     nicht definiert     x=0 und y=0
</pre>
<p>Mit der obigen Definition ist der Wertebereich des Arkustangens
<code>-%pi &lt; atan2(y,x) &lt;= %pi</code>.  Alternativ kann der Arkustangens mit zwei
Argumenten definiert werden als
</p>
<pre class="verbatim">                              %i y + x
     atan2(y, x) = - %i log(-------------)
                                  2    2
                            sqrt(y  + x )
</pre>
<p>Der Arkustangens ist f&uuml;r das symbolische und numerische Rechnen geeignet.
F&uuml;r reelle Argumente <var>x</var> und <var>y</var> deren Vorzeichen bestimmt werden
kann, vereinfacht Maxima den Arkustangens wie oben in der Definition angegeben.
Sind beide Argumente Gleitkommazahlen wird ein numerisches Ergebnis berechnet.
Die numerische Berechnung f&uuml;r komplexe Gleitkommazahlen ist nicht
implementiert.  Weiterhin kennt Maxima die speziellen Werte, wenn eines der
Argumente <var>x</var> oder <var>y</var> unendlich ist.  <code>atan2(x, x)</code> und
<code>atan2(x, -x)</code> werden von Maxima vereinfacht, wenn Maxima das Vorzeichen
von <var>x</var> ermitteln kann.
</p>
<p>Die Vereinfachung des Arkustangens wird weiterhin von den folgenden
Optionsvariablen kontrolliert:
</p>
<dl compact="compact">
<dt> <code>distribute_over</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>
 den Wert <code>true</code> und ist das
Argument des Arkustangens eine Matrix, Liste oder Gleichung wird die Funktion
auf die Elemente oder beiden Seiten der Gleichung angewendet.  Der Standardwert
ist <code>true</code>.
</p>
</dd>
<dt> <code>trigsign</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#trigsign">trigsign</a></code>
 den Wert <code>true</code>, vereinfacht
Maxima <code>atan2(-y, x)</code> zu <code>- atan2(y, x)</code>.  Der Standardwert ist
<code>true</code>.
</p>
</dd>
<dt> <code>logarc</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#logarc">logarc</a></code>
 den Wert <code>true</code>, wird der
Arkustangens durch einen Ausdruck mit der Logarithmusfunktionen ersetzt.
Der Standardwert von <code>logarc</code> ist <code>false</code>.
</p></dd>
</dl>

<p>Maxima kann Ausdr&uuml;cke mit dem Arkustangens ableiten und integrieren sowie die
Grenzwerte von Ausdr&uuml;cken mit dem Arkustangens ermitteln.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) atan2([-1, 1],[-1, 0, 1]);
              3 %pi    %pi    %pi    3 %pi  %pi  %pi
(%o1)     [[- -----, - ---, - ---], [-----, ---, ---]]
                4       2      4       4     2    4
(%i2) atan2(1,[-0.5, 0.5]);
(%o2)         [2.034443935795703, 1.10714871779409]
(%i3) assume(a&gt;0)$

(%i4) atan2(2*a, -2*a);
                              3 %pi
(%o4)                         -----
                                4
(%i5) diff(atan2(y,x), x);
                                 y
(%o5)                       - -------
                               2    2
                              y  + x
(%i6) integrate(atan2(y,x), x);
                          2    2
                   y log(y  + x )          y
(%o6)              -------------- + x atan(-)
                         2                 x
</pre></dd></dl>

<p><a name="sin"></a>
<a name="cos"></a>
<a name="tan"></a>
<a name="cot"></a>
<a name="csc"></a>
<a name="sec"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sin</b><i> (<var>z</var>)</i>
<a name="IDX386"></a>
</dt>
<dt><u>Funktion:</u> <b>cos</b><i> (<var>z</var>)</i>
<a name="IDX387"></a>
</dt>
<dt><u>Funktion:</u> <b>tan</b><i> (<var>z</var>)</i>
<a name="IDX388"></a>
</dt>
<dt><u>Funktion:</u> <b>cot</b><i> (<var>z</var>)</i>
<a name="IDX389"></a>
</dt>
<dt><u>Funktion:</u> <b>csc</b><i> (<var>z</var>)</i>
<a name="IDX390"></a>
</dt>
<dt><u>Funktion:</u> <b>sec</b><i> (<var>z</var>)</i>
<a name="IDX391"></a>
</dt>
<dd><p>Die Winkelfunktionen: Sinus, Kosinus, Tangens, Kotangens, Kosekans und Sekans.
</p>
<p>Die Winkelfunktionen sind f&uuml;r das numerische und symbolische Rechnen geeignet.
Die Winkelfunktionen k&ouml;nnen f&uuml;r reelle und komplexe Gleitkommazahlen in
doppelter und in beliebiger Genauigkeit berechnet werden.  Ist das Argument 
eine ganze oder rationale Zahl, werden die Winkelfunktionen nicht numerisch
berechnet, sondern vereinfacht.  Die numerische Berechnung kann mit den
Optionsvariablen und Auswertungsschaltern <code><a href="maxima_5.html#numer">numer</a></code>
 und <code><a href="maxima_5.html#float">float</a></code>

erzwungen werden.
</p>
<p>Die Winkelfunktionen sind gerade oder ungerade und haben Spiegelsymmetrie.
Maxima wendet diese Symmetrieeigenschaften automatisch bei der Vereinfachung
von Ausdr&uuml;cken mit Winkelfunktionen an.
</p>
<p>Ist das Argument <var>z</var> eine Matrix, eine Liste oder eine Gleichung werden die
Winkelfunktionen auf die Elemente der Matrix, der Liste oder auf die beiden
Seiten der Gleichung angewendet.  Dieses Verhalten wird von der Optionsvariablen
<code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>
 kontrolliert.
</p>
<p>Winkelfunktionen k&ouml;nnen f&uuml;r das symbolische Rechnen verwendet werden.
Maxima kann Ausdr&uuml;cke mit Winkelfunktionen differenzieren und integrieren,
Grenzwerte bestimmen sowie Gleichungen und  Differentialgleichungen mit
Winkelfunktionen l&ouml;sen.
</p>
<p>Das Argument der Winkelfunktionen kann eine Taylorreihe sein.  In diesem Fall
wird die Taylorreihenentwicklung f&uuml;r die Winkelfunktion vollst&auml;ndig
ausgef&uuml;hrt.
</p>
<p>Die folgenden Optionsvariablen kontrollieren die Vereinfachung der
Winkelfunktionen:
</p>
<dl compact="compact">
<dt> <code>distribute_over</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>
 den Wert <code>true</code> und ist das
Argument der Winkelfunktion eine Matrix, Liste oder Gleichung wird die Funktion
auf die Elemente oder beiden Seiten der Gleichung angewendet.  Der Standardwert
ist <code>true</code>.
</p>
</dd>
<dt> <code>%piargs</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#g_t_0025piargs">%piargs</a></code>
 den Wert <code>true</code>, werden die
Winkelfunktionen f&uuml;r ganzzahlige und halbzahlige Vielfache der Konstanten
<code>%pi</code> zu speziellen Werten vereinfacht.  Der Standardwert ist <code>true</code>.
</p>
</dd>
<dt> <code>%iargs</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#g_t_0025iargs">%iargs</a></code>
 den Wert <code>true</code> und ist das Argument
der Winkelfunktion ein Vielfaches der imagin&auml;ren Einheit <code>%i</code> werden die
Winkelfunktionen zu Hyperbelfunktionen vereinfacht.  Der Standardwert ist
<code>true</code>.
</p>
</dd>
<dt> <code>trigsign</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#trigsign">trigsign</a></code>
 den Wert <code>true</code>, werden die gerade
oder ungerade Symmetrie der Winkelfunktionen bei der Vereinfachung angewendet.
Der Standardwert ist <code>true</code>.
</p>
</dd>
<dt> <code>triginverses</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#triginverses">triginverses</a></code>
 den Wert <code>true</code> und ist das
Argument eine inverse Winkelfunktion vereinfachen die Winkelfunktionen zu einem
einfachen algebraischen Ausdruck, zum Beispiel vereinfacht <code>sin(acos(x))</code>
zu <code>sqrt(1-x^2)</code>.  Der Standardwert ist <code>true</code>.
</p>
</dd>
<dt> <code>trigexpand</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#trigexpand">trigexpand</a></code>
 den Wert <code>true</code>, dann werden die
Winkelfunktionen f&uuml;r ein Argument expandiert, das eine Summe oder ein Produkt
mit einer ganzen Zahl ist.  Der Standardwert ist <code>false</code>.
</p>
</dd>
<dt> <code>exponentialize</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="maxima_9.html#exponentialize">exponentialize</a></code>
 den Wert <code>true</code>, dann werden
die Winkelfunktionen in eine Exponentialform transformiert.  Der Standardwert
ist <code>false</code>.
</p>
</dd>
<dt> <code>halfangles</code></dt>
<dd><p>Hat die Optionsvariable <code><a href="#halfangles">halfangles</a></code>
 den Wert <code>true</code>, dann werden die
Winkelfunktionen f&uuml;r halbzahlige Argumente zu einem &auml;quivalenten Ausdruck
transformiert.  Der Standardwert ist <code>false</code>.
</p></dd>
</dl>

<p>Beispiele:
</p>
<p>Im Folgenden werden Beispiele f&uuml;r die Sinusfunktion gezeigt.  Numerische
Berechnungen f&uuml;r Gleitkommazahlen:
</p>
<pre class="example">(%i1) sin(1+%i);
(%o1)                      sin(%i + 1)
(%i2) sin(1.0+%i);
(%o2)       .6349639147847361 %i + 1.298457581415977
(%i3) sin(1.0b0+%i);
(%o3)     6.349639147847361b-1 %i + 1.298457581415977b0
(%i4) sin(1.0b0),fpprec:45;
(%o4)   8.41470984807896506652502321630298999622563061b-1
</pre>
<p>Einige Vereinfachungen der Sinusfunktionen:
</p>
<pre class="example">(%i5) sin(%i*(x+y));
(%o5)                    %i sinh(y + x)
(%i6) sin(%pi/3);
                             sqrt(3)
(%o6)                        -------
                                2
(%i2) sin(x+y),trigexpand:true;
(%o2)             cos(x) sin(y) + sin(x) cos(y)
(%i3) sin(2*x+y),trigexpand:true;
           2         2
(%o3)  (cos (x) - sin (x)) sin(y) + 2 cos(x) sin(x) cos(y)
</pre>
<p>Grenzwerte, Ableitungen und Integrale mit der Sinusfunktion:
</p>
<pre class="example">(%i4) limit(sin(x)/x,x,0);
(%o4)                          1
(%i5) diff(sin(sqrt(x))/x,x);
                  cos(sqrt(x))   sin(sqrt(x))
(%o5)             ------------ - ------------
                        3/2            2
                     2 x              x
(%i6) integrate(sin(x^3),x);
(%o6) 
                         1      3                     1        3
        gamma_incomplete(-, %i x ) + gamma_incomplete(-, - %i x )
                         3                            3
      - ---------------------------------------------------------
                                   12
</pre>
<p>Reihenentwicklung der Sinusfunktion:
</p>
<pre class="example">(%i7) taylor(sin(x),x,0,3);
                              3
                             x
(%o7)/T/                 x - -- + . . .
                             6
</pre></dd></dl>

<p><a name="g_t_0025piargs"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>%piargs</b>
<a name="IDX392"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>%piargs</code> den Wert <code>true</code>, werden Winkel- und Hyperbelfunktionen 
sowie deren Inverse zu algebraischen Konstanten vereinfacht, wenn das Argument
ein ganzzahliges Vielfaches der folgenden Konstanten ist:
<code>%pi</code>, <code>%pi/2</code>, <code>%pi/3</code>, <code>%pi/4</code> oder <code>%pi/6</code>.
</p>
<p>Maxima kennt weiterhin einige Identit&auml;ten, wenn die Konstante
<code>%pi</code>
mit einer Variablen multipliziert wird, die als ganzzahlig deklariert wurde.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) %piargs : false$
(%i2) [sin (%pi), sin (%pi/2), sin (%pi/3)];
                                %pi       %pi
(%o2)            [sin(%pi), sin(---), sin(---)]
                                 2         3
(%i3) [sin (%pi/4), sin (%pi/5), sin (%pi/6)];
                      %pi       %pi       %pi
(%o3)            [sin(---), sin(---), sin(---)]
                       4         5         6
(%i4) %piargs : true$
(%i5) [sin (%pi), sin (%pi/2), sin (%pi/3)];
                                sqrt(3)
(%o5)                    [0, 1, -------]
                                   2
(%i6) [sin (%pi/4), sin (%pi/5), sin (%pi/6)];
                         1         %pi   1
(%o6)                [-------, sin(---), -]
                      sqrt(2)       5    2
(%i7) [cos (%pi/3), cos (10*%pi/3), tan (10*%pi/3),
       cos (sqrt(2)*%pi/3)];
                1    1               sqrt(2) %pi
(%o7)          [-, - -, sqrt(3), cos(-----------)]
                2    2                    3
</pre>
<p>Weitere Identit&auml;ten werden angewendet, wenn
<code>%pi</code> und <code>%pi/2</code>
mit einer ganzzahligen Variable multipliziert werden.
</p>
<pre class="example">(%i1) declare (n, integer, m, even)$
(%i2) [sin (%pi * n), cos (%pi * m), sin (%pi/2 * m),
       cos (%pi/2 * m)];
                                      m/2
(%o2)                  [0, 1, 0, (- 1)   ]
</pre></dd></dl>

<p><a name="g_t_0025iargs"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>%iargs</b>
<a name="IDX393"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>%iargs</code> den Wert <code>true</code>, werden Winkelfunktionen zu 
Hyperbelfunktionen vereinfacht, wenn das Argument ein Vielfaches der 
imagin&auml;ren Einheit
<code>%i</code>
ist.
</p>
<p>Die Vereinfachung zu Hyperbelfunktionen wird auch dann ausgef&uuml;hrt, wenn das
Argument offensichtlich reell ist.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) %iargs : false$
(%i2) [sin (%i * x), cos (%i * x), tan (%i * x)];
(%o2)           [sin(%i x), cos(%i x), tan(%i x)]
(%i3) %iargs : true$
(%i4) [sin (%i * x), cos (%i * x), tan (%i * x)];
(%o4)           [%i sinh(x), cosh(x), %i tanh(x)]
</pre>
<p>Auch wenn das Argument offensichtlich reell ist, wird zu einer Hyperbelfunktion
vereinfacht.
</p>
<pre class="example">(%i1) declare (x, imaginary)$
(%i2) [featurep (x, imaginary), featurep (x, real)];
(%o2)                     [true, false]
(%i3) sin (%i * x);
(%o3)                      %i sinh(x)
</pre></dd></dl>

<p><a name="halfangles"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>halfangles</b>
<a name="IDX394"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>halfangles</code> den Wert <code>true</code>, werden Winkel- und 
Hyperbelfunktionen mit halbzahligen Argumenten <code><var>expr</var>/2</code> vereinfacht.
</p>
<p>F&uuml;r ein reelles Argument <var>x</var> im Intervall <code>0 &lt; x &lt; 2*%pi</code> vereinfacht
der Sinus f&uuml;r ein halbzahliges Argument zu einer einfachen Formel: 
</p>
<pre class="example">                         sqrt(1 - cos(x))
                         ----------------
                             sqrt(2)
</pre>
<p>Ein komplizierter Faktor wird gebraucht, damit die Formel korrekt ist f&uuml;r ein
komplexes Argument <var>z</var>:
</p>
<pre class="verbatim">           realpart(z)
     floor(-----------)
              2 %pi
(- 1)                   (1 - unit_step(- imagpart(z))

                            realpart(z)            realpart(z)
                      floor(-----------) - ceiling(-----------)
                               2 %pi                  2 %pi
                ((- 1)                                          + 1))
</pre>
<p>Maxima kennt diesen Faktor und &auml;hnliche Faktoren f&uuml;r die Sinus, Kosinus,
Sinus Hyperbolicus und Kosinus Hyperbolicus Funktionen.  F&uuml;r spezielle 
Argumente <em>z</em> dieser Funktionen vereinfachen diese Funktionen entsprechend.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) halfangles:false;
(%o1)                                false
(%i2) sin(x/2);
                                        x
(%o2)                               sin(-)
                                        2
(%i3) halfangles:true;
(%o3)                                true
(%i4) sin(x/2);
                                                    x
                                            floor(-----)
                                                  2 %pi
                      sqrt(1 - cos(x)) (- 1)
(%o4)                 ----------------------------------
                                   sqrt(2)
(%i5) assume(x&gt;0, x&lt;2*%pi)$
(%i6) sin(x/2);
                               sqrt(1 - cos(x))
(%o6)                          ----------------
                                   sqrt(2)
</pre></dd></dl>

<p><a name="ntrig"></a>
</p><dl>
<dt><u>Paket:</u> <b>ntrig</b>
<a name="IDX395"></a>
</dt>
<dd><p>Das Paket <code>ntrig</code> enth&auml;lt Regeln, um Winkelfunktionen zu vereinfachen, 
die Argumente der Form <code><var>f</var>(<var>n</var> %pi/10)</code> haben.  <var>f</var> ist eine 
der Funktionen <code>sin</code>, <code>cos</code>, <code>tan</code>, <code>csc</code>, <code>sec</code> oder 
<code>cot</code>.
</p>
<p>Das Kommando <code>load(ntrig)</code> l&auml;dt das Paket.  Die Vereinfachungen werden
dann von Maxima automatisch ausgef&uuml;hrt.
</p></dd></dl>

<p><a name="trigexpand"></a>
</p><dl>
<dt><u>Funktion:</u> <b>trigexpand</b><i> (<var>expr</var>)</i>
<a name="IDX396"></a>
</dt>
<dd><p>Die Funktion <code>trigexpand</code> expandiert Winkel- und Hyperbelfunktionen im 
Ausdruck <var>expr</var>, die Summen und Vielfache von Winkeln als Argument haben.
Die besten Ergebnisse werden erzielt, wenn der Ausdruck <var>expr</var> zun&auml;chst
expandiert wird.
</p>
<p>Folgende Schalter kontrollieren <code>trigexpand</code>:
</p>
<dl compact="compact">
<dt> <code>trigexpand</code></dt>
<dd><p>Wenn <code>true</code>, werden Sinus- und Kosinusfunktionen expandiert.
</p>
</dd>
<dt> <code>halfangles</code></dt>
<dd><p>Wenn <code>true</code>, werden Vereinfachungen f&uuml;r halbzahlige Argumente angewendet.
</p>
</dd>
<dt> <code>trigexpandplus</code></dt>
<dd><p>Wenn <code>true</code>, werden Winkelfunktionen, die eine Summe als Argument haben,
wie zum Beispiel <code>sin(x+y)</code>, vereinfacht.
</p>
</dd>
<dt> <code>trigexpandtimes</code></dt>
<dd><p>Wenn <code>true</code>,  werden Winkelfunktionen, die ein Produkt als Argument haben,
wie zum Beispiel <code>sin(2 x)</code>, vereinfacht.
</p></dd>
</dl>

<p>Beispiele:
</p>
<pre class="example">(%i1) x+sin(3*x)/sin(x),trigexpand=true,expand;
                         2           2
(%o1)               - sin (x) + 3 cos (x) + x
(%i2) trigexpand(sin(10*x+y));
(%o2)          cos(10 x) sin(y) + sin(10 x) cos(y)
</pre></dd></dl>

<p><a name="trigexpandplus"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>trigexpandplus</b>
<a name="IDX397"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p><code>trigexpandplus</code> kontrolliert die Vereinfachung von Winkelfunktionen mit
der Funktion <code><a href="#trigexpand">trigexpand</a></code>
 f&uuml;r den Fall, dass Winkelfunktionen mit Summen
als Argumente auftreten.  Hat <code>trigexpandplus</code> den Wert <code>true</code>,
werden zum Beispiel Winkelfunktionen wie <code>sin(x+y)</code> vereinfacht.
</p></dd></dl>

<p><a name="trigexpandtimes"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>trigexpandtimes</b>
<a name="IDX398"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p><code>trigexpandtimes</code> kontrolliert die Vereinfachung von Winkelfunktionen mit
der Funktion <code><a href="#trigexpand">trigexpand</a></code>
 f&uuml;r den Fall, dass Winkelfunktionen mit
Produkten als Argumente auftreten.  Hat <code>trigexpandtimes</code> den Wert 
<code>true</code>, werden zum Beispiel Winkelfunktionen wie <code>sin(2 x)</code> 
vereinfacht.
</p></dd></dl>

<p><a name="triginverses"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>triginverses</b>
<a name="IDX399"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Kontrolliert die Vereinfachung, wenn das Argument einer Winkelfunktion oder
Hyperbelfunktion eine der inversen Funktion ist.
</p>
<p>Hat <code>triginverses</code> den Wert <code>all</code>, vereinfachen beide Ausdr&uuml;cke
<code>atan(tan(<var>x</var>))</code> und <code>tan(atan(<var>x</var>))</code> zum Wert <var>x</var>.
</p>
<p>Hat <code>triginverses</code> den Wert <code>all</code>, wird
<code><var>arcfun</var>(<var>fun</var>(<var>x</var>))</code> nicht vereinfacht.
</p>
<p>Hat <code>triginverses</code> den Wert <code>false</code>, werden
<code><var>arcfun</var>(<var>fun</var>(<var>x</var>))</code> und 
<code><var>fun</var>(<var>arcfun</var>(<var>x</var>))</code> nicht vereinfacht.
</p></dd></dl>

<p><a name="trigreduce"></a>
</p><dl>
<dt><u>Funktion:</u> <b>trigreduce</b><i> (<var>expr</var>, <var>x</var>)</i>
<a name="IDX400"></a>
</dt>
<dt><u>Funktion:</u> <b>trigreduce</b><i> (<var>expr</var>)</i>
<a name="IDX401"></a>
</dt>
<dd><p>Produkte und Potenzen von Winkelfunktionen und den Hyperbelfunktionen mit dem
Argument <var>x</var> werden zu Funktionen vereinfacht, die Vielfache von <var>x</var>
enthalten.  <code>trigreduce</code> versucht auch, Sinus- und Kosinusfunktionen in
einem Nenner zu eliminieren.  Wird keine Variable <var>x</var> angegeben, werden alle
Variablen im Ausdruck <code>expr</code> betrachtet.
</p>
<p>Siehe auch <code><a href="maxima_15.html#poissimp">poissimp</a></code>.
</p>

<pre class="example">(%i1) trigreduce(-sin(x)^2+3*cos(x)^2+x);
               cos(2 x)      cos(2 x)   1        1
(%o1)          -------- + 3 (-------- + -) + x - -
                  2             2       2        2
</pre></dd></dl>

<p><a name="trigsign"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>trigsign</b>
<a name="IDX402"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat <code>trigsign</code> den Wert <code>true</code>, werden Winkelfunktionen mit einem
negativem Argument vereinfacht.  Zum Beispiel vereinfacht in diesem Fall
<code>sin(-x)</code> zu <code>-sin(x)</code>.
</p></dd></dl>

<p><a name="trigsimp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>trigsimp</b><i> (<var>expr</var>)</i>
<a name="IDX403"></a>
</dt>
<dd><p>Wendet die Identit&auml;ten
<code>sin(x)^2 + cos(x)^2 = 1</code>
und
<code>cosh(x)^2 - sinh(x)^2 = 1</code>
an, um Ausdr&uuml;cke, die Funktionen wie <code>tan</code>, <code>sec</code>, usw. enthalten, 
zu Ausdr&uuml;cken mit den Funktionen <code>sin</code>, <code>cos</code>, <code>sinh</code>, 
<code>cosh</code> zu vereinfachen.
</p>
<p>Die Anwendung von Funktionen wie <code><a href="#trigreduce">trigreduce</a></code>,
 <code><a href="maxima_17.html#ratsimp">ratsimp</a></code>
 und
<code><a href="maxima_9.html#radcan">radcan</a></code>
 kann den Ausdruck weiter vereinfachen.
</p>
<p>Das Kommando <code>demo(trgsmp)</code> zeigt einige Beispiele.
</p></dd></dl>

<p><a name="trigrat"></a>
</p><dl>
<dt><u>Funktion:</u> <b>trigrat</b><i> (<var>expr</var>)</i>
<a name="IDX404"></a>
</dt>
<dd><p>Gives a canonical simplifyed quasilinear form of a trigonometrical expression; 
<var>expr</var> is a rational fraction of several <code>sin</code>, <code>cos</code> or 
<code>tan</code>, the arguments of them are linear forms in some variables (or 
kernels) and <code>%pi/<var>n</var></code> (<var>n</var> integer) with integer coefficients.
The result is a simplified fraction with numerator and denominator linear in 
<code>sin</code> and <code>cos</code>.  Thus <code>trigrat</code> linearize always when it is 
possible.
</p>
<pre class="example">(%i1) trigrat(sin(3*a)/sin(a+%pi/3));
(%o1)            sqrt(3) sin(2 a) + cos(2 a) - 1
</pre>
<p>The following example is taken from
Davenport, Siret, and Tournier, <i>Calcul Formel</i>, Masson (or in English,
Addison-Wesley), section 1.5.5, Morley theorem.
</p>
<pre class="example">(%i1) c : %pi/3 - a - b$
(%i2) bc : sin(a)*sin(3*c)/sin(a+b);
                                          %pi
                  sin(a) sin(3 (- b - a + ---))
                                           3
(%o2)             -----------------------------
                           sin(b + a)
(%i3) ba : bc, c=a, a=c;
                                         %pi
                    sin(3 a) sin(b + a - ---)
                                          3
(%o3)               -------------------------
                                  %pi
                          sin(a - ---)
                                   3
(%i4) ac2 : ba^2 + bc^2 - 2*bc*ba*cos(b);
         2         2         %pi
      sin (3 a) sin (b + a - ---)
                              3
(%o4) ---------------------------
                2     %pi
             sin (a - ---)
                       3
                                       %pi
 - (2 sin(a) sin(3 a) sin(3 (- b - a + ---)) cos(b)
                                        3
             %pi            %pi
 sin(b + a - ---))/(sin(a - ---) sin(b + a))
              3              3
      2       2              %pi
   sin (a) sin (3 (- b - a + ---))
                              3
 + -------------------------------
                2
             sin (b + a)
(%i5) trigrat (ac2);
(%o5) - (sqrt(3) sin(4 b + 4 a) - cos(4 b + 4 a)
 - 2 sqrt(3) sin(4 b + 2 a) + 2 cos(4 b + 2 a)
 - 2 sqrt(3) sin(2 b + 4 a) + 2 cos(2 b + 4 a)
 + 4 sqrt(3) sin(2 b + 2 a) - 8 cos(2 b + 2 a) - 4 cos(2 b - 2 a)
 + sqrt(3) sin(4 b) - cos(4 b) - 2 sqrt(3) sin(2 b) + 10 cos(2 b)
 + sqrt(3) sin(4 a) - cos(4 a) - 2 sqrt(3) sin(2 a) + 10 cos(2 a)
 - 9)/4
</pre></dd></dl>

<hr size="6">
<a name="Hyperbelfunktionen"></a>
<a name="SEC68"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC67" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC69" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.6 Hyperbelfunktionen </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC69">10.6.1 Einf&uuml;hrung in Hyperbelfunktionen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC70">10.6.2 Funktionen und Variablen f&uuml;r Hyperbelfunktionen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-Hyperbelfunktionen"></a>
<a name="SEC69"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC68" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC70" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC68" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 10.6.1 Einf&uuml;hrung in Hyperbelfunktionen </h3>

<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Hyperbelfunktionen"></a>
<a name="SEC70"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC69" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC71" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC68" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 10.6.2 Funktionen und Variablen f&uuml;r Hyperbelfunktionen </h3>

<p><a name="asinh"></a>
<a name="acosh"></a>
<a name="atanh"></a>
<a name="acoth"></a>
<a name="acsch"></a>
<a name="asech"></a>
</p><dl>
<dt><u>Funktion:</u> <b>asinh</b><i> (<var>x</var>)</i>
<a name="IDX405"></a>
</dt>
<dt><u>Funktion:</u> <b>acosh</b><i> (<var>x</var>)</i>
<a name="IDX406"></a>
</dt>
<dt><u>Funktion:</u> <b>atanh</b><i> (<var>x</var>)</i>
<a name="IDX407"></a>
</dt>
<dt><u>Funktion:</u> <b>acoth</b><i> (<var>x</var>)</i>
<a name="IDX408"></a>
</dt>
<dt><u>Funktion:</u> <b>acsch</b><i> (<var>x</var>)</i>
<a name="IDX409"></a>
</dt>
<dt><u>Funktion:</u> <b>asech</b><i> (<var>x</var>)</i>
<a name="IDX410"></a>
</dt>
<dd><p>Die inversen Hyperbelfunktionen: Areasinus Hyperbolicus, Areakosinus
Hyperbolicus, Areatangens Hyperbolicus, Areakotangens Hyperbolicus, Areakosekans
Hyperbolicus, Areasekans Hyperbolicus.
</p></dd></dl>

<p><a name="sinh"></a>
<a name="cosh"></a>
<a name="tanh"></a>
<a name="coth"></a>
<a name="csch"></a>
<a name="sech"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sinh</b><i> (<var>x</var>)</i>
<a name="IDX411"></a>
</dt>
<dt><u>Funktion:</u> <b>cosh</b><i> (<var>x</var>)</i>
<a name="IDX412"></a>
</dt>
<dt><u>Funktion:</u> <b>tanh</b><i> (<var>x</var>)</i>
<a name="IDX413"></a>
</dt>
<dt><u>Funktion:</u> <b>coth</b><i> (<var>x</var>)</i>
<a name="IDX414"></a>
</dt>
<dt><u>Funktion:</u> <b>csch</b><i> (<var>x</var>)</i>
<a name="IDX415"></a>
</dt>
<dt><u>Funktion:</u> <b>sech</b><i> (<var>x</var>)</i>
<a name="IDX416"></a>
</dt>
<dd><p>Die Hyperbelfunktionen: Sinus Hyperbolicus, Kosinus Hyperbolicus, Tangens
Hyperbolicus, Kotangens Hyperbolicus, Kosekans Hyperbolicus, Sekans
Hyperbolicus.
</p></dd></dl>

<hr size="6">
<a name="Zufallszahlen"></a>
<a name="SEC71"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC70" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC60" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 10.7 Zufallszahlen </h2>

<p><a name="make_005frandom_005fstate"></a>
</p><dl>
<dt><u>Funktion:</u> <b>make_random_state</b><i> (<var>n</var>)</i>
<a name="IDX417"></a>
</dt>
<dt><u>Funktion:</u> <b>make_random_state</b><i> (<var>s</var>)</i>
<a name="IDX418"></a>
</dt>
<dt><u>Funktion:</u> <b>make_random_state</b><i> (true)</i>
<a name="IDX419"></a>
</dt>
<dt><u>Funktion:</u> <b>make_random_state</b><i> (false)</i>
<a name="IDX420"></a>
</dt>
<dd><p>Ein Zufallszustand repr&auml;sentiert den Zustand des Zufallszahlengenerators.  Der
Zustand enth&auml;lt 627 32-Bit Worte.
</p>
<p><code>make_random_state(<var>n</var>)</code> gibt einen neuen Zufallszustand zur&uuml;ck, der 
aus einer ganzen Zahl <var>n</var> modulo 2^32 erzeugt wird.  <var>n</var> kann eine 
negative Zahl sein.
</p>
<p><code>make_random_state(<var>s</var>)</code> gibt eine Kopie des Zufallszutandes <var>s</var>
zur&uuml;ck.
</p>
<p><code>make_random_state(true)</code> gibt einen neuen Zufallszustand zur&uuml;ck, der aus
der aktuellen Systemzeit des Computers erzeugt wird.
</p>
<p><code>make_random_state(false)</code> gibt eine Kopie des aktuellen Zustands des
Zufallszahlengenerators zur&uuml;ck.
</p></dd></dl>

<p><a name="set_005frandom_005fstate"></a>
</p><dl>
<dt><u>Funktion:</u> <b>set_random_state</b><i> (<var>s</var>)</i>
<a name="IDX421"></a>
</dt>
<dd><p>Kopiert <var>s</var> in den Zufallszustand des Zufallszahlengenerators.
</p>
<p><code>set_random_state</code> gibt immer <code>done</code> zur&uuml;ck.
</p></dd></dl>

<p><a name="random"></a>
</p><dl>
<dt><u>Funktion:</u> <b>random</b><i> (<var>x</var>)</i>
<a name="IDX422"></a>
</dt>
<dd><p>Erzeugt eine Pseudo-Zufallszahl.  Ist <var>x</var> eine ganze Zahl, gibt 
<code>random(<var>x</var>)</code> eine ganze Zahl im Intervall 0 bis einschlie&szlig;lich
<code><var>x</var>-1</code> zur&uuml;ck.  Ist <var>x</var> eine Gleitkommazahl, gibt
<code>random(<var>x</var>)</code> eine positive Gleitkommazahl zur&uuml;ck, die kleiner als
<var>x</var> ist.  <code>random</code> gibt eine Fehlermeldung, wenn <var>x</var> weder eine
ganze Zahl noch eine Gleitkommazahl ist oder wenn <var>x</var> eine negative Zahl 
ist.
</p>
<p>Die Funktionen <code>make_random_state</code> und <code>set_random_state</code> verwalten
den Zustand des Zufallszahlengenerators.
</p>
<p>Der Maxima-Zufallszahlengenerator ist eine Implementation des Mersenne twister
MT 19937.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) s1: make_random_state (654321)$
(%i2) set_random_state (s1);
(%o2)                         done
(%i3) random (1000);
(%o3)                          768
(%i4) random (9573684);
(%o4)                        7657880
(%i5) random (2^75);
(%o5)                11804491615036831636390
(%i6) s2: make_random_state (false)$
(%i7) random (1.0);
(%o7)                   .2310127244107132
(%i8) random (10.0);
(%o8)                   4.394553645870825
(%i9) random (100.0);
(%o9)                   32.28666704056853
(%i10) set_random_state (s2);
(%o10)                        done
(%i11) random (1.0);
(%o11)                  .2310127244107132
(%i12) random (10.0);
(%o12)                  4.394553645870825
(%i13) random (100.0);
(%o13)                  32.28666704056853
</pre></dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC60" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_11.html#SEC72" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>Dezember, 10 2012</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
