Repository: chriskmanx/qmole
Catalog: QMOLEDEV/gnutls-2.12.7/lib/po/*.po
Languages: pl

source: Success.
pl: Sukces.

source: Could not negotiate a supported cipher suite.
pl: Nie uda³o siê wynegocjowaæ obs³ugiwanego zestawu certyfikatów.

source: The cipher type is unsupported.
pl: Ten typ certyfikatu nie jest obs³ugiwany.

source: The certificate and the given key do not match.
pl: Certyfikat i dany klucz nie pasuj± do siebie.

source: Could not negotiate a supported compression method.
pl: Nie uda³o siê wynegocjowaæ obs³ugiwanej metody kompresji.

source: An unknown public key algorithm was encountered.
pl: Napotkano nieznany algorytm klucza publicznego.

source: An algorithm that is not enabled was negotiated.
pl: Wynegocjowano algorytm, który nie zosta³ w³±czony.

source: A large TLS record packet was received.
pl: Odebrano du¿y pakiet rekordu TLS.

source: A record packet with illegal version was received.
pl: Odebrano pakiet rekordu o niedozwolonej wersji.

source: The Diffie-Hellman prime sent by the server is not acceptable (not long enough).
pl: Liczba pierwsza Diffie Hellmana wys³ana przez serwer jest nieakceptowalna (zbyt ma³a).

source: A TLS packet with unexpected length was received.
pl: Odebrano pakiet TLS o nieoczekiwanej d³ugo¶ci.

source: The specified session has been invalidated for some reason.
pl: Podana sesja zosta³a z jakiego¶ powodu uniewa¿niona.

source: GnuTLS internal error.
pl: B³±d wewnêtrzny GnuTLS.

source: An illegal TLS extension was received.
pl: Odebrano niedozwolone rozszerzenie TLS.

source: A TLS fatal alert has been received.
pl: Odebrano krytyczny alarm TLS.

source: An unexpected TLS packet was received.
pl: Odebrano nieoczekiwany pakiet TLS.

source: A TLS warning alert has been received.
pl: Odebrano ostrzegawczy alarm TLS.

source: An error was encountered at the TLS Finished packet calculation.
pl: Wykryto b³±d przy obliczaniu pakietu TLS Finished.

source: The peer did not send any certificate.
pl: Druga strona nie wys³a³a ¿adnego certyfikatu.

source: There is already a crypto algorithm with lower priority.
pl: Istnieje ju¿ algorytm kryptograficzny z ni¿szym priorytetem.

source: No temporary RSA parameters were found.
pl: Nie znaleziono parametrów tymczasowych RSA.

source: No temporary DH parameters were found.
pl: Nie znaleziono parametrów tymczasowych DH.

source: An unexpected TLS handshake packet was received.
pl: Odebrano nieoczekiwany pakiet nawi±zania TLS.

source: The scanning of a large integer has failed.
pl: Poszukiwanie du¿ej liczby ca³kowitej nie powiod³o siê.

source: Could not export a large integer.
pl: Nie uda³o siê wyeksportowaæ du¿ej liczby ca³kowitej.

source: Decryption has failed.
pl: Odszyfrowywanie nie powiod³o siê.

source: Encryption has failed.
pl: Szyfrowanie nie powiod³o siê.

source: Public key decryption has failed.
pl: Odszyfrowywanie z kluczem publicznym nie powiod³o siê.

source: Public key encryption has failed.
pl: Szyfrowanie z kluczem publicznym nie powiod³o siê.

source: Public key signing has failed.
pl: Podpisywanie z kluczem publicznym nie powiod³o siê.

source: Public key signature verification has failed.
pl: Sprawdzenie podpisu z kluczem publicznym nie powiod³o siê.

source: Decompression of the TLS record packet has failed.
pl: Dekompresja pakietu rekordu TLS nie powiod³a siê.

source: Compression of the TLS record packet has failed.
pl: Kompresja pakietu rekordu TLS nie powiod³a siê.

source: Internal error in memory allocation.
pl: B³±d wewnêtrzny przy przydzielaniu pamiêci.

source: An unimplemented or disabled feature has been requested.
pl: Za¿±dano niezaimplementowanej lub wy³±czonej opcji.

source: Insufficient credentials for that request.
pl: Niewystarczaj±ce uprawnienia dla tego ¿±dania.

source: Error in password file.
pl: B³±d w pliku hase³.

source: Wrong padding in PKCS1 packet.
pl: B³êdne wyrównanie w pakiecie PKCS1.

source: The requested session has expired.
pl: ¯±dana sesja wygas³a.

source: Hashing has failed.
pl: Funkcja skrótu nie powiod³a siê.

source: Base64 decoding error.
pl: B³±d dekodowania base64.

source: Base64 unexpected header error.
pl: Nieoczekiwany b³±d nag³ówka base64.

source: Base64 encoding error.
pl: B³±d kodowania base64.

source: Parsing error in password file.
pl: B³±d przetwarzania pliku hase³.

source: The requested data were not available.
pl: ¯±dane dane nie by³y dostêpne.

source: Error in the pull function.
pl: B³±d w funkcji pull.

source: Error in the push function.
pl: B³±d w funkcji push.

source: The upper limit of record packet sequence numbers has been reached. Wow!
pl: Osi±gniêto górne ograniczenie numerów sekwencyjnych pakietów rekordów. Wow!

source: Error in the certificate.
pl: B³±d w certyfikacie.

source: Unknown Subject Alternative name in X.509 certificate.
pl: Nieznana nazwa Subject Alternative w certyfikacie X.509.

source: Unsupported critical extension in X.509 certificate.
pl: Nieobs³ugiwane rozszerzenie krytyczne w certyfikacie X.509.

source: Key usage violation in certificate has been detected.
pl: Wykryto naruszenie u¿ycia klucza w certyfikacie.

source: Resource temporarily unavailable, try again.
pl: Zasoby chwilowo niedostêpne, proszê spróbowaæ ponownie.

source: Function was interrupted.
pl: Funkcja zosta³a przerwana.

source: Rehandshake was requested by the peer.
pl: Druga strona za¿±da³a ponownego nawi±zania sesji.

source: TLS Application data were received, while expecting handshake data.
pl: Odebrano dane aplikacji TLS, ale oczekiwano na nawi±zanie sesji.

source: Error in Database backend.
pl: B³±d w backendzie bazy danych.

source: The certificate type is not supported.
pl: Ten typ certyfikatu nie jest obs³ugiwany.

source: The given memory buffer is too short to hold parameters.
pl: Przekazany bufor pamiêci jest zbyt ma³y do przechowania parametrów.

source: The request is invalid.
pl: ¯±danie jest nieprawid³owe.

source: An illegal parameter has been received.
pl: Odebrano niedozwolony parametr.

source: Error while reading file.
pl: B³±d podczas odczytu pliku.

source: ASN1 parser: Element was not found.
pl: Analiza ASN1: Nie znaleziono elementu.

source: ASN1 parser: Identifier was not found
pl: Analiza ASN1: Nie znaleziono identyfikatora.

source: ASN1 parser: Error in DER parsing.
pl: Analiza ASN1: B³±d przy analizie DER.

source: ASN1 parser: Value was not found.
pl: Analiza ASN1: Nie znaleziono warto¶ci.

source: ASN1 parser: Generic parsing error.
pl: Analiza ASN1: Ogólny b³±d przetwarzania.

source: ASN1 parser: Value is not valid.
pl: Analiza ASN1: Warto¶æ nie jest prawid³owa.

source: ASN1 parser: Error in TAG.
pl: Analiza ASN1: B³±d w znaczniku.

source: ASN1 parser: error in implicit tag
pl: Analiza ASN1: b³±d w domy¶lnym znaczniku.

source: ASN1 parser: Error in type 'ANY'.
pl: Analiza ASN1: B³±d w typie 'ANY'.

source: ASN1 parser: Syntax error.
pl: Analiza ASN1: B³±d sk³adni.

source: ASN1 parser: Overflow in DER parsing.
pl: Analiza ASN1: Przepe³nienie przy analizie DER.

source: Too many empty record packets have been received.
pl: Odebrano zbyt du¿o pustych pakietów rekordów.

source: The initialization of GnuTLS-extra has failed.
pl: Inicjalizacja GnuTLS-extra nie powiod³a siê.

source: The GnuTLS library version does not match the GnuTLS-extra library version.
pl: Wersja biblioteki GnuTLS nie zgadza siê z wersj± biblioteki GnuTLS-extra.

source: The gcrypt library version is too old.
pl: Wersja biblioteki gcrypt jest zbyt stara.

source: The tasn1 library version is too old.
pl: Wersja biblioteki tasn1 jest zbyt stara.

source: The OpenPGP User ID is revoked.
pl: Identyfikator u¿ytkownika OpenPGP jest uniewa¿niony.

source: Error loading the keyring.
pl: B³±d przy wczytywaniu zbioru kluczy.

source: The initialization of LZO has failed.
pl: Inicjalizacja LZO nie powiod³a siê.

source: No supported compression algorithms have been found.
pl: Nie znaleziono obs³ugiwanego algorytmu kompresji.

source: No supported cipher suites have been found.
pl: Nie znaleziono obs³ugiwanego zestawu certyfikatów.

source: Could not get OpenPGP key.
pl: Nie uda³o siê uzyskaæ klucza OpenPGP.

source: Could not find OpenPGP subkey.
pl: Nie uda³o siê odnale¼æ podklucza OpenPGP.

source: The SRP username supplied is illegal.
pl: Podana nazwa u¿ytkownika SRP nie jest dozwolona.

source: The OpenPGP fingerprint is not supported.
pl: Odcisk klucza OpenPGP nie jest obs³ugiwany.

source: The certificate has unsupported attributes.
pl: Certyfikat ma nieobs³ugiwane atrybuty.

source: The OID is not supported.
pl: OID nie jest obs³ugiwany.

source: The hash algorithm is unknown.
pl: Algorytm skrótu jest nieznany.

source: The PKCS structure's content type is unknown.
pl: Typ zawarto¶ci struktury PKCS jest nieznany.

source: The PKCS structure's bag type is unknown.
pl: Typ opakowania struktury PKCS jest nieznany.

source: The given password contains invalid characters.
pl: Podane has³o zawiera nieprawid³owe znaki.

source: The Message Authentication Code verification failed.
pl: Sprawdzenie kodu autentyczno¶ci wiadomo¶ci (MAC) nie powiod³o siê.

source: Some constraint limits were reached.
pl: Osi±gniêto niektóre ograniczenia.

source: Failed to acquire random data.
pl: Nie uda³o siê pozyskaæ danych losowych.

source: Received a TLS/IA Intermediate Phase Finished message
pl: Odebrano wiadomo¶æ TLS/IA Intermediate Phase Finished

source: Received a TLS/IA Final Phase Finished message
pl: Odebrano wiadomo¶æ TLS/IA Final Phase Finished

source: Verifying TLS/IA phase checksum failed
pl: Sprawdzenie sumy kontrolnej frazy TLS/IA nie powiod³o siê

source: The specified algorithm or protocol is unknown.
pl: Podany algorytm lub protokó³ jest nieznany.

source: The handshake data size is too large (DoS?), check gnutls_handshake_set_max_packet_length().
pl: Rozmiar danych nawi±zania jest zbyt du¿y (DoS?), proszê sprawdziæ gnutls_handshake_set_max_packet_length().

source: (unknown error code)
pl: (nieznany kod b³êdu)

source: Close notify
pl: Powiadomienie o zamkniêciu

source: Unexpected message
pl: Nieoczekiwany komunikat

source: Bad record MAC
pl: B³êdny MAC rekordu

source: Decryption failed
pl: Odszyfrowywanie nie powiod³o siê

source: Record overflow
pl: Przepe³nienie rekordu

source: Decompression failed
pl: Dekompresja nie powiod³a siê

source: Handshake failed
pl: Nawi±zanie komunikacji nie powiod³o siê

source: Certificate is bad
pl: B³êdny certyfikat

source: Certificate is not supported
pl: Nieobs³ugiwany certyfikat

source: Certificate was revoked
pl: Certyfikat zosta³ anulowany

source: Certificate is expired
pl: Certyfikat wygas³

source: Unknown certificate
pl: Nieznany certyfikat

source: Illegal parameter
pl: Niedozwolony parametr

source: CA is unknown
pl: Nieznane CA

source: Access was denied
pl: Dostêp zabroniony

source: Decode error
pl: B³±d dekodowania

source: Decrypt error
pl: B³±d odszyfrowywania

source: Export restriction
pl: Ograniczenia eksportowe

source: Error in protocol version
pl: B³±d w wersji protoko³u

source: Insufficient security
pl: Niewystarczaj±ce bezpieczeñstwo

source: User canceled
pl: Anulowane przez u¿ytkownika

source: Internal error
pl: B³±d wewnêtrzny

source: No renegotiation is allowed
pl: Renegocjacja niedozwolona

source: Could not retrieve the specified certificate
pl: Nie uda³o siê pobraæ wskazanego certyfikatu

source: An unsupported extension was sent
pl: Wys³ano nieobs³ugiwane rozszerzenie

source: The server name sent was not recognized
pl: Nierozpoznana wys³ana nazwa serwera

source: The SRP/PSK username is missing or not known
pl: Brak lub nieznana nazwa u¿ytkownika SRP/PSK

source: Inner application negotiation failed
pl: Negocjacja w ramach aplikacji nie powiod³a siê

source: Inner application verification failed
pl: Weryfikacja w ramach aplikacji nie powiod³a siê

source: Path Length Constraint: %d
pl: Ograniczenie d³ugo¶ci ¶cie¿ki: %d

source: Policy Language: %s
pl: Jêzyk polityki: %s

source: Policy: ASCII:
pl: Polityka: ASCII:

source: Hexdump:
pl: Zrzut hex:

source: %s Digital signature.
pl: %s Podpis cyfrowy.

source: %s Non repudiation.
pl: %s Bez odmowy.

source: %s Key encipherment.
pl: %s Szyfrowanie klucza.

source: %s Data encipherment.
pl: %s Szyfrowanie danych.

source: %s Key agreement.
pl: %s Uzgodnienie klucza.

source: %s Certificate signing.
pl: %s Podpisanie certyfikatu.

source: %s CRL signing.
pl: %s Podpisanie CRL.

source: %s Key encipher only.
pl: %s Tylko szyfrowanie klucza.

source: %s Key decipher only.
pl: %s Tylko deszyfrowanie klucza.

source: warning: distributionPoint contains an embedded NUL, replacing with '!'
pl: uwaga: distributionPoint zawiera znak NUL, zast±piono znakiem '!'

source: %s TLS WWW Server.
pl: %s Serwer WWW TLS.

source: %s TLS WWW Client.
pl: %s Klient WWW TLS.

source: %s Code signing.
pl: %s Podpisywanie kodu.

source: %s Email protection.
pl: %s Ochrona poczty elektronicznej.

source: %s Time stamping.
pl: %s Oznaczanie czasu.

source: %s OCSP signing.
pl: %s Podpisywanie OCSP.

source: %s Any purpose.
pl: %s Dowolne zastosowanie.

source: %s Certificate Authority (CA): FALSE
pl: %s CA: NIE

source: %s Certificate Authority (CA): TRUE
pl: %s CA: TAK

source: %s Path Length Constraint: %d
pl: %s Ograniczenie d³ugo¶ci ¶cie¿ki: %d

source: %s XMPP Address: %.*s
pl: %s Adres XMPP: %.*s

source: %s otherName OID: %.*s
pl: %s OID otherName: %.*s

source: %s otherName DER:
pl: %s DER otherName:

source: %s otherName ASCII:
pl: %s ASCII otherName:

source: %s Extensions:
pl: %s Rozszerzenia:

source: %s Basic Constraints (%s):
pl: %s Ograniczenia podstawowe (%s):

source: critical
pl: krytyczny

source: not critical
pl: niekrytyczny

source: %s Subject Key Identifier (%s):
pl: %s Identyfikator klucza przedmiotu (%s):

source: %s Authority Key Identifier (%s):
pl: %s Identyfikator klucza autorytetu (%s):

source: %s Key Usage (%s):
pl: %s U¿ycie klucza (%s):

source: %s Key Purpose (%s):
pl: %s Przeznaczenie klucza (%s):

source: %s Subject Alternative Name (%s):
pl: %s Alternatywna nazwa przedmiotu (%s):

source: %s CRL Distribution points (%s):
pl: %s Punkty rozprowadzania CRL (%s):

source: %s Proxy Certificate Information (%s):
pl: %s Informacja o certyfikacie proxy (%s):

source: %s Unknown extension %s (%s):
pl: %s Nieznane rozszerzenie %s (%s):

source: %s Hexdump:
pl: %s Zrzut hex:

source: Version: %d
pl: Wersja: %d

source: Serial Number (hex):
pl: Numer seryjny (hex):

source: Issuer: %s
pl: Wystawca: %s

source: Validity:
pl: Wa¿no¶æ:

source: Not Before: %s
pl: Nie wcze¶niej ni¿: %s

source: Not After: %s
pl: Nie pó¼niej ni¿: %s

source: Subject: %s
pl: Przedmiot: %s

source: unknown
pl: nieznany

source: Subject Public Key Algorithm: %s
pl: Algorytm klucza publicznego: %s

source: Modulus (bits %d):
pl: Reszta (bitów: %d):

source: Exponent (bits %d):
pl: Wyk³adnik (bitów: %d):

source: Public key (bits %d):
pl: Klucz publiczny (bitów: %d):

source: Signature Algorithm: %s
pl: Algorytm podpisu: %s

source: warning: signed using a broken signature algorithm that can be forged.
pl: uwaga: podpisano z³amanym algorytmem podpisu, który mo¿e byæ podrobiony.

source: Signature:
pl: Podpis:

source: MD5 fingerprint:
pl: Odcisk MD5:

source: SHA-1 fingerprint:
pl: Odcisk SHA-1:

source: Public Key Id:
pl: Identyfikator klucza publicznego:

source: signed using %s (broken!),
pl: podpisano przy u¿yciu %s (uszkodzonego!),

source: signed using %s,
pl: podpisano przy u¿yciu %s,

source: X.509 Certificate Information:
pl: Informacja o certyfikacie X.509:

source: Other Information:
pl: Inne informacje:

source: Version: 1 (default)
pl: Wersja: 1 (domy¶lna)

source: Update dates:
pl: Daty uaktualnieñ:

source: Issued: %s
pl: Wystawiono: %s

source: Next at: %s
pl: Nastêpnie: %s

source: Extensions:
pl: Rozszerzenia:

source: CRL Number (%s):
pl: Numer CRL (%s):

source: Authority Key Identifier (%s):
pl: Identyfikator klucza autorytetu (%s):

source: Unknown extension %s (%s):
pl: Nieznane rozszerzenie %s (%s):

source: Hexdump:
pl: Zrzut hex:

source: Revoked certificates (%d):
pl: Uniewa¿nione certyfikaty (%d):

source: No revoked certificates.
pl: Brak uniewa¿nionych certyfikatów.

source: Serial Number (hex):
pl: Numer seryjny (hex):

source: Revoked at: %s
pl: Uniewa¿niono: %s

source: X.509 Certificate Revocation List Information:
pl: Informacja o li¶cie uniewa¿nieñ certyfikatów X.509:

source: Exponent:
pl: Wyk³adnik:

source: Attributes:
pl: Atrybuty:

source: Challenge password: %s
pl: Has³o wyzwania: %s

source: Unknown attribute %s:
pl: Nieznane rozszerzenie %s:

source: PKCS #10 Certificate Request Information:
pl: Informacja o ¿±daniu certyfikatu PKCS #10:

source: Key Usage:
pl: U¿ycie klucza:

source: error: get_key_usage: %s
pl: b³±d: get_key_usage: %s

source: Digital signatures.
pl: Podpisy cyfrowe.

source: Communications encipherment.
pl: Szyfrowanie komunikacji.

source: Storage data encipherment.
pl: Szyfrowanie przechowywanych danych.

source: Authentication.
pl: Uwierzytelnianie.

source: Certificate signing.
pl: Podpisanie certyfikatu.

source: Fingerprint (hex):
pl: Odcisk (hex):

source: Revoked: True
pl: Uniewa¿niony: tak

source: Revoked: False
pl: Uniewa¿niony: nie

source: Time stamps:
pl: Oznaczenia czasu:

source: Creation: %s
pl: Utworzenie: %s

source: Expiration: Never
pl: Wyga¶niêcie: nigdy

source: Expiration: %s
pl: Wyga¶niêcie: %s

source: Public Key Algorithm: %s
pl: Algorytm klucza publicznego: %s

source: Name[%d]: %s
pl: Nazwa[%d]: %s

source: Revoked Name[%d]: %s
pl: Nazwa uniewa¿niona[%d]: %s

source: Subkey[%d]:
pl: Podklucz[%d]:

source: name[%d]: %s,
pl: nazwa[%d]: %s,

source: revoked name[%d]: %s,
pl: nazwa uniewa¿niona[%d]: %s,

source: fingerprint:
pl: odcisk:

source: created: %s,
pl: utworzono: %s,

source: never expires,
pl: nigdy nie wygasa,

source: expires: %s,
pl: wygasa: %s,

source: key algorithm %s (%d bits)
pl: algorytm klucza publicznego %s (bitów: %d)

source: unknown key algorithm (%d)
pl: nieznany algorytm klucza publicznego (%d)

source: OpenPGP Certificate Information:
pl: Informacja o certyfikacie OpenPGP:
