<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html401/loose.dtd">
<html>
<!-- Created on Dezember, 3 2012 by texi2html 1.76 -->
<!--
Written by: Lionel Cons <Lionel.Cons@cern.ch> (original author)
            Karl Berry  <karl@freefriends.org>
            Olaf Bachmann <obachman@mathematik.uni-kl.de>
            and many others.
Maintained by: Many creative people <dev@texi2html.cvshome.org>
Send bugs and suggestions to <users@texi2html.cvshome.org>

-->
<head>
<title>Maxima Manual: 5. Datentypen und Strukturen</title>

<meta name="description" content="Maxima Manual: 5. Datentypen und Strukturen">
<meta name="keywords" content="Maxima Manual: 5. Datentypen und Strukturen">
<meta name="resource-type" content="document">
<meta name="distribution" content="global">
<meta name="Generator" content="texi2html 1.76">
<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<style type="text/css">
<!--
a.summary-letter {text-decoration: none}
pre.display {font-family: serif}
pre.format {font-family: serif}
pre.menu-comment {font-family: serif}
pre.menu-preformatted {font-family: serif}
pre.smalldisplay {font-family: serif; font-size: smaller}
pre.smallexample {font-size: smaller}
pre.smallformat {font-family: serif; font-size: smaller}
pre.smalllisp {font-size: smaller}
span.sansserif {font-family:sans-serif; font-weight:normal;}
ul.toc {list-style: none}
body
{
    color: black;
    background: white; 
    margin-left: 8%;
    margin-right: 13%;
}

h1
{
    margin-left: +8%;
    font-size: 150%;
    font-family: sans-serif
}

h2
{
    font-size: 125%;
    font-family: sans-serif
}

h3
{
    font-size: 100%;
    font-family: sans-serif
}

h2,h3,h4,h5,h6 { margin-left: +4%; }

div.textbox
{
    border: solid;
    border-width: thin;
    /* width: 100%; */
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em
}

div.titlebox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
    background: rgb(200,255,255);
    font-family: sans-serif
}

div.synopsisbox
{
    border: none;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 2em;
    padding-right: 2em;
     background: rgb(255,220,255);
    /*background: rgb(200,255,255); */
    /* font-family: fixed */
}

pre.example
{
    border: 1px solid gray;
    padding-top: 1em;
    padding-bottom: 1em;
    padding-left: 1em;
    padding-right: 1em;
    /* background: rgb(247,242,180); */ /* kind of sandy */
    /* background: rgb(200,255,255); */ /* sky blue */
    background-color: #F1F5F9; /* light blue-gray */
    /* font-family: "Lucida Console", monospace */
}

div.spacerbox
{
    border: none;
    padding-top: 2em;
    padding-bottom: 2em
}

div.image
{
    margin: 0;
    padding: 1em;
    text-align: center;
}

div.categorybox
{
    border: 1px solid gray;
    padding-top: 0px;
    padding-bottom: 0px;
    padding-left: 1em;
    padding-right: 1em;
    background: rgb(247,242,220);
}


-->
</style>

<link rel="icon" href="http://maxima.sourceforge.net/favicon.ico"/>
</head>

<body lang="de" bgcolor="#FFFFFF" text="#000000" link="#0000FF" vlink="#800080" alink="#FF0000">

<a name="Datentypen-und-Strukturen"></a>
<a name="SEC19"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="maxima_4.html#SEC18" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima_4.html#SEC8" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h1 class="chapter"> 5. Datentypen und Strukturen </h1>


<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC20">5.1 Zahlen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC26">5.2 Zeichenketten</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC29">5.3 Funktionen und Variablen f&uuml;r Konstante</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC30">5.4 Listen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC33">5.5 Arrays</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC36">5.6 Strukturen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Zahlen"></a>
<a name="SEC20"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC19" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC21" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.1 Zahlen </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC21">5.1.1 Einf&uuml;hrung in Zahlen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC25">5.1.2 Funktionen und Variablen f&uuml;r Zahlen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-Zahlen"></a>
<a name="SEC21"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC20" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC25" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.1.1 Einf&uuml;hrung in Zahlen </h3>

<a name="SEC22"></a>
<h3 class="subheading"> Ganze und rationale Zahlen </h3>

<p>Arithmetische Rechnungen mit ganzen oder rationalen Zahlen sind exakt.
Prinzipiell k&ouml;nnen die ganzen und rationalen Zahlen eine beliebige Anzahl an 
Stellen haben.  Eine Obergrenze ist allein der zur Verf&uuml;gung stehende
Speicherplatz.
</p>
<pre class="example">(%i1) 1/3+5/4+3;
                               55
(%o1)                          --
                               12
(%i2) 100!;
(%o2) 9332621544394415268169923885626670049071596826438162146859\
2963895217599993229915608941463976156518286253697920827223758251\
185210916864000000000000000000000000
(%i3) 100!/101!;
                                1
(%o3)                          ---
                               101
</pre>
<p>Funktionen f&uuml;r ganze und rationale Zahlen:
</p>
<pre class="verbatim">   integerp       numberp       nonnegintegerp     
   oddp           evenp
   ratnump        rationalize
</pre>
<a name="SEC23"></a>
<h3 class="subheading"> Gleitkommazahlen </h3>

<p>Maxima rechnet mit Gleitkommazahlen in doppelter Genauigkeit.  Weiterhin kann
Maxima mit gro&szlig;en Gleitkommazahlen rechnen, die prinzipiell eine beliebige
Genauigkeit haben.
</p>
<p>Gleitkommazahlen werden mit einem Dezimalpunkt eingegeben.  Der Exponent kann 
mit &quot;f&quot;, &quot;e&quot; oder &quot;d&quot; angegeben werden.  Intern rechnet Maxima
ausschlie&szlig;lich mit Gleitkommazahlen in doppelter Genauigkeit, die immer mit
&quot;e&quot; f&uuml;r den Exponenten angezeigt werden.  Gro&szlig;e Gleitkommazahlen werden
mit dem Exponenten &quot;b&quot; bezeichnet.  Gro&szlig;- und Kleinschreibung werden bei der
Schreibweise des Exponenten nicht unterschieden.
</p>
<pre class="example">(%i1) [2.0,1f10,1,e10,1d10,1d300];
(%o1)        [2.0, 1.e+10, 1, e10, 1.e+10, 1.e+300]
(%i2) [2.0b0,1b10,1b300];
(%o2)               [2.0b0, 1.0b10, 1.0b300]
</pre>

<p>Ist mindestens eine Zahl in einer Rechnung eine Gleitkommazahl, werden die 
Argumente in Gleitkommazahlen umgewandelt und eine Gleitkommazahl als Ergebnis
zur&uuml;ckgegeben.  Dies wird auch f&uuml;r gro&szlig;e Gleitkommazahlen ausgef&uuml;hrt.
</p>
<pre class="example">(%i1) 2.0+1/2+3;
(%o1)                                 5.5
(%i2) 2.0b0+1/2+3;
(%o2)                                5.5b0
</pre>

<p>Mit den Funktionen <code><a href="#float">float</a></code>
 und <code><a href="#bfloat">bfloat</a></code>
 werden Zahlen in
Gleitkommazahlen und gro&szlig;e Gleitkommazahlen umgewandelt:
</p>
<pre class="example">(%i1) float([2,1/2,1/3,2.0b0]);
(%o1)          [2.0, 0.5, .3333333333333333, 2.0]
(%i2) bfloat([2,1/2,1/3,2.0b0]);
(%o2)     [2.0b0, 5.0b-1, 3.333333333333333b-1, 2.0b0]
</pre>

<p>Funktionen und Variablen f&uuml;r Gleitkommazahlen:
</p>
<pre class="verbatim">   float        floatnump     
   bfloat       bfloatp       fpprec
   float2bf     bftorat       ratepsilon

   number_pbranch 
   m1pbranch
</pre>
<a name="SEC24"></a>
<h3 class="subheading"> Komplexe Zahlen </h3>

<p>Maxima kennt keinen eigenen Typ f&uuml;r komplexe Zahlen.  Komplexe Zahlen werden 
von Maxima intern als die Addition von Realteil und dem mit der Imagin&auml;ren 
Einheit <code><a href="#g_t_0025i">%i</a></code>
 multiplizierten Imagin&auml;rteil dargestellt.  Zum Beispiel sind
die komplexen Zahlen <code>2 + 3*%i</code> und <code>2 - 3*%i</code> die Wurzeln der 
Gleichung <code>x^2 - 4*x + 13 = 0</code>.
</p>
<p>Maxima vereinfacht Produkte, Quotienten, Wurzeln und andere Ausdr&uuml;cke mit 
komplexen Zahlen nicht automatisch zu einer komplexen Zahl.  Um Produkte mit
komplexen Zahlen zu vereinfachen, kann der Ausdruck mit der Funktion 
<code><a href="maxima_9.html#expand">expand</a></code>
 expandiert werden.
</p>
<p>Funktionen f&uuml;r komplexe Zahlen:
</p>
<pre class="verbatim">   realpart     imagpart      rectform     polarform
   cabs         carg          conjugate    csign
</pre>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Zahlen"></a>
<a name="SEC25"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC21" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC26" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC20" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.1.2 Funktionen und Variablen f&uuml;r Zahlen </h3>

<p><a name="bfloat"></a>
</p><dl>
<dt><u>Funktion:</u> <b>bfloat</b><i> (<var>expr</var>)</i>
<a name="IDX84"></a>
</dt>
<dd><p>Konvertiert alle Zahlen im Ausdruck <var>expr</var> in gro&szlig;e Gleitkommazahlen.
Die Anzahl der Stellen wird durch die Optionsvariable 
<code><a href="#fpprec">fpprec</a></code>
 spezifiziert.
</p>
<p>Hat die Optionsvariable <code><a href="#float2bf">float2bf</a></code>
 den Wert <code>false</code>, gibt Maxima eine
Warnung aus, wenn eine Gleitkommazahl mit doppelter Genauigkeit in eine 
gro&szlig;e Gleitkommazahl umgewandelt wird.
</p>
<p>Siehe auch die Funktion und den Auswertungsschalter <code><a href="#float">float</a></code>
 sowie die
Optionsvariable <code><a href="#numer">numer</a></code>
 f&uuml;r die Umwandlung von Zahlen in Gleitkommazahlen
mit doppelter Genauigkeit.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) bfloat([2, 3/2, 1.5]);
(%o1)                 [2.0b0, 1.5b0, 1.5b0]
(%i2) bfloat(sin(1/2));
(%o2)                  4.79425538604203b-1
(%i3) bfloat(%pi),fpprec:45;
(%o3)    3.1415926535897932384626433832795028841971694b0
</pre></dd></dl>

<p><a name="bfloatp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>bfloatp</b><i> (<var>number</var>)</i>
<a name="IDX85"></a>
</dt>
<dd><p>Gibt den Wert <code>true</code> zur&uuml;ck, wenn das Argument <var>number</var> eine
gro&szlig;e Gleitkommazahl ist, ansonsten den Wert <code>false</code>.
</p>
<p>Siehe auch die Funktionen <code><a href="#numberp">numberp</a></code>,
 <code><a href="#floatnump">floatnump</a></code>,

<code><a href="#ratnump">ratnump</a></code>
 und <code><a href="#integerp">integerp</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) bfloatp(1.5b0);
(%o1)                         true
(%i2) a:bfloat(%e);
(%o2)                  2.718281828459045b0
(%i3) bfloatp(a);
(%o3)                         true
(%i4) bfloatp(1.5);
(%o4)                         false
</pre></dd></dl>

<p><a name="bftorat"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>bftorat</b>
<a name="IDX86"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Die Optionsvariable <code>bftorat</code> kontrolliert die Umwandlung von gro&szlig;en
Gleitkommazahlen in rationale Zahlen.  Hat <code>bftorat</code> den Wert <code>false</code>,
wird die Genauigkeit der Umwandlung von der Optionsvariablen
<code><a href="#ratepsilon">ratepsilon</a></code>
 kontrolliert.  Hat dagegen <code>bftorat</code> den Wert
<code>true</code>, wird die gro&szlig;e Gleitkommazahl exakt durch die rationale Zahl 
repr&auml;sentiert.
</p>
<p>Hinweis: <code>bftorat</code> hat keinen Einfluss auf die Umwandlung in rationale
Zahlen mit der Funktion <code><a href="#rationalize">rationalize</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) ratepsilon:1e-4;
(%o1)                         1.e-4
(%i2) rat(bfloat(11111/111111)), bftorat:false;
`rat' replaced 9.99990999991B-2 by 1/10 = 1.0B-1
                               1
(%o2)/R/                       --
                               10
(%i3) rat(bfloat(11111/111111)), bftorat:true;
`rat' replaced 9.99990999991B-2 by 11111/111111 = 9.99990999991B-2
                             11111
(%o3)/R/                     ------
                             111111
</pre></dd></dl>

<p><a name="bftrunc"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>bftrunc</b>
<a name="IDX87"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat die Optionsvariable <code>bftrunc</code> den Wert <code>true</code>, werden bei der
Ausgabe einer gro&szlig;en Gleitkommazahl nachfolgende Nullen nicht angezeigt.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) bftrunc:true;
(%o1)                         true
(%i2) bfloat(1);
(%o2)                         1.0b0
(%i3) bftrunc:false;
(%o3)                         false
(%i4) bfloat(1);
(%o4)                  1.000000000000000b0
</pre></dd></dl>

<p><a name="evenp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>evenp</b><i> (<var>expr</var>)</i>
<a name="IDX88"></a>
</dt>
<dd><p>Ist das Argument <var>expr</var> eine gerade ganze Zahl, wird <code>true</code>
zur&uuml;ckgegeben.  In allen anderen F&auml;llen wird <code>false</code> zur&uuml;ckgegeben.
</p>
<p><code>evenp</code> gibt f&uuml;r Symbole oder Ausdr&uuml;cke immer den Wert <code>false</code> 
zur&uuml;ck, auch wenn das Symbol als gerade ganze Zahl deklariert ist oder der 
Ausdruck eine gerade ganze Zahl repr&auml;sentiert.  Siehe die Funktion
<code><a href="maxima_11.html#featurep">featurep</a></code>,
 um zu testen, ob ein Symbol oder Ausdruck eine gerade
ganze Zahl repr&auml;sentiert.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) evenp(2);
(%o1)                         true
(%i2) evenp(3);
(%o2)                         false
(%i3) declare(n, even);
(%o3)                         done
(%i4) evenp(n);
(%o4)                         false
(%i5) featurep(n, even);
(%o5)                         true
</pre></dd></dl>

<p><a name="float"></a>
</p><dl>
<dt><u>Funktion:</u> <b>float</b><i> (<var>expr</var>)</i>
<a name="IDX89"></a>
</dt>
<dt><u>Optionsvariable:</u> <b>float</b>
<a name="IDX90"></a>
</dt>
<dd><p>Die Funktion <code>float</code> konvertiert ganze, rationale und gro&szlig;e
Gleitkommazahlen, die im Argument <var>expr</var> enthalten sind, in Gleitkommazahlen
mit doppelter Genauigkeit.
</p>
<p><code>float</code> ist auch eine Optionsvariable mit dem Standardwert <code>false</code> und
ein Auswertungsschalter f&uuml;r die Funktion <code><a href="maxima_8.html#ev">ev</a></code>.
  Erh&auml;lt die
Optionsvariable <code>float</code> den Wert <code>true</code>, werden rationale und
gro&szlig;e Gleitkommazahlen sofort in Gleitkommazahlen umgewandelt.  Als
Auswertungsschalter der Funktion <code>ev</code> hat <code>float</code> denselben Effekt,
ohne dass die Optionsvariable <code>float</code> ihren Wert &auml;ndert.  Im Unterschied
zur Funktion <code>float</code> werden durch das Setzen der Optionsvariablen oder bei
Verwendung als Auswertungsschalter keine ganze Zahlen in Gleitkommazahlen
umgewandelt.  Daher k&ouml;nnen die beiden Kommandos <code>ev(expr, float)</code> und
<code>float(expr)</code> ein unterschiedliches Ergebnis haben.
</p>
<p>Siehe auch die Optionsvariable <code><a href="#numer">numer</a></code>.
</p>

<p>Beispiele:
</p>
<p>In den ersten zwei Beispielen werden die Zahlen <code>1/2</code> und <code>1</code> in eine
Gleitkommazahl umgewandelt.  Die Sinusfunktion vereinfacht sodann zu einem
numerischen Wert.  Das Auswertungsschalter <code>float</code> wandelt ganze Zahlen
nicht in eine Gleitkommazahl um.  Daher wird <code>sin(1)</code> nicht zu einem
numerischen Wert vereinfacht.
</p>
<pre class="example">(%i1) float(sin(1/2));
(%o1)                   0.479425538604203
(%i2) float(sin(1));
(%o2)                   .8414709848078965
(%i3) sin(1/2),float;
(%o3)                   0.479425538604203
(%i4) sin(1),float;
(%o4)                        sin(1)
</pre></dd></dl>

<p><a name="float2bf"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>float2bf</b>
<a name="IDX91"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p> 
<p>Hat die Optionsvariable <code>float2bf</code> den Wert <code>false</code>, wird eine
Warnung ausgegeben, wenn eine Gleitkommazahl in eine gro&szlig;e Gleitkommazahl 
umgewandelt wird, da die Umwandlung zu einem Verlust an Genauigkeit f&uuml;hren 
kann.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) float2bf:true;
(%o1)                         true
(%i2) bfloat(1.5);
(%o2)                         1.5b0
(%i3) float2bf:false;
(%o3)                         false
(%i4) bfloat(1.5);
bfloat: converting float 1.5 to bigfloat.
(%o4)                         1.5b0
</pre></dd></dl>

<p><a name="floatnump"></a>
</p><dl>
<dt><u>Funktion:</u> <b>floatnump</b><i> (<var>number</var>)</i>
<a name="IDX92"></a>
</dt>
<dd><p>Gibt den Wert <code>true</code> zur&uuml;ck, wenn das Argument <var>number</var> eine 
Gleitkommazahl ist.  Ansonsten wird <code>false</code> zur&uuml;ckgegeben.  Auch wenn 
<var>number</var> eine gro&szlig;e Gleitkommazahl ist, ist das Ergebnis <code>false</code>.
</p>
<p>Siehe auch die Funktionen <code><a href="#numberp">numberp</a></code>,
 <code><a href="#bfloatp">bfloatp</a></code>,

<code><a href="#ratnump">ratnump</a></code>
 und <code><a href="#integerp">integerp</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) floatnump(1.5);
(%o1)                         true
(%i2) floatnump(1.5b0);
(%o2)                         false
</pre></dd></dl>

<p><a name="fpprec"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>fpprec</b>
<a name="IDX93"></a>
</dt>
<dd><p>Standardwert: 16
</p>
<p><code>ffprec</code> ist die Zahl der Stellen f&uuml;r das Rechnen mit gro&szlig;en 
Gleitkommazahlen.  <code>ffprec</code> hat keinen Einflu&szlig; auf das Rechnen mit
Gleitkommazahlen in doppelter Genauigkeit.  Siehe auch <code><a href="#bfloat">bfloat</a></code>
 und 
<code><a href="#fpprintprec">fpprintprec</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) fpprec:16;
(%o1)                          16
(%i2) bfloat(%pi);
(%o2)                  3.141592653589793b0
(%i3) fpprec:45;
(%o3)                          45
(%i4) bfloat(%pi);
(%o4)    3.1415926535897932384626433832795028841971694b0
(%i5) sin(1.5b0);
(%o5)   9.97494986604054430941723371141487322706651426b-1
</pre></dd></dl>

<p><a name="fpprintprec"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>fpprintprec</b>
<a name="IDX94"></a>
</dt>
<dd><p>Standardwert: 0
</p>
<p><code>fpprintprec</code> ist die Anzahl der Stellen, die angezeigt werden, wenn eine
Gleitkommazahl ausgegeben wird.
</p>
<p>Hat <code>fpprintprec</code> einen Wert zwischen 2 und 16, ist die Anzahl der 
angezeigten Stellen f&uuml;r einfache Gleitkommazahlen gleich dem Wert von 
<code>fpprintprec</code>.  Hat <code>fpprintprec</code> den Wert 0 oder ist gr&ouml;&szlig;er als
16 werden 16 Stellen angezeigt.
</p>
<p>Hat f&uuml;r gro&szlig;e Gleitkommazahlen <code>fpprintprec</code> einen Wert zwischen 2 
und <code><a href="#fpprec">fpprec</a></code>,
 ist die Anzahl der angezeigten Stellen gleich
<code>fpprintprec</code>.  Ist der Wert von <code>fpprintprec</code> gleich 0 oder 
gr&ouml;&szlig;er als <code>fpprec</code> werden <code>fpprec</code> Stellen angezeigt.
</p>
<p><code>fpprintprec</code> kann nicht den Wert 1 erhalten.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) fpprec:16;
(%o1)                          16
(%i2) fpprintprec:5;
(%o2)                           5
(%i3) float(%pi);
(%o3)                        3.1416
(%i4) bfloat(%pi);
(%o4)                       3.1415b0
(%i5) fpprintprec:25;
(%o5)                          25
(%i6) bfloat(%pi);
(%o6)                  3.141592653589793b0
(%i7) bfloat(%pi);
(%o7)                  3.141592653589793b0
(%i8) fpprec:45;
(%o8)                          45
(%i9) bfloat(%pi);
(%o9)             3.141592653589793238462643b0
(%i10) fpprintprec:45;
(%o10)                         45
(%i11) bfloat(%pi);
(%o11)   3.1415926535897932384626433832795028841971694b0
</pre></dd></dl>

<p><a name="integerp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>integerp</b><i> (<var>number</var>)</i>
<a name="IDX95"></a>
</dt>
<dd><p>Hat den R&uuml;ckgabewert <code>true</code>, wenn das Argument <var>number</var> eine ganze 
Zahl ist.  In allen anderen F&auml;llen gibt <code>integerp</code> den Wert <code>false</code> 
zur&uuml;ck.
</p>
<p><code>integerp</code> gibt f&uuml;r Symbole oder Ausdr&uuml;cke immer den Wert <code>false</code> 
zur&uuml;ck, auch wenn das Symbol als ganze Zahl deklariert ist oder der Ausdruck 
eine ganze Zahl repr&auml;sentiert.  Siehe die Funktion <code><a href="maxima_11.html#featurep">featurep</a></code>,
 um zu
testen, ob ein Symbol oder Ausdruck eine ganze Zahl repr&auml;sentiert.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) integerp (1);
(%o1)                         true
(%i2) integerp (1.0);
(%o2)                         false
(%i3) integerp (%pi);
(%o3)                         false
(%i4) declare (n, integer)$
(%i5) integerp (n);
(%o5)                         false
</pre></dd></dl>

<p><a name="m1pbranch"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>m1pbranch</b>
<a name="IDX96"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Die Optionsvariable <code>m1pbranch</code> kontrolliert die Vereinfachung der
Exponentiation von <code>-1</code> f&uuml;r den Fall, dass die Optionsvariable
<code><a href="maxima_9.html#domain">domain</a></code>
 den Wert <code>complex</code> hat.  Hat <code>m1pbranch</code> f&uuml;r diesen
Fall den Wert <code>true</code>, wird die Exponentiation von <code>-1</code> zu einem
Ausdruck vereinfacht, der dem Hauptwert entspricht.  Die Auswirkung der
Optionsvariable <code>m1pbranch</code> ist in der folgenden Tabelle gezeigt.
</p>
<pre class="example">              domain:real
                            
(-1)^(1/3):      -1
(-1)^(1/4):   (-1)^(1/4)

             domain:complex
          
m1pbranch:false          m1pbranch:true
(-1)^(1/3)               1/2+%i*sqrt(3)/2
(-1)^(1/4)              sqrt(2)/2+%i*sqrt(2)/2
</pre>
<p>Siehe auch die Optionsvariable <code><a href="#numer_005fpbranch">numer_pbranch</a></code>.
</p>
</dd></dl>

<p><a name="nonnegintegerp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>nonnegintegerp</b><i> (<var>number</var>)</i>
<a name="IDX97"></a>
</dt>
<dd><p>Gibt den Wert <code>true</code> zur&uuml;ck, wenn <code>number</code> eine ganze positive Zahl
oder Null ist.  Siehe auch <code><a href="#integerp">integerp</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) nonnegintegerp(2);
(%o1)                         true
(%i2) nonnegintegerp(-2);
(%o2)                         false
</pre></dd></dl>

<p><a name="numberp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>numberp</b><i> (<var>number</var>)</i>
<a name="IDX98"></a>
</dt>
<dd><p>Hat das Ergebnis <code>true</code>, wenn <var>number</var> eine ganze, rationale, eine
Gleitkommazahl oder eine gro&szlig;e Gleitkommazahl ist.  Ansonsten ist das 
Ergebnis <code>false</code>.
</p>
<p><code>numberp</code> gibt f&uuml;r ein Symbol immer das Ergebnis <code>false</code> zur&uuml;ck.
Dies ist auch dann der Fall, wenn das Symbol eine numerische Konstante wie 
<code><a href="#g_t_0025pi">%pi</a></code>
 ist oder wenn das Symbol mit der Funktion <code><a href="maxima_11.html#declare">declare</a></code>
 eine 
Eigenschaft wie <code><a href="maxima_11.html#integer">integer</a></code>,
 <code><a href="maxima_11.html#real">real</a></code>
 oder <code><a href="maxima_11.html#complex">complex</a></code>
 erhalten
hat.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) numberp (42);
(%o1)                         true
(%i2) numberp (-13/19);
(%o2)                         true
(%i3) numberp (3.14159);
(%o3)                         true
(%i4) numberp (-1729b-4);
(%o4)                         true
(%i5) map (numberp, [%e, %pi, %i, %phi, inf, minf]);
(%o5)      [false, false, false, false, false, false]
(%i6) declare(a,even, b,odd, c,integer, d,rational, e,real);
(%o6)                         done
(%i7) map (numberp, [a, b, c, d, e]);
(%o7) [false, false, false, false, false]
</pre></dd></dl>

<p><a name="numer"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>numer</b>
<a name="IDX99"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat die Optionsvariable <code>numer</code> den Wert <code>true</code>, werden rationale
Zahlen und gro&szlig;e Gleitkommazahlen in Gleitkommazahlen umgewandelt.
Weiterhin werden Konstante wie zum Beispiel <code><a href="#g_t_0025pi">%pi</a></code>,
 die einen
numerischen Wert haben, durch diesen ersetzt.  Mathematische Funktionen mit
numerischen Argumenten vereinfachen zu einer Gleitkommazahl.  Wird die
Optionsvariable <code>numer</code> gesetzt, erh&auml;lt die Optionsvariable
<code><a href="#float">float</a></code>
 denselben Wert.  Im Unterschied zur Optionsvariablen <code>float</code>
vereinfachen auch mathematische Funktionen mit einem ganzzahligen Wert wie zum
Beispiel <code>sin(1)</code> zu einem numerischen Wert.
</p>
<p><code>numer</code> ist auch ein Auswertungsschalter der Funktion <code><a href="maxima_8.html#ev">ev</a></code>.
  Der
Auswertungsschalter hat die gleiche Funktionsweise wie die Optionsvariable,
ohne dass die Optionsvariable ihren Wert &auml;ndert.
</p>
<p>Siehe auch <code><a href="#float">float</a></code>
 und <code><a href="maxima_10.html#g_t_0025enumer">%enumer</a></code>.
</p>

<p>Beispiele:
</p>
<p>Erh&auml;lt <code>numer</code> den Wert <code>true</code>, werden rationale Zahlen, Konstante
mit einem numerischen Wert und mathematische Funktionen mit numerischen
Argumenten zu einer Gleitkommazahl ausgewertet oder vereinfacht.
</p>
<pre class="example">(%i1) numer:false;
(%o1)                         false
(%i2) [1, 1/3, %pi, sin(1)];
                           1
(%o2)                  [1, -, %pi, sin(1)]
                           3
(%i3) numer:true;
(%o3)                         true
(%i4) [1, 1/3, %pi, sin(1)];
(%o4) [1, .3333333333333333, 3.141592653589793, 
                                               .8414709848078965]
</pre>
<p><code>numer</code> ist auch ein Auswertungsschalter der Funktion <code>ev</code>.  Hier wird
die Kurzschreibweise der Funktion <code>ev</code> verwendet.
</p>
<pre class="example">(%i1) [sqrt(2), sin(1), 1/(1+sqrt(3))];
                                        1
(%o1)            [sqrt(2), sin(1), -----------]
                                   sqrt(3) + 1

(%i2) [sqrt(2), sin(1), 1/(1+sqrt(3))],numer;
(%o2) [1.414213562373095, .8414709848078965, .3660254037844387]
</pre></dd></dl>

<p><a name="numer_005fpbranch"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>numer_pbranch</b>
<a name="IDX100"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Die Optionsvariable <code>numer_pbranch</code> kontrolliert die Vereinfachung der
Exponentiation einer negativen ganzen, rationalen oder Gleitkommazahl.
Hat <code>numer_pbranch</code> den Wert <code>true</code> und ist der Exponent eine 
Gleitkommazahl oder hat die Optionsvariable <code><a href="#numer">numer</a></code>
 den Wert <code>true</code>, 
dann berechnet Maxima den Hauptwert der Exponentiation.  Ansonsten wird ein 
vereinfachter Ausdruck, aber nicht numerischer Wert zur&uuml;ckgegeben.  Siehe auch
die Optionsvariable <code><a href="#m1pbranch">m1pbranch</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) (-2)^0.75;
(%o1) (-2)^0.75

(%i2) (-2)^0.75,numer_pbranch:true;
(%o2) 1.189207115002721*%i-1.189207115002721

(%i3) (-2)^(3/4);
(%o3) (-1)^(3/4)*2^(3/4)

(%i4) (-2)^(3/4),numer;
(%o4) 1.681792830507429*(-1)^0.75

(%i5) (-2)^(3/4),numer,numer_pbranch:true;
(%o5) 1.189207115002721*%i-1.189207115002721
</pre></dd></dl>

<p><a name="numerval"></a>
</p><dl>
<dt><u>Funktion:</u> <b>numerval</b><i> (<var>x_1</var>, <var>val_1</var>, &hellip;, <var>var_n</var>, <var>val_n</var>)</i>
<a name="IDX101"></a>
</dt>
<dd><p>Die Variablen <var>x_1</var>, &hellip;, <var>x_n</var> erhalten die numerischen Werte
<var>val_1</var>, &hellip;, <code>val_n</code>.  Die numerischen Werte werden immer dann
f&uuml;r die Variablen in Ausdr&uuml;cke eingesetzt, wenn die Optionsvariable 
<code><a href="#numer">numer</a></code>
 den Wert <code>true</code> hat.  Siehe auch <code><a href="maxima_8.html#ev">ev</a></code>.
</p>

<p>Die Argumente <var>val_1</var>, &hellip;, <var>val_n</var> k&ouml;nnen auch beliebige 
Ausdr&uuml;cke sein, die wie numerische Werte f&uuml;r Variablen eingesetzt werden.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) numerval(a, 123, b, x^2)$

(%i2) [a, b];
(%o2)                        [a, b]
(%i3) numer:true;
(%o3)                         true
(%i4) [a, b];
                                   2
(%o4)                       [123, x ]
</pre></dd></dl>

<p><a name="oddp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>oddp</b><i> (<var>expr</var>)</i>
<a name="IDX102"></a>
</dt>
<dd><p>Gibt <code>true</code> zur&uuml;ck, wenn das Argument <var>expr</var> eine ungerade ganze Zahl
ist.  In allen anderen F&auml;llen wird <code>false</code> zur&uuml;ckgegeben.
</p>
<p><code>oddp</code> gibt f&uuml;r Symbole oder Ausdr&uuml;cke immer den Wert <code>false</code> 
zur&uuml;ck, auch wenn das Symbol als ungerade ganze Zahl deklariert ist oder der 
Ausdruck eine ungerade ganze Zahl repr&auml;sentiert.  Siehe die Funktion 
<code><a href="maxima_11.html#featurep">featurep</a></code>,
 um zu testen, ob ein Symbol oder Ausdruck eine ungerade 
ganze Zahl repr&auml;sentiert.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) oddp(3);
(%o1)                         true
(%i2) oddp(2);
(%o2)                         false
(%i3) declare(n,odd);
(%o3)                         done
(%i4) oddp(n);
(%o4)                         false
(%i5) featurep(n,odd);
(%o5)                         true
</pre></dd></dl>

<p><a name="ratepsilon"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>ratepsilon</b>
<a name="IDX103"></a>
</dt>
<dd><p>Standardwert: <code>2.0e-15</code>
</p>
<p>Die Optionsvariable <code>ratepsilon</code> kontrolliert die Genauigkeit, mit der
Gleitkommazahlen in rationale Zahlen umgewandelt werden, wenn die
Optionsvariable <code>bftorat</code> den Wert <code>false</code> hat.  F&uuml;r ein Beispiel
siehe die Optionsvariable <code><a href="#bftorat">bftorat</a></code>.
</p>
</dd></dl>

<p><a name="rationalize"></a>
</p><dl>
<dt><u>Funktion:</u> <b>rationalize</b><i> (<var>expr</var>)</i>
<a name="IDX104"></a>
</dt>
<dd><p>Konvertiert alle Gleitkommazahlen einschlie&szlig;lich gro&szlig;er 
Gleitkommazahlen, die in dem Ausdruck <var>expr</var> auftreten, in rationale Zahlen.
</p>
<p>Es mag &uuml;berraschend sein, dass <code>rationalize(0.1)</code> nicht das Ergebnis
<code>1/10</code> hat.  Dies ist nicht speziell f&uuml;r Maxima.  Ursache ist, dass die 
gebrochene Zahl <code>1/10</code> in der internen Darstellung als bin&auml;re Zahl keine
endliche Darstellung hat.
</p>
<p>Siehe auch die Funktionen <code><a href="#float">float</a></code>
 und <code><a href="#bfloat">bfloat</a></code>
 sowie die
Auswertungsschalter <code><a href="#float">float</a></code>
 und <code><a href="#numer">numer</a></code>,
 um eine rationale Zahl
in eine Gleitkommazahl umzuwandeln.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) rationalize (0.5);
                                1
(%o1)                           -
                                2
(%i2) rationalize (0.1);
                        3602879701896397
(%o2)                   -----------------
                        36028797018963968
(%i3) fpprec : 5$
(%i4) rationalize (0.1b0);
                             209715
(%o4)                        -------
                             2097152
(%i5) fpprec : 20$
(%i6) rationalize (0.1b0);
                     236118324143482260685
(%o6)                ----------------------
                     2361183241434822606848
(%i7) rationalize (sin (0.1*x + 5.6));
               3602879701896397 x   3152519739159347
(%o7)      sin(------------------ + ----------------)
               36028797018963968    562949953421312
(%i8) float(%);
(%o8)                          sin(0.1 x + 5.6)
</pre></dd></dl>

<p><a name="ratnump"></a>
</p><dl>
<dt><u>Funktion:</u> <b>ratnump</b><i> (<var>number</var>)</i>
<a name="IDX105"></a>
</dt>
<dd><p>Gibt <code>true</code> zur&uuml;ck, wenn <var>number</var> eine ganze oder rationale Zahl ist.
In allen anderen F&auml;llen ist das Ergebnis <code>false</code>.
</p>
<p>Siehe auch die Funktionen <code><a href="#numberp">numberp</a></code>,
 <code><a href="#integerp">integerp</a></code>,

<code><a href="#floatnump">floatnump</a></code>
 und <code><a href="#bfloatp">bfloatp</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) ratnump(1/2);
(%o1)                         true
(%i2) ratnump(3);
(%o2)                         true
(%i3) ratnump(3.0);
(%o3)                         false
</pre></dd></dl>


<hr size="6">
<a name="Zeichenketten"></a>
<a name="SEC26"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC25" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC27" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.2 Zeichenketten </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC27">5.2.1 Einf&uuml;hrung in Zeichenketten</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC28">5.2.2 Funktionen und Variablen f&uuml;r Zeichenketten</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-Zeichenketten"></a>
<a name="SEC27"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC26" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC28" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC26" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.2.1 Einf&uuml;hrung in Zeichenketten </h3>

<p>Zeichenketten werden bei der Eingabe in Anf&uuml;hrungszeichen gesetzt.  Sie werden 
standardm&auml;&szlig;ig ohne Anf&uuml;hrungszeichen ausgegeben.  Hat die 
Optionsvariable <code><a href="#stringdisp">stringdisp</a></code>
 den Wert <code>true</code>, werden Zeichenketten mit
Anf&uuml;hrungszeichen dargestellt.
</p>
<p>Zeichenketten k&ouml;nnen jedes Zeichen einschlie&szlig;lich Tabulator-, 
Zeilenvorschub- oder Wagenr&uuml;cklauf-Zeichen enthalten.  Das Anf&uuml;hrungszeichen 
wird innerhalb einer Zeichenkette durch <code>\&quot;</code> und der Backslash durch 
<code>\\</code> dargestellt.  Ein Backslash am Ende einer Eingabezeile erlaubt die
Fortsetzung einer Zeichenkette in der n&auml;chsten Zeile.  Maxima kennt keine 
weiteren Kombinationen mit einem Backslash.  Daher wird der Backslash an anderer
Stelle ignoriert.  Maxima kennt keine andere M&ouml;glichkeit, als spezielle
Zeichen wie ein Tabulator-, Zeilenvorschub- oder Wagenr&uuml;cklaufzeichen in einer
Zeichenkette darzustellen.
</p>
<p>Maxima hat keinen Typ f&uuml;r ein einzelnes Zeichen.  Einzelne Zeichen werden
daher als eine Zeichenkette mit einem Zeichen dargestellt.  Folgende Funktionen
und Variablen arbeiten mit Zeichenketten:
</p>
<pre class="verbatim">   concat   sconcat   string   stringdisp
</pre>

<p>Das Zusatzpaket <code>stringproc</code> enth&auml;lt eine umfangreiche Bibliothek an 
Funktionen f&uuml;r Zeichenketten.  Siehe <a href="maxima_73.html#SEC380">stringproc</a>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) s_1 : &quot;This is a string.&quot;;
(%o1)               This is a string.
(%i2) s_2 : &quot;Embedded \&quot;double quotes\&quot; and backslash \\ characters.&quot;;
(%o2) Embedded &quot;double quotes&quot; and backslash \ characters.
(%i3) s_3 : &quot;Embedded line termination
in this string.&quot;;
(%o3) Embedded line termination
in this string.
(%i4) s_4 : &quot;Ignore the \
line termination \
characters in \
this string.&quot;;
(%o4) Ignore the line termination characters in this string.
(%i5) stringdisp : false;
(%o5)                         false
(%i6) s_1;
(%o6)                   This is a string.
(%i7) stringdisp : true;
(%o7)                         true
(%i8) s_1;
(%o8)                  &quot;This is a string.&quot;
</pre>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Zeichenketten"></a>
<a name="SEC28"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC27" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC29" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC26" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.2.2 Funktionen und Variablen f&uuml;r Zeichenketten </h3>

<p><a name="concat"></a>
</p><dl>
<dt><u>Funktion:</u> <b>concat</b><i> (<var>arg_1</var>, <var>arg_2</var>, &hellip;)</i>
<a name="IDX106"></a>
</dt>
<dd><p>Verkettet die Argumente <var>arg_1</var>, <var>arg_2</var>, &hellip; zu einer Zeichenkette 
oder einem Symbol.  Die Argumente m&uuml;ssen sich zu einem Atom auswerten lassen.
Der R&uuml;ckgabewert ist ein Symbol, wenn das erste Argument ein Symbol ist.
Ansonsten wird eine Zeichenkette zur&uuml;ckgegeben.
</p>
<p><code>concat</code> wertet die Argumente aus.  Der <a href="maxima_8.html#g_t_0027">Quote-Operator</a>
 <code>'</code>
verhindert die Auswertung.  Siehe auch die Funktion <code><a href="#sconcat">sconcat</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) y: 7$
(%i2) z: 88$
(%i3) stringdisp:true$
(%i4) concat(y, z/2);
(%o4)                         &quot;744&quot;
(%i5) concat('y, z/2);
(%o5)                          y44
</pre>
<p>Einem Symbol, das mit <code>concat</code> konstruiert wird, kann ein Wert zugewiesen
werden und es kann in Ausdr&uuml;cken auftreten.
</p>
<pre class="example">(%i6) a: concat ('y, z/2);
(%o6)                          y44
(%i7) a:: 123;
(%o7)                          123
(%i8) y44;
(%o8)                          123
(%i9) b^a;
                               y44
(%o9)                         b
(%i10) %, numer;
                                123
(%o11)                         b
</pre>
<p><code>concat(1, 2)</code> gibt eine Zeichenkette als Ergebnis zur&uuml;ck.
</p>
<pre class="example">(%i12) concat (1, 2) + 3;
(%o12)                       &quot;12&quot; + 3
</pre></dd></dl>

<p><a name="sconcat"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sconcat</b><i> (<var>arg_1</var>, <var>arg_2</var>, &hellip;)</i>
<a name="IDX107"></a>
</dt>
<dd><p>Verkettet die Argumente <var>arg_1</var>, <var>arg_2</var>, &hellip; zu einer Zeichenkette.
Im Unterschied zu der Funktion <code><a href="#concat">concat</a></code>
 m&uuml;ssen die Argumente <i>nicht</i> 
Atome sein.  Der R&uuml;ckgabewert ist eine Zeichenkette.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) sconcat (&quot;xx[&quot;, 3, &quot;]:&quot;, expand ((x+y)^3));
(%o1)               xx[3]:y^3+3*x*y^2+3*x^2*y+x^3
</pre></dd></dl>

<p><a name="string"></a>
</p><dl>
<dt><u>Funktion:</u> <b>string</b><i> (<var>expr</var>)</i>
<a name="IDX108"></a>
</dt>
<dd><p>Konvertiert das Argument <code>expr</code> in eine lineare Darstellung, wie sie auch
vom Parser von der Eingabe eingelesen wird.  Die R&uuml;ckgabe von <code>string</code>
ist eine Zeichenkette.  Diese kann nicht als Eingabe f&uuml;r eine Berechnung
genutzt werden.
</p>
<p>Beispiele:
</p>
<p>Die hier verwendete Funktion <code><a href="maxima_73.html#stringp">stringp</a></code>
 ist im Paket <code><a href="maxima_73.html#SEC380">stringproc</a></code>

definiert und wird automatisch geladen.
</p>
<pre class="example">(%i1) stringdisp:true;
(%o1)                         true
(%i2) string(expand((a+b)^2));
(%o2)                    &quot;b^2+2*a*b+a^2&quot;
(%i3) stringp(%);
(%o3)                         true
</pre></dd></dl>

<p><a name="stringdisp"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>stringdisp</b>
<a name="IDX109"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Hat <code>stringdisp</code> den Wert <code>true</code>, werden Zeichenketten mit
Anf&uuml;hrungszeichen ausgegeben.  Ansonsten werden keine Anf&uuml;hrungszeichen
ausgegeben.
</p>
<p>Wird die Definition einer Funktion ausgegeben, werden enthaltene Zeichenketten
unabh&auml;ngig vom Wert der Optionsvariablen <code>stringdisp</code> immer mit
Anf&uuml;hrungszeichen ausgegeben.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) stringdisp: false$
(%i2) &quot;This is an example string.&quot;;
(%o2)              This is an example string.
(%i3) foo () :=
      print (&quot;This is a string in a function definition.&quot;);
(%o3) foo() := 
              print(&quot;This is a string in a function definition.&quot;)
(%i4) stringdisp: true$
(%i5) &quot;This is an example string.&quot;;
(%o5)             &quot;This is an example string.&quot;
</pre></dd></dl>





<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Konstante"></a>
<a name="SEC29"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC28" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC30" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.3 Funktionen und Variablen f&uuml;r Konstante </h2>

<p><a name="g_t_0025e"></a>
</p><dl>
<dt><u>Konstante:</u> <b>%e</b>
<a name="IDX110"></a>
</dt>
<dd><p><code>%e</code> ist die Basis des nat&uuml;rlichen Logarithmus, auch Eulersche Zahl 
genannt.  Der numerische Wert der Konstanten als Gleitkommazahl mit doppelter
Genauigkeit ist 2.718281828459045d0.
</p>
<p>Die Funktion <code><a href="#bfloat">bfloat</a></code>
 kann <code>%e</code> mit einer beliebigen Genauigkeit
berechnen.
</p>
<p>Hat die Optionsvariable <code><a href="#numer">numer</a></code>
 den Wert <code>true</code>, wird <code>%e</code> durch
den numerischen Wert ersetzt, aber nicht, wenn <code>%e</code> die Basis der
Exponentiation mit einem symbolischen Exponenten ist.  Hat zus&auml;tzlich die
Optionsvariable <code><a href="maxima_10.html#g_t_0025enumer">%enumer</a></code>
 den Wert <code>true</code>, dann wird <code>%e</code> in
einem Ausdruck immer durch den numerischen Wert ersetzt.
</p>
<p>Beispiel:
</p>
<p>Berechnung von <code>%e</code> auf 48 Stellen.
</p>
<pre class="example">(%i1) fpprec: 48$
(%i2) bfloat(%e);
(%o2)  2.7182818284590452353602874713526624977572470937b0
</pre>
<p>Die Wirkung der Optionsvariablen <code>numer</code> und <code>%enumer</code> auf das 
Ersetzen von <code>%e</code> durch den numerischen Wert.
</p>
<pre class="example">(%i1) %e, numer;
(%o1)                   2.718281828459045
(%i2) %e^x, numer;
                                 x
(%o2)                          %e
(%i3) %e^x, numer, %enumer;
                                        x
(%o3)                  2.718281828459045
</pre>
<p>Im ersten Beispiel vereinfacht die Reihe zu <code>%e</code>.  F&uuml;r die Vereinfachung
der Reihe wird die Funktion <code><a href="maxima_70.html#simplify_005fsum">simplify_sum</a></code>
 geladen.  Im zweiten Beispiel
ist <code>%e</code> der Grenzwert.
</p>
<pre class="example">(%i1) load(simplify_sum)$

(%i2) sum(1/n!, n, 0, inf);
                            inf
                            ====
                            \     1
(%o2)                        &gt;    --
                            /     n!
                            ====
                            n = 0
(%i3) simplify_sum(%);

(%o3)                          %e

(%i4) limit((1+x)^(1/x), x, 0);
(%o4)                          %e
</pre></dd></dl>

<p><a name="g_t_0025i"></a>
</p><dl>
<dt><u>Konstante:</u> <b>%i</b>
<a name="IDX111"></a>
</dt>
<dd><p><code>%i</code> ist die imagin&auml;re Einheit.
</p>
<p>Maxima kennt keinen eigenen Typ f&uuml;r komplexe Zahlen.  Komplexe Zahlen werden 
von Maxima intern als die Addition von Realteil und dem mit der imagin&auml;ren 
Einheit <code><a href="#g_t_0025i">%i</a></code>
 multiplizierten Imagin&auml;rteil dargestellt.  Zum Beispiel sind
die komplexen Zahlen <code>2 + 3*%i</code> und <code>2 - 3*%i</code> die Wurzeln der 
Gleichung <code>x^2 - 4*x + 13 = 0</code>.  Siehe auch das Kapitel
<a href="#SEC20">Zahlen</a>.
</p>

<p>Beispiele:
</p>
<p>Einige Beispiele f&uuml;r das Rechnen mit der imagin&auml;ren Einheit.
</p>
<pre class="example">(%i1) sqrt(-1);
(%o1)                          %i
(%i2) %i^2;
(%o2)                          - 1
(%i3) exp(%i*%pi/2);
(%o3)                          %i
(%i4) sin(%i*x);
(%o4)                      %i sinh(x)
</pre></dd></dl>

<p><a name="false"></a>
</p><dl>
<dt><u>Konstante:</u> <b>false</b>
<a name="IDX112"></a>
</dt>
<dd><p>Repr&auml;sentiert den logischen Wert <code>falsch</code>.  <code>false</code> wird intern
von Maxima durch die Lisp-Konstante <code>NIL</code> dargestellt.
</p>
<p>Siehe auch <code><a href="#true">true</a></code>
 f&uuml;r den logischen Wert <code>wahr</code>.
</p></dd></dl>

<p><a name="g_t_0025gamma"></a>
</p><dl>
<dt><u>Konstante:</u> <b>%gamma</b>
<a name="IDX113"></a>
</dt>
<dd><p>Die Euler-Mascheroni-Konstante mit dem Wert <code>0.5772156649015329</code> als
Gleitkommazahl in doppelter Genauigkeit.
</p>
<p>Die Funktion <code><a href="#bfloat">bfloat</a></code>
 kann <code>%gamma</code> mit einer beliebigen Genauigkeit
berechnen.
</p>
<p>Hat die Optionsvariable <code><a href="#numer">numer</a></code>
 den Wert <code>true</code>, wird die Konstante
<code>%gamma</code> durch ihren numerischen Wert ersetzt.  
</p>
<p>Beispiele:
</p>
<p>Numerische Werte f&uuml;r <code>%gamma</code>.
</p>
<pre class="example">(%i1) %gamma, numer;
(%o1)                   .5772156649015329
(%i2) bfloat(%gamma), fpprec: 48;
(%o2)  5.7721566490153286060651209008240243104215933594b-1
</pre>
<p>Bestimmte Integrale, die <code>%gamma</code> als Ergebnis haben.
</p>
<pre class="example">(%i1) -integrate(exp(-t)*log(t), t, 0, inf);
(%o1)                        %gamma
(%i2) -integrate(log(log(1/t)),t, 0,1);
(%o2)                        %gamma
</pre></dd></dl>

<p><a name="ind"></a>
</p><dl>
<dt><u>Konstante:</u> <b>ind</b>
<a name="IDX114"></a>
</dt>
<dd><p><code>ind</code> repr&auml;sentiert ein unbestimmtes Ergebnis.  Siehe auch <code><a href="#und">und</a></code>

und die Funktion <code><a href="maxima_16.html#limit">limit</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) limit(sin(1/x), x, 0);
(%o1)                          ind
</pre></dd></dl>

<p><a name="inf"></a>
</p><dl>
<dt><u>Konstante:</u> <b>inf</b>
<a name="IDX115"></a>
</dt>
<dd><p><code>inf</code> repr&auml;sentiert einen positiven unendlich gro&szlig;en Wert.  Siehe
auch <code><a href="#minf">minf</a></code>
 und <code><a href="#infinity">infinity</a></code>.
</p>

<p>Die unendlichen Gr&ouml;&szlig;en, aber auch die unbestimmten Gr&ouml;&szlig;en
<code><a href="#ind">ind</a></code>
 und <code><a href="#und">und</a></code>,
 eignen sich nicht f&uuml;r das arithmetische
Rechnen.  Diese Gr&ouml;&szlig;en werden von Maxima in Rechnungen
wie Symbole behandelt, was zu fehlerhaften Ergebnissen f&uuml;hrt.  Daher sollten
unendliche Gr&ouml;&szlig;en nur im Zusammenhang mit Grenzwerten
<code><a href="maxima_16.html#limit">limit</a></code>,
 bestimmten Integralen <code><a href="maxima_16.html#integrate">integrate</a></code>
 oder Reihen
<code><a href="maxima_15.html#sum">sum</a></code>
 verwendet werden.
</p></dd></dl>

<p><a name="infinity"></a>
</p><dl>
<dt><u>Konstante:</u> <b>infinity</b>
<a name="IDX116"></a>
</dt>
<dd><p><code>infinity</code> repr&auml;sentiert einen komplexen unendlichen Wert.  Siehe
auch <code><a href="#inf">inf</a></code>
 und <code><a href="#minf">minf</a></code>.
</p>

<p>Die unendlichen Gr&ouml;&szlig;en, aber auch die unbestimmten Gr&ouml;&szlig;en 
<code><a href="#ind">ind</a></code>
 und <code><a href="#und">und</a></code>,
 eignen sich nicht f&uuml;r das arithmetische 
Rechnen.  Diese Gr&ouml;&szlig;en werden von Maxima in Rechnungen
wie Symbole behandelt, was zu fehlerhaften Ergebnissen f&uuml;hrt.  Daher sollten
unendliche Gr&ouml;&szlig;en nur im Zusammenhang mit Grenzwerten
<code><a href="maxima_16.html#limit">limit</a></code>,
 bestimmten Integralen <code><a href="maxima_16.html#integrate">integrate</a></code>
 oder Reihen
<code><a href="maxima_15.html#sum">sum</a></code>
 verwendet werden.
</p></dd></dl>

<p><a name="minf"></a>
</p><dl>
<dt><u>Konstante:</u> <b>minf</b>
<a name="IDX117"></a>
</dt>
<dd><p><code>minf</code> repr&auml;sentiert einen negativen unendlichen Wert.  Siehe
auch <code><a href="#inf">inf</a></code>
 und <code><a href="#infinity">infinity</a></code>.
</p>

<p>Die unendlichen Gr&ouml;&szlig;en, aber auch die unbestimmten Gr&ouml;&szlig;en 
<code><a href="#ind">ind</a></code>
 und <code><a href="#und">und</a></code>,
 eignen sich nicht f&uuml;r das arithmetische 
Rechnen.  Diese Gr&ouml;&szlig;en werden von Maxima in Rechnungen
wie Symbole behandelt, was zu fehlerhaften Ergebnissen f&uuml;hrt.  Daher sollten
unendliche Gr&ouml;&szlig;en nur im Zusammenhang mit Grenzwerten 
<code><a href="maxima_16.html#limit">limit</a></code>,
 bestimmten Integralen <code><a href="maxima_16.html#integrate">integrate</a></code>
 oder Reihen
<code><a href="maxima_15.html#sum">sum</a></code>
 verwendet werden.
</p></dd></dl>

<p><a name="g_t_0025phi"></a>
</p><dl>
<dt><u>Konstante:</u> <b>%phi</b>
<a name="IDX118"></a>
</dt>
<dd><p><code>%phi</code> repr&auml;sentiert die <i>Goldene Zahl</i> <em>(1 + sqrt(5))/2</em>.  Der
Wert als Gleitkommazahl in doppelter Genauigkeit ist 1.618033988749895d0.
</p>
<p>Die Funktion <code><a href="maxima_21.html#fibtophi">fibtophi</a></code>
 dr&uuml;ckt Fibonacci-Zahlen <code>fib(n)</code> durch die
Goldene Zahl <code>%phi</code> aus.  Standardm&auml;&szlig;ig kennt Maxima keine
algebraischen Eigenschaften der Konstanten <code>%phi</code>.  Mit den Eingaben
<code>tellrat(%phi^2-%phi-1)</code> und <code>algebraic: true</code> kann die Funktion
<code><a href="maxima_17.html#ratsimp">ratsimp</a></code>
 einige Vereinfachungen ausf&uuml;hren.
</p>
<p>Die Funktion <code><a href="#bfloat">bfloat</a></code>
 kann <code>%phi</code> mit einer beliebigen Genauigkeit
berechnen.  Hat die Optionsvariable <code><a href="#numer">numer</a></code>
 den Wert <code>true</code>, wird
die Konstante <code>%phi</code> durch ihren numerischen Wert ersetzt.
</p>
<p>Beispiele:
</p>
<p>Numerische Werte f&uuml;r <code>%phi</code>.
</p>
<pre class="example">(%i1) %phi, numer;
(%o1)                   1.618033988749895
(%i2) bfloat(%phi), fpprec: 48;
(%o2)  1.61803398874989484820458683436563811772030917981b0
</pre>
<p><code>fibtophi</code> dr&uuml;ckt Fibonacci-Zahlen <code>fib(n)</code> durch <code>%phi</code> aus.
</p>
<pre class="example">(%i1) fibtophi (fib (n));
                           n             n
                       %phi  - (1 - %phi)
(%o1)                  -------------------
                           2 %phi - 1
(%i2) fib (n-1) + fib (n) - fib (n+1);
(%o2)          - fib(n + 1) + fib(n) + fib(n - 1)
(%i3) fibtophi (%);
            n + 1             n + 1       n             n
        %phi      - (1 - %phi)        %phi  - (1 - %phi)
(%o3) - --------------------------- + -------------------
                2 %phi - 1                2 %phi - 1
                                          n - 1             n - 1
                                      %phi      - (1 - %phi)
                                    + ---------------------------
                                              2 %phi - 1
(%i4) ratsimp (%);
(%o4)                           0
</pre>
<p>Mit den Eingaben <code>tellrat(%phi^2-%phi-1)</code> und <code>algebraic:true</code> kann 
die Funktion <code>ratsimp</code> einige Vereinfachungen f&uuml;r Ausdr&uuml;cke 
ausf&uuml;hren, die <code>%phi</code> enthalten.
</p>
<pre class="example">(%i1) e : expand ((%phi^2 - %phi - 1) * (A + 1));
                 2                      2
(%o1)        %phi  A - %phi A - A + %phi  - %phi - 1
(%i2) ratsimp (e);
                  2                     2
(%o2)        (%phi  - %phi - 1) A + %phi  - %phi - 1
(%i3) tellrat (%phi^2 - %phi - 1);
                            2
(%o3)                  [%phi  - %phi - 1]
(%i4) algebraic : true;
(%o4)                         true
(%i5) ratsimp (e);
(%o5)                           0
</pre></dd></dl>

<p><a name="g_t_0025pi"></a>
</p><dl>
<dt><u>Konstante:</u> <b>%pi</b>
<a name="IDX119"></a>
</dt>
<dd><p><code>%pi</code> repr&auml;sentiert die Kreiszahl.  Der numerische Wert als 
Gleitkommazahl in doppelter Genauigkeit ist <code>3.141592653589793d0</code>.
</p>
<p>Die Funktion <code><a href="#bfloat">bfloat</a></code>
 kann <code>%pi</code> mit einer beliebigen Genauigkeit
berechnen.  Hat die Optionsvariable <code><a href="#numer">numer</a></code>
 den Wert <code>true</code>, wird die
Konstante <code>%pi</code> durch ihren numerischen Wert ersetzt.
</p>
<p>Beispiele:
</p>
<p>Numerische Werte f&uuml;r <code>%pi</code>.
</p>
<pre class="example">(%i1) %pi, numer;
(%o1)                   3.141592653589793
(%i2) bfloat(%pi), fpprec:48;
(%o2)  3.14159265358979323846264338327950288419716939938b0
</pre>
<p>Grenzwert und bestimmte Integrale, die <code>%pi</code> als Ergebnis haben.
</p>
<pre class="example">(%i1) 'limit(n!^2*(n+1)^(2*n^2+n)/(2*n^(2*n^2+3*n+1)),n,inf);
                        2                     2
                   - 2 n  - 3 n - 1        2 n  + n   2
         limit    n                 (n + 1)         n!
         n -&gt; inf
(%o1)    ----------------------------------------------
                               2
(%i2) %, nouns;
(%o2)                          %pi
(%i3) 'integrate(4*sqrt(1-t^2),t,0,1);
                         1
                        /
                        [            2
(%o3)                 4 I  sqrt(1 - t ) dt
                        ]
                        /
                         0
(%i4) %, nouns;
(%o4)                          %pi
(%i5) 'integrate(2*exp(-t^2),t,0,inf);
                           inf
                          /         2
                          [      - t
(%o5)                   2 I    %e     dt
                          ]
                          /
                           0
(%i6) %, nouns;
(%o6)                       sqrt(%pi)
</pre></dd></dl>

<p><a name="true"></a>
</p><dl>
<dt><u>Konstante:</u> <b>true</b>
<a name="IDX120"></a>
</dt>
<dd><p><code>true</code> repr&auml;sentiert den logischen Wert <code>wahr</code>.  Intern ist 
<code>true</code> als die Lisp-Konstante <code>T</code> implementiert.
</p>
<p>Siehe auch <code><a href="#false">false</a></code>
 f&uuml;r den logischen Wert <code>falsch</code>.
</p></dd></dl>

<p><a name="und"></a>
</p><dl>
<dt><u>Konstante:</u> <b>und</b>
<a name="IDX121"></a>
</dt>
<dd><p><code>und</code> repr&auml;sentiert ein nicht definiertes Ergebnis.  Siehe auch 
<code><a href="#ind">ind</a></code>
 und die Funktion <code><a href="maxima_16.html#limit">limit</a></code>.
</p>

<p>Beispiel:
</p>
<pre class="example">(%i1) limit (x*sin(x), x, inf);
(%o1)                          und
</pre></dd></dl>

<p><a name="zeroa"></a>
</p><dl>
<dt><u>Konstante:</u> <b>zeroa</b>
<a name="IDX122"></a>
</dt>
<dd><p><code>zeroa</code> repr&auml;sentiert eine positive unendlich kleine Zahl.  <code>zeroa</code>
kann in Ausdr&uuml;cken benutzt werden.  Die Funktion <code>limit</code> vereinfacht
Ausdr&uuml;cke, die infinitesimale Gr&ouml;&szlig;en enthalten.
</p>
<p>Siehe auch <code><a href="#zerob">zerob</a></code>
 und <code><a href="maxima_16.html#limit">limit</a></code>.
</p>

<p>Beispiele:
</p>
<p><code>limit</code> vereinfacht Ausdr&uuml;cke, die infinitesimale Gr&ouml;&szlig;en enthalten.
</p>
<pre class="example">(%i1) limit(zeroa);
(%o1)                           0
(%i2) limit(x+zeroa);
(%o2)                           x
</pre></dd></dl>

<p><a name="zerob"></a>
</p><dl>
<dt><u>Konstante:</u> <b>zerob</b>
<a name="IDX123"></a>
</dt>
<dd><p><code>zerob</code> repr&auml;sentiert eine negative unendlich kleine Zahl.  <code>zerob</code>
kann in Ausdr&uuml;cken benutzt werden.  Die Funktion <code>limit</code> vereinfacht
Ausdr&uuml;cke, die infinitesimale Gr&ouml;&szlig;en enthalten.
</p>
<p>Siehe auch <code><a href="#zeroa">zeroa</a></code>
 und <code><a href="maxima_16.html#limit">limit</a></code>.
</p>
</dd></dl>





<hr size="6">
<a name="Listen"></a>
<a name="SEC30"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC29" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC31" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.4 Listen </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC31">5.4.1 Einf&uuml;hrung in Listen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC32">5.4.2 Funktionen und Variablen f&uuml;r Listen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-Listen"></a>
<a name="SEC31"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC30" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC32" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC30" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.4.1 Einf&uuml;hrung in Listen </h3>

<p>Listen werden in Maxima mit eckigen Klammern eingegeben und angezeigt:
</p>
<pre class="example">[a, b, c, ...]
</pre>
<p>Die Elemente einer Liste k&ouml;nnen Zahlen, Symbole, Ausdr&uuml;cke und auch Listen
sein, wodurch verschachtelte Listen entstehen:
</p>
<pre class="example">(%i1) [1, 1/2, a, a+b, sin(x), [log(y)^2, y]];
                 1                        2
(%o1)        [1, -, a, b + a, sin(x), [log (y), y]]
                 2
</pre>
<p>Mit den Funktionen <code><a href="#makelist">makelist</a></code>
 und <code><a href="#create_005flist">create_list</a></code>
 k&ouml;nnen Listen aus
Ausdr&uuml;cken generiert werden.  Die Funktion <code><a href="#copylist">copylist</a></code>
 erzeugt eine Kopie
einer Liste.  Auf einzelne Elemente oder Teile von Listen kann mit den
Funktionen <code><a href="#first">first</a></code>,
 <code><a href="#rest">rest</a></code>
 oder <code><a href="#last">last</a></code>
 zugegriffen werden.
Mit der Aussagefunktion <code><a href="#listp">listp</a></code>
 kann getestet werden, ob eine Liste
vorliegt.  F&uuml;r das Arbeiten mit Listen kennt Maxima die folgenden Funktionen:
</p>
<pre class="verbatim">   append        assoc     cons      copylist
   create_list   delete    eighth    endcons
   fifth         first     fourth    join
   last          length    listp     makelist
   member        ninth     pop       push
   rest          reverse   second    seventh
   sixth         sort      sublist   sublist_indices
   tenth         third
</pre>
<p>Da Maxima intern alle Ausdr&uuml;cke als Listen darstellt, k&ouml;nnen viele der oben
aufgef&uuml;hrten Funktionen nicht nur auf Maxima-Listen, sondern auch auf
allgemeine Ausdr&uuml;cke angewendet werden.  So wird zum Beispiel die Addition der
drei Symbole <code>a</code>, <code>b</code>, <code>c</code> von Maxima intern folgenderma&szlig;en
als eine Lisp-Liste dargestellt:
</p>
<pre class="example">   ((MPLUS) $A $B $C)
</pre>
<p>Der Operator der Addition ist <code>MPLUS</code> und die Symbole <code>$A</code>, <code>$B</code>
und <code>$C</code> sind die Argumente des Operators.  Alle Funktionen f&uuml;r Listen,
die nur auf die Argumente wirken, k&ouml;nnen auch auf allgemeine Ausdr&uuml;cke
angewendet werden.  Im folgenden werden zum Beispiel die Funktionen
<code><a href="#first">first</a></code>,
 <code><a href="#last">last</a></code>,
 <code><a href="#cons">cons</a></code>
 und <code><a href="#delete">delete</a></code>
 auf eine
Addition angewendet:
</p>
<pre class="example">(%i1) expr: a + b + c;
(%o1)                       c + b + a
(%i2) first(expr);
(%o2)                           c
(%i3) last(expr);
(%o3)                           a
(%i4) cons(2*x, expr);
(%o4)                    2 x + c + b + a
(%i5) delete(b, expr);
(%o5)                         c + a
</pre>
<p>Weitere Beispiele f&uuml;r die Anwendung der Funktionen f&uuml;r Listen auf allgemeine
Ausdr&uuml;cke sind bei den einzelnen Funktionen angegeben.  Eine ausf&uuml;hrliche
Beschreibung der internen Darstellung von Maxima-Ausdr&uuml;cken ist in
<a href="maxima_6.html#SEC39">Ausdr&uuml;cke</a> enthalten.
</p>
<p>Auf die einzelnen Elemente einer Liste kann direkt &uuml;ber einen Index
zugegriffen werden.  Bezeichnet der Index kein Element der Liste, gibt Maxima
eine Fehlermeldung aus.  Im Folgenden werden Beispiele gezeigt:
</p>
<pre class="example">(%i1) list : [a,b,c];
(%o1)                       [a, b, c]
(%i2) list[1];
(%o2)                           a
(%i3) list[2];
(%o3)                           b
(%i4) list[3];
(%o4)                           c
(%i5) list[1]: sin(x);
(%o5)                        sin(x)
(%i6) list[2]: cos(x);
(%o6)                        cos(x)
(%i7) list[3]: tan(x);
(%o7)                        tan(x)
(%i8) list;
(%o8)               [sin(x), cos(x), tan(x)]
</pre>
<p>Listen k&ouml;nnen auch als Argument einer Funktion auftreten.  Hat die Funktion
die Eigenschaft <code><a href="maxima_9.html#distribute_005fover">distribute_over</a></code>,
 dann wird die Funktion auf die
Elemente der Liste angewendet.  Dies funktioniert auch f&uuml;r Funktionen mit
mehreren Argumenten.
</p>
<pre class="example">(%i1) sin([x,y,z]);
(%o1)               [sin(x), sin(y), sin(z)]
(%i2) mod([x,y],3);
(%o2)                [mod(x, 3), mod(y, 3)]
(%i3) mod([x,y],[5,7]);
(%o3)   [[mod(x, 5), mod(x, 7)], [mod(y, 5), mod(y, 7)]]
</pre>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Listen"></a>
<a name="SEC32"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC31" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC33" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC30" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.4.2 Funktionen und Variablen f&uuml;r Listen </h3>

<p><a name="g_t_005b"></a>
<a name="g_t_005d"></a>
</p><dl>
<dt><u>Operator:</u> <b>[</b>
<a name="IDX124"></a>
</dt>
<dt><u>Operator:</u> <b>]</b>
<a name="IDX125"></a>
</dt>
<dd><p>Die Operatoren <code>[</code> und <code>]</code> markieren den Anfang und das Ende einer
Liste.
</p>
<p><code>[</code> und <code>]</code> schlie&szlig;en auch die Indizes von Symbolen, Arrays, 
Hash-Arrays oder Array-Funktionen ein.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) x: [a, b, c];
(%o1)                       [a, b, c]
(%i2) x[3];
(%o2)                           c
(%i3) array (y, fixnum, 3);
(%o3)                           y
(%i4) y[2]: %pi;
(%o4)                          %pi
(%i5) y[2];
(%o5)                          %pi
(%i6) z['foo]: 'bar;
(%o6)                          bar
(%i7) z['foo];
(%o7)                          bar
(%i8) g[k] := 1/(k^2+1);
                                  1
(%o8)                     g  := ------
                           k     2
                                k  + 1
(%i9) g[10];
                                1
(%o9)                          ---
                               101
</pre></dd></dl>

<p><a name="append"></a>
</p><dl>
<dt><u>Funktion:</u> <b>append</b><i> (<var>list_1</var>, &hellip;, <var>list_n</var>)</i>
<a name="IDX126"></a>
</dt>
<dd><p>Gibt eine Liste mit den Elementen der Listen <var>list_1</var>, &hellip;, <var>list_n</var>
zur&uuml;ck.  Ist eines der Argumente <var>list_1</var>, &hellip;, <var>list_n</var> keine
Liste meldet Maxima einen Fehler.
</p>
<p><code>append</code> kann auch f&uuml;r allgemeine Ausdr&uuml;cke genutzt werden.
So hat zum Beispiel <code>append(f(a,b), f(c,d,e))</code> das Ergebnis
<code>f(a,b,c,d,e)</code>.  In diesem Fall muss der Operator, der hier <code>f</code> ist,
f&uuml;r beide Ausdr&uuml;cke identisch sein, ansonsten meldet Maxima einen Fehler.
</p>
<p>Siehe auch die Funktionen <code><a href="#cons">cons</a></code>
 und <code><a href="#endcons">endcons</a></code>,
 um ein Element
einer Liste hinzuzuf&uuml;gen.
</p>
<p>Beispiele:
</p>
<p>In den ersten Beispielen werden jeweils Listen mit verschiedenen Elementen
zusammengef&uuml;gt.  Im letzten Beispiel wird <code>append</code> genutzt, um zwei
Additionen zusammenzusetzen.
</p>
<pre class="example">(%i1) append([a,b], [x,y,z], [1]);
(%o1)                  [a, b, x, y, z, 1]
(%i2) append([x+y, 0, -3.2], [2.5e+20, x]);
(%o2)             [y + x, 0, - 3.2, 2.5e+20, x]
(%i3) append([2*a+b], [x+y]);
(%o3)                   [b + 2 a, y + x]
(%i4) append(2*a+b, x+y);
(%o4)                    y + x + b + 2 a
</pre></dd></dl>

<p><a name="assoc"></a>
</p><dl>
<dt><u>Funktion:</u> <b>assoc</b><i> (<var>key</var>, <var>list</var>, <var>default</var>)</i>
<a name="IDX127"></a>
</dt>
<dt><u>Funktion:</u> <b>assoc</b><i> (<var>key</var>, <var>list</var>)</i>
<a name="IDX128"></a>
</dt>
<dd><p>Ist das Argument <code>list</code> eine Liste mit paarweisen Elementen der Form
<code>[[key_1, value_1], [key_2, value_2], ...]</code>, wobei <var>key_i</var> ein
Schl&uuml;ssel und <var>value_i</var> der dazugeh&ouml;rige Wert ist, dann gibt die
Funktion <code>assoc</code> den zum Schl&uuml;ssel <var>key</var> geh&ouml;renden Wert
<code>value</code> zur&uuml;ck.  Wird der Schl&uuml;ssel nicht gefunden, wird das Argument
<code>default</code> zur&uuml;ckgegeben, wenn es vorhanden ist, oder der Wert
<code>false</code>.
</p>
<p>Anstatt Paare <code>[key_i, value_i]</code> k&ouml;nnen auch allgemeine Ausdr&uuml;cke in 
der Liste enthalten sein, die zwei Argumente haben.  Zum Beispiel sind 
Eintr&auml;ge der Form <code>x=1</code> oder <code>a^b</code> m&ouml;glich.  Im ersten Fall ist 
<code>x</code> der Schl&uuml;ssel und im zweiten Fall <code>a</code>.  Die Werte sind jeweils 
<code>1</code> und <code>b</code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) l : [[info, 10], [warn, 20], [err, 30]];
(%o1)          [[info, 10], [warn, 20], [err, 30]]
(%i2) assoc(info, l);
(%o2)                          10
(%i3) assoc(warn, l);
(%o3)                          20
(%i4) assoc(err, l);
(%o4)                          30
(%i5) l : [x+y, a^(2*b), sin(x) = 0.5];
                            2 b
(%o5)              [y + x, a   , sin(x) = 0.5]
(%i6) assoc(x, l);
(%o6)                           y
(%i7) assoc(y, l);
(%o7)                         false
(%i8) assoc(a, l);
(%o8)                          2 b
(%i9) assoc(sin(x), l);
(%o9)                          0.5
</pre></dd></dl>

<p><a name="cons"></a>
</p><dl>
<dt><u>Funktion:</u> <b>cons</b><i> (<var>expr</var>, <var>list</var>)</i>
<a name="IDX129"></a>
</dt>
<dd><p>F&uuml;gt den Ausdruck <var>expr</var> als erstes Element der Liste <var>list</var> hinzu.
</p>
<p><code>cons</code> arbeitet auch mit allgemeinen Ausdr&uuml;cken als Argument <var>list</var>.
In diesem Fall wird dem Hauptoperator des Arguments <var>list</var> der Ausdruck
<var>expr</var> als erstes Argument hinzugef&uuml;gt.
</p>
<p>Siehe auch die Funktion <code><a href="#endcons">endcons</a></code>,
 um ein Element an das Ende einer
Liste anzuh&auml;ngen sowie die Funktion <code><a href="#append">append</a></code>,
 um zwei Listen
zusammenzuf&uuml;gen.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) cons(x, [a, b, c]);
(%o1)                     [x, a, b, c]
(%i2) cons(x^2+1, [a, b, c]);
                          2
(%o2)                   [x  + 1, a, b, c]
(%i3) cons(x^2+1, a+b+c);
                        2
(%o3)                  x  + c + b + a + 1
(%i4) cons(x^2+1, f(a,b,c));
                          2
(%o4)                  f(x  + 1, a, b, c)
</pre></dd></dl>

<p><a name="copylist"></a>
</p><dl>
<dt><u>Funktion:</u> <b>copylist</b><i> (<var>list</var>)</i>
<a name="IDX130"></a>
</dt>
<dd><p>Gibt eine Kopie der Liste <var>list</var> zur&uuml;ck.
</p>
<p>Im Unterschied zur Funktion <code>copylist</code> wird mit dem Zuweisungsoperator
<code><a href="maxima_7.html#g_t_003a">:</a></code>
 keine Kopie, sondern eine Referenz auf das Original zugewiesen.  Das
folgende Beispiel zeigt den Unterschied f&uuml;r den Fall, dass das Original
modifiziert wird.
</p>
<pre class="example">(%i1) list : [x,y,z];
(%o1)                       [x, y, z]
(%i2) a: list;
(%o2)                       [x, y, z]
(%i3) b: copylist(list);
(%o3)                       [x, y, z]
(%i4) list[2]:99;
(%o4)                          99
(%i5) list;
(%o5)                      [x, 99, z]
(%i6) a;
(%o6)                      [x, 99, z]
(%i7) b;
(%o7)                       [x, y, z]
</pre></dd></dl>

<p><a name="create_005flist"></a>
</p><dl>
<dt><u>Funktion:</u> <b>create_list</b><i> (<var>expr</var>, <var>x_1</var>, <var>list_1</var>, &hellip;, <var>x_n</var>, <var>list_n</var>)</i>
<a name="IDX131"></a>
</dt>
<dd><p>Erzeugt eine Liste, indem der Ausdruck <var>expr</var> zun&auml;chst f&uuml;r die Variable
<var>x_1</var> ausgewertet wird.  Der Variablen <var>x_1</var> werden f&uuml;r die Auswertung 
nacheinander die Werte der Liste <var>list_1</var> zugewiesen.  Dann wird der
Ausdruck <var>expr</var> f&uuml;r die Variable <var>x_2</var> mit den Werten der Liste
<var>list_2</var> ausgewertet u.s.w.  Die Anzahl der Elemente der Ergebnisliste ist
das Produkt der Anzahl der Elemente der einzelnen Listen <var>list_i</var>.  Die
Variablen <var>x_i</var> m&uuml;ssen Symbole sein, die nicht ausgewertet werden.  Die 
Elemente der Listen <var>list_i</var> werden vor der Iteration ausgewertet.
</p>
<p>Anstatt einer Liste <var>list_i</var> mit den Elementen f&uuml;r die Iteration kann auch
eine untere und obere Grenze angegeben werden.  Die Grenzen k&ouml;nnen ganze
Zahlen oder Gleitkommazahlen sowie Ausdr&uuml;cke sein, die zu einer Zahl
auswerten.  Die Schrittweite ist immer 1.  Siehe auch das Beispiel weiter unten.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) create_list(x^i, i, [1, 3, 7]);
                 3   7
(%o1)       [x, x , x ]
</pre>
<p>In diesem Beispiel wird f&uuml;r zwei Listen iteriert.
</p>
<pre class="example">(%i1) create_list([i, j], i, [a, b], j, [e, f, h]);
(%o1) [[a, e], [a, f], [a, h], [b, e], [b, f], [b, h]]
</pre>
<p>Anstatt einer Liste <var>list_i</var> k&ouml;nnen auch zwei Argumente &uuml;bergeben 
werden, die jedes zu einer Nummer auswerten.  Diese Werte sind die untere und
die obere Grenze f&uuml;r die Iteration.
</p>
<pre class="example">(%i1) create_list([i,j],i,[1,2,3],j,1,i);
(%o1) [[1, 1], [2, 1], [2, 2], [3, 1], [3, 2], [3, 3]]
</pre></dd></dl>

<p><a name="delete"></a>
</p><dl>
<dt><u>Funktion:</u> <b>delete</b><i> (<var>expr</var>, <var>list</var>)</i>
<a name="IDX132"></a>
</dt>
<dt><u>Funktion:</u> <b>delete</b><i> (<var>expr</var>, <var>list</var>, <var>n</var>)</i>
<a name="IDX133"></a>
</dt>
<dd><p><code>delete(<var>expr</var>, <var>list</var>)</code> entfernt aus der Liste <var>list</var> die
Elemente, die gleich dem Ausdruck <var>expr</var> sind.  Mit dem Argument <var>n</var>
kann die Anzahl der Elemente spezifiziert werden, die aus der Liste entfernt
werden sollen.  <code>delete</code> gibt eine neue Liste zur&uuml;ck.  Das Argument
<var>list</var> wird nicht modifiziert.
</p>
<p>Die Gleichheit wird mit dem Operator <code><a href="maxima_7.html#g_t_003d">=</a></code>
 gepr&uuml;ft.  Daher werden nur
Ausdr&uuml;cke als gleich erkannt, die syntaktisch &uuml;bereinstimmen.  &Auml;quivalente
Ausdr&uuml;cke, die syntaktisch voneinander verschieden sind, werden nicht aus der
Liste entfernt.  Zum Beispiel sind die Ausdr&uuml;cke <code>x^2-1</code> und
<code>(x+1)*(x-1)</code> &auml;quivalent, aber syntaktisch verschieden.
</p>
<p>Das zweite Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.  In 
diesem Fall werden die Argumente des Hauptoperators als die Elemente einer Liste
angenommen.
</p>
<p>Beispiele:
</p>
<p>Entferne Elemente einer Liste.
</p>
<pre class="example">(%i1) delete (y, [w, x, y, z, z, y, x, w]);
(%o1)                  [w, x, z, z, x, w]
</pre>
<p>Entferne Terme einer Summe.
</p>
<pre class="example">(%i1) delete (sin(x), x + sin(x) + y);
(%o1)                         y + x
</pre>
<p>Entferne Faktoren eines Produkts.
</p>
<pre class="example">(%i1) delete (u - x, (u - w)*(u - x)*(u - y)*(u - z));
(%o1)                (u - w) (u - y) (u - z)
</pre>
<p>Entferne Argumente einer Funktion.
</p>
<pre class="example">(%i1) delete (a, f(a, b, c, d, a));
(%o1)                     f(b, c, d)
</pre>
<p>Das Element <code>a</code> tritt mehrfach auf.  Es werden zwei Elemente entfernt.
</p>
<pre class="example">(%i1) delete (a, f(a, b, a, c, d, a), 2);
(%o1)                    f(b, c, d, a)
</pre>
<p>Die Gleichheit wird mit dem Operator <code>=</code> gepr&uuml;ft.
</p>
<pre class="example">(%i1) [is(equal (0, 0)), is(equal (0, 0.0)), is(equal (0, 0b0))];

`rat' replaced 0.0 by 0/1 = 0.0
`rat' replaced 0.0B0 by 0/1 = 0.0B0
(%o1)                  [true, true, true]
(%i2) [is (0 = 0), is (0 = 0.0), is (0 = 0b0)];
(%o2)                 [true, false, false]
(%i3) delete (0, [0, 0.0, 0b0]);
(%o3)                     [0.0, 0.0b0]
(%i4) is (equal ((x + y)*(x - y), x^2 - y^2));
(%o4)                         true
(%i5) is ((x + y)*(x - y) = x^2 - y^2);
(%o5)                         false
(%i6) delete ((x + y)*(x - y), [(x + y)*(x - y), x^2 - y^2]);
                              2    2
(%o6)                       [x  - y ]
</pre></dd></dl>

<p><a name="endcons"></a>
</p><dl>
<dt><u>Funktion:</u> <b>endcons</b><i> (<var>expr</var>, <var>list</var>)</i>
<a name="IDX134"></a>
</dt>
<dd><p>F&uuml;gt den Ausdruck <var>expr</var> als letztes Element der Liste <var>list</var> hinzu.
</p>
<p><code>endcons</code> arbeitet auch mit allgemeinen Ausdr&uuml;cken als Argument
<var>list</var>.  In diesem Fall wird dem Hauptoperator des Arguments <var>list</var> der
Ausdruck <var>expr</var> als letztes Argument hinzugef&uuml;gt.
</p>
<p>Siehe auch die Funktion <code><a href="#cons">cons</a></code>,
 um ein Element am Anfang einer
Liste einzuf&uuml;gen sowie die Funktion <code><a href="#append">append</a></code>,
 um zwei Listen
zusammenzuf&uuml;gen.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) endcons(x, [a, b, c]);
(%o1)                     [a, b, c, x]
(%i2) endcons(x^2+1, [a, b, c]);
                                   2
(%o2)                   [a, b, c, x  + 1]
(%i3) endcons(x^2+1, a+b+c);
                        2
(%o3)                  x  + c + b + a + 1
(%i4) endcons(x^2+1, f(a,b,c));
                                   2
(%o4)                  f(a, b, c, x  + 1)
</pre></dd></dl>

<p><a name="first"></a>
</p><dl>
<dt><u>Funktion:</u> <b>first</b><i> (<var>list</var>)</i>
<a name="IDX135"></a>
</dt>
<dd><p>Gibt das erste Element der Liste <var>list</var> zur&uuml;ck.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck wie zum Beispiel
der Term einer Summe, der Faktor eines Produktes oder die erste Spalte einer
Matrix sein.  Die Funktion <code>first</code> und verwandte Funktionen wie
<code><a href="#last">last</a></code>
 oder <code><a href="#rest">rest</a></code>
 arbeiten mit der externen Darstellung eines
Ausdrucks, wie sie in der Anzeige erscheint.  Dies kann mit der Optionsvariablen
<code><a href="maxima_6.html#inflag">inflag</a></code>
 kontrolliert werden.  Hat die Optionsvariable <code>inflag</code> den
Wert <code>true</code>, wird von diesen Funktionen die interne Darstellung betrachtet.
</p>
<p>Die Funktionen <code><a href="#second">second</a></code>
 bis <code><a href="#tenth">tenth</a></code>
 geben jeweils das 2. bis 10. 
Element zur&uuml;ck.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) l: [a,b,c];
(%o1)                       [a, b, c]
(%i2) first(l);
(%o2)                           a
(%i3) first(x + y);
(%o3)                           y
(%i4) first(x * y);
(%o4)                           x
(%i5) first(f(x, y, z));
(%o5)                           x
</pre></dd></dl>

<p><a name="join"></a>
</p><dl>
<dt><u>Funktion:</u> <b>join</b><i> (<var>list_1</var>, <var>list_2</var>)</i>
<a name="IDX136"></a>
</dt>
<dd><p>Erzeugt eine neue Liste aus den Elementen der Listen <var>list_1</var> und
<var>list_2</var>, wobei die Elemente abwechselnd &uuml;bernommen werden.  Das Ergebnis
hat die Form <code>[<var>list_1</var>[1], <var>list_2</var>[1], <var>list_1</var>[2],
<var>list_2</var>[2], ...]</code>.
</p>
<p>Haben die Listen verschiedene L&auml;ngen, werden die zus&auml;tzlichen Elemente der
l&auml;ngeren Liste ignoriert.
</p>
<p>Sind <var>list_1</var> oder <var>list_2</var> keine Listen, gibt Maxima einen Fehler aus.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) L1: [a, sin(b), c!, d - 1];
(%o1)                [a, sin(b), c!, d - 1]
(%i2) join (L1, [1, 2, 3, 4]);
(%o2)          [a, 1, sin(b), 2, c!, 3, d - 1, 4]
(%i3) join (L1, [aa, bb, cc, dd, ee, ff]);
(%o3)        [a, aa, sin(b), bb, c!, cc, d - 1, dd]
</pre></dd></dl>

<p><a name="last"></a>
</p><dl>
<dt><u>Funktion:</u> <b>last</b><i> (<var>list</var>)</i>
<a name="IDX137"></a>
</dt>
<dd><p>Gibt das letzte Element der Liste <var>list</var> zur&uuml;ck.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.  Siehe
<code><a href="#first">first</a></code>
 f&uuml;r weitere Erl&auml;uterungen.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) l: [a,b,c];
(%o1)                       [a, b, c]
(%i2) last(x + y);
(%o2)                           x
(%i3) last(x * y);
(%o3)                           y
(%i4) last(f(x, y, z));
(%o4)                           z
</pre></dd></dl>

<p><a name="length"></a>
</p><dl>
<dt><u>Funktion:</u> <b>length</b><i> (<var>list</var>)</i>
<a name="IDX138"></a>
</dt>
<dd><p>Gibt die Anzahl der Elemente der Liste <var>list</var> zur&uuml;ck.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.  Wie bei
anderen Funktionen f&uuml;r Listen wird auch von der Funktion <code>length</code> die
externe Darstellung eines Ausdrucks betrachtet, wie sie f&uuml;r die Ausgabe
vorliegt.  Die Optionsvariable <code><a href="maxima_6.html#inflag">inflag</a></code>
 hat daher Einfluss auf das Ergebnis
der Funktion <code>length</code>.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) length([a, x^2, sin(x), y+3]);
(%o1)                           4
(%i2) length(a/(b*x));
(%o2)                           2
(%i3) length(a/(b*x)),inflag:true;
(%o3)                           3
</pre></dd></dl>


<p><a name="listarith"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>listarith</b>
<a name="IDX139"></a>
</dt>
<dd><p>Standardwert: <code>true</code>
</p>
<p>Hat die Optionsvariable <code>listarith</code> den Wert <code>true</code>, werden 
Rechenoperationen mit Matrizen und Listen elementweise ausgef&uuml;hrt.  Das 
Ergebnis von Rechnungen mit Listen und Matrizen sind wieder Listen und Matrizen.
Hat die Optionsvariable <code>listarith</code> den Wert <code>false</code>, wird die
elementweise Ausf&uuml;hrung der Rechenoperationen unterdr&uuml;ckt.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) listarith: true;
(%o1)                         true
(%i2) 2 + [a, b, c];
(%o2)                 [a + 2, b + 2, c + 2]
(%i3) 2^[a, b, c];
                            a   b   c
(%o3)                     [2 , 2 , 2 ]
(%i4) [1, 2, 3] + [a, b, c];
(%o4)                 [a + 1, b + 2, c + 3]
(%i5) listarith: false;
(%o5)                         false
(%i6) 2 + [a, b, c];
(%o6)                     [a, b, c] + 2
(%i7) 2^[a, b, c];
                            [a, b, c]
(%o7)                      2
(%i8) [1, 2, 3] + [a, b, c];
(%o8)                 [a, b, c] + [1, 2, 3]
</pre></dd></dl>

<p><a name="listp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>listp</b><i> (<var>expr</var>)</i>
<a name="IDX140"></a>
</dt>
<dd><p>Gibt <code>true</code> zur&uuml;ck, wenn <var>expr</var> eine Liste ist.  Ansonsten ist der 
R&uuml;ckgabewert <code>false</code>.
</p></dd></dl>

<p><a name="makelist"></a>
</p><dl>
<dt><u>Funktion:</u> <b>makelist</b><i> (<var>expr</var>, <var>i</var>, <var>i_0</var>, <var>i_1</var>)</i>
<a name="IDX141"></a>
</dt>
<dt><u>Funktion:</u> <b>makelist</b><i> (<var>expr</var>, <var>x</var>, <var>list</var>)</i>
<a name="IDX142"></a>
</dt>
<dd><p>Erzeugt eine Liste, indem der Ausdruck <var>expr</var> f&uuml;r die Variable <var>i</var>
ausgewertet wird.  Die Variable <var>i</var> nimmt nacheinander die Werte von
<var>i_0</var> bis <var>i_1</var> an, wobei die Schrittweite 1 ist.  Alternativ kann eine
Liste <var>list</var> als Argument &uuml;bergeben werden.  In diesem Fall nimmt die
Variable <var>i</var> nacheinander die Werte der Liste <var>list</var> an.
</p>
<p>Siehe auch die Funktion <code><a href="#create_005flist">create_list</a></code>,
 um eine Liste zu generieren.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) makelist(concat(x, i), i, 1, 6);
(%o1)               [x1, x2, x3, x4, x5, x6]
(%i2) makelist(x = y, y, [a, b, c]);
(%o2)                 [x = a, x = b, x = c]
</pre></dd></dl>

<p><a name="member"></a>
</p><dl>
<dt><u>Funktion:</u> <b>member</b><i> (<var>expr</var>, <var>list</var>)</i>
<a name="IDX143"></a>
</dt>
<dd><p>Gibt <code>true</code> zur&uuml;ck, wenn der Ausdruck <var>expr</var> gleich einem Element in
der Liste <var>list</var> ist.  Die Gleichheit wird dem Operator
<code><a href="maxima_7.html#g_t_003d">=</a></code>
 festgestellt.
</p>
<p>Die Gleichheit wird mit dem Operator <code><a href="maxima_7.html#g_t_003d">=</a></code>
 gepr&uuml;ft.  Daher werden nur
Ausdr&uuml;cke als gleich erkannt, die syntaktisch &uuml;bereinstimmen.  &Auml;quivalente
Ausdr&uuml;cke, die syntaktisch voneinander verschieden sind, werden nicht aus der
Liste entfernt.  Zum Beispiel sind die Ausdr&uuml;cke <code>x^2-1</code> und
<code>(x+1)*(x-1)</code> &auml;quivalent, aber syntaktisch verschieden.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.  Dabei werden
die Argumente des Hauptoperators betrachtet.
</p>
<p>Siehe auch die Funktion <code><a href="maxima_14.html#elementp">elementp</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) member (8, [8, 8.0, 8b0]);
(%o1)                         true
(%i2) member (8, [8.0, 8b0]);
(%o2)                         false
(%i3) member (b, [a, b, c]);
(%o3)                         true
(%i4) member (b, [[a, b], [b, c]]);
(%o4)                         false
(%i5) member ([b, c], [[a, b], [b, c]]);
(%o5)                         true
(%i6) F (1, 1/2, 1/4, 1/8);
                               1  1  1
(%o6)                     F(1, -, -, -)
                               2  4  8
(%i7) member (1/8, %);
(%o7)                         true
(%i8) member (&quot;ab&quot;, [&quot;aa&quot;, &quot;ab&quot;, sin(1), a + b]);
(%o8)                         true
</pre></dd></dl>

<p><a name="pop"></a>
</p><dl>
<dt><u>Funktion:</u> <b>pop</b><i> (<var>list</var>)</i>
<a name="IDX144"></a>
</dt>
<dd><p>Die Funktion <code>pop</code> entfernt das erste Element der Liste <var>list</var> und
gibt dieses Element zur&uuml;ck.  <var>list</var> muss ein Symbol sein, dem eine Liste
zugewiesen wurde, und kann nicht selbst eine Liste sein.
</p>
<p>Ist dem Argument <var>list</var> keine Liste zugewiesen, gibt Maxima eine
Fehlermeldung aus.
</p>
<p>Siehe auch die Funktion <code><a href="#push">push</a></code>
 f&uuml;r Beispiele.
</p>
<p>Mit dem Kommando <code>load(basic)</code> wird die Funktion geladen.
</p></dd></dl>

<p><a name="push"></a>
</p><dl>
<dt><u>Funktion:</u> <b>push</b><i> (<var>item</var>, <var>list</var>)</i>
<a name="IDX145"></a>
</dt>
<dd><p>Die Funktion <code>push</code> f&uuml;gt das Argument <var>item</var> als erstes Element der
Liste <var>list</var> hinzu und gibt die neue Liste zur&uuml;ck.  Das Argument
<var>list</var> muss ein Symbol sein, dem eine Liste zugewiesen wurde, und kann nicht
selbst eine Liste sein.  Das Argument <var>item</var> kann ein beliebiger Ausdruck
sein.
</p>
<p>Ist dem Argument <var>list</var> keine Liste zugewiesen, gibt Maxima eine 
Fehlermeldung aus.
</p>
<p>Siehe auch die Funktion <code><a href="#pop">pop</a></code>,
 um das erste Element einer Liste zu
entfernen.
</p>
<p>Mit dem Kommando <code>load(basic)</code> wird die Funktion geladen.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) ll:[];
(%o1)                          []
(%i2) push(x,ll);
(%o2)                          [x]
(%i3) push(x^2+y,ll);
                                 2
(%o3)                      [y + x , x]
(%i4) a:push(&quot;string&quot;,ll);
                                     2
(%o4)                  [string, y + x , x]
(%i5) pop(ll);
(%o5)                        string
(%i6) pop(ll);
                                  2
(%o6)                        y + x
(%i7) pop(ll);
(%o7)                           x
(%i8) ll;
(%o8)                          []
(%i9) a;
                                     2
(%o9)                  [string, y + x , x]
</pre></dd></dl>

<p><a name="rest"></a>
</p><dl>
<dt><u>Funktion:</u> <b>rest</b><i> (<var>list</var>, <var>n</var>)</i>
<a name="IDX146"></a>
</dt>
<dt><u>Funktion:</u> <b>rest</b><i> (<var>list</var>)</i>
<a name="IDX147"></a>
</dt>
<dd><p>Entfernt das erste Element oder, wenn <var>n</var> eine positive ganze Zahl ist, die
ersten <var>n</var> Elemente der Liste <var>list</var> und gibt den Rest der Liste als
Ergebnis zur&uuml;ck.  Ist <var>n</var> eine negative Zahl, werden die letzten <var>n</var>
Elemente von der Liste entfernt und der Rest als Ergebnis zur&uuml;ckgegeben.
</p>
<p>Das Argument <var>list</var> kann auch ein allgemeiner Ausdruck sein.
</p>
<p>Siehe auch die Funktionen <code><a href="#first">first</a></code>
 und <code><a href="#last">last</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) rest([a,b,c]);
(%o1)                        [b, c]
(%i2) rest(a+b+c);
(%o2)                         b + a
</pre></dd></dl>

<p><a name="reverse"></a>
</p><dl>
<dt><u>Funktion:</u> <b>reverse</b><i> (<var>list</var>)</i>
<a name="IDX148"></a>
</dt>
<dd><p>Kehrt die Anordnung der Elemente einer Liste <var>list</var> um und gibt die
Ergebnisliste zur&uuml;ck.  Das Argument <var>list</var> kann auch ein allgemeiner
Ausdruck sein.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) reverse([a, b, c]);
(%o1)                       [c, b, a]
(%i2) reverse(sin(x)=2*x^2+1);
                           2
(%o2)                   2 x  + 1 = sin(x)
</pre></dd></dl>

<p><a name="second"></a>
<a name="third"></a>
<a name="fourth"></a>
<a name="fifth"></a>
<a name="sixth"></a>
<a name="seventh"></a>
<a name="eighth"></a>
<a name="ninth"></a>
<a name="tenth"></a>
</p><dl>
<dt><u>Funktion:</u> <b>second</b><i> (<var>list</var>)</i>
<a name="IDX149"></a>
</dt>
<dt><u>Funktion:</u> <b>third</b><i> (<var>list</var>)</i>
<a name="IDX150"></a>
</dt>
<dt><u>Funktion:</u> <b>fourth</b><i> (<var>list</var>)</i>
<a name="IDX151"></a>
</dt>
<dt><u>Funktion:</u> <b>fifth</b><i> (<var>list</var>)</i>
<a name="IDX152"></a>
</dt>
<dt><u>Funktion:</u> <b>sixth</b><i> (<var>list</var>)</i>
<a name="IDX153"></a>
</dt>
<dt><u>Funktion:</u> <b>seventh</b><i> (<var>list</var>)</i>
<a name="IDX154"></a>
</dt>
<dt><u>Funktion:</u> <b>eighth</b><i> (<var>list</var>)</i>
<a name="IDX155"></a>
</dt>
<dt><u>Funktion:</u> <b>ninth</b><i> (<var>list</var>)</i>
<a name="IDX156"></a>
</dt>
<dt><u>Funktion:</u> <b>tenth</b><i> (<var>list</var>)</i>
<a name="IDX157"></a>
</dt>
<dd><p>Die Funktionen <code>second</code> bis <code>tenth</code> geben das 2. bis 10. Element eines
Ausdrucks oder einer Liste <var>list</var> zur&uuml;ck.  Siehe <code><a href="#first">first</a></code>.
</p>
</dd></dl>

<p><a name="sort"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sort</b><i> (<var>L</var>, <var>P</var>)</i>
<a name="IDX158"></a>
</dt>
<dt><u>Funktion:</u> <b>sort</b><i> (<var>L</var>)</i>
<a name="IDX159"></a>
</dt>
<dd><p>Sortiert eine Liste <var>L</var> und gibt die sortierte Liste zur&uuml;ck.  Das
optionale Argument <var>P</var> ist eine Aussagefunktion mit zwei Argumenten, die
eine Ordnung der Elemente definiert.  Die Aussagefunktion kann eine Funktion,
ein bin&auml;rer Operator oder ein Lambda-Ausdruck sein.  Wird kein Argument
<var>P</var> angegeben, werden die Elemente der Liste mit der Aussagefunktion
<code><a href="maxima_6.html#orderlessp">orderlessp</a></code>
 geordnet.
</p>
<p>Die Aussagefunktion <code><a href="maxima_6.html#orderlessp">orderlessp</a></code>
 sortiert eine List aufsteigend.  Mit der
Aussagefunktion <code><a href="maxima_6.html#ordergreatp">ordergreatp</a></code>
 kann die Liste absteigend sortiert werden.
Die Aussagefunktion <code><a href="maxima_6.html#ordermagnitudep">ordermagnitudep</a></code>
 sortiert Maxima Zahlen, Konstante 
oder Ausdr&uuml;cke, die zu einer Zahl oder Konstanten ausgewertet werden k&ouml;nnen,
nach der Gr&ouml;&szlig;e.  Mit dem Operator <code><a href="maxima_7.html#g_t_003c">&lt;</a></code>
 kann auch nach der Gr&ouml;&szlig;e
sortiert werden.  Im Unterschied zur Aussagefunktion <code>ordermagnitudep</code> ist
die Ordnung nicht vollst&auml;ndig, wenn einzelne Elemente der Liste nicht
vergleichbar unter dem Operator <code>&lt;</code> sind.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) sort ([11, -17, 29b0, 7.55, 3, -5/2, b + a, 9 * c,
      19 - 3 * x]);
               5
(%o1) [- 17, - -, 3, 7.55, 11, 2.9b1, b + a, 9 c, 19 - 3 x]
               2
(%i2) sort ([11, -17, 29b0, 7.55, 3, -5/2, b + a, 9*c, 19 - 3*x],
      ordergreatp);
                                                   5
(%o2) [19 - 3 x, 9 c, b + a, 2.9b1, 11, 7.55, 3, - -, - 17]
                                                   2
(%i3) sort ([%pi, 3, 4, %e, %gamma]);
(%o3)                [3, 4, %e, %gamma, %pi]
(%i4) sort ([%pi, 3, 4, %e, %gamma], &quot;&lt;&quot;);
(%o4)                [%gamma, %e, 3, %pi, 4]
(%i5) my_list: [[aa,hh,uu], [ee,cc], [zz,xx,mm,cc], [%pi,%e]];
(%o5) [[aa, hh, uu], [ee, cc], [zz, xx, mm, cc], [%pi, %e]]
(%i6) sort (my_list);
(%o6) [[%pi, %e], [aa, hh, uu], [ee, cc], [zz, xx, mm, cc]]
(%i7) sort (my_list, lambda ([a, b], orderlessp (reverse (a),
      reverse (b))));
(%o7) [[%pi, %e], [ee, cc], [zz, xx, mm, cc], [aa, hh, uu]]
</pre>
<p>Ordne Maxima Zahlen, Konstante und konstante Ausdr&uuml;cke nach der Gr&ouml;&szlig;e.
Alle anderen Elemente werden aufsteigend sortiert.
</p>
<pre class="example">(%i8) sort([%i,1+%i,2*x,minf,inf,%e,sin(1),0,1,2,3,1.0,1.0b0],
           ordermagnitudep);
(%o8) [minf, 0, sin(1), 1, 1.0, 1.0b0, 2, %e, 3, inf, %i, 
                                                     %i + 1, 2 x]
</pre></dd></dl>

<p><a name="sublist"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sublist</b><i> (<var>L</var>, <var>P</var>)</i>
<a name="IDX160"></a>
</dt>
<dd><p>Gibt die Elemente der Liste <var>L</var> als eine Liste zur&uuml;ck, f&uuml;r die die
Aussagefunktion <code>P</code> das Ergebnis <code>true</code> hat.  <code>P</code> ist eine
Funktion mit einem Argument wie zum Beispiel die Funktion
<code><a href="#integerp">integerp</a></code>.
  Siehe auch die Funktion <code><a href="#sublist_005findices">sublist_indices</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) L: [1, 2, 3, 4, 5, 6];
(%o1)                  [1, 2, 3, 4, 5, 6]
(%i2) sublist (L, evenp);
(%o2)                       [2, 4, 6]
</pre></dd></dl>

<p><a name="sublist_005findices"></a>
</p><dl>
<dt><u>Funktion:</u> <b>sublist_indices</b><i> (<var>L</var>, <var>P</var>)</i>
<a name="IDX161"></a>
</dt>
<dd><p>Gibt die Indizes der Elemente der Liste <var>L</var> zur&uuml;ck, f&uuml;r die die
Aussagefunktion <code>P</code> das Ergebnis <code>true</code> hat.  <code>P</code> ist eine
Funktion mit einem Argument wie zum Beispiel die Funktion
<code><a href="#integerp">integerp</a></code>.
  Siehe auch die Funktion <code><a href="#sublist">sublist</a></code>.
</p>

<p>Beispiele:
</p>
<pre class="example">(%i1) sublist_indices ('[a, b, b, c, 1, 2, b, 3, b],
                       lambda ([x], x='b));
(%o1)                     [2, 3, 7, 9]
(%i2) sublist_indices ('[a, b, b, c, 1, 2, b, 3, b], symbolp);
(%o2)                  [1, 2, 3, 4, 7, 9]
(%i3) sublist_indices ([1 &gt; 0, 1 &lt; 0, 2 &lt; 1, 2 &gt; 1, 2 &gt; 0],
                       identity);
(%o3)                       [1, 4, 5]
(%i4) assume (x &lt; -1);
(%o4)                       [x &lt; - 1]
(%i5) map (maybe, [x &gt; 0, x &lt; 0, x &lt; -2]);
(%o5)                [false, true, unknown]
(%i6) sublist_indices ([x &gt; 0, x &lt; 0, x &lt; -2], identity);
(%o6)                          [2]
</pre></dd></dl>

<p><a name="unique"></a>
</p><dl>
<dt><u>Funktion:</u> <b>unique</b><i> (<var>L</var>)</i>
<a name="IDX162"></a>
</dt>
<dd><p>Gibt eine Liste mit den Elementen der Liste <var>L</var> zur&uuml;ck, die sich
voneinander unterscheiden.  Sind alle Elemente der Liste <var>L</var> verschieden,
gibt <code>unique</code> eine Kopie der Liste <var>L</var> und nicht die Liste selbst
zur&uuml;ck.  Ist <var>L</var> keine Liste, gibt <code>unique</code> den Ausdruck <var>L</var>
zur&uuml;ck.
</p>
<p>Beispiel:
</p>
<pre class="example">(%i1) unique ([1, %pi, a + b, 2, 1, %e, %pi, a + b, [1]]);
(%o1)              [1, 2, %e, %pi, [1], b + a]
</pre></dd></dl>





<hr size="6">
<a name="Arrays"></a>
<a name="SEC33"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC32" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC34" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.5 Arrays </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC34">5.5.1 Einf&uuml;hrung in Arrays</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC35">5.5.2 Funktionen und Variablen f&uuml;r Arrays</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-Arrays"></a>
<a name="SEC34"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC33" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC35" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC33" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.5.1 Einf&uuml;hrung in Arrays </h3>

<p>Am flexibelsten sind Arrays, die nicht deklariert werden, diese werden auch
Hashed-Arrays genannt und entstehen dadurch, dass einer indizierten Variablen
ein Wert zugewiesen wird.  Die Indizes brauchen keine ganze Zahlen zu sein,
es sind auch Symbole und Ausdr&uuml;cke als Index m&ouml;glich.  Nicht-deklarierte
Arrays wachsen dynamisch mit der Zuweisung von Werten an die Elemente.  Im 
Folgenden wird ein nicht-deklariertes Array <code>a</code> durch Zuweisung von Werten
erzeugt.  Die Elemente des Arrays werden mit der Funktion <code><a href="#listarray">listarray</a></code>

angezeigt.
</p>
<pre class="example">(%i1) a[1,2]: 99;
(%o1)                          99
(%i2) a[x,y]: x^y;
                                y
(%o2)                          x
(%i3) listarray(a);
                                  y
(%o3)                       [99, x ]
</pre>
<p>Von den nicht-deklarierten Arrays sind deklarierte Arrays zu unterscheiden.
Diese haben bis zu 5 Dimensionen und k&ouml;nnen einen Typ wie <code>fixnum</code> oder
<code>flonum</code> erhalten.  Maxima unterscheidet zun&auml;chst zwei verschiedene Arten
von deklarierten Arrays.  Zum einen kann ein Symbol mit der Funktion
<code><a href="#array">array</a></code>
 als ein deklariertes Array definiert werden.  Eine andere 
M&ouml;glichkeit ist, mit der Funktion <code><a href="#make_005farray">make_array</a></code>
 ein Lisp-Array zu 
deklarieren, dass einem Symbol zugewiesen wird.
</p>
<p>Das erste Beispiel zeigt die Deklaration eines Symbols <code>a</code> als ein Array.
Im zweiten Beispiel wird ein Lisp-Array erzeugt, das dem Symbol <code>b</code>
zugewiesen wird.
</p>
<pre class="example">(%i1) array(a, fixnum, 2, 2);
(%o1)                           a
(%i2) b: make_array(fixnum, 2, 2);
(%o2)              {Array:  #2A((0 0) (0 0))}
</pre>
<p>Erh&auml;lt die Optionsvariable <code><a href="#use_005ffast_005farrays">use_fast_arrays</a></code>
 den Wert <code>true</code>, werden
ausschlie&szlig;lich Lisp-Arrays erzeugt.  Im Folgenden wird auch von der Funktion
<code>array</code> ein Lisp-Array erzeugt, dass dem Symbol <code>c</code> zugewiesen wird.
Die Implementation der Funktionalit&auml;t der Funktion <code>array</code> ist jedoch
nicht vollst&auml;ndig, wenn Lisp-Arrays genutzt werden.  So kann in diesem
Beispiel nicht wie oben ein Array mit dem Typ <code>fixnum</code> definiert werden.
Das ist ein Programmfehler.
</p>
<pre class="example">(%i3) use_fast_arrays: true;
(%o3)                         true
(%i4) array(c, 2, 2);
(%o4)    #2A((NIL NIL NIL) (NIL NIL NIL) (NIL NIL NIL))
(%i5) c;
(%o5)    #2A((NIL NIL NIL) (NIL NIL NIL) (NIL NIL NIL))
(%i6) array(c, fixnum, 2, 2);

make_array: dimensions must be integers; found [fixnum + 1, 3, 3]
 -- an error. To debug this try: debugmode(true);
</pre>
<p>Maxima kennt weiterhin Array-Funktionen, die Funktionswerte speichern k&ouml;nnen,
und indizierte Funktionen.  Die hier beschriebenen Funktionen k&ouml;nnen auch
auf diese Arrays angewendet werden.  Siehe <a href="maxima_25.html#Array_002dFunktionen">Array-Funktionen</a> f&uuml;r eine
Beschreibung.
</p>
<p>Weitere Ausf&uuml;hrungen sind bei der Beschreibung der einzelnen Funktionen zu
finden.  Maxima kennt folgende Funktionen und Symbole f&uuml;r das Arbeiten mit
Arrays:
</p>
<pre class="verbatim">   array         arrayapply     arrayinfo   
   arraymake     arrays         fillarray
   listarray     make_array     rearray
   remarray      subvar         subvarp
   use_fast_arrays
</pre>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Arrays"></a>
<a name="SEC35"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC34" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC36" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC33" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.5.2 Funktionen und Variablen f&uuml;r Arrays </h3>

<p><a name="array"></a>
</p><dl>
<dt><u>Funktion:</u> <b>array</b><i> (<var>name</var>, <var>dim_1</var>, &hellip;, <var>dim_n</var>)</i>
<a name="IDX163"></a>
</dt>
<dt><u>Funktion:</u> <b>array</b><i> (<var>name</var>, <var>type</var>, <var>dim_1</var>, &hellip;, <var>dim_n</var>)</i>
<a name="IDX164"></a>
</dt>
<dt><u>Funktion:</u> <b>array</b><i> ([<var>name_1</var>, &hellip;, <var>name_m</var>], <var>dim_1</var>, &hellip;, <var>dim_n</var>)</i>
<a name="IDX165"></a>
</dt>
<dt><u>Funktion:</u> <b>array</b><i> ([<var>name_1</var>, &hellip;, <var>name_m</var>], <var>type</var>, <var>dim_1</var>, &hellip;, <var>dim_n</var>)</i>
<a name="IDX166"></a>
</dt>
<dd><p>Erzeugt ein <em>n</em>-dimensionales Array.  Das Array kann bis zu 5 Dimensionen
haben.  Die Indizes der <em>i</em>-ten Dimension sind ganze Zahlen in einem 
Bereich von 0 bis einschlie&szlig;lich <var>dim_i</var>.
</p>
<p><code>array(<var>name</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</code> erzeugt ein Array, 
dessen Elemente einen beliebigen Typ haben und auch Symbole oder Ausdr&uuml;cke
sein k&ouml;nnen.
</p>
<p><code>array(<var>name</var>, <var>type</var>, <var>dim_1</var>, ..., <var>dim_n</var>)</code> erzeugt 
ein Array mit Elementen, die vom Typ <var>type</var> sind.  Das Argument <var>type</var>
kann <code>fixnum</code> f&uuml;r ganze Zahlen oder <code>flonum</code> f&uuml;r Gleitkommazahlen
sein.
</p> 
<p><code>array([<var>name_1</var>, ..., <var>name_m</var>], <var>dim_1</var>, ..., <var>dim_n</var>)</code>
erzeugt <em>m</em> Arrays, die alle die gleiche Dimension haben.  Wie oben kann
weiterhin der Typ der Arrays durch Angabe des Argumentes <var>type</var> als
<code>fixnum</code> oder <code>flonum</code> festgelegt werden.
</p>
<p>Mit der Funktion <code>array</code> k&ouml;nnen nicht-deklarierte Arrays in ein
deklariertes Array umgewandelt werden.  Wenn das deklarierte einen Typ erhalten
soll, m&uuml;ssen alle Elemente des nicht-deklarierten Arrays von diesem Typ sein.
</p>
<p>Siehe auch die Funktion <code><a href="#make_005farray">make_array</a></code>,
 um ein Lisp-Array zu erzeugen,
sowie die Optionsvariable <code><a href="#use_005ffast_005farrays">use_fast_arrays</a></code>.
</p>

<p>Beispiele:
</p>
<p>Es werden zwei verschiedene Arrays definiert.  Im ersten Fall erh&auml;lt das Array
keinen Typ.  Elemente, denen noch kein Wert zugewiesen wurde, werden mit dem
Symbol <code>#####</code> initialisiert.  Im zweiten Fall ist das Array vom Typ 
<code>fixnum</code>.  Jetzt wird das Array mit dem Wert <code>0</code> initialisiert.
</p>
<pre class="example">(%i1) array(a, 2, 2);
(%o1)                           a
(%i2) a[0,0]: 0; a[1,1]:11; a[2,2]:22;
(%o2)                           0
(%o3)                          11
(%o4)                          22
(%i5) listarray(a);
(%o5) [0, #####, #####, #####, 11, #####, #####, #####, 22]
(%i6) array(b, fixnum, 2, 2);
(%o6)                           b
(%i7) b[0,0]: 0; b[1,1]:11; b[2,2]:22;
(%o7)                           0
(%o8)                          11
(%o9)                          22
(%i10) listarray(b);
(%o10)            [0, 0, 0, 0, 11, 0, 0, 0, 22]
</pre>
<p>Ein nicht-deklariertes Array kann in ein deklariertes Array umgewandelt werden.
</p>
<pre class="example">(%i1) a[1,1]:11;
(%o1)                          11
(%i2) a[2,2]:22;
(%o2)                          22
(%i3) arrayinfo(a);
(%o3)              [hashed, 2, [1, 1], [2, 2]]
(%i4) array(a, fixnum, 2, 2);
(%o4)                           a
(%i5) arrayinfo(a);
(%o5)                 [complete, 2, [2, 2]]
</pre></dd></dl>

<p><a name="arrayapply"></a>
</p><dl>
<dt><u>Funktion:</u> <b>arrayapply</b><i> (<var>A</var>, [<var>i_1</var>, &hellip;, <var>i_n</var>])</i>
<a name="IDX167"></a>
</dt>
<dd><p>Wertet <code><var>A</var>[<var>i_1</var>, ... , <var>i_n</var>]</code> aus, wobei <var>A</var> ein Array
und <var>i_1</var>, &hellip;, <var>i_n</var> die Indizes eines Array-Elementes sind.
</p>
<p>Siehe auch die Funktion <code><a href="#subvar">subvar</a></code>,
 die die gleiche Funktionalit&auml;t hat,
sowie die Funktion <code><a href="#arraymake">arraymake</a></code>,
 die die Referenz auf das Array-Element
nicht auswertet.
</p>
<p>Beispiele:
</p>
<p>Die Funktion <code>arrayapply</code> wertet die Referenz auf ein Array-Element aus.
Im Unterschied dazu wertet die Funktion <code><a href="#arraymake">arraymake</a></code>
 die Referenz nicht aus.
Die Funktion <code><a href="#subvar">subvar</a></code>
 hat die gleiche Funktionalit&auml;t wie
<code>arrayapply</code>.
</p>
<pre class="example">(%i1) a[1,2]: 12;
(%o1)                          12
(%i2) a[x,y]: x^y;
                                y
(%o2)                          x
(%i3) arrayapply(a, [1, 2]);
(%o3)                          12
(%i4) arrayapply(a, [x, y]);
                                y
(%o4)                          x
(%i5) arraymake(a, [x,y]);
(%o5)                         a
                               x, y
(%i6) subvar(a, x, y);
                                y
(%o6)                          x
</pre></dd></dl>

<p><a name="arrayinfo"></a>
</p><dl>
<dt><u>Funktion:</u> <b>arrayinfo</b><i> (<var>A</var>)</i>
<a name="IDX168"></a>
</dt>
<dd><p>Gibt Informationen &uuml;ber das Array <var>A</var> zur&uuml;ck.  Das Argument <var>A</var> kann
ein deklariertes oder ein nicht-deklariertes Array sowie eine Array-Funktion
oder eine indizierte Funktion sein.
</p>
<p>F&uuml;r ein deklarierte Array gibt <code>arrayinfo</code> eine Liste zur&uuml;ck, die 
<code>declared</code>, die Zahl der Dimensionen und die Gr&ouml;&szlig;e der Dimensionen 
enth&auml;lt.  Die Elemente des Arrays werden von der Funktion <code><a href="#listarray">listarray</a></code>

zur&uuml;ckgegeben.
</p>
<p>F&uuml;r ein nicht-deklariertes Array (Hashed-Array) gibt <code>arrayinfo</code> eine
Liste zur&uuml;ck, die <code>hashed</code>, die Zahl der Indizes und die Indizes
enth&auml;lt, deren Elemente einen Wert haben.  Die Werte der Elemente werden mit
der Funktion <code><a href="#listarray">listarray</a></code>
 zur&uuml;ckgegeben.
</p>
<p>F&uuml;r Array-Funktionen gibt <code>arrayinfo</code> eine Liste zur&uuml;ck, die 
<code>hashed</code> die Zahl der Indizes und die Indizes enth&auml;lt, f&uuml;r die 
Funktionen im Array enthalten sind.  Die Funktionen werden mit der Funktion 
<code><a href="#listarray">listarray</a></code>
 angezeigt.
</p>
<p>F&uuml;r indizierte Funktionen gibt <code>arrayinfo</code> eine Liste zur&uuml;ck, die 
<code>hashed</code>, die Zahl der Indizes und die Indizes enth&auml;lt, f&uuml;r die 
Lambda-Ausdr&uuml;cke vorhanden sind.  Die <code><a href="maxima_25.html#lambda">lambda</a></code>
-Ausdr&uuml;cke werden von der
Funktion <code><a href="#listarray">listarray</a></code>
 angezeigt.
</p>
<p>Die Funktion <code>arrayinfo</code> kann auch f&uuml;r Lisp-Arrays angewendet werden,
die mit der Funktion <code><a href="#make_005farray">make_array</a></code>
 erzeugt werden.
</p>
<p>Beispiele:
</p>
<p><code>arrayinfo</code> und <code>listarray</code> angewendet auf ein deklariertes Array.
</p>
<pre class="example">(%i1) array(aa, 2, 3);
(%o1)                          aa
(%i2) aa[2, 3] : %pi;
(%o2)                          %pi
(%i3) aa[1, 2] : %e;
(%o3)                          %e
(%i4) arrayinfo(aa);
(%o4)                 [declared, 2, [2, 3]]
(%i5) listarray(aa);
(%o5) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
</pre>
<p><code>arrayinfo</code> und <code>listarray</code> angewendet auf ein nicht-deklariertes
Array.
</p>
<pre class="example">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
(%i3) arrayinfo (bb);
(%o3)               [hashed, 1, [BAR], [FOO]]
(%i4) listarray (bb);
                              3         2
(%o4)                 [(c - d) , (b + a) ]
</pre>
<p><code>arrayinfo</code> und <code>listarray</code> angewendet auf eine Array-Funktion.
</p>
<pre class="example">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
(%i4) arrayinfo (cc);
(%o4)              [hashed, 2, [4, z], [u, v]]
(%i5) listarray (cc);
                              z  v
(%o5)                        [-, -]
                              4  u
</pre>
<p><code>arrayinfo</code> und <code>listarray</code> angewendet auf eine indizierte Funktion.
</p>
<pre class="example">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
(%i4) arrayinfo (dd);
(%o4)             [hashed, 1, [b + a], [v - u]]
(%i5) listarray (dd);
                         b + a                v - u
(%o5)      [lambda([y], y     ), lambda([y], y     )]
</pre></dd></dl>

<p><a name="arraymake"></a>
</p><dl>
<dt><u>Funktion:</u> <b>arraymake</b><i> (<var>A</var>, [<var>i_1</var>, &hellip;, <var>i_n</var>])</i>
<a name="IDX169"></a>
</dt>
<dd><p>Gibt den Ausdruck <code><var>A</var>[<var>i_1</var>, ..., <var>i_n</var>]</code> zur&uuml;ck.  Das 
Ergebnis ist eine nicht ausgewertete Referenz auf ein Element des Arrays
<var>A</var>.  <code>arraymake</code> ist vergleichbar mit der Funktion <code><a href="maxima_25.html#funmake">funmake</a></code>.
</p>

<p>Ist das Array <var>A</var> ein Lisp-Array, wie es mit der Funktion 
<code><a href="#make_005farray">make_array</a></code>
 erzeugt wird, dann gibt <code>arraymake</code> einen Lisp-Fehler
zur&uuml;ck.  Das ist ein Programmfehler.
</p>
<p>Siehe auch die Funktionen <code><a href="#arrayapply">arrayapply</a></code>
 und <code><a href="#subvar">subvar</a></code>,
 die die
Referenz auswerten.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) arraymake (A, [1]);
(%o1)                          A
                                1
(%i2) arraymake (A, [k]);
(%o2)                          A
                                k
(%i3) arraymake (A, [i, j, 3]);
(%o3)                       A
                             i, j, 3
(%i4) array (A, fixnum, 10);
(%o4)                           A
(%i5) fillarray (A, makelist (i^2, i, 1, 11));
(%o5)                           A
(%i6) arraymake (A, [5]);
(%o6)                          A
                                5
(%i7) ''%;
(%o7)                          36
(%i8) L : [a, b, c, d, e];
(%o8)                    [a, b, c, d, e]
(%i9) arraymake ('L, [n]);
(%o9)                          L
                                n
(%i10) ''%, n = 3;
(%o10)                          c
(%i11) A2 : make_array (fixnum, 10);
(%o11)          {Array:  #(0 0 0 0 0 0 0 0 0 0)}
(%i12) fillarray (A2, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o12)          {Array:  #(1 2 3 4 5 6 7 8 9 10)}
(%i13) arraymake ('A2, [8]);
(%o13)                         A2
                                 8
(%i14) ''%;
(%o14)                          9
</pre></dd></dl>

<p><a name="arrays"></a>
</p><dl>
<dt><u>Systemvariable:</u> <b>arrays</b>
<a name="IDX170"></a>
</dt>
<dd><p>Standardwert: <code>[]</code>
</p>
<p><code>arrays</code> ist eine Informationsliste <code><a href="maxima_4.html#infolists">infolists</a></code>
 der vom Nutzer 
definierten Arrays.  Die Liste enth&auml;lt deklarierte Arrays, nicht-deklarierte
Arrays und Array-Funktionen, die der Nutzer mit dem Operator <code><a href="maxima_7.html#g_t_003a_003d">:=</a></code>
 oder der
Funktion <code><a href="maxima_25.html#define">define</a></code>
 definiert hat.  Dagegen sind Arrays, die mit
<code><a href="#make_005farray">make_array</a></code>
 definiert sind, nicht in der Liste enthalten.
</p>
<p>Siehe auch die Funktion <code><a href="#array">array</a></code>,
 um ein Array zu definieren.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) array (aa, 5, 7);
(%o1)                          aa
(%i2) bb [FOO] : (a + b)^2;
                                   2
(%o2)                       (b + a)
(%i3) cc [x] := x/100;
                                   x
(%o3)                      cc  := ---
                             x    100
(%i4) dd : make_array ('any, 7);
(%o4)       {Array:  #(NIL NIL NIL NIL NIL NIL NIL)}
(%i5) arrays;
(%o5)                     [aa, bb, cc]
</pre></dd></dl>

<p><a name="fillarray"></a>
</p><dl>
<dt><u>Funktion:</u> <b>fillarray</b><i> (<var>A</var>, <var>B</var>)</i>
<a name="IDX171"></a>
</dt>
<dd><p>F&uuml;llt das Array <var>A</var> mit den Werten aus <var>B</var>.  Das Argument <var>B</var> ist 
eine Liste oder ein Array.
</p>
<p>Hat das Array <var>A</var> einen Typ, dann kann es nur mit Elementen gef&uuml;llt
werden, die den gleichen Typ haben.
</p>
<p>Sind die Dimensionen von <var>A</var> und <var>B</var> verschieden, werden zun&auml;chst die
Zeilen des Arrays <var>A</var> aufgef&uuml;llt.  Hat die Liste oder das Array <var>B</var>
nicht gen&uuml;gend Elemente, um das Array <var>A</var> aufzuf&uuml;llen, werden die 
restlichen Elemente mit dem letzten Wert von <var>B</var> aufgef&uuml;llt.
&Uuml;berz&auml;hlige Elemente in <var>B</var> werden ignoriert.
</p>
<p><code>fillarray</code> gibt das erste Argument zur&uuml;ck.
</p>
<p>Siehe die Funktionen <code><a href="#array">array</a></code>
 und <code><a href="#make_005farray">make_array</a></code>,
 um ein Array
zu definieren.
</p>
<p>Beispiele:
</p>
<p>Erzeuge ein Array mit 9 Elementen und f&uuml;lle es mit den Elementen einer Liste.
</p>
<pre class="example">(%i1) array (a1, fixnum, 8);
(%o1)                          a1
(%i2) listarray (a1);
(%o2)              [0, 0, 0, 0, 0, 0, 0, 0, 0]
(%i3) fillarray (a1, [1, 2, 3, 4, 5, 6, 7, 8, 9]);
(%o3)                          a1
(%i4) listarray (a1);
(%o4)              [1, 2, 3, 4, 5, 6, 7, 8, 9]
</pre>
<p>Sind zu wenige Elemente vorhanden, um das Array aufzuf&uuml;llen, wird das Array
mit dem letzten Element aufgef&uuml;llt.  &Uuml;berz&auml;hlige Elemente werden 
ignoriert.
</p>
<pre class="example">(%i1) a2 : make_array (fixnum, 8);
(%o1)             {Array:  #(0 0 0 0 0 0 0 0)}
(%i2) fillarray (a2, [1, 2, 3, 4, 5]);
(%o2)             {Array:  #(1 2 3 4 5 5 5 5)}
(%i3) fillarray (a2, [4]);
(%o3)             {Array:  #(4 4 4 4 4 4 4 4)}
(%i4) fillarray (a2, makelist (i, i, 1, 100));
(%o4)             {Array:  #(1 2 3 4 5 6 7 8)}
</pre>
<p>Arrays werden zeilenweise aufgef&uuml;llt.
</p>
<pre class="example">(%i1) a3 : make_array (fixnum, 2, 5);
(%o1)        {Array:  #2A((0 0 0 0 0) (0 0 0 0 0))}
(%i2) fillarray (a3, [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]);
(%o2)        {Array:  #2A((1 2 3 4 5) (6 7 8 9 10))}
(%i3) a4 : make_array (fixnum, 5, 2);
(%o3)     {Array:  #2A((0 0) (0 0) (0 0) (0 0) (0 0))}
(%i4) fillarray (a4, a3);
(%o4)     {Array:  #2A((1 2) (3 4) (5 6) (7 8) (9 10))}
</pre></dd></dl>

<p><a name="listarray"></a>
</p><dl>
<dt><u>Funktion:</u> <b>listarray</b><i> (<var>A</var>)</i>
<a name="IDX172"></a>
</dt>
<dd><p>Gibt eine Liste mit den Elementen des Arrays <var>A</var> zur&uuml;ck.  Das Argument 
<var>A</var> kann ein deklariertes, nicht-deklariertes, eine Array-Funktion oder eine
indizierte Funktion sein.
</p>
<p>Die Elemente werden zeilenweise ausgegeben.  F&uuml;r nicht-deklarierte Arrays mit
Indizes, die keine ganze Zahlen sind, wird die Sortierung von der
Aussagefunktion <code><a href="maxima_6.html#orderlessp">orderlessp</a></code>
 bestimmt.
</p>
<p>F&uuml;r nicht-deklarierte Arrays, Array-Funktionen und indizierte Funktionen
werden die Elemente in der Reihenfolge wie von der Funktion 
<code><a href="#arrayinfo">arrayinfo</a></code>
 zur&uuml;ckgegeben.
</p>
<p>Elemente von deklarierten Arrays, denen noch kein Wert zugewiesen wurde und die
keinen Typ haben, werden als <code>#####</code> zur&uuml;ckgegeben.  Elemente von
deklarierten Arrays mit einem Typ, geben den Wert 0 f&uuml;r den Typ <code>fixnum</code>
und 0.0 f&uuml;r den Typ <code>flonum</code> zur&uuml;ck.
</p>
<p>Ist das Argument <var>A</var> ein Lisp-Array, wie es von der Funktion
<code><a href="#make_005farray">make_array</a></code>
 erzeugt wird, generiert Maxima einen Lisp-Fehler.  Das ist ein
Programmfehler.
</p>
<p>Beispiele:
</p>
<p>Anwendung der Funktionen <code>listarray</code> und <code><a href="#arrayinfo">arrayinfo</a></code>
 f&uuml;r ein
deklariertes Array.
</p>
<pre class="example">(%i1) array (aa, 2, 3);
(%o1)                          aa
(%i2) aa [2, 3] : %pi;
(%o2)                          %pi
(%i3) aa [1, 2] : %e;
(%o3)                          %e
(%i4) listarray (aa);
(%o4) [#####, #####, #####, #####, #####, #####, %e, #####, 
                                        #####, #####, #####, %pi]
(%i5) arrayinfo (aa);
(%o5)                 [declared, 2, [2, 3]]
</pre>
<p>Anwendung der Funktionen <code>listarray</code> und <code><a href="#arrayinfo">arrayinfo</a></code>
 f&uuml;r ein
nicht-deklariertes Array.
</p>
<pre class="example">(%i1) bb [FOO] : (a + b)^2;
                                   2
(%o1)                       (b + a)
(%i2) bb [BAR] : (c - d)^3;
                                   3
(%o2)                       (c - d)
(%i3) listarray (bb);
                              3         2
(%o3)                 [(c - d) , (b + a) ]
(%i4) arrayinfo (bb);
(%o4)               [hashed, 1, [BAR], [FOO]]
</pre>
<p>Anwendung der Funktionen <code>listarray</code> und <code><a href="#arrayinfo">arrayinfo</a></code>
 f&uuml;r eine
Array-Funktion.
</p>
<pre class="example">(%i1) cc [x, y] := y / x;
                                     y
(%o1)                      cc     := -
                             x, y    x
(%i2) cc [u, v];
                                v
(%o2)                           -
                                u
(%i3) cc [4, z];
                                z
(%o3)                           -
                                4
(%i4) listarray (cc);
                              z  v
(%o4)                        [-, -]
                              4  u
(%i5) arrayinfo (cc);
(%o5)              [hashed, 2, [4, z], [u, v]]
</pre>
<p>Anwendung der Funktionen <code>listarray</code> und <code><a href="#arrayinfo">arrayinfo</a></code>
 f&uuml;r ein
indizierte Funktion.
</p>
<pre class="example">(%i1) dd [x] (y) := y ^ x;
                                     x
(%o1)                     dd (y) := y
                            x
(%i2) dd [a + b];
                                    b + a
(%o2)                  lambda([y], y     )
(%i3) dd [v - u];
                                    v - u
(%o3)                  lambda([y], y     )
(%i4) listarray (dd);
                         b + a                v - u
(%o4)      [lambda([y], y     ), lambda([y], y     )]
(%i5) arrayinfo (dd);
(%o5)             [hashed, 1, [b + a], [v - u]]
</pre></dd></dl>

<p><a name="make_005farray"></a>
</p><dl>
<dt><u>Funktion:</u> <b>make_array</b><i> (<var>type</var>, <var>dim_1</var>, &hellip;, <var>dim_n</var>)</i>
<a name="IDX173"></a>
</dt>
<dd><p>Gibt ein Lisp-Array zur&uuml;ck.  Das Argument <var>type</var> kann die Werte
<code>any</code>, <code>flonum</code>, <code>fixnum</code> oder <code>hashed</code> haben.  Das Array
hat <em>i</em> Dimensionen und der Index <em>i</em> l&auml;uft von 0 bis 
einschlie&szlig;lich <em><var>dim_i</var>-1</em>.
</p>

<p>Die meisten Funktionen, die auf ein Array angewendet werden k&ouml;nnen, das mit
der Funktion <code><a href="#array">array</a></code>
 definiert wurde, k&ouml;nnen auch auf Lisp-Arrays
angewendet werden.  Einige Funktionalit&auml;ten stehen jedoch nicht zur
Verf&uuml;gung.  Dies ist auf eine unzureichende Implementation der Lisp-Arrays
zur&uuml;ckzuf&uuml;hren und kann als Programmfehler betrachtet werden.  Hinweise auf
Einschr&auml;nkungen sind bei den einzelnen Funktionen f&uuml;r Arrays zu finden.
</p>
<p>Erh&auml;lt die Optionsvariable <code><a href="#use_005ffast_005farrays">use_fast_arrays</a></code>
 den Wert <code>true</code>,
erzeugt Maxima ausschlie&szlig;lich Lisp-Arrays.  Dies trifft auch auf die
Funktion <code><a href="#array">array</a></code>
 zu.  Wie bereits oben erl&auml;utert, ist in diesem Fall
jedoch mit einer eingeschr&auml;nkten Funktionalit&auml;t zu rechnen.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) A1 : make_array (fixnum, 10);
(%o1)           {Array:  #(0 0 0 0 0 0 0 0 0 0)}
(%i2) A1 [8] : 1729;
(%o2)                         1729
(%i3) A1;
(%o3)          {Array:  #(0 0 0 0 0 0 0 0 1729 0)}
(%i4) A2 : make_array (flonum, 10);
(%o4) {Array:  #(0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
(%i5) A2 [2] : 2.718281828;
(%o5)                      2.718281828
(%i6) A2;
(%o6) 
     {Array:  #(0.0 0.0 2.718281828 0.0 0.0 0.0 0.0 0.0 0.0 0.0)}
(%i7) A3 : make_array (any, 10);
(%o7) {Array:  #(NIL NIL NIL NIL NIL NIL NIL NIL NIL NIL)}
(%i8) A3 [4] : x - y - z;
(%o8)                      - z - y + x
(%i9) A3;
(%o9) {Array:  #(NIL NIL NIL NIL ((MPLUS SIMP) $X ((MTIMES SIMP)\
 -1 $Y) ((MTIMES SIMP) -1 $Z))
  NIL NIL NIL NIL NIL)}
(%i10) A4 : make_array (fixnum, 2, 3, 5);
(%o10) {Array:  #3A(((0 0 0 0 0) (0 0 0 0 0) (0 0 0 0 0)) ((0 0 \
0 0 0) (0 0 0 0 0) (0 0 0 0 0)))}
(%i11) fillarray (A4, makelist (i, i, 1, 2*3*5));
(%o11) {Array:  #3A(((1 2 3 4 5) (6 7 8 9 10) (11 12 13 14 15))
    ((16 17 18 19 20) (21 22 23 24 25) (26 27 28 29 30)))}
(%i12) A4 [0, 2, 1];
(%o12)                         12
</pre></dd></dl>

<p><a name="rearray"></a>
</p><dl>
<dt><u>Funktion:</u> <b>rearray</b><i> (<var>A</var>, <var>dim_1</var>, &hellip;, <var>dim_n</var>)</i>
<a name="IDX174"></a>
</dt>
<dd><p>Die Funktion <code>rearray</code> erlaubt es, ein Array <var>A</var> zu vergr&ouml;&szlig;ern
oder auch zu verkleinern.  Die Anzahl der Dimensionen <var>n</var> sowie der Typ
eines Arrays k&ouml;nnen nicht ge&auml;ndert werden.
</p>
<p>Das neue Array wird zeilenweise mit den Werten des alten Arrays aufgef&uuml;llt.
Hat das alte Array nicht gen&uuml;gend Elemente werden die restlichen Elemente
entsprechend dem Typ des Arrays mit <code>false</code>, <code>0.0</code> oder <code>0</code>
aufgef&uuml;llt.
</p>
<p>Siehe die Funktionen <code><a href="#array">array</a></code>
 und <code><a href="#make_005farray">make_array</a></code>,
 um ein Array
zu definieren.
</p>
<p>Beispiel:
</p>
<p>In diesem Beispiel wird das Array <code>A</code> verkleinert.  Der R&uuml;ckgabewert von
<code>rearray</code> ist ein internes Lisp-Array auch f&uuml;r den Fall, dass das Array
selbst kein Lisp-Array ist.
</p>
<pre class="example">(%i1) array(A, fixnum, 2, 2);
(%o1)                           A
(%i2) listarray(A);
(%o2)              [0, 0, 0, 0, 0, 0, 0, 0, 0]
(%i3) rearray(A, 1, 1);
(%o3)              {Array:  #2A((0 0) (0 0))}
(%i4) listarray(A);
(%o4)                     [0, 0, 0, 0]
</pre></dd></dl>

<p><a name="remarray"></a>
</p><dl>
<dt><u>Funktion:</u> <b>remarray</b><i> (<var>A_1</var>, &hellip;, <var>A_n</var>)</i>
<a name="IDX175"></a>
</dt>
<dt><u>Funktion:</u> <b>remarray</b><i> (all)</i>
<a name="IDX176"></a>
</dt>
<dd><p>Entfernt Arrays und Array-Funktionen.  Der vom Array belegte Speicher wird
freigegeben.  Die Argumente k&ouml;nnen deklarierte und nicht-deklarierte Arrays
sowie Array-Funktionen und indizierte Funktionen sein.
</p>
<p><code>remarray(all)</code> entfernt alle Arrays, die in der Informationsliste
<code><a href="#arrays">arrays</a></code>
 enthalten sind.
</p>
<p><code>remarray</code> gibt eine Liste der Arrays zur&uuml;ck, die entfernt wurden.
<code>remarray</code> wertet die Argumente nicht aus.
</p></dd></dl>

<p><a name="subvar"></a>
</p><dl>
<dt><u>Funktion:</u> <b>subvar</b><i> (<var>x</var>, <var>i_1</var>, <var>x_2</var>, &hellip;)</i>
<a name="IDX177"></a>
</dt>
<dd><p>Wertet den indizierten Ausdruck <code><var>x</var>[<var>i_1</var>, <var>i_2</var>, ...]</code> aus.
<code>subvar</code> wertet die Argumente aus.
</p>
<p>Siehe die Funktion <code><a href="#arrayapply">arrayapply</a></code>,
 die dieselbe Funktionalit&auml;t hat, und
die Funktion <code><a href="#arraymake">arraymake</a></code>,
 die eine Referenz auf das Array-Element
zur&uuml;ckgibt, ohne diese auszuwerten.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) x : foo $
(%i2) i : 3 $
(%i3) subvar (x, i);
(%o3)                         foo
                                 3
(%i4) foo : [aa, bb, cc, dd, ee]$
(%i5) subvar (x, i);
(%o5)                          cc
(%i6) arraymake (x, [i]);
(%o6)                         foo
                                 3
(%i7) ''%;
(%o7)                          cc
</pre></dd></dl>

<p><a name="subvarp"></a>
</p><dl>
<dt><u>Funktion:</u> <b>subvarp</b><i> (<var>expr</var>)</i>
<a name="IDX178"></a>
</dt>
<dd><p>Gibt <code>true</code> zur&uuml;ck, wenn <var>expr</var> eine indizierte Variable wie zum
Beispiel <code>a[i]</code> ist.
</p></dd></dl>

<p><a name="use_005ffast_005farrays"></a>
</p><dl>
<dt><u>Optionsvariable:</u> <b>use_fast_arrays</b>
<a name="IDX179"></a>
</dt>
<dd><p>Standardwert: <code>false</code>
</p>
<p>Erh&auml;lt die Optionsvariable <code><a href="#use_005ffast_005farrays">use_fast_arrays</a></code>
 den Wert <code>true</code>,
erzeugt Maxima ausschlie&szlig;lich Lisp-Arrays, wie sie auch von der Funktion
<code><a href="#make_005farray">make_array</a></code>
 erzeugt werden.  Dies trifft auch auf die Funktion 
<code><a href="#array">array</a></code>
 zu.  Der Vorteil der Lisp-Arrays ist, dass diese effizienter sind.
</p>
<p>Die Implementation der Lisp-Arrays ist jedoch nicht vollst&auml;ndig ausgef&uuml;hrt,
so dass es zu einer eingeschr&auml;nkten Funktionalit&auml;t kommt.  Dies ist ein 
Programmfehler.  Hinweise auf einzelne Einschr&auml;nkungen sind bei den einzelnen
Funktionen zu finden.
</p>
<p>Siehe die Funktion <code><a href="#make_005farray">make_array</a></code>
 f&uuml;r weitere Ausf&uuml;hrungen zu
Lisp-Arrays.
</p></dd></dl>





<hr size="6">
<a name="Strukturen"></a>
<a name="SEC36"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC35" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC37" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC19" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h2 class="section"> 5.6 Strukturen </h2>

<table class="menu" border="0" cellspacing="0">
<tr><td align="left" valign="top"><a href="#SEC37">5.6.1 Einf&uuml;hrung in Strukturen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
<tr><td align="left" valign="top"><a href="#SEC38">5.6.2 Funktionen und Variablen f&uuml;r Strukturen</a></td><td>&nbsp;&nbsp;</td><td align="left" valign="top">
</td></tr>
</table>

<hr size="6">
<a name="Einf_00fchrung-in-Strukturen"></a>
<a name="SEC37"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC36" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC38" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC36" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.6.1 Einf&uuml;hrung in Strukturen </h3>


<p>Maxima bietet eine einfache M&ouml;glichkeit, Daten in eine Struktur
zusammenzufassen.  Eine Struktur ist ein Ausdruck, in der die Argumente mit
ihren Feldnamen bezeichnet werden und die Struktur als Ganzes mit dem Namen des
Operators bezeichnet wird.  Der Wert eines Feldes kann ein beliebiger Ausdruck
sein.
</p>

<p>Eine Struktur wird mit der Funktion <code><a href="#defstruct">defstruct</a></code>
 definiert.  Die
Informationsliste <code><a href="#structures">structures</a></code>
 enth&auml;lt die vom Nutzer definierten
Strukturen.  Die Funktion <code><a href="#new">new</a></code>
 generiert eine neue Instanz einer
Struktur.  Mit dem Operator <code><a href="#g_t_0040">@</a></code>
 wird auf die Felder einer Struktur
zugegriffen.  Mit dem Kommando <code>kill(<var>S</var>)</code> wird die Definition der
Struktur <code>S</code> gel&ouml;scht.  Mit dem Kommando <code>kill(<var>x</var>@<var>a</var>)</code>
wird das Feld <var>a</var> der Instanz <var>x</var> einer Struktur gel&ouml;scht.
</p>

<p>In der 2D-Anzeige werden die Felder von Instanzen einer Struktur als eine
Gleichung angezeigt.  Die linke Seite der Gleichung ist der Feldname und die
rechte Seite der Gleichung ist der Wert des Feldes.  Die Gleichungen werden
nur in der Anzeige gezeigt und werden nicht als Teil der Struktur gespeichert.
In der 1D-Anzeige und bei der Ausgabe mit der Funktion <code><a href="maxima_4.html#grind">grind</a></code>
 werden
nur die Werte der Felder ausgegeben.
</p>

<p>Ein Feldname kann nicht als der Name einer Funktion verwendet werden.  Jedoch
kann ein Feld einen Lambda-Ausdruck enthalten.  Auch k&ouml;nnen die Felder nicht 
auf bestimmte Datentypen eingeschr&auml;nkt werden.  Einem Feld kann immer ein
beliebiger Ausdruck zugewiesen werden.  Weiterhin sind die Felder einer 
Struktur immer sichtbar.  Der Zugriff auf ein Feld kann nicht eingeschr&auml;nkt
werden.
</p>
<hr size="6">
<a name="Funktionen-und-Variablen-f_00fcr-Strukturen"></a>
<a name="SEC38"></a>
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC37" title="Previous section in reading order"> &lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next section in reading order"> &gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="#SEC36" title="Up section"> Up </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<h3 class="subsection"> 5.6.2 Funktionen und Variablen f&uuml;r Strukturen </h3>

<p><a name="structures"></a>
</p><dl>
<dt><u>Systemvariable:</u> <b>structures</b>
<a name="IDX180"></a>
</dt>
<dd>
<p><code>structures</code> ist eine Informationsliste, die die vom Benutzer mit der
Funktion <code><a href="#defstruct">defstruct</a></code>
 definierten Strukturen enth&auml;lt.
</p></dd></dl>

<p><a name="defstruct"></a>
</p><dl>
<dt><u>Funktion:</u> <b>defstruct</b><i> (<var>S</var>(<var>a_1</var>, &hellip;, <var>a_n</var>))</i>
<a name="IDX181"></a>
</dt>
<dt><u>Funktion:</u> <b>defstruct</b><i> (<var>S</var>(<var>a_1</var> = <var>v_1</var>, &hellip;, <var>a_n</var> = <var>v_n</var>))</i>
<a name="IDX182"></a>
</dt>
<dd>
<p>Definiert eine Struktur, als eine Liste mit den Feldnamen <var>a_1</var>, &hellip;,
<var>a_n</var> und dem Namen <var>S</var> f&uuml;r die Struktur.  Eine Instanz einer
Struktur ist ein Ausdruck mit dem Operator <var>S</var> und <var>n</var> Argumenten,
die die Werte der Felder sind.  Mit dem Kommando <code>new(<var>S</var></code> wird eine
neue Instanz einer Struktur <var>S</var> generiert.  Siehe auch <code><a href="#new">new</a></code>.
</p>


<p>Mit einem Symbol <var>a</var> als Argument wird der Name eines Feldes bezeichnet.
Mit einer Gleichung <code><var>a</var> = <var>v</var></code> wird der Name des Feldes als
<var>a</var> bezeichnet und ein Standardwert <var>v</var> definiert.  Der Standardwert
<var>v</var> kann ein beliebiger Ausdruck sein.
</p>

<p><code>defstruct</code> legt die Definition der Struktur <var>S</var> in der
Informationsliste <code><a href="#structures">structures</a></code>
 ab.
</p>

<p>Mit dem Kommando <code>kill(<var>S</var>)</code> wird die Definition einer Struktur
gel&ouml;scht und von der Informationsliste <code>structures</code> entfernt.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) defstruct (foo (a, b, c));
(%o1)                    [foo(a, b, c)]
(%i2) structures;
(%o2)                    [foo(a, b, c)]
(%i3) new (foo);
(%o3)                     foo(a, b, c)
(%i4) defstruct (bar (v, w, x = 123, y = %pi));
(%o4)             [bar(v, w, x = 123, y = %pi)]
(%i5) structures;
(%o5)      [foo(a, b, c), bar(v, w, x = 123, y = %pi)]
(%i6) new (bar);
(%o6)              bar(v, w, x = 123, y = %pi)
(%i7) kill (foo);
(%o7)                         done
(%i8) structures;
(%o8)             [bar(v, w, x = 123, y = %pi)]
</pre></dd></dl>

<p><a name="new"></a>
</p><dl>
<dt><u>Funktion:</u> <b>new</b><i> (<var>S</var>)</i>
<a name="IDX183"></a>
</dt>
<dt><u>Funktion:</u> <b>new</b><i> (<var>S</var> (<var>v_1</var>, &hellip;, <var>v_n</var>))</i>
<a name="IDX184"></a>
</dt>
<dd>
<p><code>new</code> erzeugt eine neue Instanz einer Struktur.
</p>

<p>Das Kommando <code>new(<var>S</var>)</code> erzeugt eine neue Instanz der Struktur <var>S</var>,
die mit der Funktion <code><a href="#defstruct">defstruct</a></code>
 definiert wurde.  Die Felder werden mit
den Standardwerten belegt, wenn die Definition der Struktur Standardwerte
enth&auml;lt.  Ansonsten erhalten die Felder keine Werte.
</p>

<p>Das Kommando <code>new(<var>S</var>(<var>v_1</var>, ..., <var>v_n</var>))</code> erzeugt eine neue
Instanz der Struktur <var>S</var>, wobei die Felder mit den Werten <var>v_1</var>,
&hellip;, <var>v_n</var> initialisiert werden.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) defstruct (foo (w, x = %e, y = 42, z));
(%o1)              [foo(w, x = %e, y = 42, z)]
(%i2) new (foo);
(%o2)               foo(w, x = %e, y = 42, z)
(%i3) new (foo (1, 2, 4, 8));
(%o3)            foo(w = 1, x = 2, y = 4, z = 8)
</pre></dd></dl>

<p><a name="g_t_0040"></a>
</p><dl>
<dt><u>Operator:</u> <b>@</b>
<a name="IDX185"></a>
</dt>
<dd>
<p><code>@</code> ist der Operator f&uuml;r den Zugriff auf ein Feld einer Struktur.  Der
Ausdruck <code><var>x</var>@<var>a</var></code> bezeichnet das Feld <var>a</var> der Instanz <var>x</var>
einer Struktur.  Der Feldname wird nicht ausgewertet.
</p>

<p>Hat das Feld <var>a</var> der Instanz <var>x</var> keinen Wert, wird der Ausdruck
<code><var>x</var>@<var>a</var></code> zu sich selbst ausgewertet.
</p>

<p><code>kill(<var>x</var>@<var>a</var>)</code> l&ouml;scht den Wert des Feldes <var>a</var> der Instanz
<var>x</var> einer Struktur.
</p>
<p>Beispiele:
</p>
<pre class="example">(%i1) defstruct (foo (x, y, z));
(%o1)                    [foo(x, y, z)]
(%i2) u : new (foo (123, a - b, %pi));
(%o2)           foo(x = 123, y = a - b, z = %pi)
(%i3) u@z;
(%o3)                          %pi
(%i4) u@z : %e;
(%o4)                          %e
(%i5) u;
(%o5)            foo(x = 123, y = a - b, z = %e)
(%i6) kill (u@z);
(%o6)                         done
(%i7) u;
(%o7)              foo(x = 123, y = a - b, z)
(%i8) u@z;
(%o8)                          u@z
</pre>

<p>Der Feldname wird nicht ausgewertet.
</p>
<pre class="example">(%i1) defstruct (bar (g, h));
(%o1)                      [bar(g, h)]
(%i2) x : new (bar);
(%o2)                       bar(g, h)
(%i3) x@h : 42;
(%o3)                          42
(%i4) h : 123;
(%o4)                          123
(%i5) x@h;
(%o5)                          42
(%i6) x@h : 19;
(%o6)                          19
(%i7) x;
(%o7)                    bar(g, h = 19)
(%i8) h;
(%o8)                          123
</pre></dd></dl>



<hr size="6">
<table cellpadding="1" cellspacing="1" border="0">
<tr><td valign="middle" align="left">[<a href="#SEC19" title="Beginning of this chapter or previous chapter"> &lt;&lt; </a>]</td>
<td valign="middle" align="left">[<a href="maxima_6.html#SEC39" title="Next chapter"> &gt;&gt; </a>]</td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left"> &nbsp; </td>
<td valign="middle" align="left">[<a href="maxima.html#SEC_Top" title="Cover (top) of document">Top</a>]</td>
<td valign="middle" align="left">[<a href="maxima_toc.html#SEC_Contents" title="Table of contents">Contents</a>]</td>
<td valign="middle" align="left">[<a href="maxima_79.html#SEC409" title="Index">Index</a>]</td>
<td valign="middle" align="left">[<a href="maxima_abt.html#SEC_About" title="About (help)"> ? </a>]</td>
</tr></table>
<p>
 <font size="-1">
  This document was generated by <em>Robert</em> on <em>Dezember, 3 2012</em> using <a href="http://texi2html.cvshome.org/"><em>texi2html 1.76</em></a>.
 </font>
 <br>

</p>
</body>
</html>
