Repository: chriskmanx/qmole
Catalog: QMOLEDEV/rox-filer-2.11/ROX-Filer/src/po/*.po
Languages: cs

source: <dir>
cs: <adresáø>

source: _Quiet
cs: _Potichu

source: Quiet
cs: Potichu

source: Don't confirm every operation
cs: Nepotvrzovat ka¾dou operaci

source: Name
cs: Jméno

source: Directory
cs: Adresáø

source: Expression:
cs: Výraz:

source: Find expression reference
cs: Najít referenci výrazu

source: <u>Quick Start</u> Just put the name of the file you're looking for in single quotes: <b>'index.html'</b> (to find a file called 'index.html') <u>Examples</u> <b>'*.htm', '*.html'</b> (finds HTML files) <b>IsDir 'lib'</b> (finds directories called 'lib') <b>IsReg 'core'</b> (finds a regular file called 'core') <b>! (IsDir, IsReg)</b> (is neither a directory nor a regular file) <b>mtime after 1 day ago and size > 1Mb</b> (big, and recently modified) <b>'CVS' prune, isreg</b> (a regular file not in CVS) <b>IsReg system(grep -q fred "%")</b> (contains the word 'fred') <u>Simple Tests</u> <b>IsReg, IsLink, IsDir, IsChar, IsBlock, IsDev, IsPipe, IsSocket, IsDoor</b> (types) <b>IsSUID, IsSGID, IsSticky, IsReadable, IsWriteable, IsExecutable</b> (permissions) <b>IsEmpty, IsMine</b> A pattern in single quotes is a shell-style wildcard pattern to match. If it contains a slash then the match is against the full path; otherwise it is against the leafname only. <u>Comparisons</u> <b>&lt;, &lt;=, =, !=, &gt;, &gt;=, After, Before</b> (compare two values) <b>5 bytes, 1Kb, 2Mb, 3Gb</b> (file sizes) <b>2 secs|mins|hours|days|weeks|years ago|hence</b> (times) <b>atime, ctime, mtime, now, size, inode, nlinks, uid, gid, blocks</b> (values) <u>Specials</u> <b>system(command)</b> (true if 'command' returns with a zero exit status; a % in 'command' is replaced with the path of the current file) <b>prune</b> (false, and prevents searching the contents of a directory).
cs: <u>Rychlý Start</u> Jméno souboru, který hledáte vlo¾te mezi jednoduché uvozovky: <b>'index.html'</b> (pokud chcete najít soubor 'index.html') <u>Pøíklady</u> <b>'*.htm', '*.html'</b> (najde HTML soubory) <b>IsDir 'lib'</b> (najde adresáøe 'lib') <b>IsReg 'core'</b> (najde bì¾ný soubor 'core') <b>! (IsDir, IsReg)</b> (není ani adresáø ani bì¾ný soubor) <b>mtime after 1 day ago and size > 1Mb</b> (velký a nedávno modifikovaný) <b>'CVS' prune, isreg</b> (bì¾ný soubor, který není v CVS) <b>IsReg system(grep -q fred "%")</b> (obsahuje slovo 'fred') <u>Jednoduché Testy</u> <b>IsReg, IsLink, IsDir, IsChar, IsBlock, IsDev, IsPipe, IsSocket, IsDoor</b> (typy) <b>IsSUID, IsSGID, IsSticky, IsReadable, IsWriteable, IsExecutable</b> (práva) <b>IsEmpty, IsMine</b> Výraz v jednoduchých závorkách je výraz shellového typu, mù¾e obsahovat magické znaky. Pokud obsahuje lomítko, kontroluje se shoda vzhledem k celé cestì; jinak pouze ke jménu bez cesty. <u>Porovnání</u> <b>&lt;, &lt;=, =, !=, &gt;, &gt;=, After, Before</b> (porovnají dvì hodnoty) <b>5 bytes, 1Kb, 2Mb, 3Gb</b> (velikosti souborù) <b>2 secs|mins|hours|days|weeks|years ago|hence</b> (èasy) <b>atime, ctime, mtime, now, size, inode, nlinks, uid, gid, blocks</b> (hodnoty) <u>Zvlá¹tní pøíkazy</u> <b>system(command)</b> (true pokud 'command' vrátil 0; % v 'command' je nahrazen cestou souèasného souboru) <b>prune</b> (false, zabrání prohledávání obsahu adresáøe).

source: Normally, you can just select a command from the menu (click on the arrow beside the command box). Sometimes, you need more... The format of a command is: <b>CHANGE, CHANGE, ...</b> Each <b>CHANGE</b> is: <b>WHO HOW PERMISSIONS</b> <b>WHO</b> is some combination of <b>u</b>, <b>g</b> and <b>o</b> which determines whether to change the permissions for the User (owner), Group or Others. <b>HOW</b> is <b>+</b>, <b>-</b> or <b>=</b> to add, remove or set exactly the permissions. <b>PERMISSIONS</b> is some combination of the letters <b>rwxXstugo</b> Bracketed text and spaces are ignored. <u>Examples</u> <b>u+rw</b>: the file owner gains read and write permission <b>g=u</b>: the group permissions are set to be the same as the user's <b>o=u-w</b>: others get the same permissions as the owner, but without write permission <b>a+x</b>: <b>a</b>ll get execute/access permission - same as <b>ugo+x</b> <b>a+X</b>: directories become accessable by everyone; files which were executable by anyone become executable by everyone <b>u+rw, go+r</b>: two commands at once! <b>u+s</b>: set the SetUID bit - often has no effect on script files <b>755</b>: set the permissions directly See the chmod(1) man page for full details.
cs: Normálnì staèí vybrat pøíkaz z nabídky (kliknìte na ¹ipku vedle pøíkazového boxu). Nìkdy je potøeba více... Formát pøíkazu je: <b>ZMÌNA, ZMÌNA, ...</b> Ka¾dá <b>ZMÌNA</b> je: <b>KDO JAK PRÁVA</b> <b>KDO</b> je kombinace <b>u</b>, <b>g</b> a <b>o</b>, která urèuje, jestli zmìnit práva pro U¾ivatele (vlastník), Skupinu nebo Ostatní. <b>JAK</b> je <b>+</b>, <b>-</b> nebo <b>=</b> pro pøidání, odebrání nebo pøesné nastavení práv. <b>PRÁVA</b> je kombinace znakù <b>rwxXstugo</b> Uzávorkovaný text a mezery jsou ignorovány. <u>Pøíklady</u> <b>u+rw</b>: vlastník souboru získá práva ètení a zápisu <b>g=u</b>: práva skupiny jsou nastavena na stejná práva jako má u¾ivatel <b>o=u-w</b>: ostatní získají stejná práva jako vlastník kromì práva zápisu <b>a+x</b>: <b>V</b>¹ichni získají právo provedení/pøístupu - stejné jako <b>ugo+x</b> <b>a+X</b>: adresáøe se stanou pøístupné pro v¹echny; soubory, které mìly pro nìkoho právo spu¹tìní se stanou spustitelné pro v¹echny <b>u+rw, go+r</b>: dva pøíkazy v jednom! <b>u+s</b>: nastaví SetUID bit - èasto nemá efekt u skriptù <b>755</b>: nastaví práva pøímo Pro úplné informace ètìte manovou stránku chmod(1).

source: Process terminated.
cs: Proces pøeru¹en.

source: There was one error.
cs: Nastala jedna chyba.

source: There were %d errors.
cs: Nastalo %d chyb.

source: ERROR reading
cs: CHYBA ètení

source: ' Done
cs: ' Hotovo

source: ERROR
cs: CHYBA

source: Yes
cs: Ano

source: No
cs: Ne

source: Asking child process to terminate...
cs: ®ádost o ukonèení potomka...

source: Trying to KILL run-away process...
cs: Zkou¹ím zabít run-away proces...

source: ?Delete %s'%s'?
cs: ?Smazat %s'%s'?

source: WRITE-PROTECTED
cs: CHRÁNÌNO PROTI ZÁPISU

source: 'Deleting '%s'
cs: Ma¾u '%s'

source: 'Directory '%s' deleted
cs: Adresáø '%s' smazán

source: ?Check '%s'?
cs: ?Zkontrolovat '%s'?

source: !Invalid find condition - change it and try again
cs: !Neplatná podmínka pro vyhledávání - zmìòte ji a zkuste znovu

source: '(while checking '%s')
cs: '(pøi kontrole '%s')

source: ?Change permissions of '%s'?
cs: ?Zmìnit práva '%s'?

source: 'Changing permissions of '%s'
cs: 'Mìním práva '%s'

source: !Invalid mode command - change it and try again
cs: !Neplatný mód pøíkazu - zmìòte jej a zkuste znovu

source: ?'%s' already exists - %s?
cs: ?'%s' u¾ existuje - %s?

source: merge contents
cs: spojit obsah

source: overwrite
cs: pøepsat

source: 'Trying copy anyway...
cs: 'Pøesto zkou¹ím zkopírovat...

source: ?Copy %s as %s?
cs: ?Zkopírovat %s jako %s?

source: 'Copying %s as %s
cs: 'Kopíruji %s jako %s

source: !ERROR: Destination already exists, but is not a directory
cs: !CHYBA: Cíl u¾ existuje, ale není to adresáø

source: !%s Failed to copy '%s'
cs: !%s Kopírování '%s' selhalo

source: ?'%s' already exists - overwrite?
cs: ?'%s' u¾ existuje - pøepsat?

source: 'Trying move anyway...
cs: 'Pøesto zkou¹ím zkopírovat...

source: ?Move %s as %s?
cs: ?Pøesunout %s na %s?

source: 'Moving %s as %s
cs: 'Pøesunuji %s na %s

source: !%s Failed to move %s as %s
cs: !%s Pøesunutí %s do %s selhalo

source: !ERROR: Can't copy object into itself
cs: !CHYBA: Nelze zkopírovat objekt do sebe

source: !ERROR: Can't move/rename object into itself
cs: !CHYBA: Nelze pøesunout/pøejmenovat objekt do sebe

source: 'Linking %s as %s
cs: 'Vytváøím odkaz %s na %s

source: ?Link %s as %s?
cs: ?Vytvoøit odkaz %s na %s?

source: 'Mounting %s
cs: 'Pøipojuji %s

source: 'Unmounting %s
cs: 'Odpojuji %s

source: ?Mount %s?
cs: ?Pøipojit %s?

source: ?Unmount %s?
cs: ?Odpojit %s?

source: !%s Mount failed
cs: !%s Pøipojení selhalo

source: !%s Unmount failed
cs: !%s Odpojení selhalo

source: ' Total: %s (
cs: ' Celkem: %s (

source: file
cs: soubor

source: files
cs: soubory

source: no directories)
cs: ¾ádné adresáøe)

source: directory
cs: adresáø

source: directories
cs: adresáøe

source: !No mount points selected!
cs: !Nejsou zvoleny ¾ádné body pro pøipojení!

source: ?Another search?
cs: ?Dal¹í hledání?

source: !'%s' is a symbolic link
cs: !'%s' je symbolický odkaz

source: You need to select some items to search through
cs: Musíte zvolit nìjaké polo¾ky ve kterých se má hledat

source: Find
cs: Najít

source: You need to select some items to count
cs: Musíte zvolit nìjaké polo¾ky pro spoèítání velikosti

source: Disk Usage
cs: Vyu¾ití disku

source: Mount / Unmount
cs: Pøipojit / Odpojit

source: ROX-Filer does not yet support mount points on your system. Sorry.
cs: ROX-Filer zatím nepodporuje pøipojovací body na Va¹em systému. Promiòte.

source: Delete
cs: Smazat

source: Force
cs: Bez potvrzení

source: Don't confirm deletion of non-writeable items
cs: Nepotvrzovat smazání polo¾ek, které nemají právo zápisu

source: Brief
cs: Struènì

source: Only log directories being deleted
cs: Vypisovat pouze smazané adresáøe?

source: You need to select the items whose permissions you want to change
cs: Musíte zvolit polo¾ky, u kterých chcete zmìnit práva

source: a+x (Make executable/searchable)
cs: a+x (Povolit spou¹tìní/pøístup)

source: a-x (Make non-executable/non-searchable)
cs: a-x (Zakázat spou¹tìní/pøístup)

source: u+rw (Give owner read+write)
cs: u+rw (Povolit vlastníkovi èíst+zapisovat)

source: go-rwx (Private - owner access only)
cs: go-rwx (Soukromé - pøístup povolen pouze vlastníkovi)

source: go=u-w (Public access, not write)
cs: go=u-w (Pøístup povolen v¹em, bez práva zápisu)

source: Permissions
cs: Pøístupová práva

source: Don't list processed files
cs: Nevypisovat zpracované soubory

source: Recurse
cs: Rekurzivnì

source: Also change contents of subdirectories
cs: Zmìnit i obsah podadresáøù

source: Command:
cs: Pøíkaz:

source: Type:
cs: Typ:

source: Copy
cs: Kopírovat

source: Newer
cs: Novìj¹í

source: Only over-write if source is newer than destination.
cs: Pøepsat jen kdy¾ je zdroj novìj¹í ne¾ cíl.

source: Move
cs: Pøesunout

source: Link
cs: Vytvoøit odkaz

source: Deleting items such as
cs: Ma¾u polo¾ky jako

source: Deleting the item
cs: Ma¾u polo¾ku

source: Deleting the items
cs: Ma¾u polo¾ky

source: and
cs: a

source: will affect some items on the pinboard or panel - really delete it?
cs: po¹kodí nìkteré polo¾ky na plo¹e nebo panelu - opravdu smazat?

source: will affect some items on the pinboard or panel - really delete them?
cs: po¹kodí nìkteré polo¾ky na plo¹e nebo panelu - opravdu smazat?

source: <missing label>
cs: <chybí název>

source: Help
cs: Nápovìda

source: Can't bookmark non-local resource '%s'
cs: Nelze vytvoøit zálo¾ku nelokálního zdroje '%s'

source: '%s' isn't a directory
cs: '%s' není adresáø

source: You should first select some rows to delete
cs: Nejprve zvolte nìjaké øádky ke smazání

source: Put the cursor on an entry in the list to move it
cs: Pro pøesun umístìte kurzor na polo¾ku seznamu

source: This item is already at the end
cs: Tato polo¾ka u¾ je na konci

source: Can't bookmark non-local directories like '%s'
cs: Nelze vytvoøit zálo¾ku nelokálních adresáøù jako je '%s'

source: Add New Bookmark
cs: Pøidat novou zálo¾ku

source: Edit Bookmarks
cs: Upravit zálo¾ky

source: Recently Visited
cs: Nedávno nav¹tívené

source: Can't open directory: %s
cs: Nelze otevøít adresáø: %s

source: lstat(2) failed: %s
cs: lstat(2) selhalo: %s

source: Internal error - bad info type
cs: Interní chyba - bad info type

source: Drag a directory here to bookmark it.
cs: K pøidání adresáøe mezi zálo¾ky jej sem pøetáhnìte.

source: XDS protocol error: leafname may not contain '/'
cs: Chyba protokolu XDS: leafname nemá obsahovat '/'

source: Sorry - I require a target type of text/uri-list or XdndDirectSave0.
cs: Promiòte - je vy¾adován cíl typu text/uri-list nebo XdndDirectSave0.

source: Sorry - I require a target type of text/uri-list or application/octet-stream.
cs: Promiòte - je vy¾adován cíl typu text/uri-list nebo application/octet-stream.

source: Unknown target
cs: Neznámý cíl

source: Remote app can't or won't send me the data - sorry
cs: Vzdálená aplikace mi nemù¾e nebo nechce poslat data - sorry

source: XDS protocol error: return code should be 'S', 'F' or 'E'
cs: chyba protokolu XDS: návratový kód by mìl být 'S', 'F' nebo 'E'

source: Sorry, can't display a menu of actions for a remote file / raw data.
cs: Promiòte, nemohu zobrazit nabídku akcí pro vzdálené soubory / nezpracovaná(syrová) data.

source: UntitledData
cs: NepojmenovanáData

source: Error saving file: %s
cs: Chyba pøi ukládání souboru: %s

source: No URIs in the text/uri-list (nothing to do!)
cs: ®ádné URI v text/uri-seznamu (není co dìlat)

source: Can't get data from remote machine (application/octet-stream not provided)
cs: Nelze získat data ze vzdáleného poèítaèe (application/octet-stream není poskytován)

source: Some of these files are on a different machine - they will be ignored - sorry
cs: Nìkteré z tìchto souborù jsou na vzdáleném poèítaèi - tyto soubory budou ignorovány - sorry

source: None of these files are on the local machine - I can't operate on multiple remote files - sorry.
cs: ®ádný z tìchto souborù není na tomto poèítaèi - nemohu pracovat s více vzdálenými soubory - promiòte.

source: Unknown action requested
cs: Po¾adována neznámá akce

source: Error getting file list: %s
cs: Chyba pøi získání seznamu souborù: %s

source: Show
cs: Ukázat

source: Show the current choice in a filer window
cs: Ukázat souèasný výbìr v oknì správce souborù

source: <nothing>
cs: <nic>

source: I can't show you the currently set item, because nothing is currently set. Drag something onto me!
cs: Nemohu zobrazit nastavenou polo¾ku, proto¾e ¾ádná není nastavena. Pøetáhnìte nìjakou na toto místo!

source: Sorry, you need to drop exactly one file onto the drop area.
cs: Promiòte, na toto místo musíte pøetáhnout právì jeden soubor.

source: Sorry, I can't use '%s' because it's not a local file.
cs: Promiòte, nemohu pou¾ít '%s' proto¾e to není místní soubor.

source: Can't access '%s': %s
cs: Nemám pøístup k '%s': %s

source: Error scanning '%s': %s
cs: Chyba pøi prozkoumávání '%s': %s

source: Error scanning '%s': %s
cs: Chyba pøi prozkoumávání '%s': %s

source: Do you want to unmount this device? Unmounting a device makes it safe to remove the disk.
cs: Chcete odpojit toto zaøízení? Odpojení disku umo¾òuje bezpeèné vyjmutí disku.

source: Unmount
cs: Odpojit

source: Directory missing/deleted
cs: Adresáø chybí/je smazán

source: Group %s is not set. Select some files and press Ctrl+%s to set the group. Press %s on its own to reselect the files later. Make sure NumLock is on if you use the keypad.
cs: Skupina %s není nastavena. Pro nastavení skupiny vyberte nìjaké soubory a stisknìte Ctrl+%s. Pozdìji mù¾ete tyto soubory znovu vybrat stisknutím %s. Ujistìte se, ¾e je zapnutý NumLock v pøípadì, ¾e pou¾íváte keypad.

source: Directory '%s' is not accessible
cs: Adresáø '%s' není pøístupný

source: Directory '%s' not found.
cs: Adresáø '%s' nenalezen.

source: Cancel
cs: Zavøít

source: Scanning,
cs: Prozkoumávám

source: Thumbs,
cs: Náhledy,

source: Symbolic link to
cs: Symbolický odkaz na

source: This filename is not valid UTF-8. You should rename it.
cs: Toto není platné jméno souboru v kódování UTF-8. Mìli by jste jej pøejmenovat.

source: Item no longer exists!
cs: Polo¾ka u¾ neexistuje

source: Size
cs: Velikost

source: Details
cs: Podrobnosti

source: Thumbnails
cs: Náhledy

source: Save As:
cs: Ulo¾ jako:

source: Unnamed
cs: Nepojmenované

source: Remote application wants to use Direct Save, but I can't read the XdndDirectSave0 (type text/plain) property.
cs: Vzdálená aplikace chce pou¾ít Direct Save, ale nemù¾u èíst XdndDirectSave0 (typ text/plain) vlastnost.

source: Drag the icon to a directory viewer (or enter a full pathname)
cs: Pøetáhnìte ikonu do prohlí¾eèe adresáøù (nebo zadejte celou cestu)

source: Attempt to read an XML file as a text file. File '%s' may be corrupted.
cs: Ètu XML soubor jako textový soubor. Soubor '%s' mù¾e být po¹kozen.

source: Error in '%s' file at line %d: "%s" This may be due to upgrading from a previous version of ROX-Filer. Open the Options window and click on Save. Further errors will be ignored.
cs: Chyba v souboru '%s' na øádku %d: "%s" Toto mù¾e být zpùsobeno upgradem z pøedchozí verze ROX-Fileru. Otevøete okno Mo¾nosti a kliknìte na Ulo¾it. Dal¹í chyby budou ignorovány.

source: Incorrect or missing line break in text/uri-list data
cs: Chybný nebo chybìjící konec øádku v text/uri-list datech

source: Note that you must save your choices and restart the filer for the new language setting to take full effect.
cs: Musíte ulo¾it Va¹e volby a restartovat filer, aby bylo nové nastavení jazyka plnì funkèní.

source: (click to set)
cs: (kliknìte pro nastavení)

source: About ROX-Filer...
cs: O programu ROX-Filer...

source: Show Help Files
cs: Zobrazit Nápovìdu

source: Manual
cs: Manuál

source: Options...
cs: Mo¾nosti...

source: Home Directory
cs: Domovský adresáø

source: File
cs: Soubor

source: Shift Open
cs: Shift Otevøení

source: Set Run Action...
cs: Nastavit spou¹tìcí akci...

source: Set Icon...
cs: Nastavit ikonu...

source: Edit Item
cs: Upravit polo¾ku

source: Show Location
cs: Zobrazit umístìní

source: Remove Item(s)
cs: Odebrat polo¾ku(y)

source: Nothing
cs: Nic

source: The location must contain at least one character!
cs: Umístìní musí obsahovat alespoò jeden znak!

source: You must first select some items to remove
cs: Nejprve musíte oznaèit nìjaké polo¾ky pro odebrání

source: You must open the menu over an item
cs: Nabídku musíte otevøít nad polo¾kou

source: You can only set the run action for a regular file
cs: Spou¹tìcí akci mù¾ete nastavit jen pro bì¾né soubory

source: Press the desired shortcut (eg, Control+F1)
cs: Stisknìte po¾adovanou zkratku (napø. Control+F1)

source: Failed to get keyboard grab!
cs: Chyba pøi snímání klávesové zkratky!

source: Clicking the icon opens:
cs: Kliknutí na ikonu otevøe:

source: The text displayed under the icon is:
cs: Text zobrazen pod ikonou je:

source: The keyboard shortcut is:
cs: Klávesová zkratka je:

source: Are you sure you want to open %d windows?
cs: Opravdu otevøít %d oken?

source: Show Info
cs: Zobrazit Info

source: (bad utf-8)
cs: (¹patné utf-8)

source: Show _Help Files
cs: Zobrazit _Help soubory

source: bytes
cs: bytù

source: Error:
cs: Chyba:

source: Real directory:
cs: Skuteèný adresáø:

source: Owner, Group:
cs: Vlastník, Skupina:

source: Size:
cs: Velikost:

source: Change time:
cs: Èas zmìny:

source: Modify time:
cs: Èas úpravy:

source: Access time:
cs: Èas pøístupu:

source: None
cs: ®ádný

source: Run action:
cs: Spou¹tìcí akce

source: Execute file
cs: Spustitelný soubor

source: <nothing yet>
cs: <zatím nic>

source: file(1) says... %s
cs: file(1) identifikuje polo¾ku jako... %s

source: Symbolic link
cs: Symbolický odkaz

source: ROX application
cs: ROX aplikace

source: mounted
cs: pøipojeno

source: unmounted
cs: odpojeno

source: Mount point for %s (%s)
cs: Bod pøipojení pro %s (%s)

source: Mount point (%s)
cs: Bod pøipojení (%s)

source: Try `ROX-Filer/AppRun --help' for more information.
cs: Zkuste `ROX-Filer/AppRun --help' pro více informací.

source: Try `ROX-Filer/AppRun -h' for more information.
cs: Zkuste `ROX-Filer/AppRun -h' pro více informací.

source: NOTE: Your system does not support long options - you must use the short versions instead.
cs: POZNÁMKA: Vá¹ systém nepodporuje dlouhé volby - musíte pou¾ít krátké verze.

source: Running as user '%s'
cs: Bì¾í pod u¾ivatelem '%s'

source: Compiled with GTK version %s
cs: Pøelo¾eno s GTK verzí %s

source: Running with GTK version %d.%d.%d
cs: Spu¹tìno s GTK verzí %d.%d.%d

source: features set at compile time
cs: vlastnosti nastavené v dobì pøekladu

source: Large File Support
cs: Podpora velkých souborù

source: GNOME-VFS library
cs: GNOME-VFS knihovna

source: Display
cs: Zobrazit

source: Icons View
cs: Ikonový pohled

source: Icons, With...
cs: Ikony, S...

source: Sizes
cs: Velikostmi

source: Types
cs: Typy

source: Times
cs: Èasy

source: List View
cs: Seznamový pohled

source: Bigger Icons
cs: Vìt¹í ikony

source: Smaller Icons
cs: Men¹í ikony

source: Automatic
cs: Automaticky

source: Sort by Name
cs: Tøídit podle jména

source: Sort by Type
cs: Tøídit podle typu

source: Sort by Date
cs: Tøídit podle data

source: Sort by Size
cs: Tøídit podle velikosti

source: Sort by Owner
cs: Tøídit podle vlastníka

source: Sort by Group
cs: Tøídit podle skupiny

source: Reversed
cs: Opaènì

source: Show Hidden
cs: Zobrazit skryté

source: Show Thumbnails
cs: Zobrazit náhledy

source: Refresh
cs: Obnovit

source: Copy...
cs: Kopírovat...

source: Rename...
cs: Pøejmenovat...

source: Link...
cs: Vytvoøit odkaz...

source: Open AVFS
cs: Otevøít AFVS

source: Send To...
cs: Poslat na...

source: Count
cs: Poèet

source: Select
cs: Vybrat

source: Select All
cs: Vybrat v¹e

source: Clear Selection
cs: Odznaèit vybrané

source: Invert Selection
cs: Invertovat výbìr

source: Select If...
cs: Vybrat pokud...

source: New
cs: Nový

source: Blank file
cs: Prázdný soubor

source: Window
cs: Okno

source: Parent, New Window
cs: Nadøazený adresáø, Nové okno

source: Parent, Same Window
cs: Nadøazený adresáø, Stejné okno

source: New Window
cs: Nové okno

source: Show Bookmarks
cs: Zobrazit zálo¾ky

source: Follow Symbolic Links
cs: Následovat symbolické odkazy

source: Resize Window
cs: Upravit velikost okna

source: Close Window
cs: Zavøít okno

source: Enter Path...
cs: Zadat cestu...

source: Shell Command...
cs: Shell pøíkaz

source: Xterm Here
cs: Xterm v tomto adresáøi

source: Switch to xterm
cs: Pøepnout do xtermu

source: You should Shift+Menu click over a file to send it somewhere
cs: Mìli by jste stisknout Shift a menu tlaèítko nad souborem, abyste jej nìkam poslali

source: Next Click
cs: Dal¹í kliknutí

source: %d items
cs: %d polo¾ek

source: Open unmounted
cs: Otevøít odpojené

source: Show Target
cs: Zobrazit cíl

source: Look Inside
cs: Podívat se dovnitø

source: Open As Text
cs: Otevøít jako text

source: _Relative link
cs: _Relativní odkaz

source: If on, the symlink will store the path from the symlink to the target file. Use this if the symlink and the target will be moved together. If off, the path from the root directory is stored - use this if the symlink may move but the target will stay put.
cs: Pokud je zapnuto, symbolický odkaz ulo¾í cestu ze symb. odkazu do cílového souboru. Pou¾ijte, pokud symb. odkaz a cíl budou pøesunuty spoleènì. Pokud je vypnuto, je ulo¾ena cesta z koøenového adresáøe - pu¾ijte, pokud se symb. odkaz mù¾e pøesunout, ale cíl ne.

source: New pathname is not absolute
cs: Nová cesta není absolutní

source: Symlink from '%s' already exists. Replace it with a link to '%s'?
cs: Symbolický odkaz z '%s' u¾ existuje. Nahradit ho odkazem na '%s'?

source: _Replace
cs: _Nahradit

source: Create
cs: Vytvoøit

source: NewDir
cs: Nový adresáø

source: Error creating '%s': %s
cs: Chyba pøi vytváøení '%s': %s

source: NewFile
cs: Nový soubor

source: Error creating file: could not find the template for %s
cs: Chyba pøi vytváøení souboru: nemohu najít ¹ablonu pro %s
