Repository: chriskmanx/qmole
Catalog: QMOLEDEV/rox-filer-2.11/ROX-Filer/src/po/*.po
Languages: cs

source: The `Send To' menu provides a quick way to send some files to an application. The applications listed are those in the following directories: %s %s The `Send To' menu may be opened by Shift+Menu clicking over a file. Advanced use: You can also create subdirectories called `.text_html', `.text', etc which will only be shown for files of that type. `.group' is shown only when multiple files are selected.
cs: Menu `Poslat na' je rychlý zpùsob, jak poslat soubory nìjaké aplikaci. Nabízené aplikace jsou ty, které jsou v tìchto adresáøích: %s %s Menu `Poslat na' je mo¾né otevøít pomocí Shift+Menu kliknutí na souboru. Pokroèilé pou¾ití: Mù¾ete také vytváøet podadresáøe nazvané `.text_html', `.text', atd., které budou zobrazeny pouze pro daný typ. `.group' je zobrazeno jen kdy¾ je vybráno více souborù

source: I'll show you your SendTo directory now; you should symlink (Ctrl+Shift drag) any applications you want into it.
cs: Nyní zobrazím Vá¹ `Poslat na' adresáø; meli by jste vytvoøit symbolické odkazy (Ctrl+Shift pøetáhnutí) na aplikace, které tam chcete mít.

source: Your CHOICESPATH variable setting prevents customisations - sorry.
cs: Nastavení Va¹í promìnné CHOICESPATH znemo¾òuje zmìny - promiòte.

source: Customise
cs: Nastavit

source: This is already the canonical name for this directory.
cs: Toto u¾ je kanonické jméno pro tento adresáø.

source: You can't open a second view onto this directory because the `Unique Windows' option is turned on in the Options window.
cs: Nemù¾ete otevøít druhý pohled na tento adresáø, proto¾e volba `Unikátní okna' je zapnuta v oknì Mo¾nosti.

source: Copy ... ?
cs: Kopírovat ... ?

source: Rename ... ?
cs: Pøejmenovat ... ?

source: Symlink ... ?
cs: Symbolický odkaz ... ?

source: Shift Open ... ?
cs: Shift Otevøení ... ?

source: Set run action for ... ?
cs: Nastavit spou¹tìcí akci pro ... ?

source: Set icon for ... ?
cs: Nastavit ikonu pro ... ?

source: Send ... to ... ?
cs: Poslat ... na ... ?

source: DELETE ... ?
cs: SMAZAT ... ?

source: Count the size of ... ?
cs: Spoèítat velikost ... ?

source: Set permissions on ... ?
cs: Nastavit práva pro ... ?

source: Search inside ... ?
cs: Hledat uvnitø ... ?

source: Look inside ... ?
cs: Podívat se do ... ?

source: You cannot do this to more than one item at a time
cs: Nemù¾ete pou¾ít souèasnì na více polo¾ek

source: Rename
cs: Pøejmenovat

source: Symlink
cs: Symbolický odkaz

source: To set a keyboard short-cut for a menu item: - Open the menu over a filer window, - Move the pointer over the item you want to use, - Press the key you want attached to it. The key will appear next to the menu item and you can just press that key without opening the menu in future.
cs: Pro nastavení klávesové zkratky pro polo¾ku nabídky: - Otevøete nabídku ve správci souborù, - Pøesuòte kurzor na polo¾ku, kterou chcete pou¾ít , - Stisknìte klávesouvou zkratku, kterou jí chcete pøiøadit. Zkratka se pøí¹tì objeví vedle polo¾ky nabídky a mù¾ete rovnou pou¾ívat zkratku bez otevírání nabídky.

source: Set keyboard shortcuts
cs: Nastavit klávesovou zkratku

source: Goto:
cs: Jít do:

source: Select If:
cs: Vybrat pokud:

source: Enter the name of a file and I'll display it for you. Press Tab to fill in the longest match. Escape to close the minibuffer.
cs: Zadejte jméno souboru a já ho zobrazím. Stisknìte Tab pro doplnìní nejdel¹ího odpovídajícího jména, Escape pokud chcete zavøít minibuffer.

source: Enter a shell command to execute. Click on a file to add it to the buffer.
cs: Zadejte shellový pøíkaz k provedení. Kliknìte na soubor pro jeho pøidání do bufferu.

source: Invalid Find condition
cs: Neplatná podmínka pro Hledání

source: ROX-Filer has converted your Options file to the new XML format
cs: ROX-Filer pøevedl Vá¹ soubor s nastavením do nového XML formátu

source: (use default)
cs: (pou¾ít defaultní)

source: Internal error: %s unreadable
cs: Intern9 chyba: %s nejde pøeèíst

source: Options
cs: Mo¾nosti

source: _Revert
cs: _Vrátit zpìt

source: Restore all choices to how they were when the Options box was opened.
cs: Obnovit v¹echny volby tak jak byly pøi otevøení boxu Mo¾nosti.

source: Choices will be saved as: %s
cs: Volby budou ulo¾eny jako: %s

source: (saving disabled by CHOICESPATH)
cs: (ulo¾ení není povoleno kvùli CHOICESPATH)

source: Error saving %s: %s
cs: Chyba pøi ukládání %s: %s

source: Missing '='
cs: Chybí '='

source: Your old panel file has been converted to the new XML format.
cs: Vá¹ starý soubor s nastavením panelu byl oøeveden do nového XML formátu.

source: You have tried to close a panel via the window manager - I usually find that this is accidental... really close?
cs: Zkusili jste zavøít panel pøes správce oken - to mù¾e zpùsobit problémy... opravdu zavøít?

source: Missing < or > in panel config file
cs: V konfiguraèním souboru panelu chybí < nebo >

source: Error saving panel %s: %s
cs: Chyba pøi ukládání panelu %s: %s

source: Applet quit without ever creating a widget!
cs: Applet skonèil ani¾ by vytvoøil widget!

source: Error running applet: %s
cs: Chyba pøi spu¹tìní appletu: %s

source: Your old pinboard file has been converted to the new XML format.
cs: Vá¹ starý soubor s nastavením plochy byl pøeveden do nového XML formátu.

source: The backdrop handler must be an application directory. Drag an application directory into the Set Backdrop dialog box, or (for programmers) pass it to the SOAP SetBackdropApp method.
cs: Ovladaè pro nastavení pozadí musí být aplikaèní adresáø. Pøetáhnìte aplikaèní adresáø na dialog Nastavení pozadí, nebo (pro programátory) jej pøedejte SOAP metodì SetBackdropApp.

source: You can only set the backdrop to an image or to a program which knows how to manage ROX-Filer's backdrop. Programmers: the application's AppInfo.xml must contain the CanSetBackdrop element, as described in ROX-Filer's manual.
cs: Na pozadí mù¾ete nastavit pouze obrázek nebo aplikaci, která ví, jak ovládat pozadí ROX-Fileru. Programátorùm: AppInfo.xml aplikace musí obsahovat CanSetBackdrop element, jak je popsáno v manuálu ROX-Fileru.

source: Set backdrop
cs: Nastavit pozadí

source: Choose a style and drag an image in:
cs: Vyberte styl a pøetáhnìte obrázek na:

source: Centre the image without scaling it
cs: Umístit obrázek do støedu a nemìnit jeho velikost

source: Centre
cs: Umístit do støedu

source: Scale the image to fit the backdrop area, without distorting it
cs: Zmìnit velikost obrázku na velikost plochy a nezkreslovat ho

source: Scale
cs: Zmìnit velikost

source: Stretch the image to fill the backdrop area
cs: Roztáhnout obrázek na velikost plochy

source: Stretch
cs: Roztáhnout

source: Tile the image over the backdrop area
cs: Umístit obrázek na plo¹e jako dla¾dice

source: Tile
cs: Dla¾dice

source: Drop an image here
cs: Sem umístìte obrázek

source: No pinboard was in use... the 'Default' pinboard has been selected. Use 'rox -p=Default' to turn it on in future.
cs: Nebylo pou¾ito ¾ádné pozadí... 'Default' pozadí bylo vybráno. Pou¾ijte 'rox -p=Default' pro zapnutí.

source: Only files (and certain applications) can be used to set the background image.
cs: Jen soubory (a nìkteré aplikace) mohou být pou¾ity pro nastavení obrázku na pozadí.

source: Missing '>' in icon label
cs: Chybí '>' ve jmenovce ikony

source: Missing ',' after icon label
cs: Chybí ',' za jmenovkou ikony

source: Error saving pinboard %s: %s
cs: Chyba pøi ukládání pozadí %s: %s

source: Backdrop...
cs: Nastavit pozadí...

source: Error loading backdrop image: %s Backdrop removed.
cs: Chyba pøi naèítání pozadí: %s Pozadí odstranìno.

source: Can't delete thumbnails in %s: %s
cs: Nemohu smazat náhledy v %s: %s

source: There are no thumbnails to delete
cs: Nejsou ¾ádné náhledy ke smazání

source: Purge thumbnails disk cache
cs: Smazat náhledy ulo¾ené v ke¹i

source: Unknown style '%s'
cs: Neznámý styl '%s'

source: Unknown details type '%s'
cs: Neznámý typ '%s' podrobností

source: Unknown sorting type '%s'
cs: Neznámý typ tøídìní '%s'

source: Invalid .gmo translation file (too short): %s
cs: Neplatný .gmo soubor pøekladu (pøíli¹ krátký): %s

source: Invalid .gmo translation file (GNU magic number not found): %s
cs: Neplatný .gmo soubor pøekladu (GNU magické èíslo nenalezeno): %s

source: Program %s not found - deleted?
cs: Program %s nenalezen - je smazán?

source: File doesn't exist, or I can't access it: %s
cs: Soubor neexistuje nebo k ìnu nemám pøístup: %s

source: I don't know how to open '%s'
cs: Nevím, jak otevøít '%s'

source: Application: This is an application directory - you can run it as a program, or open it (hold down Shift while you open it). Most applications provide their own help here, but this one doesn't.
cs: Aplikace: Toto je aplikaèní adresáø - mù¾ete ho spou¹tìt jako program nebo ho otevøít (pøi jeho otevírání stidknìte Shift). Vìt¹ina aplikací má na tomto místì vlastní nápovìdu, tato aplikace ale ne.

source: Could not send data to program: %s
cs: Nemohu poslat data programu: %s

source: Could not read link: %s
cs: Nemohu èíst odkaz: %s

source: Broken symlink (or you don't have permission to follow it): %s
cs: Poru¹ený symbolický odkaz (nebo nemáte práva pro jeho následování): %s

source: Close
cs: Zavøít

source: Close filer window
cs: Zavøít okno správce souborù

source: Up
cs: Nahoru

source: Change to parent directory
cs: Pøejít do vy¹¹ího adresáøe

source: Home
cs: Domù

source: Change to home directory
cs: Pøejít do domovského adresáøe

source: Bookmarks
cs: Zálo¾ky

source: Bookmarks menu
cs: Menu zálo¾ek

source: Scan
cs: Naèíst

source: Rescan directory contents
cs: Znovu naèíst obsah adresáøe

source: Change icon size
cs: Zmìnit velikost ikony

source: Automatic size mode
cs: Mód Automatická velikost

source: Show extra details
cs: Zobrazit extra podrobnosti

source: Hidden
cs: Skrytý

source: Show/hide hidden files
cs: Zobrazit/skrýt skryté soubory

source: Show ROX-Filer help
cs: Zobrazit nápovìdu programu ROX-Filer

source: (%u hidden)
cs: (%u skrytých)

source: items
cs: polo¾ek

source: item
cs: polo¾ka

source: No items%s
cs: ®ádné polo¾ky%s

source: %u selected (%s)
cs: %u vybrán (%s)

source: Sym link
cs: Symbolický odkaz

source: Mount point
cs: Bod pøipojení

source: App dir
cs: Aplikaèní adresáø

source: Dir
cs: Adresáø

source: Char dev
cs: Znakové zaøízení

source: Block dev
cs: Blokové zaøízení

source: Pipe
cs: Roura

source: Socket
cs: Soket

source: Unknown
cs: Neznámé

source: Executable '%s' is world-writeable! Refusing to run. Please change the permissions now (this problem may have been caused by a bug in earlier versions of the filer). Having (non-symlink) run actions world-writeable means that other people who use your computer can replace your run actions with malicious versions. If you trust everyone who could write to these files then you needn't worry. Otherwise, you should check, or even just delete, all the existing run actions.
cs: Spustitelný '%s' má právo zápisu pro v¹echny! Odmítám spustit. Zmìòte teï jeho práva (tento problém mù¾e být zpùsoben chybou v døívìj¹ích verzích správce souborù). Právo zápisu (kromì symb. odkazù) u spustitelných souborù znamená, ¾e ostatní lidé, kteøí pou¾ívají Vá¹ poèítaè, mohou nahradit Va¹e programy ¹patnou verzí. Pokud vìøíte ka¾dému, kdo mù¾e do tìchto souborù zapisovat, pak se nemusíte obávat. Jinak by jste mìli zkontrolovat, nebo je¹tì lépe smazat, v¹echny existující programy.

source: go-w (Fix security problem)
cs: go-w (Opravit bezpeènostní problém)

source: Enter a shell command which will load "$@" into a suitable program. Eg: gimp "$@"
cs: Zadejte shellový pøíkaz, který otevøe "$@" ve vhodném programu. Napø.: gimp "$@"

source: This is not a program! Give me an application instead!
cs: Toto není program! Zadejte aplikaci!

source: No run action defined
cs: Není definována ¾ádná spou¹tìcí akce

source: Error in handler %s: %s
cs: Chyba v ovladaèi %s: %s

source: Invalid application %s (bad AppRun)
cs: Neplatná aplikace %s (¹patný AppRun)

source: Non-executable %s
cs: Nespustitelný %s

source: Set run action
cs: Nastavit spou¹tìcí akci

source: If a handler for the specific type isn't set up, use this as the default.
cs: Pokud není nastaven ovladaè pro specifický typ, pou¾ije se tento jako defaultní.

source: Set default for all `%s/<anything>'
cs: Nastavit jako defaultní pro v¹echny typy `%s/<anything>'

source: Use this application for all files with this MIME type.
cs: Pou¾ít tuto aplikaci pro v¹echny soubory s tímto MIME typem.

source: Only for the type `%s' (%s/%s)
cs: Pouze pro typ `%s' (%s/%s)

source: Drop a suitable application here
cs: Pøetáhnìte sem vhodnou aplikaci

source: OR
cs: NEBO

source: Enter a shell command:
cs: Zadejte shellový pøíkaz

source: A run action already exists and is quite a big program - are you sure you want to delete it?
cs: Spou¹tìcí akce u¾ existuje a je to celkem velký program - chcete ji smazat?

source: Can't remove %s: %s
cs: Nelze odebrat %s: %s

source: Choices saving is disabled by CHOICESPATH variable
cs: Ulo¾ení Choices je zakázáno promìnnou CHOICESPATH

source: The pathname you gave does not exist. The icon has not been changed.
cs: Cesta, kterou jste zadali, neexistuje. Ikona nebyla zmìnìna.

source: Unable to load image file -- maybe it's not in a format I understand, or maybe the permissions are wrong? The icon has not been changed.
cs: Nejde naèíst obrázek -- mo¾ná je ve formátu, který neznám, nebo jsou ¹patná pøístupová práva? Ikona nebyla zmìnìna.

source: Really delete icon '%s'?
cs: Opravdu smazat ikonu '%s'?

source: Can't delete '%s': %s
cs: Nemohu smazat '%s': %s

source: Set icon
cs: Nastavit ikonu

source: Use a copy of the image as the default for all files of these MIME types.
cs: Pou¾ít kopii obrázku jako defaultní pro v¹echny soubory tohoto MIME typu.

source: Set icon for all `%s/<anything>'
cs: Nastavit ikonu pro v¹echny `%s/<anything>'

source: Use a copy of the image for all files of this MIME type.
cs: Pou¾ít kopii obrázku pro v¹echny soubory tohoto MIME typu.

source: Add the file and image filenames to your personal list. The setting will be lost if the image or the file is moved.
cs: Pøidat jméno souboru a obrázku do osobního seznamu. Nastavení bude ztraceno, pokud obrázek nebo soubor bude pøesunut.

source: Only for the file `%s'
cs: Pouze pro soubor `%s'

source: Copy the image inside the directory, as a hidden file called '.DirIcon'. All users will then see the icon, and you can move the directory around safely. This is usually the best option if you can write to the directory.
cs: Zkopírovat obrázek do adresáøe jako skrytý soubor nazvaný '.DirIcon'. V¹ichni u¾ivatelé potom uvidí tuto ikonu a Vy mù¾ete bezpeènì pøesunovat adresáø. Toto je obvykle nejlep¹í volba v pøípadì, ¾e mù¾ete zapisovat do adresáøe.

source: Copy image into directory
cs: Zkopírovat obrázek do adresáøe

source: Drop an icon file here
cs: Sem umístìte ikonu

source: Setting icon disabled by CHOICESPATH
cs: Nastavení ikony zakázáno kvùli CHOICESPATH

source: Error creating image '%s': %s
cs: Chyba pøi vytváøení obrázku '%s': %s

source: _Name
cs: _Jméno

source: _Type
cs: _Typ

source: _Permissions
cs: _Práva

source: _Owner
cs: _Vlastník

source: _Group
cs: _Skupina

source: _Size
cs: _Velikost

source: Last _Modified
cs: Poslední _Modifikace

source: Translation
cs: Pøeklad

source: Language
cs: Jazyk

source: Use the LANG environment variable
cs: Pou¾ít promìnnou prostøedí LANG

source: Chinese (traditional)
cs: Èínsky (tradièní)

source: Chinese (simplified)
cs: Èínsky (zjednodu¹ená)

source: Danish
cs: Dánsky

source: Dutch
cs: Holandsky

source: English (no translation)
cs: Anglicky (bez pøekladu)

source: French
cs: Francouzsky

source: German
cs: Nìmecky

source: Hungarian
cs: Maïarsky

source: Japanese
cs: Japonsky

source: Norwegian
cs: Norsky

source: Italian
cs: Italsky

source: Polish
cs: Polsky

source: Russian
cs: Rusky

source: Spanish
cs: ©panìlsky

source: Swedish
cs: ©védsky

source: Filer windows
cs: Okna správce souborù

source: Auto-resize filer windows
cs: Automaticky mìnit velikost oken správce souborù

source: Never automatically resize
cs: Nikdy automaticky nìmìnit velikost

source: You'll have to resize windows manually, using the window manager, the `Resize Window' menu entry or by double-clicking on the window background.
cs: Budete muset mìnit velikost oken ruènì pomocí správce oken, pomcí nabídky `Resize Window' v menu nebo pomocí dvojkliku na pozadí okna.

source: Resize when changing the display style
cs: Zmìnit velikost pøi zmìnì stylu pohledu

source: Changing the size of the icons or which details are displayed will resize the window for you.
cs: Zmìna velikosti ikon nebo toho, které podrobnosti mají být zobrazeny, zmìní velikost okna.

source: Always resize
cs: V¾dy mìnit velikost

source: The filer will resize windows whenever it seems useful (that is, when changing directory or display style).
cs: Správce souborù bude mìnit velikost oken kdykoliv to bude potøeba (pøi zmìnì adresáøe nebo stylu pohledu).

source: Largest window size:
cs: Nejvìt¹í velikost okna

source: The largest size, as a percentage of the screen size, that the auto-resizer will resize a window to.
cs: Nejvìt¹í velikost v procentech plochy obrazovky, která mù¾e být pou¾ita pøi automatické zmìnì velikosti.

source: Window behaviour
cs: Chování okna

source: Short titlebar flags
cs: Krátké popisky v titulku

source: Unique windows
cs: Unikátní okna

source: If you open a directory and that directory is already displayed in another window, then this option causes the other window to be closed.
cs: Pokud otevøete adresáø a tento adresáø je u¾ zobrazen v jimém, oknì, potom toto nastavení zpùsobí, ¾e jiná okna budou zavøena.

source: New window on button 1
cs: Nové okno po stisku tlaèítka 1

source: Clicking with mouse button 1 (usually the left button) opens a directory in a new window with this turned on. Clicking with the button-2 (middle) will reuse the current window.
cs: Tato volba zpùsobí, ¾e kliknutí tlaèítka 1 na my¹i (obvykle levé tlaèítko) otevøe adresáø v v novém oknì. Kliknutí tlaèítka 2 na my¹i (prostøední) pou¾ije souèasné okno.

source: Single-click navigation
cs: Procházení pomocí jednoho kliknutí

source: Clicking on an item opens it with this on. Hold down Control to select the item instead. If off, clicking once selects an item; double click to open things.
cs: Tato volba zpùsobí, ¾e kliknutí na polo¾ku tuto plo¾ku otevøe. Pokud ji chcete vybrat, musíte pøi kliknutí dr¾et Control. Pokud není tato volba zapnutá, jedno kliknutí polo¾ku vybere, dvojklik ji otevøe.things.

source: Sorting
cs: Tøídìní

source: Directories come first (for sort by name)
cs: Adresáøe jsou zobrazovány první (u tøídìní podle jména)

source: If this is on then directories will always appear before anything else when sorting by name.
cs: Tato volba zpùsobí, ¾e pokud se tøídí podle jména, adresáøe budou zobrazeny v¾dy pøed v¹ím ostatním.

source: Capitalised names first (for sort by name)
cs: Velká písmena první (u tøídìní podle jména)

source: If on, all filenames starting with a capital letter come before filenames starting with lowercase ones.
cs: Tato volba zpùsobí, ¾e jména souborù zaèínající velkým písmenem mají pøednost pøed soubory, které zaèínají malým písmenem

source: Default settings for new windows
cs: Defaultní nastavení pro nová okna

source: Inherit options from source window
cs: Zdìdit nastavení ze zdrojového okna

source: If this is on then display options for a new window are inherited from the source window if possible, otherwise they are set to the defaults below.
cs: Tato volba zpùsobí, ¾e nastavení zobrazení pro nové okno je zdìdìno od zdrojového okna, pokud je to mo¾né, jinak je nastaveno na ní¾e uvedené defaultní hodnoty.

source: View type:
cs: Typ pohledu:

source: Sort by:
cs: Tøídit podle:

source: Type
cs: Typu

source: Date
cs: Data

source: Show hidden files
cs: Zobrazovat skryté soubory

source: If this is on then files whose names start with a dot are shown too, otherwise they are hidden.
cs: Tato volba zpùsobí, ¾e jsou zobrazovány i soubory, jejich¾ jméno zaèíná teèkou, jinak jsou tyto soubory skryté.

source: Icon View
cs: Ikonový pohled

source: Default size:
cs: Defaultní velikost

source: Huge Icons
cs: Obrovské ikony

source: Large Icons
cs: Velké ikony

source: Small Icons
cs: Malé ikony

source: Default details:
cs: Defaultní podrobnosti:

source: No details
cs: ®ádné podrobnosti

source: Automatic small icons:
cs: Automaticky nastavit malé ikony:

source: Change at:
cs: Zmìnit u:

source: When automatic icon sizing is selected: If the directory contains this many items then it will be shown using Small Icons, otherwise Large Icons will be used.
cs: Pokud je nastaveno automatické nastavení velikosti ikon: Pokud adresáø obsahuje alespoò tolik polo¾ek, potom jsou zobrazovány malé ikony, jinak jsou pou¾ity velké ikony

source: Max width (Large icons):
cs: Maximální velikost (Velké ikony):

source: pixels
cs: pixelù

source: Text wider than this is broken onto two lines in Large Icons mode. In Huge Icons mode, text is wrapped when 50% wider than this.
cs: Text, který je ¹ir¹í je rozdìlen na dva øádky, pokud je pou¾it mód Velké ikony. V módu Obrovské ikony je text rozdìlen, kdy¾ je ¹ir¹í o 50%.

source: (Small Icons):
cs: (Malé ikony)

source: Maximum width for the text beside a Small Icon.
cs: Maximání ¹íøka textu vedle malých ikon.

source: Show column headings
cs: Ukazovat nadpisy sloupcù

source: If this is on then column headings will be shown in the list view.
cs: Tato volb zpùsobí, ¾e nadpisy sloupcù budou zobrazeny v seznamovém pohledu.

source: Tools/Minibuffer
cs: Nástroje/Minibuffer

source: Toolbar
cs: Panel nástrojù

source: Toolbar type:
cs: Typ panelu nástrojù:

source: Icons only
cs: Pouze ikony

source: Text under icons
cs: Text pod ikonami

source: Text beside icons
cs: Text vedle ikon

source: Show totals of items
cs: Zobrazovat souhrnné informace o polo¾kách

source: Show the number of items displayed in a filer window, as well as the number of hidden items (if any). When there's a selection, show the number of selected items and their combined size.
cs: Zobrazuje poèet polo¾ek zobrazených v oknì a poèet skrytých souborù (pokud existují. Pokud jsou vybrány nìjaké polo¾ky, je zobrazen jejich poèet a celková velikost.

source: Select the buttons you want on the bar:
cs: Vyberte tlaèítka, které mají být zobrazeny na panelu:

source: Beep if Tab-completion fails
cs: Pípnout, pokud Tab-doplnìní sel¾e

source: When using the `Enter Path...' minibuffer and Tab is pressed, beep if nothing happens (eg, because there are several possibilities and the next letter varies).
cs: Pøi pou¾ívání minibufferu `Zadat cestu...' a pøi stisku Tab pípnout, kdy¾ se nic nestane (napø. proto¾e existuje více mo¾ností závislých na dal¹ím znaku).

source: Beep if there are several matches
cs: Pípnout, kdy¾ existuje více shod

source: When using the `Enter Path...' minibuffer and Tab is pressed, beep if there is more than one matching file, even though some more letters were added.
cs: Pøi pou¾ívání minibufferu `Zadat cestu...' a pøi stisku Tab pípnout, kdy¾ existuje více odpovídajících souborù, even though some more letters were added.

source: When thumbnails are turned on, each image file in a directory is loaded and a small thumbnail of it is shown.
cs: Pokud jsou zapnuty náhledy, ka¾dý obrázek v adresáøi je naèten a je zobrazen jeho malý náhled.

source: Show image thumbnails
cs: Zobrazovat náhledy obrázkù

source: This is the default setting for new windows. Use the Display menu to turn thumbnails on and off for individual windows.
cs: Toto je dafultní nastavení pro nová okna. Pou¾ijte menu Zobrazit pro zapnutía vypnutí náhledù v individuálních oknech.

source: Thumbnails cache
cs: Ke¹ náhledù
