Repository: chriskmanx/qmole
Catalog: QMOLEDEV/rox-filer-2.11/ROX-Filer/src/po/*.po
Languages: cs

source: To speed things up, the generated thumbnails are stored in the hidden ~/.thumbnails directory. Click here to remove all the cached thumbnails. They will be created again as needed.
cs: Kvùli urychlení jsou vygenerované náhledy ulo¾eny ve skrytém adresáøi ~/.thumbnails. Kliknìte sem pro odtranìní v¹ech ke¹ovaných náhledù. V pøípadì potøeby budou znovu vytvoøeny.

source: Pinboard
cs: Plocha

source: When using a pinboard, you can drag files and applications onto the desktop background to create shortcuts to them.
cs: Pokud pou¾íváte plochu, mù¾ete pøetáhnout soubory a aplikace na plochu a tím na nì vytvoøíte odkaz.

source: Appearance
cs: Vzhled

source: Foreground:
cs: Popøedí

source: Text shadow:
cs: Stín textu:

source: Background:
cs: Pozadí

source: Thin
cs: Tenký

source: Thick
cs: Tlustý

source: Use custom font:
cs: Pou¾ít vlastní písmo:

source: The font used for the text displayed under the icons
cs: Písmo pou¾ité pro text zobrazovaný pod ikonami

source: Pinboard behaviour
cs: Chování plochy

source: Single-click to open
cs: Jednoduché kliknutí pro otevøení

source: Keep icons within screen limits
cs: Dr¾et ikony v mezích obrazovky

source: If this is set, pinboard icons are always kept completely within screen limits, including the label.
cs: Tato volba zpùsobí, ¾e ikony na plo¹e jsou v¾dy úplnì umístìny v mezích obrazovky vèetnì jejich popisku.

source: Icon grid step:
cs: Møí¾ka pro umístìní ikon:

source: Fine
cs: Jemná

source: Use a 2-pixel grid for positioning icons on the desktop.
cs: Pou¾ije se 2-pixelová møí¾ka pro umís»ování ikon na plo¹e.

source: Medium
cs: Støední

source: Use a 16-pixel grid for positioning icons on the desktop.
cs: Pou¾ije se 16-pixelová møí¾ka pro umís»ování ikon na plo¹e.

source: Coarse
cs: Hrubá

source: Use a 32-pixel grid for positioning icons on the desktop.
cs: Pou¾ije se 32-pixelová møí¾ka pro umís»ování ikon na plo¹e.

source: Iconified windows
cs: Ikonifikovaná okna

source: Most window managers provide a way to iconify (or 'minimise') windows, and various programs, including ROX-Filer, can be used to display the iconified windows.
cs: Vìt¹ina správcù oken umo¾òuje ikonifikovat (nebo 'minimalizovat') okna, a rùzné programy, vèetnì ROX-Fileru, mohou být pou¾ity ke zobrazování ikonifikovaných oken.

source: Show iconified windows
cs: Zobrazovat ikonifikovaná okna

source: If this option is on, the filer will show each iconified window as a small button on the pinboard. Requires a compatible window manager, and the pinboard must be in use.
cs: Tato volba zpùsobí, ¾e správce souborù zobrazí ka¾dé ikonifikované okno jako malé tlaèítko na plo¹e. Je potøeba kompatibilní správce oken a musí být pou¾ívána plocha.

source: Iconify to the
cs: Ikonifikovat

source: top-left
cs: nahoøe-vlevo

source: top-right
cs: nahoøe-vpravo

source: bottom-left
cs: dole-vlevo

source: bottom-right
cs: dole-vpravo

source: , going
cs: , smìrem

source: horizontally
cs: horizontálním

source: vertically
cs: vertikálním

source: Panels
cs: Panely

source: Panels are bars of icons that run along the side of the screen. See the manual for information about using panels.
cs: Panely jsou pásy ikon umístìné podél okraje obrazovky. Více informací o pu¾ití panelù je v manuálu.

source: Panel style
cs: Styl panelu

source: Image and text
cs: Obrázek a text

source: Every panel icon is shown with an image and some text.
cs: Ka¾dá ikona panelu je zobrazena s obrázkem a nìjakým textem.

source: Image only for applications
cs: Obrázek pouze pro aplikace

source: Applications have just an image, everything else has both an image and text.
cs: Aplikace mají pouze obrázek, v¹echno ostatní má orázek i text.

source: Image only
cs: Jen obrázek

source: Only the image is shown.
cs: Je zobrazen pouze obrázek.

source: Panel width (thin)
cs: ©íøka panelu (úzký)

source: (thick)
cs: (¹iroký)

source: The size of the panels.
cs: Velikost panelù.

source: Action windows
cs: Okna akcí

source: Action windows appear when you start a background operation, such as copying or deleting some files.
cs: Okna akcí se zobrazí, kdy¾ spustíte nìjakou operaci na pozadí, napøíklad kopírování nebo mazání souborù.

source: Auto-start (Quiet) these actions
cs: Automaticky (bez upozornìní) provést tyto operace

source: Copy files without confirming first.
cs: Kopírovat soubory bez upozornìní.

source: Move files without confirming first.
cs: Pøesunout soubory bez upozornìní.

source: Create links to files without confirming first.
cs: Vytváøet symbolické odkazy na soubory bez upozornìní.

source: Delete files without confirming first.
cs: Smazat soubory bez upozornìní.

source: Mount
cs: Pøipojit

source: Mount and unmount filesystems without confirming first.
cs: Pøipojit a odpojit soubory bez upozornìní.

source: Default settings
cs: Defaultní nastavení

source: Don't confirm deletion of non-writeable items.
cs: Nepotvrzovat smazání polo¾ek, které nemají právo zápisu.

source: Don't display so much information in the message area.
cs: Nezobrazovat moc informací v oknì zpráv.

source: Also change contents of subdirectories.
cs: Mìnit také obsah podadresáøù.

source: Drag and Drop
cs: Táhni a pus»

source: Dragging to icons
cs: Pøetáhnutí na ikony

source: Allow dragging to icons in filer windows
cs: Povolit pøetahování na ikony ve správci souborù

source: When this is on you can drag a file over a sub-directory or program in a filer window. The item will highlight when you do this and dropping the file will put it into that directory, or load it into the program.
cs: Tato volba zpùsobí, ¾e pøetahovat soubor pøes podadresáøe nebo programy ve správci oken. Polo¾ka pøi tom bude zvýraznìna a upu¹tìní souboru ho umístí do tohoto adresáøe nebo v pøípadì programu bude do tohoto programu naèten.

source: Directories spring open
cs: Pru¾né otvírání adresáøù

source: This option, which requires the above option to be turned on too, causes the highlighted directory to 'spring open' after the file is held over it for a short while.
cs: Tato volba, která vy¾aduje zapnutou i pøedchozí volbu, zpùsobí, ¾e adresáø je 'pru¾nì otevøen', kdy¾ je nad nimi soubor podr¾en po urèitou dobu.

source: Spring delay:
cs: Zpo¾dìní pro pru¾né otevøení:

source: This option sets how long, in ms, you must hold a file over a directory before it will spring open. The above option must be turned on for this to have any effect.
cs: Tato volba nastavuje, jak dlouho v ms musíte podr¾et soubor nad adresáøem pøedtím, ne¾ bude otevøen. Pøedchozí volba musí být zapnuta, aby mìla tado volba nìjaký efekt.

source: When dragging files with the left mouse button
cs: Pøi pøetahování souborù levým tlaèítkem my¹i

source: Show a menu of possible actions
cs: Zobrazit nabídku mo¾ných akcí

source: Copy the files
cs: Kopírovat soubory

source: Note that you can still get the menu to appear, by dragging with Alt held down.
cs: Zobrazit nabídku mù¾ete také v pøípadì, ¾e pøi pøetahování byl stisknut Alt.

source: When dragging files with the middle mouse button
cs: Pøi pøetahování souborù prostøedním tlaèítkem my¹i

source: Move the files
cs: Pøesunout soubory

source: Note that you can still get the menu to appear, by dragging with the left button and holding down the Alt key.
cs: Zobrazit nabídku mù¾ete také v pøípadì, ¾e pøi pøetahování lev7m tlaèítkem byl stisknut Alt.

source: Menus
cs: Nabídky

source: Size of icons in menus:
cs: Velikost ikon v nabídkách:

source: No Icons
cs: ®ádné ikony

source: Same as current window
cs: Stejná jako v souèasném oknì

source: Same as default
cs: Stajná jako defaultní

source: Behaviour
cs: Chování

source: `Xterm Here' program
cs: `Xterm v tomto adresáøi' program

source: The program to launch when you choose `Xterm Here' from the menu.
cs: Program, který je spu¹tìn, kdy¾ vyberete `Xterm v tomto adresáøi' z nabídky

source: Keyboard shortcuts
cs: Klávesové zkratky

source: MIME types
cs: MIME typy

source: Colours
cs: Barvy

source: File type colours
cs: Barvy typù souborù

source: Colour files based on their types
cs: Barvy souborù zavisí na jejich typech

source: Filenames (and details) are coloured according to the file's type.
cs: Jména souborù (a podrobnosti) mají barvu, která patøí k danému typu souboru.

source: Directory:
cs: Adresáø

source: Regular file:
cs: Bì¾ný soubor

source: Pipe:
cs: Roura

source: Socket:
cs: Soket

source: Error, such as a symlink which points to a non-existant file, or a file which the filer does not have permission to examine.
cs: Chyba, jako napøíklad symbolický odkaz na neexistující soubor nebo soubor nebo soubor u kterého nemá spravce souborù práva k prozkoumání.

source: Character device:
cs: Znakové zaøízení:

source: Block device:
cs: Blokové zaøízení:

source: Door files are a bit like sockets or pipes, and have only been seen on Solaris.
cs: Door soubory jsou trochu jako sokety a roury a jsou pou69v8ny na Solarisu.

source: Executable file:
cs: Spustitelný soubor:

source: Application directory:
cs: Aplikaèní adresáø:

source: Unknown type:
cs: Neznámý typ:

source: Compatibility
cs: Kompatibilita

source: Window manager problems
cs: Problémy se správcem oken

source: Override window manager control of the pinboard and panels
cs: Pøebít kontrolu správce oken nad pozadím a panely

source: Some window managers don't support the new Extended Window Manager Hints system, and so treat the pinboard and panels like normal windows. Turn this on to fix problems such as the pinboard coming to the front when you click on it, titlebars and other decorations appearing around windows, or having them appear in window-select lists.
cs: Nìkteøí správci oken nepodporují Extended Window Manager Hints system zachází s pozadím a panely jako s normálními okny. Pou¾ijte, pro vyøe¹ení problémù jako: pozadí vyskoèí dopøedu pøi kliknutí na nìj, titulky a jiné dekorace se objevují u tìchto oken nebo se objevují v seznamu oken.

source: Pass all backdrop mouse clicks to window manager
cs: Pøedat v¹echny kliknutí my¹í na pozadí správci oken

source: Normally, right clicking on the desktop background will open the pinboard menu and left clicking will clear the selection. Turn this on to forward the events to your window manager instead. Clicks on icons will not be forwarded.
cs: Normálnì pravé kliknutí na plo¹e otevøe nabídku plochy a levé kliknutí vyma¾e výbìr. Pokud je zapnuto, pøedjí se v¹echny události správci oken. Kliknutí na ikony nebude pøedáno.

source: Blackbox, Fluxbox and similar window managers do not yet work well with the ROX-Filer pinboard. This option enables some workarounds. These window managers are expected to change their behaviour in new versions so that this isn't necessary.
cs: Blackbox, Fluxbox a podobní správci oken zatím nepracují dobøe s pozadím ROX-Fileru. Tato volba èásteènì øe¹í problémy. Tito správcioken pravdìpodbnì opraví chování ve svých nových verzích, tak¾e toto není nutné.

source: Drag and drop
cs: Táhni a pus»

source: Don't use hostnames
cs: Nepou¾ívat jména poèítaèù

source: Some older applications don't support XDND fully and may need to have this option turned on. Use this if dragging files to an application shows a + sign on the pointer but the drop doesn't work.
cs: Nìkteré star¹í aplikace plnì nepodporují XDND a mohou potøebovat mít zapnutoututo volbu. Pou¾ijte, pokud pøetáhnutí souborù na aplikaci zobrazí znak +, ale pu¹tìní souborù nefunguje.
