Repository: chriskmanx/qmole
Catalog: QMOLEDEV/libbonobo-2.0.0/po/*.po
Languages: ca, gl, hu, sk, ta, tr, uk, vi, zh_tw

source: An unsupported action was attempted
ca: S'ha intentat dur a terme una acció no permesa
gl: Tentouse levar a cabo unha acción non soportada
hu: Nem támogatott action-t próbáltál
sk: Skúsená nepodporovaná akcia
ta: µ÷ ¬¾ÃÅÇ¢ûÇ¡ ¦ºÂø ÓÂüº¢ì¸ôÀğ¼Ğ
tr: Desteklenmeyen bir eylem gerçekleþtirildi
uk: Здійснено непідтримувану дію
vi: Đã cố gắng thực hiện một hành động không được hỗ trợ
zh_tw: 嘗試執行了一個不支援的動作

source: IO Error
ca: Error d'entrada/sortida
gl: Erro de E/S
hu: IO hiba
sk: V/V chyba
ta: IO À¢¨Æ
tr: IO Hatasý
uk: Помилка В/В
vi: Lỗi nhập xuất
zh_tw: 輸出入錯誤

source: Invalid argument value
ca: Valor d'argument no vàlid
gl: Valor de argumento non válido
hu: Érvénytelen argumentum érték
sk: Nesprávna hodnota argumentu
ta: À¢¨ÆÂ¡É Á¡È¢ Á¾¢ôÒ
tr: Geçersiz parametre girdisi
uk: Невірне значення арґумента
vi: Giá trị đối số không hợp lệ
zh_tw: 不合法的參數數值

source: Object not found
ca: No s'ha torbat l'objecte
gl: Obxecto non atopado
hu: Az objektum nem található
sk: Objekt nenájdený
ta: ­ÄìÌ ¸¡½Å¢ø¨Ä
tr: Nesne Bulunamadý
uk: Об'єкта не знайдено
vi: Không tìm thấy object
zh_tw: 找不到物件

source: Syntax error in object description
ca: Error de sintaxi en la descripció de l'objecte
gl: Erro de sintaxe na descrición do obxecto
hu: Szintaktikai hiba az objektum leírásban
sk: Chyba syntaxe v popise objektu
ta: ­ÄìÌ Å¢ÅÃ¢ôÀ¢ø ¦¾¡¼Ã¢Âø À¢¨Æ
tr: Nesne Açýklamasýnda Kural Hatasý
uk: Синтаксична помилка в описі об'єкта
vi: Sai cú pháp trong mô tả object
zh_tw: 物件描述內有語法錯誤

source: Cannot activate object from factory
ca: No es pot activar l'objecte des de la fàbrica
gl: Non se pode activar obxecto de fábrica
hu: Az objektum aktiválása a factoryból sikertelen
sk: Nemô¾em aktivova» objekt z továrne
ta: ¦¾¡Æ¢üº¡¨ÄÂ¢ø ¦ÀüÈ ­Äì¨¸ ¦ºÂüÀ¼ ÓÊÂÅ¢ø¨Ä
tr: Nesne aktifleþtirilemiyor
uk: Неможливо активувати об'єкт з фабрики
vi: Không thể kích hoạt object từ factory
zh_tw: 無法從元件工廠去啟動物件

source: No permission to access stream
ca: No hi ha permís per accedir al flux
gl: Non se ten permiso para acceder ao fluxo
hu: Nincs jogod a stream eléréséhez
sk: Nie sú práva na prístup k prúdu
ta: µ¨¼ «Ï¸ÖìÌ «ÑÁ¾¢ ¸¢¨¼Â¡Ğ
tr: Akýma eriþim izniniz yok
uk: Немає права на досуп до потоку
vi: Không được phép truy xuất luồng
zh_tw: 不允許去存取資料流

source: An unsupported stream action was attempted
ca: S'ha intentat una acció de flux no permesa
gl: Tentouse levar a cabo unha acción non soportada sobre fluxo
hu: Nem támogatott 'stream action'-t próbáltál használni
sk: Skúsená nepodporovaná akcia prúdu
ta: µ÷ ¬¾ÃÅÇ¢ûÇ¡ µ¨¼î ¦ºÂø ÓÂüº¢ì¸ôÀğ¼Ğ
tr: Desteklenmeyen bir akým eylemi gerçekleþtirildi
uk: Здійснено непідтримувану дію потоку
vi: Đã cố gắng thực hiện một hành động về luồng không được hỗ trợ
zh_tw: 嘗試執行了一個不支援的資料流動作

source: IO Error on stream
ca: Error d'entrada/sortida al flux
gl: Erro de E/S no fluxo
hu: IO hiba a streamen
sk: V/V chyba v prúde
ta: µ¨¼Â¢ø IO À¢¨Æ
tr: Akým sýrasýnda IO hatasý
uk: Помилка В/В у потоці
vi: Lỗi nhập xuất trên luồng
zh_tw: 資料流的輸出入錯誤

source: IO Error on storage
ca: Error d'entrada/sortida en emmagatzemar
gl: Erro de E/S no almacenamento
hu: IO hiba a storage-on
sk: V/V chyba v úlo¾isku
ta: §¾ì¸ò¾¢ø IO À¢¨Æ
tr: Depolama anýnda IO hatasý
uk: Помилка В/В у сховищі
vi: Lỗi nhập xuất trên bộ lưu trữ
zh_tw: 儲存庫的輸出入錯誤

source: Name already exists in storage
ca: El nom ja existeix a l'emmagatzematge
gl: O nome xa existe no medio de almacenamento
hu: Már van ilyen név a storage-ban
sk: Meno u¾ existuje v úlo¾isku
ta: §¾ì¸ò¾¢ø ²ü¸É§Å ¦ÀÂ÷ ¯ñÎ
tr: Depoda bu isimde zaten kayýt var
uk: Назва вже існує у сховищі
vi: Tên này đã tồn tại trong bộ lưu trữ
zh_tw: 儲存庫內已有相同的名稱

source: Object not found in storage
ca: No s'ha trobat l'objecte a l'emmagatzematge
gl: Obxecto non atopado no medio de almacenamento
hu: Az objektum nem található a storage-ban
sk: Objekt nebol nájdený v úlo¾isku
ta: §¾ì¸ò¾¢ø ­ÄìÌ ¸¡½Å¢ø¨Ä
tr: Depoda nesne bulunamadý
uk: Об'екта не знайдено у сховищі
vi: Không tìm thấy object trong bộ lưu trữ
zh_tw: 在儲存庫內找不到物件

source: No permission to do operation on storage
ca: No hi ha permís per fer l'operació a l'emmagatzematge
gl: Non se ten permiso para facer a operación no medio de almacenamento
hu: Nincs jogosultságod művelet végzéséhez a storage-on
sk: Nie sú práva na vykonanie operácie v úlo¾isku
ta: §¾ì¸ò¾¢ø ­Âì¸ «ÑÁ¾¢ ¸¢¨¼Â¡Ğ
tr: Depolama anýnda iþlem yürütmeye izniniz yok
uk: Немає права на викрнання операції зі сховищем
vi: Không được phép thao tác trên bộ lưu trữ
zh_tw: 在儲存庫內不允許執行動作

source: An unsupported storage action was attempted
ca: S'ha intentat una acció d'emmagatzematge no permesa
gl: Tentouse levar a cabo unha acción non soportada sobre medio de almacenamento
hu: Nem támogatott 'storage action'-t probáltál
sk: Skúsená nepodporovaná akcia úlo¾iska
ta: µ÷ ¬¾ÃÅÇ¢ûÇ¡ §¾ì¸¸î ¦ºÂø ÓÂüº¢ì¸ôÀğ¼Ğ
tr: Desteklenmeyen bir depolama eylemi gerçekleþtirildi
uk: Здійснено непідтримувану дію сховища
vi: Đã cố gắng thực hiện một hành động về lưu trữ không được hỗ trợ
zh_tw: 嘗試執行了一個不支援的儲存庫動作

source: Object is not a stream
ca: L'objecte no és un flux
gl: O obxecto non é un fluxo
hu: Az objektum nem stream
sk: Objekt nie je prúd
ta: ­ÄìÌ µÕ µ¨¼ «øÄ
tr: Nesne bir akým deðildir
uk: Об'єкт не є потоком
vi: Object không phải là một luồng
zh_tw: 物件不是資料流

source: Object is not a storage
ca: L'objecte no és un emmagatzematge
gl: O obxecto non é un medio de almacenamento
hu: Az objektum nem storage
sk: Objekt nie je úlo¾isko
ta: ­ÄìÌ µÕ §¾ì¸¸õ «øÄ
tr: Nesne bir depolama deðildir
uk: Об'єкт не є сховищем
vi: Object không phải là một bộ lưu trữ
zh_tw: 物件不是儲存庫

source: Storage is not empty
ca: L'emmagatzematge no és buit
gl: O medio de almacenamento non está baleiro
hu: A storage nem üres
sk: Úlo¾isko nie je prázdne
ta: §¾ì¸¸õ ¦ÅüÈ¡ÉĞ «øÄ
tr: Depolama boþ deðil
uk: Сховище не порожнє
vi: Bộ lưu trữ không rỗng
zh_tw: 儲存庫內仍有物件

source: malformed user interface XML description
ca: descripció XML incorrecta de la interfície d'usuari
gl: descrición XML de interface de usuario mal formada
hu: rossz felhasználóifelület-leíró XML
sk: poru¹ený XML popis pou¾ívateµského rozhrania
ta: ¦À¡Õò¾-ÁüÈ ÀÂÉ÷ ­¨¼Ó¸ XML Å¢ÅÃ¢ôÒ
tr: XML için kusurlu kullanýcý arayüzü tanýmlamasý
uk: неправильний XML-опис інтерфейса користувача
vi: Sai mô tả giao diện người dùng của XML
zh_tw: 不合格式的使用者介面 XML 描述

source: invalid path to XML user interface element
ca: camí invalid cap a l'element de la interfície d'usuari XML
gl: camiño non válido a elemento de interface de usuario XML
hu: érvénytelen elérési útvonal az XML felhasználói felület elmhez
sk: neplatná cesta k prvku XML pou¾ívateµského rozhrania
ta: XML ÀÂÉ÷ ­¨¼Ó¸ ¯ÚôÀ¢ı À¡¨¾ À¢¨ÆÂ¡ÉĞ
tr: XML kullanýcý arayüzü öðesi için geçersiz yol tanýmlamasý
uk: недопустимий шлях до XML-елемента інтерфейса користувача
vi: Đường dẫn của element giao diện người dùng của XML không hợp lệ
zh_tw: 指到 XML 使用者介面元件的路徑不合法

source: the requested UI attribute didn't exist
gl: o atributo de IU pedido non existía
hu: a kért UI attribútum nem létezett
sk: po¾adovaná vlastnos» UI neexistuje
uk: запитаний атрибут інтерфейса користувача не існував
vi: thuột tính UI yêu cầu không tồn tại

source: Unknown command or verb
ca: Ordre o verb desconegut
gl: Comando ou verbo descoñecido
sk: Neznámy príkaz alebo výraz
ta: ¦¾Ã¢Â¡¾ ¸ğ¼¨Ç «øÄĞ Å¢¨Éî¦º¡ø
tr: Bilinmeyen komut veya fiil
uk: Невідома команда чи дія
vi: Lệnh lạ
zh_tw: 不詳的指令

source: Command is insensitive
ca: L'ordre no és sensible
gl: O comando non é sensible
sk: Príkaz je necitlivý
ta: ¸ğ¼¨Ç ¯½÷Å¢ûÇ¡¾Ğ
tr: Duyarsýz komut
uk: Команда не має змісту
vi: Lệnh không phản ứng
zh_tw: 指令是不區分大小寫的

source: incorrect data type
ca: tipus de dades incorrecte
gl: tipo de datos incorrecto
hu: rossz adattípus
sk: nesprávny typ dát
ta: À¢¨ÆÂ¡É ¾Ã× Å¨¸
tr: Hatalý veri tipi
uk: невірний тип даних
vi: sai kiểu dữ liệu
zh_tw: 不正確的資料類別

source: stream not found
ca: no s'ha trobat el flux
gl: fluxo non atopado
hu: a stream nem található
sk: prúd nenájdený
ta: µ¨¼ ¸¡½Å¢ø¨Ä
tr: Akým bulunamadý
uk: потоку не знайдено
vi: không tìm thấy luồng
zh_tw: 找不到資料流

source: property not found
ca: no s'ha trobat la propietat
gl: propiedade non atopada
hu: a tulajdonság nem található
sk: vlastnos» nenájdená
ta: ÀñÒ ¸¡½Å¢ø¨Ä
tr: Özellik bulunamadý
uk: властивості не знайдено
vi: không tìm thấy thuộc tính
zh_tw: 找不到屬性

source: property has invalid type
ca: la propietat té un tipus no válid
gl: a propiedade é de tipo non válido
hu: a tulajdonság típusa érvénytelen
sk: vlastnos» je neplatného typu
ta: ÀñÀ¢ø ¦ºøÖÀÊÂ¡¸¡¾ Å¨¸
tr: Geçersiz özellik tipi
uk: властивість має невірний тип
vi: thuộc tính sai kiểu
zh_tw: 不合規格的屬性類別

source: property is read only
ca: la propietat és només de lectura
gl: a propiedade é de só lectura
hu: a tulajdonság csak olvasható
sk: vlastnos» je len na èítanie
ta: ÀñÒ Å¡º¢ì¸ìÜÊÂĞ ÁğÎõ
tr: Özellik salt okunur
uk: властивість лише для зчитування
vi: thuộc tính chỉ đọc
zh_tw: 只是唯讀的屬性

source: config database backend failed
ca: el 'backend' de la base de dades de configuració ha fallat
gl: fallou o 'backend' da base de datos da configuración
hu: az adatbázis backend beállítása sikertelen
sk: komunikácia s konfiguraènou databázou zlyhala
tr: Yapýlandýrma veritabaný baþarýsýzlýkla sonuçlandý
uk: збій в модулі конфіґураційної бази даних
vi: lỗi cấu hình database backend
zh_tw: 設定資料庫模組失敗

source: Moniker interface cannot be found
ca: No es pot trobar la interfície del moniker
gl: Non se pode atopar a interface do alias (moniker)
hu: A Moniker interfész nem található
sk: Rozhranie monikera nemô¾e by» nájdené
ta: Moniker ­¨¼Ó¸õ ¸ñÎÀ¢Êì¸ ÓÊÂÅ¢ø¨Ä
tr: Moniker arayüzü bulunamadý
uk: Неможливо знати інтерфейс монікера
vi: Không tìm thấy Moniker interface
zh_tw: 無法找到命名器介面

source: Moniker activation timed out
ca: L'activació del moniker ha excedit el temps
gl: Esgotouse o tempo de activación do alias (moniker)
hu: A Moniker aktiválása időtúllépés miatt sikertelen
sk: Èasový limit aktivácie monikera vypr¹al
ta: Moniker àñÎ ¦ºöÔõ §¿Ãõ ÓÊÅ¨¼ó¾Ğ
tr: Moniker için aktifleþtirme zaman aþýmý
uk: Вийшов час активації монікера
vi: Quá hạn khi kích hoạt moniker
zh_tw: 啟動命名器逾時

source: Syntax error within moniker
ca: Error de sintaxi dins del moniker
gl: Erro de sintaxe interno do alias (moniker)
hu: Szintaktikai hiba a monikerben
sk: Chyba syntaxe v monikeri
ta: Moniker ¯û§Ç ¦¾¡¼Ã¢Âø À¢¨Æ
tr: Moniker için yazým hatasý
uk: Синтаксична помилка в монікері
vi: Lỗi cú pháp trong moniker
zh_tw: 命名器內含有語法錯誤

source: Moniker has an unknown moniker prefix
ca: El moniker té un prefix del moniker desconegut
gl: O alias (moniker) ten un prefixo de alias (moniker) descoñecido
hu: A Monikernek ismeretlen a moniker prefixe
sk: Moniker má neznámu predponu
tr: Moniker, bilinmeyen bir moniker sabitine sahip!
uk: Монікер має невідомий префікс монікера
vi: Moniker có tiếp đầu ngữ lạ
zh_tw: 命名器具有不詳的前置字

source: Error checking error; no exception
ca: Error en comprovar l'error; cap excepció
gl: Erro comprobando erro; non hai excepción
hu: Hibaellenőrzési hiba; nincs kivétel
sk: Chyba pri kontrole chyby; bez výnimky
ta: À¢¨ÆÀ¡÷ìÌõ§À¡Ğ À¢¨Æ; Å¢¾¢Å¢ÄìÌ ¸¢¨¼Â¡Ğ
tr: Hata kontrol hatasý; itiraz edilemiyor
uk: Помилка перевірки на помилку; без вийняткової ситуації
vi: Lỗi kiểm tra; không có exception
zh_tw: 檢查錯誤時發生錯誤；沒有列外處理

source: General activation error with no description
ca: Error general d'activació sense descripció
gl: Erro xeral de activación sen descrición
hu: Általános aktiválási hiba, leírás nélkül
sk: V¹eobecná chyba aktivácie bez popisu
ta: Å¢ÅÃ½õ ­øÄ¡Áø ¦À¡Ğò ¦¾¡¼í¸ø À¢¨Æ
tr: Tanýmlamasýz genel aktifleþtirme hatasý
uk: Загальна помилка активації без опису
vi: Lỗi kích hoạt chung, không có thông tin cụ thể
zh_tw: 一般的不具描述的啟動錯誤

source: Could not initialize Bonobo
ca: No s'ha pogut inicialitzar el Bonobo
gl: Non se puido inicializar Bonobo
hu: A Bonobo inicializálása sikertelen
sk: Nemô¾em inicializova» Bonobo
ta: ¦À¡§É¡§À¡Å¢ı ¦¾¡¼ì¸Á¾¢ôÀÇ¢ì¸ ÓÊÂÅ¢ø¨Ä
tr: Bonobo baþlatýlamýyor
vi: Không thể khởi động Bonobo
zh_tw: 無法初始化 Bonobo

source: Failed to resolve, or extend '%s
hu: '%s' feloldása vagy kiterjesztése sikertelen
sk: Zlyhalo rozdelenie alebo roz¹írenie '%s'
uk: Не вдалося розв'язати чи розширити "%s"
vi: Lỗi khi phân giải hoặc mở rộng '%s'

source: Failed to activate object
hu: Az objektum aktiválása sikertelen
sk: Zlyhala aktivácia objektu
uk: Не вдалося активувати об'єкт
vi: Lỗi khi kích hoạt object

source: ORB IOR handling moniker
ca: moniker de maneig ORB IOR
gl: Alias (moniker) de maxeno ORB IOR
hu: ORB IOR kezekő moniker
sk: ORB IOR ovládací moniker
tr: Moniker ORB IOR tutuþu
vi: Moniker xử lý ORB IOR
zh_tw: ORB IOR 命名器處理

source: Standard Moniker factory
ca: Fàbrica estàndard moniker
gl: Alias (moniker) estándar de fábrica
sk: ©tandardná továreò monikera
ta: ¦ºó¾Ã Moniker ¦¾¡Æ¢üº¡¨Ä
tr: Moniker Fabrika standardý
vi: Moniker factory chuẩn
zh_tw: 標準命名器的元件工廠

source: generic Oaf activation moniker
ca: moniker genèric d'activació Oaf
gl: alias (moniker) xenérico de activación OAF
hu: Általános Oaf aktiváló moniker
sk: v¹eobecný aktivaèný moniker Oaf
ta: ÅÊÅ¢Âø Oaf àñÎ ¦ºöÔõ moniker
tr: Genel Moniker Oaf etkinleþtirmesi
vi: moniker chung kích hoạt Oaf
zh_tw: 一般的 Oaf 啟動命名器

source: generic Oaf query moniker
ca: moniker genèric de consulta Oaf
gl: alias (moniker) xenérico de petición OAF
hu: általános Oaf lekérdező moniker
sk: v¹eobecný dotazovací moniker Oaf
ta: ÅÊÅ¢Âø Oaf Å¢ÉÅø moniker
tr: Genel Moniker Oaf sorgulamasý
vi: moniker chung truy vấn Oaf
zh_tw: 一般的 Oaf 查詢命名器

source: generic factory 'new' moniker
ca: moniker 'nou' genèric de fàbrica
gl: 'novo' alias (moniker) xenérico de fábrica
hu: általános factory 'new' moniker
sk: v¹eobecný moniker továrne 'new'
ta: ÅÊÅ¢Âø ¦¾¡Æ¢üº¡¨Ä 'Ò¾¢Â' moniker
tr: Moniker genel üretim 'yeni'
vi: factory 'new' moniker chung
zh_tw: 一般的 '新增' 命名器的元件工廠

source: generic item moniker
ca: moniker genèric d'element
gl: alias (moniker) de obxecto xenérico
hu: általános item moniker
sk: v¹eobecný moniker polo¾iek
ta: ÅÊÅ¢Âø ¯ÕôÀÊ moniker
tr: Moniker genel öðesi
vi: moniker chung
zh_tw: 一般的項目命名器

source: stream MonikerExtender
ca: flux MonikerExtender
gl: fluxo MonikerExtender
sk: prúd MonikerExtender
ta: µ¨¼ MonikerExtender
tr: Moniker Kapsamýndaki akým
vi: luồng MonikerExtender
zh_tw: 資料流命名延伸器

source: Exception activating '%s
hu: Kivétel '%s' aktiválásakor
sk: Aktivácia výnimky '%s'
uk: Вийняткова ситуація під час активації "%s"
vi: Lỗi khi kích hoạt '%s'

source: Failed to activate '%s
hu: '%s' aktiválása sikertelen
sk: Zlyhala aktivácia '%s'
uk: Не вдалося активувати "%s"
vi: Lỗi khi kích hoạt '%s'

source: Bonobo Echo server factory
sk: Bonobo továreò servera echo

source: Bonobo Echo server sample program
hu: Bonobo Echo server példaprogram
sk: Uká¾kový program bonobo servera echo
vi: Chương trình mẫu server Bonobo Echo

source: Echo component
hu: Echo komponens
sk: Komponent echo

source: Echo component factory
hu: Echo komponens factory
sk: Továreò komponentu echo

source: I could not initialize Bonobo
hu: A Bonobo inicializásála sikertelen
sk: Nemô¾em inicializova» Bonobo
uk: Не вдалося ініціалізувати Bonobo
vi: Không thể khởi động Bonobo

source: Could not create an instance of the sample echo component
hu: Nem sikerült létrehozni az echo példaprogramból egy példányt sem
sk: Nemô¾em vytvori» in¹tanciu uká¾kového komponentu echo
uk: Не вдалося створити екземпляр зразка компонента відлуння
vi: Không thể tạo ra một phiên bản của echo component

source: An exception occured '%s'
hu: Kivétel történt: '%s'
sk: Vyskytla sa výnimka '%s'
uk: Сталася виключна ситуація "%s"
vi: Một lỗi đã xảy ra '%s'

source: HTTP Moniker
gl: Alias (moniker) HTTP
vi: Moniker HTTP
zh_tw: HTTP 命名器
