Repository: chriskmanx/qmole
Catalog: QMOLEDEV/gtksourceview-3.2.3/po/*.po
Languages: en@shaw

source: Document Words
en@shaw: 筐ヰ 火

source: Name
en@shaw: 别

source: The provider name
en@shaw: 拆 别

source: Icon
en@shaw: 拆

source: The provider icon
en@shaw: 拆 拆

source: Proposals Batch Size
en@shaw: 答ゐ 拆

source: Number of proposals added in one batch
en@shaw: 仇ヰ 答ゐ 仇

source: Scan Batch Size
en@shaw: 拆

source: Number of lines scanned in one batch
en@shaw: 仇ヰ ゐ拆 仇

source: Minimum Word Size
en@shaw: ヰヰ 火 拆

source: The minimum word size to complete
en@shaw: ヰヰ 火 拆 ヰゐ梆

source: Highlight Syntax
en@shaw: ｐ拆ゐ拆

source: Whether to highlight syntax in the buffer
en@shaw: ю ｐ拆ゐ拆 仇

source: Highlight Matching Brackets
en@shaw: ｐ拆ゐ拆 ヰ

source: Whether to highlight matching brackets
en@shaw: ю ｐ拆ゐ拆 ヰ

source: Maximum Undo Levels
en@shaw: ヰヰ 仇 ゐюゐ

source: Number of undo levels for the buffer
en@shaw: 仇ヰ 仇 ゐюゐ 仇

source: Language
en@shaw: ゐ

source: Language object to get highlighting patterns from
en@shaw: ゐ ○ю ю ｐ拆ゐ拆 拣

source: Can undo
en@shaw: 仇

source: Whether Undo operation is possible
en@shaw: ю 仇 拣别

source: Can redo
en@shaw: 梆

source: Whether Redo operation is possible
en@shaw: ю 梆 拣别

source: Style scheme
en@shaw: 拆 梆

source: All
en@shaw: 佛

source: No extra information available
en@shaw: ю 拣ヰ别 别ゐ

source: Remember the last info window visibility state
en@shaw: ヰюヰ ゐ ゐ 别

source: Select on Show
en@shaw: ゐю

source: Select first proposal when completion is shown
en@shaw: ゐю 火 答 ю ヰゐ梆 答

source: Show Headers
en@shaw: ｐю拣

source: Show provider headers when proposals from multiple providers are available
en@shaw: 拆 ｐю拣 ю 答ゐ ヰ仇ゐ 拆火 别ゐ

source: Accelerators
en@shaw: юゐ拣别拣

source: Number of proposal accelerators to show
en@shaw: 仇ヰ 答 юゐ拣别拣

source: Auto Complete Delay
en@shaw: 佛 ヰゐ梆 ゐ

source: Completion popup delay for interactive completion
en@shaw: ヰゐ梆 仇 ゐ 火 ヰゐ梆

source: Provider Page Size
en@shaw: 拆 别 拆

source: Provider scrolling page size
en@shaw: 拆 答ゐ 别 拆

source: Proposal Page Size
en@shaw: 答 别 拆

source: Proposal scrolling page size
en@shaw: 答 答ゐ 别 拆

source: Provider
en@shaw: 拆

source: Completion
en@shaw: ヰゐ梆

source: The completion object to which the context belongs
en@shaw: ヰゐ梆 ○ю ю ゐ

source: Activation
en@shaw: 别

source: The type of activation
en@shaw: 拆 别

source: Completion Info
en@shaw: ヰゐ梆

source: Maximum width
en@shaw: ヰヰ

source: The maximum allowed width
en@shaw: ヰヰ ゐ

source: Maximum height
en@shaw: ヰヰ ｐ拆

source: The maximum allowed height
en@shaw: ヰヰ ゐ ｐ拆

source: Shrink width
en@shaw: 梆

source: Whether the window should shrink width to fit the contents
en@shaw: ю 梆

source: Shrink height
en@shaw: 梆 ｐ拆

source: Whether the window should shrink height to fit the contents
en@shaw: ю 梆 ｐ拆

source: Label
en@shaw: ゐ别

source: Label to be shown for this item
en@shaw: ゐ别 答 拆

source: Markup
en@shaw: ヰ

source: Markup to be shown for this item
en@shaw: ヰ 答 拆

source: Text
en@shaw: ю

source: Item text
en@shaw: 拆 ю

source: Icon to be shown for this item
en@shaw: 拆 答 拆

source: Info to be shown for this item
en@shaw: 答 拆

source: using \C is not supported in language definitions
en@shaw: 筐 \C 桂 ゐ ю

source: Highlighting a single line took too much time, syntax highlighting will be disabled
en@shaw: ｐ拆ゐ拆 ゐ拆 ヰ仇 拆, ｐ拆ゐ拆 别ゐ

source: context '%s' cannot contain a \%%{...@start} command
en@shaw: ю '%s' 别 \%%{...@start} ヰ

source: duplicated context id '%s'
en@shaw: 筐ゐ别 ю '%s'

source: style override used with wildcard context reference in language '%s' in ref '%s'
en@shaw: 拆 答拣拆 筐 拆ゐ ю ю拣 ゐ '%s' ю '%s'

source: invalid context reference '%s'
en@shaw: ゐ ю ю拣 '%s'

source: unknown context '%s'
en@shaw: 仇答 ю '%s'

source: Missing main language definition (id = "%s".)
en@shaw: ヰ ヰ别 ゐ ю (id = "%s".)

source: Window Type
en@shaw: 拆

source: The gutters text window type
en@shaw: 火 ю 拆

source: Others
en@shaw: 仇拣

source: Language id
en@shaw: ゐ id

source: Language name
en@shaw: ゐ 别

source: Language section
en@shaw: ゐ ю

source: Hidden
en@shaw: ｐ

source: Whether the language should be hidden from the user
en@shaw: ю ゐ ｐ 筐

source: Language specification directories
en@shaw: ゐ ю别 拆ю拣

source: List of directories where the language specification files (.lang) are located
en@shaw: ゐ 拆ю拣 ゐ ю别 拆ゐ (.ゐ) ゐ答别

source: category
en@shaw: ю桂

source: The mark category
en@shaw: ヰ葛 ю桂

source: Source Buffer
en@shaw: 桂 仇

source: Width of a tab character expressed in spaces
en@shaw: 葛 ю 别

source: Wrap Mode
en@shaw: ヰ答

source: Whether to wrap lines never, at word boundaries, or at character boundaries.
en@shaw: ю ゐ拆 ю, 火 拣, 葛 拣.

source: Whether to print the document with highlighted syntax
en@shaw: ю 筐ヰ ｐ拆ゐ拆

source: Print Line Numbers
en@shaw: ゐ拆 仇ヰ拣

source: Interval of printed line numbers (0 means no numbers)
en@shaw: 拣 ゐ拆 仇ヰ拣 (0 ヰ梆 仇ヰ拣)

source: Print Header
en@shaw: ｐю

source: Whether to print a header in each page
en@shaw: ю ｐю 梆 别

source: Whether to print a footer in each page
en@shaw: ю 梆 别

source: Body Font Name
en@shaw: 别

source: Line Numbers Font Name
en@shaw: ゐ拆 仇ヰ拣 别

source: Header Font Name
en@shaw: ｐю 别

source: Footer Font Name
en@shaw: 别

source: Number of pages
en@shaw: 仇ヰ 别○ю

source: Line background
en@shaw: ゐ拆

source: Line background color
en@shaw: ゐ拆 仇ゐ

source: Background color
en@shaw: 仇ゐ

source: Foreground
en@shaw: 桂

source: Foreground color
en@shaw: 桂 仇ゐ

source: Bold
en@shaw: 答ゐ

source: Italic
en@shaw: 拆ゐ

source: Underline
en@shaw: 火ゐ拆

source: Line background set
en@shaw: ゐ拆 ю

source: Whether line background color is set
en@shaw: ю ゐ拆 仇ゐ ю

source: Foreground set
en@shaw: 桂 ю

source: Whether foreground color is set
en@shaw: ю 桂 仇ゐ ю

source: Background set
en@shaw: ю

source: Whether background color is set
en@shaw: ю 仇ゐ ю

source: Bold set
en@shaw: 答ゐ ю

source: Whether bold attribute is set
en@shaw: ю 答ゐ 筐 ю

source: Italic set
en@shaw: 拆ゐ ю

source: Whether italic attribute is set
en@shaw: ю 拆ゐ 筐 ю

source: Underline set
en@shaw: 火ゐ拆 ю

source: Whether underline attribute is set
en@shaw: ю 火ゐ拆 筐 ю

source: Style scheme id
en@shaw: 拆 梆 id

source: Style scheme name
en@shaw: 拆 梆 别

source: Style scheme description
en@shaw: 拆 梆

source: Style scheme filename
en@shaw: 拆 梆 拆ゐ别

source: Style scheme search path
en@shaw: 拆 梆 火

source: List of directories and files where the style schemes are located
en@shaw: ゐ 拆ю拣 拆ゐ 拆 梆ヰ ゐ答别

source: The completion object associated with the view
en@shaw: ヰゐ梆 ○ю 答别

source: Show Line Numbers
en@shaw: ゐ拆 仇ヰ拣

source: Whether to display line numbers
en@shaw: ю ゐ ゐ拆 仇ヰ拣

source: Show Line Marks
en@shaw: ゐ拆 ヰ葛

source: Indent Width
en@shaw: ю

source: Number of spaces to use for each step of indent
en@shaw: 仇ヰ 别 筐 梆 ю ю

source: Auto Indentation
en@shaw: 佛 ю别

source: Whether to enable auto indentation
en@shaw: ю 别 佛 ю别

source: Insert Spaces Instead of Tabs
en@shaw: 火 别 ю

source: Whether to insert spaces instead of tabs
en@shaw: ю 火 别 ю

source: Show Right Margin
en@shaw: 拆 ヰ葛○

source: Whether to display the right margin
en@shaw: ю ゐ 拆 ヰ葛○

source: Right Margin Position
en@shaw: 拆 ヰ葛○

source: Position of the right margin
en@shaw: 拆 ヰ葛○

source: Smart Home/End
en@shaw: ヰ葛 ｐ答/ю

source: Highlight current line
en@shaw: ｐ拆ゐ拆 仇 ゐ拆

source: Whether to highlight the current line
en@shaw: ю ｐ拆ゐ拆 仇 ゐ拆

source: Indent on tab
en@shaw: ю

source: Whether to indent the selected text when the tab key is pressed
en@shaw: ю ю ゐю ю ю ю

source: Draw Spaces
en@shaw: 别

source: Set if and how the spaces should be visualized
en@shaw: ю ｐ 别 ゐ拆

source: translator-credits
en@shaw: 路ヰ 路火ヰ

source: Ada
en@shaw: 路

source: Arbitrary base number
en@shaw: 葛拣 别 仇ヰ

source: Boolean value
en@shaw: 叼ゐ梆 ゐ

source: Comment
en@shaw: 仇ヰヰ

source: Data Type
en@shaw: 别 拆

source: Decimal number
en@shaw: юヰ 仇ヰ

source: Escaped Character
en@shaw: 别 葛

source: Keyword
en@shaw: 梆火

source: Real number
en@shaw: 攫 仇ヰ

source: Sources
en@shaw: 桂

source: Storage Class
en@shaw: 桂 ゐ

source: ASP
en@shaw: 路

source: ASP Object
en@shaw: 路 ○ю

source: Function
en@shaw: 仇

source: Number
en@shaw: 仇ヰ

source: Operator
en@shaw: 拣别

source: Special constant
en@shaw: ю

source: Pattern
en@shaw: 拣

source: Variable
en@shaw: 吼

source: Boo
en@shaw: 路

source: Boolean
en@shaw: 叼ゐ梆

source: Definition
en@shaw: ю

source: Multiline string
en@shaw: ヰゐ梆ゐ拆

source: Namespace
en@shaw: 别ヰ别

source: Null Value
en@shaw: 仇 ゐ

source: Regular Expression
en@shaw: юゐ ю

source: Special Variable
en@shaw: ю 吼

source: Bullet
en@shaw: ゐ

source: Date
en@shaw: 别

source: E-mail address
en@shaw: 梆ヰ别 ю

source: File
en@shaw: 拆

source: Release
en@shaw: ゐ梆

source: Character
en@shaw: 葛

source: Common Defines
en@shaw: ヰ 拆

source: Error
en@shaw: 火

source: Floating point number
en@shaw: ゐ答 娥 仇ヰ

source: Included File
en@shaw: ゐ叼 拆

source: Classic
en@shaw: ゐ

source: Classic color scheme
en@shaw: ゐ 仇ゐ 梆

source: Control Keyword
en@shaw: 答 梆火

source: Blue based color scheme
en@shaw: ゐ 别 仇ゐ 梆

source: Cobalt
en@shaw: 答ゐ

source: String Format
en@shaw: 桂ヰ

source: Color
en@shaw: 仇ゐ

source: Decimal
en@shaw: юヰ

source: Dimension
en@shaw: 拆ヰю

source: Known Property Value
en@shaw: 答 拣 ゐ

source: Others 2
en@shaw: 仇拣 2

source: Others 3
en@shaw: 仇拣 3

source: at-rules
en@shaw: -叼ゐ

source: Device Functions
en@shaw: 拆 仇

source: Global Functions
en@shaw: ゐ答 仇

source: Global Variables
en@shaw: ゐ答 吼ゐ

source: Base-N number
en@shaw: 别-N 仇ヰ

source: Built-in identifier
en@shaw: ゐ- 拆ю拆

source: Complex number
en@shaw: ヰゐю 仇ヰ

source: Data type
en@shaw: 别 拆

source: Defaults
en@shaw: 佛ゐ

source: Documentation comment
en@shaw: 筐ヰ别 仇ヰヰ

source: Documentation comment element
en@shaw: 筐ヰ别 仇ヰヰ юゐヰ

source: Identifier
en@shaw: 拆ю拆

source: Reserved keyword
en@shaw: 火 梆火

source: Special character (inside a string)
en@shaw: ю 葛 (拆 )

source: Statement
en@shaw: 别ヰ

source: Underlined
en@shaw: 火ゐ拆

source: Encoding
en@shaw: ю答

source: Exec parameter
en@shaw: юю 拣ヰ

source: Group
en@shaw: 叼

source: Translation
en@shaw: ゐ别

source: Added line
en@shaw: ゐ拆

source: Changed line
en@shaw: 别○ ゐ拆

source: Location
en@shaw: ゐ答别

source: Removed line
en@shaw: ヰ叼 ゐ拆

source: Special case
en@shaw: ю 别

source: Binary number
en@shaw: 拆拣 仇ヰ

source: Special Token
en@shaw: ю 答

source: Formatting Elements
en@shaw: 桂ヰ юゐヰ

source: GUI Elements
en@shaw: GUI юゐヰ

source: Header Elements
en@shaw: ｐю юゐヰ

source: Structural Elements
en@shaw: 火 юゐヰ

source: Command
en@shaw: ヰ

source: Dos Batch
en@shaw: 路叼

source: Attribute name
en@shaw: 筐 别

source: patch-start
en@shaw: -葛

source: entity
en@shaw: ю

source: error
en@shaw: 火

source: quoted-value
en@shaw: 答-ゐ

source: Assertion
en@shaw: 火

source: Boolean Value
en@shaw: 叼ゐ梆 ゐ

source: Debug
en@shaw: 梆仇

source: Design by Contract
en@shaw: 拆

source: Eiffel
en@shaw: 路拆

source: Exception Handling
en@shaw: ю ｐゐ

source: Void Value
en@shaw: 娥 ゐ

source: Base-N Integer
en@shaw: 别-N ○

source: Compiler Directive
en@shaw: ヰ拆ゐ 火ю

source: Floating Point
en@shaw: ゐ答 娥

source: Reserved Constant
en@shaw: 火

source: Scientific
en@shaw: 拆

source: Debug Code
en@shaw: 梆仇 答

source: Error Text
en@shaw: 火 ю

source: Forth
en@shaw: 路桂

source: Floating Point number
en@shaw: ゐ答 娥 仇ヰ

source: Labeled argument
en@shaw: ゐ别ゐ 葛筐ヰ

source: Module Path
en@shaw: ヰ筐

source: Polymorphic Variant
en@shaw: ゐ梆ヰ ю梆

source: Type Variable
en@shaw: 拆 吼

source: Type, module or object keyword
en@shaw: 拆, ヰ筐 ○ю 梆火

source: Variant Constructor
en@shaw: ю梆 仇

source: GAP
en@shaw: 路

source: Reserved Keywords
en@shaw: 火 梆火

source: Deprecated
en@shaw: ю别

source: Function Name
en@shaw: 仇 别

source: Parameter
en@shaw: 拣ヰ

source: Property Name
en@shaw: 拣 别

source: Return
en@shaw: 火

source: Signal Name
en@shaw: 别

source: Type
en@shaw: 拆

source: Include directive
en@shaw: ゐ叼 火ю

source: Widget State
en@shaw: ○ 别

source: Code Block
en@shaw: 答 ゐ

source: Definition list
en@shaw: ю ゐ

source: Emphasis
en@shaw: юヰ

source: Enumerated list
en@shaw: 叼ヰ火别 ゐ

source: Escape
en@shaw: 别

source: Haddock
en@shaw: 路ｐ

source: Haddock Directive
en@shaw: 路ｐ 火ю

source: Header Property
en@shaw: ｐю 拣

source: Itemized list
en@shaw: 拆ヰ拆 ゐ

source: Float
en@shaw: ゐ答

source: Haskell
en@shaw: 路ｐ

source: Hex
en@shaw: ｐю

source: Symbol
en@shaw: ヰ

source: Literate Haskell
en@shaw: ゐ火 路ｐ

source: Attribute Name
en@shaw: 筐 别

source: Attribute Value
en@shaw: 筐 ゐ

source: Declaration
en@shaw: юゐ火别

source: External
en@shaw: 火

source: Future Reserved Keywords
en@shaw: 筐 火 梆火

source: Java
en@shaw: 路○

source: Scope Declaration
en@shaw: 答 юゐ火别

source: Constructors
en@shaw: 仇拣

source: Javascript
en@shaw: 路○

source: Object
en@shaw: ○ю

source: Properties
en@shaw: 拣

source: Undefined Value
en@shaw: 拆 ゐ

source: Color scheme used in the Kate text editor
en@shaw: 仇ゐ 梆 筐 路别 ю ю

source: Kate
en@shaw: 路别

source: Include
en@shaw: ゐ叼

source: LaTeX
en@shaw: 路ゐ别ю

source: Math Mode
en@shaw: ヰ ヰ答

source: Verbatim
en@shaw: 火别

source: math-bound
en@shaw: ヰ-

source: Lua
en@shaw: 路ゐ叼

source: Reserved Identifier
en@shaw: 火 拆ю拆

source: m4 Macro
en@shaw: m4 ヰ

source: m4-comment
en@shaw: m4-仇ヰヰ

source: Assignment Left Hand Side
en@shaw: 拆ヰ ゐю ｐ 拆

source: Assignment Right Hand Side
en@shaw: 拆ヰ 拆 ｐ 拆

source: Trailing Tab
en@shaw: 别ゐ

source: command
en@shaw: ヰ

source: function
en@shaw: 仇

source: keyword
en@shaw: 梆火

source: Block Elements
en@shaw: ゐ юゐヰ

source: Mallard
en@shaw: 路ヰゐ火

source: Page Elements
en@shaw: 别 юゐヰ

source: Section Elements
en@shaw: ю юゐヰ

source: Objective-C
en@shaw: ○ю-C

source: Dark color scheme using the Tango color palette
en@shaw: 葛 仇ゐ 梆 筐 路 仇ゐ ゐю

source: Oblivion
en@shaw: ゐ梆

source: Operation operator
en@shaw: 拣别 拣别

source: Type Operators
en@shaw: 拆 拣别拣

source: Pascal
en@shaw: 路

source: Control
en@shaw: 答

source: Include Statement
en@shaw: ゐ叼 别ヰ

source: Line Directive
en@shaw: ゐ拆 火ю

source: POD Escape
en@shaw: 别

source: POD heading
en@shaw: ｐю

source: POD keyword
en@shaw: 梆火

source: Perl
en@shaw: 路火

source: System Command
en@shaw: ヰ

source: Fuzzy
en@shaw: 仇

source: Special
en@shaw: ю

source: Prolog
en@shaw: 路答ゐ

source: Format
en@shaw: 桂ヰ

source: Module Handler
en@shaw: ヰ筐 ｐゐ

source: Python
en@shaw: 路拆

source: string-conversion
en@shaw: -火

source: Assignment Operator
en@shaw: 拆ヰ 拣别

source: Integer Number
en@shaw: ○ 仇ヰ

source: Reserved Class
en@shaw: 火 ゐ

source: Special Constant
en@shaw: ю

source: Command Macro
en@shaw: ヰ ヰ

source: Conditional Macro
en@shaw: ヰ

source: Define
en@shaw: 拆

source: Directory Macro
en@shaw: 拆ю拣 ヰ

source: Email
en@shaw: 梆ヰ别

source: Flow Conditional
en@shaw: ゐ

source: Header
en@shaw: ｐю

source: Other Macro
en@shaw: 仇 ヰ

source: RPM Variable
en@shaw: RPM 吼

source: RPM spec
en@shaw: RPM ю

source: Section
en@shaw: ю

source: Spec Macro
en@shaw: ю ヰ

source: Attribute Definition
en@shaw: 筐 ю

source: Module handler
en@shaw: ヰ筐 ｐゐ

source: Numeric literal
en@shaw: 筐ヰю ゐ火

source: Ruby
en@shaw: 路叼

source: Scheme
en@shaw: 路梆

source: Common Commands
en@shaw: ヰ ヰ

source: Variable Definition
en@shaw: 吼 ю

source: No idea what it is
en@shaw: 拆

source: Option Name
en@shaw: 别

source: Section 1
en@shaw: ю 1

source: Section 2
en@shaw: ю 2

source: Section 3
en@shaw: ю 3

source: Section 4
en@shaw: ю 4

source: Section 5
en@shaw: ю 5

source: Verbatim Block
en@shaw: 火别 ゐ

source: Color scheme using Tango color palette
en@shaw: 仇ゐ 梆 筐 路 仇ゐ ゐю

source: Tango
en@shaw: 路

source: File Attributes
en@shaw: 拆 筐

source: Generated Content
en@shaw: ○ю拣别 ю

source: Vala
en@shaw: 路ゐ

source: Gate
en@shaw: 别

source: Attribute value
en@shaw: 筐 ゐ

source: Element name
en@shaw: юゐヰ 别

source: Entity
en@shaw: ю

source: Processing instruction
en@shaw: 答ю 仇

source: Element
en@shaw: юゐヰ

source: rule
en@shaw: 叼

source: token-type
en@shaw: 答-拆
