Repository: chriskmanx/qmole
Catalog: QMOLEDEV/atk-2.2.0/po/*.po
Languages: en@shaw

source: Selected Link
en@shaw: ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘› ğ‘¤ğ‘¦ğ‘™ğ‘’

source: Specifies whether the AtkHyperlink object is selected
en@shaw: ğ‘•ğ‘ğ‘§ğ‘•ğ‘¦ğ‘“ğ‘²ğ‘Ÿ ğ‘¢ğ‘§ğ‘ğ‘¼ ğ‘ AtkHyperlink ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘¦ğ‘Ÿ ğ‘•ğ‘©ğ‘¤ğ‘§ğ‘’ğ‘‘ğ‘©ğ‘›

source: Number of Anchors
en@shaw: ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘¨ğ‘™ğ‘’ğ‘»ğ‘Ÿ

source: The number of anchors associated with the AtkHyperlink object
en@shaw: ğ‘ ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘¨ğ‘™ğ‘’ğ‘»ğ‘Ÿ ğ‘©ğ‘•ğ‘´ğ‘–ğ‘¦ğ‘±ğ‘‘ğ‘©ğ‘› ğ‘¢ğ‘¦ğ‘ ğ‘ AtkHyperlink ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘

source: End index
en@shaw: ğ‘§ğ‘¯ğ‘› ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘•

source: The end index of the AtkHyperlink object
en@shaw: ğ‘ ğ‘§ğ‘¯ğ‘› ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘• ğ‘ ğ‘ AtkHyperlink ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘

source: Start index
en@shaw: ğ‘•ğ‘‘ğ‘¸ğ‘‘ ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘•

source: The start index of the AtkHyperlink object
en@shaw: ğ‘ ğ‘•ğ‘‘ğ‘¸ğ‘‘ ğ‘¦ğ‘¯ğ‘›ğ‘§ğ‘’ğ‘• ğ‘ ğ‘ AtkHyperlink ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘

source: invalid
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘¨ğ‘¤ğ‘¦ğ‘›

source: accelerator label
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘¤ğ‘¼ğ‘±ğ‘‘ğ‘¼ ğ‘¤ğ‘±ğ‘šğ‘©ğ‘¤

source: alert
en@shaw: ğ‘©ğ‘¤ğ‘»ğ‘‘

source: animation
en@shaw: ğ‘¨ğ‘¯ğ‘©ğ‘¥ğ‘±ğ‘–ğ‘©ğ‘¯

source: arrow
en@shaw: ğ‘¨ğ‘®ğ‘´

source: calendar
en@shaw: ğ‘’ğ‘¨ğ‘¤ğ‘©ğ‘¯ğ‘›ğ‘¼

source: canvas
en@shaw: ğ‘’ğ‘¨ğ‘¯ğ‘ğ‘©ğ‘•

source: check box
en@shaw: ğ‘—ğ‘§ğ‘’ ğ‘šğ‘ªğ‘’ğ‘•

source: check menu item
en@shaw: ğ‘—ğ‘§ğ‘’ ğ‘¥ğ‘§ğ‘¯ğ‘¿ ğ‘²ğ‘‘ğ‘©ğ‘¥

source: color chooser
en@shaw: ğ‘’ğ‘³ğ‘¤ğ‘¼ ğ‘—ğ‘µğ‘Ÿğ‘¼

source: column header
en@shaw: ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ ğ‘£ğ‘§ğ‘›ğ‘¼

source: combo box
en@shaw: ğ‘’ğ‘­ğ‘¥ğ‘šğ‘´ ğ‘šğ‘ªğ‘’ğ‘•

source: dateeditor
en@shaw: ğ‘›ğ‘±ğ‘‘ğ‘§ğ‘›ğ‘¦ğ‘‘ğ‘¼

source: desktop icon
en@shaw: ğ‘›ğ‘§ğ‘•ğ‘’ğ‘‘ğ‘ªğ‘ ğ‘²ğ‘’ğ‘ªğ‘¯

source: desktop frame
en@shaw: ğ‘›ğ‘§ğ‘•ğ‘’ğ‘‘ğ‘ªğ‘ ğ‘“ğ‘®ğ‘±ğ‘¥

source: dial
en@shaw: ğ‘›ğ‘²ğ‘¤

source: dialog
en@shaw: ğ‘›ğ‘²ğ‘©ğ‘¤ğ‘ªğ‘œ

source: directory pane
en@shaw: ğ‘›ğ‘²ğ‘®ğ‘§ğ‘’ğ‘‘ğ‘¼ğ‘¦ ğ‘ğ‘±ğ‘¯

source: drawing area
en@shaw: ğ‘›ğ‘®ğ‘·ğ‘¦ğ‘™ ğ‘ºğ‘¦ğ‘©

source: file chooser
en@shaw: ğ‘“ğ‘²ğ‘¤ ğ‘—ğ‘µğ‘Ÿğ‘¼

source: filler
en@shaw: ğ‘“ğ‘¦ğ‘¤ğ‘»

source: fontchooser
en@shaw: ğ‘“ğ‘ªğ‘¯ğ‘‘ ğ‘—ğ‘µğ‘Ÿğ‘¼

source: frame
en@shaw: ğ‘“ğ‘®ğ‘±ğ‘¥

source: glass pane
en@shaw: ğ‘œğ‘¤ğ‘­ğ‘• ğ‘ğ‘±ğ‘¯

source: html container
en@shaw: HTML ğ‘’ğ‘©ğ‘¯ğ‘‘ğ‘±ğ‘¯ğ‘¼

source: icon
en@shaw: ğ‘²ğ‘’ğ‘ªğ‘¯

source: image
en@shaw: ğ‘¦ğ‘¥ğ‘¦ğ‘¡

source: internal frame
en@shaw: ğ‘¦ğ‘¯ğ‘‘ğ‘»ğ‘¯ğ‘©ğ‘¤ ğ‘“ğ‘®ğ‘±ğ‘¥

source: label
en@shaw: ğ‘¤ğ‘±ğ‘šğ‘©ğ‘¤

source: layered pane
en@shaw: ğ‘¤ğ‘±ğ‘»ğ‘› ğ‘ğ‘±ğ‘¯

source: list
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘‘

source: list item
en@shaw: ğ‘¤ğ‘¦ğ‘•ğ‘‘ ğ‘²ğ‘‘ğ‘©ğ‘¥

source: menu
en@shaw: ğ‘¥ğ‘§ğ‘¯ğ‘¿

source: menu bar
en@shaw: ğ‘¥ğ‘§ğ‘¯ğ‘¿ ğ‘šğ‘¸

source: menu item
en@shaw: ğ‘¥ğ‘§ğ‘¯ğ‘¿ ğ‘²ğ‘‘ğ‘©ğ‘¥

source: option pane
en@shaw: ğ‘ªğ‘ğ‘–ğ‘©ğ‘¯ ğ‘ğ‘±ğ‘¯

source: page tab
en@shaw: ğ‘ğ‘±ğ‘¡ ğ‘‘ğ‘¨ğ‘š

source: page tab list
en@shaw: ğ‘ğ‘±ğ‘¡ ğ‘‘ğ‘¨ğ‘š ğ‘¤ğ‘¦ğ‘•ğ‘‘

source: panel
en@shaw: ğ‘ğ‘¨ğ‘¯ğ‘©ğ‘¤

source: password text
en@shaw: ğ‘ğ‘­ğ‘•ğ‘¢ğ‘¼ğ‘› ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘

source: popup menu
en@shaw: ğ‘ğ‘ªğ‘ğ‘³ğ‘ ğ‘¥ğ‘§ğ‘¯ğ‘¿

source: progress bar
en@shaw: ğ‘ğ‘®ğ‘©ğ‘œğ‘®ğ‘§ğ‘• ğ‘šğ‘¸

source: push button
en@shaw: ğ‘ğ‘«ğ‘– ğ‘šğ‘³ğ‘‘ğ‘©ğ‘¯

source: radio button
en@shaw: ğ‘®ğ‘±ğ‘›ğ‘¦ğ‘´ ğ‘šğ‘³ğ‘‘ğ‘©ğ‘¯

source: radio menu item
en@shaw: ğ‘®ğ‘±ğ‘›ğ‘¦ğ‘´ ğ‘¥ğ‘§ğ‘¯ğ‘¿ ğ‘²ğ‘‘ğ‘©ğ‘¥

source: root pane
en@shaw: ğ‘®ğ‘µğ‘‘ ğ‘ğ‘±ğ‘¯

source: row header
en@shaw: ğ‘®ğ‘´ ğ‘£ğ‘§ğ‘›ğ‘¼

source: scroll bar
en@shaw: ğ‘•ğ‘’ğ‘®ğ‘´ğ‘¤ ğ‘šğ‘¸

source: scroll pane
en@shaw: ğ‘•ğ‘’ğ‘®ğ‘´ğ‘¤ ğ‘ğ‘±ğ‘¯

source: separator
en@shaw: ğ‘•ğ‘§ğ‘ğ‘¼ğ‘±ğ‘‘ğ‘¼

source: slider
en@shaw: ğ‘•ğ‘¤ğ‘²ğ‘›ğ‘¼

source: split pane
en@shaw: ğ‘•ğ‘ğ‘¤ğ‘¦ğ‘‘ ğ‘ğ‘±ğ‘¯

source: spin button
en@shaw: ğ‘•ğ‘ğ‘¦ğ‘¯ ğ‘šğ‘³ğ‘‘ğ‘©ğ‘¯

source: statusbar
en@shaw: ğ‘•ğ‘‘ğ‘±ğ‘‘ğ‘«ğ‘•ğ‘šğ‘¸

source: table
en@shaw: ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤

source: table cell
en@shaw: ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘•ğ‘§ğ‘¤

source: table column header
en@shaw: ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ ğ‘£ğ‘§ğ‘›ğ‘¼

source: table row header
en@shaw: ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘®ğ‘´ ğ‘£ğ‘§ğ‘›ğ‘¼

source: tear off menu item
en@shaw: ğ‘‘ğ‘º ğ‘ªğ‘“ ğ‘¥ğ‘§ğ‘¯ğ‘¿ ğ‘²ğ‘‘ğ‘©ğ‘¥

source: terminal
en@shaw: ğ‘‘ğ‘»ğ‘¥ğ‘¦ğ‘¯ğ‘©ğ‘¤

source: text
en@shaw: ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘

source: toggle button
en@shaw: ğ‘‘ğ‘ªğ‘œğ‘©ğ‘¤ ğ‘šğ‘³ğ‘‘ğ‘©ğ‘¯

source: tool bar
en@shaw: ğ‘‘ğ‘µğ‘¤ ğ‘šğ‘¸

source: tool tip
en@shaw: ğ‘‘ğ‘µğ‘¤ ğ‘‘ğ‘¦ğ‘

source: tree
en@shaw: ğ‘‘ğ‘®ğ‘°

source: tree table
en@shaw: ğ‘‘ğ‘®ğ‘° ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤

source: unknown
en@shaw: ğ‘³ğ‘¯ğ‘´ğ‘¯

source: viewport
en@shaw: ğ‘ğ‘¿ğ‘ğ‘¹ğ‘‘

source: window
en@shaw: ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´

source: header
en@shaw: ğ‘£ğ‘§ğ‘›ğ‘¼

source: footer
en@shaw: ğ‘“ğ‘«ğ‘‘ğ‘¼

source: paragraph
en@shaw: ğ‘ğ‘¨ğ‘®ğ‘©ğ‘œğ‘®ğ‘­ğ‘“

source: ruler
en@shaw: ğ‘®ğ‘µğ‘¤ğ‘¼

source: application
en@shaw: ğ‘©ğ‘ğ‘¤ğ‘¦ğ‘’ğ‘±ğ‘•ğ‘©ğ‘¯

source: autocomplete
en@shaw: ğ‘·ğ‘‘ğ‘´ğ‘’ğ‘ªğ‘¥ğ‘ğ‘¤ğ‘°ğ‘‘

source: edit bar
en@shaw: ğ‘§ğ‘›ğ‘¦ğ‘‘ ğ‘šğ‘¸

source: embedded component
en@shaw: ğ‘§ğ‘¥ğ‘šğ‘§ğ‘›ğ‘¦ğ‘› ğ‘’ğ‘©ğ‘¥ğ‘ğ‘´ğ‘¯ğ‘©ğ‘¯ğ‘‘

source: entry
en@shaw: ğ‘§ğ‘¯ğ‘‘ğ‘®ğ‘¦

source: chart
en@shaw: ğ‘—ğ‘¸ğ‘‘

source: caption
en@shaw: ğ‘’ğ‘¨ğ‘ğ‘–ğ‘©ğ‘¯

source: document frame
en@shaw: ğ‘›ğ‘ªğ‘’ğ‘¿ğ‘¥ğ‘©ğ‘¯ğ‘‘ ğ‘“ğ‘®ğ‘±ğ‘¥

source: heading
en@shaw: ğ‘£ğ‘§ğ‘›ğ‘¦ğ‘™

source: page
en@shaw: ğ‘ğ‘±ğ‘¡

source: section
en@shaw: ğ‘•ğ‘§ğ‘’ğ‘–ğ‘©ğ‘¯

source: redundant object
en@shaw: ğ‘®ğ‘¦ğ‘›ğ‘©ğ‘¯ğ‘›ğ‘©ğ‘¯ğ‘‘ ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘

source: form
en@shaw: ğ‘“ğ‘¹ğ‘¥

source: link
en@shaw: ğ‘¤ğ‘¦ğ‘™ğ‘’

source: input method window
en@shaw: ğ‘¦ğ‘¯ğ‘ğ‘«ğ‘‘ ğ‘¥ğ‘§ğ‘”ğ‘©ğ‘› ğ‘¢ğ‘¦ğ‘¯ğ‘›ğ‘´

source: Accessible Name
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘¯ğ‘±ğ‘¥

source: Object instance's name formatted for assistive technology access
en@shaw: ğ‘©ğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘¨ğ‘¯ğ‘•ğ‘§ğ‘Ÿ ğ‘¯ğ‘±ğ‘¥ ğ‘“ğ‘¹ğ‘¥ğ‘¨ğ‘‘ğ‘©ğ‘› ğ‘“ğ‘¹ ğ‘©ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘¦ğ‘ ğ‘‘ğ‘§ğ‘’ğ‘¯ğ‘­ğ‘¤ğ‘©ğ‘¡ğ‘° ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•

source: Accessible Description
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯

source: Description of an object, formatted for assistive technology access
en@shaw: ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘ ğ‘©ğ‘¯ ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘, ğ‘“ğ‘¹ğ‘¥ğ‘¨ğ‘‘ğ‘©ğ‘› ğ‘“ğ‘¹ ğ‘©ğ‘•ğ‘¦ğ‘•ğ‘‘ğ‘¦ğ‘ ğ‘‘ğ‘§ğ‘’ğ‘¯ğ‘­ğ‘¤ğ‘©ğ‘¡ğ‘° ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•

source: Accessible Parent
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘ğ‘ºğ‘©ğ‘¯ğ‘‘

source: Is used to notify that the parent has changed
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘ğ‘ºğ‘©ğ‘¯ğ‘‘ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›

source: Accessible Value
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘ğ‘¨ğ‘¤ğ‘¿

source: Is used to notify that the value has changed
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›

source: Accessible Role
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘®ğ‘´ğ‘¤

source: The accessible role of this object
en@shaw: ğ‘ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘®ğ‘´ğ‘¤ ğ‘ ğ‘ğ‘¦ğ‘• ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘

source: Accessible Layer
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘¤ğ‘±ğ‘¼

source: The accessible layer of this object
en@shaw: ğ‘ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘¤ğ‘±ğ‘¼ ğ‘ ğ‘ğ‘¦ğ‘• ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘

source: Accessible MDI Value
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ MDI ğ‘ğ‘¨ğ‘¤ğ‘¿

source: The accessible MDI value of this object
en@shaw: ğ‘ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ MDI ğ‘ğ‘¨ğ‘¤ğ‘¿ ğ‘ ğ‘ğ‘¦ğ‘• ğ‘ªğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘

source: Accessible Table Caption
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘¨ğ‘ğ‘–ğ‘©ğ‘¯

source: Is used to notify that the table caption has changed; this property should not be used. accessible-table-caption-object should be used instead
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘¨ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›; ğ‘ğ‘¦ğ‘• ğ‘ğ‘®ğ‘ªğ‘ğ‘¼ğ‘‘ğ‘¦ ğ‘–ğ‘«ğ‘› ğ‘¯ğ‘ªğ‘‘ ğ‘šğ‘° ğ‘¿ğ‘Ÿğ‘›. ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤-ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤-ğ‘’ğ‘¨ğ‘ğ‘–ğ‘©ğ‘¯-ğ‘©ğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘ ğ‘–ğ‘«ğ‘› ğ‘šğ‘° ğ‘¿ğ‘Ÿğ‘› ğ‘¦ğ‘¯ğ‘•ğ‘‘ğ‘§ğ‘›

source: Accessible Table Column Header
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ ğ‘£ğ‘§ğ‘›ğ‘¼

source: Is used to notify that the table column header has changed
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ ğ‘£ğ‘§ğ‘›ğ‘¼ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›

source: Accessible Table Column Description
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯

source: Is used to notify that the table column description has changed
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘ªğ‘¤ğ‘©ğ‘¥ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›

source: Accessible Table Row Header
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘®ğ‘´ ğ‘£ğ‘§ğ‘›ğ‘¼

source: Is used to notify that the table row header has changed
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘®ğ‘´ ğ‘£ğ‘§ğ‘›ğ‘¼ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›

source: Accessible Table Row Description
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘®ğ‘´ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯

source: Is used to notify that the table row description has changed
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘®ğ‘´ ğ‘›ğ‘¦ğ‘•ğ‘’ğ‘®ğ‘¦ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›

source: Accessible Table Summary
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘•ğ‘³ğ‘¥ğ‘¼ğ‘¦

source: Is used to notify that the table summary has changed
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘•ğ‘³ğ‘¥ğ‘¼ğ‘¦ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›

source: Accessible Table Caption Object
en@shaw: ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘¨ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘©ğ‘šğ‘¡ğ‘§ğ‘’ğ‘‘

source: Is used to notify that the table caption has changed
en@shaw: ğ‘¦ğ‘Ÿ ğ‘¿ğ‘Ÿğ‘› ğ‘‘ ğ‘¯ğ‘´ğ‘‘ğ‘¦ğ‘“ğ‘² ğ‘ğ‘¨ğ‘‘ ğ‘ ğ‘‘ğ‘±ğ‘šğ‘©ğ‘¤ ğ‘’ğ‘¨ğ‘ğ‘–ğ‘©ğ‘¯ ğ‘£ğ‘¨ğ‘Ÿ ğ‘—ğ‘±ğ‘¯ğ‘¡ğ‘›

source: Number of Accessible Hypertext Links
en@shaw: ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘¨ğ‘’ğ‘•ğ‘§ğ‘•ğ‘©ğ‘šğ‘©ğ‘¤ ğ‘£ğ‘²ğ‘ğ‘»ğ‘‘ğ‘§ğ‘’ğ‘•ğ‘‘ ğ‘¤ğ‘¦ğ‘™ğ‘’ğ‘•

source: The number of links which the current AtkHypertext has
en@shaw: ğ‘ ğ‘¯ğ‘³ğ‘¥ğ‘šğ‘¼ ğ‘ ğ‘¤ğ‘¦ğ‘™ğ‘’ğ‘• ğ‘¢ğ‘¦ğ‘— ğ‘ ğ‘’ğ‘³ğ‘®ğ‘©ğ‘¯ğ‘‘ AtkHypertext ğ‘£ğ‘¨ğ‘Ÿ
